{
  "Kanye West_Flashing Lights": {
    "genre": "Hip Hop",
    "track bpm": 90,
    "lyrics summary": "The lyrics of 'Flashing Lights' explore the seductive allure and underlying dangers of fame and celebrity life.",
    "lyrics sentiment": "Mixed because the lyrics present a glamorous yet critical view of fame, highlighting both allure and perils.",
    "music energy": "Medium because despite its steady 90 BPM tempo, it features lush production and introspective elements.",
    "music danceability": "Medium because the rhythm is steady and groove-oriented, suitable for moderate dancing.",
    "valence": "Medium because the track balances a seductive sound with more thoughtful, introspective lyrics.",
    "mode": "Minor because the track explores introspective and critical themes typical of a minor mode."
  },
  "Kendrick Lamar_Alright": {
    "genre": "Hip-hop",
    "track bpm": 110,
    "lyrics summary": "'Alright' by Kendrick Lamar focuses on themes of systemic oppression, resilience, and faith, serving as an anthem for hope in the face of adversity.",
    "lyrics sentiment": "Mixed because it addresses serious issues of oppression but also expresses hope and resilience.",
    "music energy": "Medium because the track has a driving beat and dynamic delivery but not overly intense.",
    "music danceability": "Medium because the beat is steady and groove-oriented, suitable for rhythmic movement.",
    "valence": "Medium because it balances serious subject matter with an underlying message of hope and perseverance.",
    "mode": "Minor because the song conveys a serious tone through its use of melody and harmony."
  },
  "The Weeknd_Die For You - Remix": {
    "genre": "Pop",
    "track bpm": 67,
    "lyrics summary": "The lyrics of 'Die For You - Remix' express feelings of deep love and emotional struggle. The singer finds it hard to communicate their feelings but remains devoted to their love.",
    "lyrics sentiment": "Mixed because the lyrics reveal both a struggle to communicate feelings and a deep expression of love and devotion.",
    "music energy": "Medium because the tempo is slow but the emotional intensity and vocal delivery provide a balanced dynamic range.",
    "music danceability": "Low because the slow tempo and emotional focus make it less suitable for dancing.",
    "valence": "Medium because, while the lyrics express struggle, the underlying message of love provides a balance of emotions.",
    "mode": "Minor because the key of C# minor contributes to the moody and introspective quality of the track."
  },
  "The Weeknd_Reminder": {
    "genre": "R&B",
    "track bpm": 105,
    "lyrics summary": "The song 'Reminder' by The Weeknd is about asserting his status and influence in the music industry while addressing misconceptions about himself.",
    "lyrics sentiment": "Mixed because the lyrics convey confidence and defiance but also reflect on being misunderstood.",
    "music energy": "Medium because while it has a steady rhythm, it's not overly intense or fast-paced.",
    "music danceability": "High because it has a groove and rhythm that encourages movement.",
    "valence": "Medium because the tone is balanced between assertive and contemplative themes.",
    "mode": "Minor because the melody and lyrical themes focus on defiance and introspection."
  },
  "Macklemore_Can't Hold Us (feat. Ray Dalton)": {
    "genre": "Hip Hop",
    "track bpm": 146,
    "lyrics summary": "The song is an anthem about self-confidence, resilience, and the journey to success. It captures the essence of overcoming obstacles, celebrating victories, and sharing those successes with the world.",
    "lyrics sentiment": "Positive because the lyrics express themes of overcoming obstacles and celebrating victories.",
    "music energy": "High because the song has an upbeat tempo and intense dynamic delivery.",
    "music danceability": "High because the song features a driving beat and rhythmic elements that are conducive to dancing.",
    "valence": "High because the theme is uplifting and triumphant, inspiring positivity.",
    "mode": "Major because the song exudes a bright and triumphant feeling."
  }
}