{
  "XXXTENTACION_Jocelyn Flores": {
    "genre": "Hip Hop",
    "track bpm": 134,
    "lyrics summary": "The song 'Jocelyn Flores' by XXXTENTACION addresses the tragic story of a woman named Jocelyn Flores, who committed suicide. The artist reflects on his struggles with the loss and his own mental health issues, expressing a deep sense of sadness and turmoil.",
    "lyrics sentiment": "Negative because the lyrics deal with themes of suicide, loss, and mental health struggles.",
    "music energy": "Low because the song features somber beats and an overall melancholic tone.",
    "music danceability": "High because the song has a consistent and prominent beat despite its low energy and introspective nature.",
    "valence": "Low because the tone is melancholic and the themes are emotionally heavy.",
    "mode": "Minor because the melody and chord progression convey a dark and mournful atmosphere."
  },
  "XXXTENTACION_Everybody Dies In Their Nightmares": {
    "genre": "Emo Rap",
    "track bpm": 85,
    "lyrics summary": "The lyrics of 'Everybody Dies In Their Nightmares' by XXXTENTACION explore his personal struggles with depression, portraying raw emotions and the ongoing battle with mental health issues.",
    "lyrics sentiment": "Negative because the lyrics express deep feelings of depression, emotional pain, and introspection.",
    "music energy": "Medium because while the theme is intense, the delivery is introspective and not overly aggressive.",
    "music danceability": "Medium because the beat is steady with a melancholic groove, fitting for moderate movement but not dance-heavy.",
    "valence": "Low because the emotional tone is dark and melancholic, reflecting the artist's mental struggles.",
    "mode": "Minor because the music has a somber, introspective quality typical of emotionally negative content."
  },
  "Juice WRLD_All Girls Are The Same": {
    "genre": "Trap",
    "track bpm": 162,
    "lyrics summary": "The lyrics explore Juice WRLD's feelings of heartache and disillusionment from experiencing repetitive heartbreak and toxic relationships.",
    "lyrics sentiment": "Negative because the lyrics express themes of heartbreak, disillusionment, and emotional turmoil.",
    "music energy": "Medium because the track has a steady trap beat and melodic flow but maintains an emotional, raw feel rather than intense aggression.",
    "music danceability": "Medium because it has a trap beat suitable for light dancing but is not overly dominant in dance rhythms.",
    "valence": "Low because the song conveys a melancholic and emotionally dark tone about heartbreak and distress.",
    "mode": "Minor because the melody and overall feel are introspective and melancholic, fitting the song's lyrical themes."
  },
  "XXXTENTACION_SAD!": {
    "genre": "Hip Hop",
    "track bpm": 150,
    "lyrics summary": "The lyrics of 'SAD!' by XXXTENTACION explore themes of depression, heartbreak, and emotional turmoil, reflecting the artist's struggles with inner demons and his plea for understanding and help.",
    "lyrics sentiment": "Negative because the lyrics express feelings of sadness, heartbreak, and emotional distress.",
    "music energy": "High because the track has an Allegro tempo and intense emotional delivery, adding to its energetic feel.",
    "music danceability": "High because the track has a strong, consistent beat which is typical of a danceable hip-hop track.",
    "valence": "Low because the tone is melancholic and the lyrics express emotional distress.",
    "mode": "Major because it is stated that the track is in a major mode."
  },
  "Travis Scott_goosebumps": {
    "genre": "Hip-Hop",
    "track bpm": 138,
    "lyrics summary": "The lyrics explore themes of intoxicating attraction and the rush of excitement that a certain person evokes, triggering physical reactions like goosebumps.",
    "lyrics sentiment": "Mixed because the lyrics convey both excitement and desire but hint at deeper existential reflections.",
    "music energy": "High because the track features intense beats and a fast-paced rhythm typical of Travis Scott's style.",
    "music danceability": "High because the song has a strong beat and rhythm that make it suitable for dancing.",
    "valence": "Medium because while the song conveys excitement and attraction, it also has underlying introspective and reflective tones.",
    "mode": "Minor because the track's mood is generally dark and moody, reflecting the introspective themes in the lyrics."
  }
}