{
  "Aly & AJ_Potential Breakup Song": {
    "genre": "Pop Rock",
    "track bpm": "around 120",
    "lyrics summary": "The lyrics express frustration and disappointment as the singer faces uncertainty in a relationship and calls out a partner's behavior that is leading towards a potential breakup.",
    "lyrics sentiment": "Mixed because the lyrics convey feelings of both empowerment and frustration.",
    "music energy": "High because the track features dynamic instrumentation and a strong vocal delivery.",
    "music danceability": "High because it has a strong, consistent beat typical of upbeat pop rock songs.",
    "valence": "Medium because the song balances themes of emotional conflict with empowering, assertive elements.",
    "mode": "Major because despite the emotionally complex lyrics, the music has an uplifting and assertive sound typical of pop rock."
  },
  "5 Seconds of Summer_Talk Fast": {
    "genre": "Pop Rock",
    "track bpm": "about 130",
    "lyrics summary": "The lyrics suggest a theme of urgency and fast-paced conversation, where the speaker addresses the need to swiftly communicate before time runs out.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of urgency and underlying tension but also convey excitement.",
    "music energy": "High because the tempo is upbeat and the song has an energetic delivery typical of pop rock music.",
    "music danceability": "High because the rhythm and beat are consistent and pronounced, making it suitable for dancing.",
    "valence": "Medium because the lyrics have a mix of urgency and excitement, creating a balanced emotional tone.",
    "mode": "Major because the overall tone of the music is bright and energetic."
  },
  "MARINA_Oh No!": {
    "genre": "Disco-Pop",
    "track bpm": 164,
    "lyrics summary": "The song 'About Damn Time' by Lizzo discusses breaking free from stress, encouraging self-love, and enjoying life.",
    "lyrics sentiment": "Positive because the lyrics express empowerment and the joy of overcoming stress to embrace life.",
    "music energy": "High because the tempo is fast and the instrumentation is lively and upbeat.",
    "music danceability": "High because the song has a strong, infectious beat ideal for dancing.",
    "valence": "High because the song is uplifting and exudes a sense of joy and empowerment.",
    "mode": "Minor because despite the upbeat tempo, the melody and chord progression are in a minor key."
  },
  "One Direction_Olivia": {
    "genre": "Pop Rock",
    "track bpm": 135,
    "lyrics summary": "The lyrics of 'Olivia' convey affection and admiration for a person named Olivia, highlighting how this person's presence is uplifting and special to the singer.",
    "lyrics sentiment": "Positive because the lyrics express admiration and a joyful celebration of someone's presence.",
    "music energy": "Medium because the song maintains a lively but not overly intense tempo with energetic vocal delivery and guitar-driven instrumentation.",
    "music danceability": "Medium because the song features a steady beat and rhythmic elements that allow for easy movement but do not dominate the track.",
    "valence": "High because the song has an uplifting and joyful feel, characterized by its positive lyrics and bright melody.",
    "mode": "Major because the song's melody and chord progressions convey a bright and happy tonal quality."
  },
  "Ariana Grande_the light is coming (feat. Nicki Minaj)": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song explores themes of regaining control and overcoming obstacles by emphasizing visibility and presence, featuring empowering verses by Nicki Minaj.",
    "lyrics sentiment": "Mixed because the lyrics include themes of empowerment and overcoming difficulties, contrasted with a critical tone and assertive delivery.",
    "music energy": "High because the song features an energetic tempo and intense vocal performances.",
    "music danceability": "High because the track has a strong, consistent beat suitable for dancing.",
    "valence": "Medium because it juxtaposes motivational empowerment with a somewhat edgy, assertive tone.",
    "mode": "Minor because the harmony and overall vibe convey a bold yet somewhat tense atmosphere."
  }
}