{
  "Sabrina Carpenter_Espresso": {
    "genre": "Pop",
    "track bpm": 104,
    "lyrics summary": "The lyrics of 'Espresso' explore themes of confidence, individuality, and romantic allure, using clever wordplay and vibrant storytelling.",
    "lyrics sentiment": "Positive because the lyrics express confidence, romantic allure, and individuality.",
    "music energy": "High because the song is described as having a high energy and an upbeat tempo.",
    "music danceability": "High because the song features a catchy rhythm and is noted to be danceable.",
    "valence": "High because the song is upbeat and expresses positive themes of confidence and allure.",
    "mode": "Major because it is in the C major key, which often conveys a bright and cheerful mood."
  },
  "Chappell Roan_HOT TO GO!": {
    "genre": "Pop",
    "track bpm": 140,
    "lyrics summary": "The song's lyrics revolve around expressing sexual desire and confidence, with Chappell Roan urging someone to make a move in a flirtatious and bold manner.",
    "lyrics sentiment": "Positive because the lyrics express confidence, desire, and a playful invitation to embrace one's sexuality.",
    "music energy": "High because the track features an upbeat tempo and vibrant, synth-driven instrumentation.",
    "music danceability": "High because the infectious beat and rhythmic structure are designed to encourage dancing.",
    "valence": "High because the overall tone of the song is uplifting, playful, and celebratory.",
    "mode": "Major because the key of F♯ Major provides a bright and triumphant tonal quality."
  },
  "Hozier_Too Sweet": {
    "genre": "Indie Rock",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'Too Sweet' explore the dynamics of a romantic relationship where contrasting lifestyles and attitudes towards life are highlighted. The song portrays a dialogue between partners, one who lives with balanced goals and the other who enjoys life's pleasures freely.",
    "lyrics sentiment": "Mixed because the lyrics reflect contrasting views within a relationship, capturing elements of both affection and tension.",
    "music energy": "Medium because the track combines soft melodies and a soothing vibe with insightful lyrical content.",
    "music danceability": "Medium because the melody is soothing with a steady rhythmic flow that allows for motion but is focused on the lyrical narrative.",
    "valence": "Medium because the music feels lighthearted and soothing, but the lyrics add depth through the exploration of mismatched relationship dynamics.",
    "mode": "Minor because the song's reflective and introspective tone suggests a moodier underlying theme despite its playful surface."
  },
  "Beyoncé_TEXAS HOLD 'EM": {
    "genre": "Country Hip-Hop",
    "track bpm": 120,
    "lyrics summary": "Beyoncé uses the lyrics of \"Texas Hold 'Em\" to pay homage to her roots, incorporating themes of personal history and cultural identity tied to Texas.",
    "lyrics sentiment": "Mixed because while the lyrics express homage and pride, there's a bittersweet tone to them as well.",
    "music energy": "High because the track features an uptempo banjo and rhythmic beat that create an energetic atmosphere.",
    "music danceability": "High because the inclusion of 'Ho' and 'Hey' chants and a rhythmic beat is designed for a lively, danceable atmosphere.",
    "valence": "Medium because the tone is both celebratory and reflective due to the mix of homage and bittersweet elements.",
    "mode": "Major because the song has an uplifting and bright sound consistent with celebratory themes."
  },
  "Sabrina Carpenter_Feather": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "The song 'Feather' by Sabrina Carpenter explores themes of empowerment and liberation, particularly focusing on shedding toxic relationships and moving forward.",
    "lyrics sentiment": "Positive because the lyrics convey a sense of empowerment and relief from a toxic past.",
    "music energy": "Medium because the song has a steady rhythm and lively arrangement typical of pop anthems without being overly intense.",
    "music danceability": "High because the track features a strong, consistent beat and engaging rhythm conducive to dancing.",
    "valence": "Medium because while the song is somewhat empowering, the undertone of leaving toxic relationships adds emotional complexity.",
    "mode": "Minor because the song is in the key of F♯ Minor, which often conveys a more introspective or darker tonal quality."
  }
}