{
  "Jafiki_WellerHub": {
    "genre": "Pop",
    "track bpm": 94,
    "lyrics summary": "The song discusses a story about a young boy who loved watching TV and eventually became obsessed with anime and other indulgent activities, suggested by the mention of addiction to porn.",
    "lyrics sentiment": "Mixed because the initial tone is light-hearted and humorous, discussing innocence and TV, but it also mentions addiction to porn, which adds a negative dimension.",
    "music energy": "Low because the snippet explicitly characterizes the track as having low energy.",
    "music danceability": "High because the track is described as very danceable and maintains a consistent 4/4 beat.",
    "valence": "Medium because the upbeat music and major key suggest positivity, but the lyrics contain both humorous and darker themes.",
    "mode": "Major because the track is in a major key, giving it a brighter and more resolved tonal quality."
  },
  "Eminem_Godzilla (feat. Juice WRLD)": {
    "genre": "Hip-Hop/Rap",
    "track bpm": 140,
    "lyrics summary": "The lyrics of 'Godzilla' revolve around themes of power, strength, and the monstrous aspects of fame and personal struggles. Eminem and Juice WRLD describe themselves metaphorically as Godzilla, highlighting their resilience and dominance in the rap world while also exploring inner battles with addiction and mental health.",
    "lyrics sentiment": "Mixed because it combines themes of confidence and power with darker undertones of personal struggle and mental health issues.",
    "music energy": "High because the song features fast-paced rapping and intense beats typical of Eminem's rapid-fire delivery.",
    "music danceability": "High because the song's strong and consistent rhythm makes it suitable for dancing, especially in a hip-hop context.",
    "valence": "Medium because although the song has empowering themes, it also delves into more complex and darker personal challenges.",
    "mode": "Minor because the song's themes and tone suggest a darker, more introspective quality."
  },
  "Eminem_Rap God": {
    "genre": "Hip-hop",
    "track bpm": 148,
    "lyrics summary": "Eminem's 'Rap God' is a self-assertive track where he boasts about his rapping abilities and addresses controversies. The song is packed with cultural references, wordplay, and showcases his technical skill in manipulating language and rhythm. Eminem reflects on his career, the evolution of hip-hop, and addresses past criticisms faced due to provocative lyrics.",
    "lyrics sentiment": "Mixed because the lyrics are boastful and defiant, yet also introspective about his past controversies and the criticism he's faced.",
    "music energy": "High because the tempo is quick and Eminem's delivery is intense and rapid-fire.",
    "music danceability": "Medium because while the beat is steady and rhythmic, the focus is on lyrical delivery rather than dance beats.",
    "valence": "Medium because while the track is defiant and assertive, it also reflects on challenges and controversies, adding complexity to its tone.",
    "mode": "Minor because the underlying tone of the track is intense and confrontational."
  },
  "Imagine Dragons_Believer": {
    "genre": "Rock",
    "track bpm": 125,
    "lyrics summary": "The lyrics discuss personal struggles and overcoming adversity, reflecting the challenges faced by the lead singer.",
    "lyrics sentiment": "Mixed because the lyrics express both the struggle of personal challenges and the positivity of overcoming them.",
    "music energy": "High because the song has a fast tempo and intense instrumentation.",
    "music danceability": "High because the beat is strong and consistent, making it suitable for dancing.",
    "valence": "Medium because the mood combines both an upbeat musical feel with themes of struggle in the lyrics.",
    "mode": "Minor because the song is in the B♭ minor key, which often conveys a darker or more introspective tonality."
  },
  "Eminem_The Real Slim Shady": {
    "genre": "Hip Hop",
    "track bpm": 104,
    "lyrics summary": "The song is a scathing commentary on the music industry and Eminem's impact, mixing humor and criticism with a catchy hook.",
    "lyrics sentiment": "Mixed because it combines humorous criticism with self-awareness and industry commentary.",
    "music energy": "High because of its intense rhythm and lively delivery.",
    "music danceability": "High because the beat is prominent and consistent, encouraging movement.",
    "valence": "Medium because it has an upbeat tempo but delivers complex and critical lyrical themes.",
    "mode": "Minor because the track uses a minor key, adding a darker underpinning to its upbeat rhythm."
  }
}