{
  "Tate McRae_Sports car": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "A flirty exploration of desire and freedom embodied through the metaphor of a sports car, capturing the rush of physical attraction.",
    "lyrics sentiment": "Positive because the lyrics convey themes of desire and freedom with a flirty tone.",
    "music energy": "High because the track features an engaging pop beat that is described as 'nasty pop girl beat'.",
    "music danceability": "High because the catchy pop beat encourages dancing or moving along to the rhythm.",
    "valence": "High because the lyrics and tone are flirty and playful, creating a positive emotional experience.",
    "mode": "Major because the song conveys a sense of brightness and freedom associated with pop music."
  },
  "Ciara_Goodies (feat. Petey Pablo)": {
    "genre": "R&B",
    "track bpm": 101,
    "lyrics summary": "'Goodies' explores themes of female empowerment, independence, and self-respect, particularly in romantic contexts, emphasizing that one's self-worth is not up for superficial grabs.",
    "lyrics sentiment": "Positive because the lyrics promote self-respect and empowerment, encouraging individuals to know their worth.",
    "music energy": "High because the beat is lively and engaging, characteristic of a dance track.",
    "music danceability": "High because the track features a seductive beat and rhythm ideal for dancing.",
    "valence": "High because the themes are empowering and self-assured, which promote positive emotions.",
    "mode": "Minor because the song has a seductive and assertive tonality characteristic of R&B tracks with serious themes."
  },
  "Doja Cat_Tia Tamera (feat. Rico Nasty)": {
    "genre": "Hip Hop",
    "track bpm": 140,
    "lyrics summary": "The lyrics of 'Tia Tamera' focus on boasting about wealth, style, and confidence, using catchy and repetitive phrases that compare themselves to famous twins Tia and Tamera Mowry.",
    "lyrics sentiment": "Positive because the lyrics celebrate personal success and confidence.",
    "music energy": "High because the track features a fast tempo and assertive delivery style.",
    "music danceability": "High because the beat is catchy and strong, typical for a hip-hop track that encourages movement.",
    "valence": "High because the song has an uplifting and empowering tone.",
    "mode": "Minor because despite its upbeat nature, typical hip-hop chord progressions tend to use minor keys for a darker, intense feel."
  },
  "Britney Spears_Womanizer": {
    "genre": "Electropop",
    "track bpm": 139,
    "lyrics summary": "'Womanizer' portrays a woman who recognizes a man's insincere intentions and refuses to become a victim of his charms, emphasizing the importance of self-respect and the ability to see through deceptive behavior.",
    "lyrics sentiment": "Mixed because the lyrics discuss themes of deception and manipulation alongside empowerment and self-respect.",
    "music energy": "High because the tempo is fast and the instrumentation is intense.",
    "music danceability": "High because the song has a strong, consistent beat designed for dancing.",
    "valence": "Medium because while the music is upbeat, the lyrical content involves themes of deception and manipulation.",
    "mode": "Major because the song uses a B key in major mode, contributing to a bright, empowering sound."
  },
  "Madison Beer_Make You Mine": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "The lyrics express a strong desire to connect with someone, capturing an eagerness to feel, taste, and ultimately become closer to a person, suggesting a romantic or intimate intention.",
    "lyrics sentiment": "Positive because the lyrics express an eager and romantic desire to connect and make someone theirs.",
    "music energy": "High because the track has a fast tempo of 123 BPM and is described as having high energy, which suggests an intense and dynamic sound.",
    "music danceability": "Medium because it is deemed 'somewhat danceable,' indicating a groove suitable for dancing but not dominated by it.",
    "valence": "Medium because while the lyrics are positive in romantic intent, the minor key suggests a more complex emotional backdrop.",
    "mode": "Minor because the track is explicitly mentioned to be in a minor key, giving it a slightly more introspective or moody quality."
  }
}