{
  "Queen_Another One Bites The Dust - Remastered 2011": {
    "genre": "Rock",
    "track bpm": 110,
    "lyrics summary": "The song uses 'biting the dust' to convey themes of downfall or defeat, both in physical contexts and tumultuous relationships.",
    "lyrics sentiment": "Mixed because the song's themes include both triumphant notions of overcoming obstacles and darker themes of defeat.",
    "music energy": "Medium because the song maintains a steady and engaging beat without being overly aggressive.",
    "music danceability": "High because the groove and rhythm are strong, making it suitable for dancing.",
    "valence": "Medium because the song combines upbeat musical elements with themes of challenge and conflict.",
    "mode": "Minor because the song is in a minor key, contributing to its slightly darker tonal quality."
  },
  "AC/DC_Back In Black": {
    "genre": "Hard Rock",
    "track bpm": 94,
    "lyrics summary": "The song 'Back in Black' by AC/DC is a hard-rock anthem celebrating resilience and a triumphant comeback. It was written as a tribute to the band's former lead singer, Bon Scott, who passed away in 1980.",
    "lyrics sentiment": "Positive because the lyrics express themes of overcoming adversity and celebratory defiance.",
    "music energy": "High because the track features a powerful riff, intense solos, and dynamic vocals.",
    "music danceability": "Medium because while it has a strong beat and rhythm, it's more rock-driven than dance-focused.",
    "valence": "High because the song's triumphant tone and energetic delivery convey positivity and empowerment.",
    "mode": "Major because the key of A major gives it a bright, uplifting tonal quality."
  },
  "Bruce Springsteen_Born to Run": {
    "genre": "Rock",
    "track bpm": 120,
    "lyrics summary": "The song is a yearning confession of love to a girl named Wendy, expressing a deep desire for escape and the pursuit of dreams along the open road.",
    "lyrics sentiment": "Positive because the lyrics emphasize love, the pursuit of happiness, and belief in transformative experiences.",
    "music energy": "High because the track is known for its passionate delivery and intense rock instrumentation.",
    "music danceability": "Medium because the song features a strong, driving beat typical of rock that supports rhythmic movements.",
    "valence": "High because the tone of the song is uplifting and inspirational, capturing the essence of dreams and freedom.",
    "mode": "Major because the song conveys a bright and hopeful feeling through its melodic progression."
  },
  "Ozzy Osbourne_Crazy Train": {
    "genre": "Heavy Metal",
    "track bpm": 138,
    "lyrics summary": "The lyrics delve into themes of chaos, societal conflict, and the struggle for sanity amidst turmoil, reflecting on fear and control.",
    "lyrics sentiment": "Negative because the lyrics discuss chaos, societal disarray, and mental struggles.",
    "music energy": "High because the track features powerful guitar riffs and intense vocal delivery characteristic of heavy metal.",
    "music danceability": "Medium because while the rhythm is steady and driving, typical of rock, it is more suited for headbanging than traditional dancing.",
    "valence": "Medium because while the themes are dark, the powerful and energetic music adds complexity to the emotional tone.",
    "mode": "Minor because the melody and chord progressions have a dark and tense quality typical of heavy metal."
  },
  "Rod Stewart_Ooh La La": {
    "genre": "Rock",
    "track bpm": 151,
    "lyrics summary": "The song is a bittersweet reflection on the naivete of youth and the harsh lessons learned with experience, told from the perspective of a man looking back on his life, wishing he had known certain things when he was younger.",
    "lyrics sentiment": "Mixed because the lyrics express regret and resignation, but also convey wisdom gained with age.",
    "music energy": "High because the tempo is fast and the instrumentation is lively.",
    "music danceability": "Medium because while it has a steady beat, it is more reflective than outright danceable.",
    "valence": "Medium because the tone balances between melancholic reflection and the wisdom and understanding gained over time.",
    "mode": "Minor because the track is in F minor, which gives it a slightly introspective and somber quality."
  }
}