{
  "Katy Perry_Last Friday Night (T.G.I.F.)": {
    "genre": "Pop",
    "track bpm": 126,
    "lyrics summary": "Katy Perry's 'Last Friday Night (T.G.I.F.)' recounts a wild night of partying, dancing on tables, taking shots, spending too much money, and experiencing misadventures leading to an unforgettable night.",
    "lyrics sentiment": "Mixed because the lyrics celebrate fun and freedom but also hint at regret and consequences.",
    "music energy": "High because of the upbeat tempo and lively instrumentation common in pop party anthems.",
    "music danceability": "High because the track has a strong, consistent beat and rhythm ideal for dancing.",
    "valence": "High because the overall mood is fun, energetic, and celebratory.",
    "mode": "Major because the melody is bright and joyful, typical for pop music anthems."
  },
  "Nicki Minaj_Starships": {
    "genre": "Pop",
    "track bpm": 125,
    "lyrics summary": "An energetic anthem celebrating freedom, fun, and escapism, encouraging listeners to enjoy life to the fullest and push their limits.",
    "lyrics sentiment": "Positive because the lyrics express joy, freedom, and a carefree attitude.",
    "music energy": "High because the tempo is fast and the track has an intense and vibrant arrangement.",
    "music danceability": "High because the beat is strong and consistent, designed for dancing.",
    "valence": "High because the overall tone is uplifting, joyful, and carefree.",
    "mode": "Minor because the track is noted to be in B minor, which has a slightly more introspective sound despite the upbeat tempo."
  },
  "Nicki Minaj_Va Va Voom": {
    "genre": "Pop",
    "track bpm": 127,
    "lyrics summary": "A song that delves into desire, moral dilemmas, and the magnetic pull of physical attraction.",
    "lyrics sentiment": "Mixed because it explores complex emotions of desire and moral dilemmas while simultaneously being vibrant and exciting.",
    "music energy": "High because the track has a fast tempo and intense dynamics.",
    "music danceability": "High because it has a consistent beat and rhythmic drive suitable for dancing.",
    "valence": "High because the tone is vibrant and exciting.",
    "mode": "Major because it's in a G♯ Major key, giving it a bright and resolved tonal quality."
  },
  "David Guetta_Where Them Girls At (feat. Nicki Minaj & Flo Rida)": {
    "genre": "EDM",
    "track bpm": 130,
    "lyrics summary": "The song is about a night out at a club, with the main theme focusing on finding, interacting with, and partying with girls.",
    "lyrics sentiment": "Positive because the lyrics convey a lively, upbeat scenario centered around partying and social interaction.",
    "music energy": "High because the track features an intense, fast-paced EDM beat and dynamic instrumentation typical of club anthems.",
    "music danceability": "High because the track has a strong, consistent beat designed to incite dancing and movement in a club setting.",
    "valence": "High because the song has a joyful, celebratory tone and is meant to be uplifting and fun.",
    "mode": "Major because the overall sound is bright and energetic, which is typical of major key compositions."
  },
  "Icona Pop_I Love It (feat. Charli XCX) - I Don’t Care 2022 Re-Edit": {
    "genre": "Pop",
    "track bpm": 124,
    "lyrics summary": "The lyrics express a carefree attitude and a sense of reckless abandon, symbolized by actions like crashing a car into a bridge and not caring about it.",
    "lyrics sentiment": "Positive because the lyrics express joy and liberation from caring about negative consequences.",
    "music energy": "High because the song has an energetic beat and intense instrumentation characteristic of pop anthems.",
    "music danceability": "High because the track features a strong, consistent rhythm that encourages dancing.",
    "valence": "High because the tone is uplifting and the lyrics convey a positive sense of freedom.",
    "mode": "Major because the melody is bright and the song conveys triumphant, carefree feelings."
  }
}