{
  "Darude_Sandstorm - Radio Edit": {
    "genre": "Trance",
    "track bpm": 136,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and has no lyrics to convey emotions.",
    "music energy": "High because the tempo is fast and the synth-driven instrumentation creates an intense soundscape.",
    "music danceability": "High because the consistent beat and driving rhythm are designed to keep people moving on the dance floor.",
    "valence": "Medium because while the track is uplifting and energizing, it's mainly focused on rhythm rather than melody or harmony that could create a joyful atmosphere.",
    "mode": "Minor because the track has a moody, pulsating synth line typical of trance music, adding tension and excitement."
  },
  "JAY-Z_Empire State Of Mind": {
    "genre": "Hip Hop",
    "track bpm": 174,
    "lyrics summary": "The song is an anthem celebrating New York City, its culture, and its vibrant spirit. Jay-Z and Alicia Keys express love and pride for New York, capturing its essence of hope, struggle, and the unique energy that defines the city.",
    "lyrics sentiment": "Positive because the lyrics express love and pride for New York City, highlighting its vibrancy and cultural richness.",
    "music energy": "High because the tempo is fast and the music is exuberant, capturing the lively spirit of New York.",
    "music danceability": "Medium because while the beat is strong, the lyrical focus and complex emotions make it less about dance and more about the message.",
    "valence": "High because the song is uplifting and celebrates the spirit and culture of New York City.",
    "mode": "Minor because the song is in a G♯/A♭ minor key, which supports the solemn but proud tone of the city narrative."
  },
  "Loud Luxury_Body": {
    "genre": "Deep House",
    "track bpm": 124,
    "lyrics summary": "The song explores themes of desire, lust, and the pursuit of physical pleasure in a late-night encounter, emphasizing urgency and lack of emotional entanglement.",
    "lyrics sentiment": "Mixed because the lyrics highlight both the excitement of a physical connection and the lack of emotional depth.",
    "music energy": "High because the track is designed as a dance floor anthem with throbbing beats and intense dynamics.",
    "music danceability": "High because the strong and consistent beat makes it ideal for dancing.",
    "valence": "Medium because the music is upbeat and vibrant, although the lyrical content deals with superficial and transient connections.",
    "mode": "Minor because the underlying tone, despite being energetic, has a dark and sensual quality."
  },
  "Matt Maeson_Hallucinogenics - Seeb Remix": {
    "genre": "Alternative",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics discuss themes of personal struggle and perseverance, with lines like 'carried on like the wayward son' and 'come undone' suggesting emotional turmoil and reflection on one's journey.",
    "lyrics sentiment": "Mixed because the lyrics depict both struggle and perseverance, reflecting emotional ups and downs.",
    "music energy": "Medium because the remix adds a steady, energetic beat that complements the alternative sound.",
    "music danceability": "Medium because the remix provides a rhythmic groove suitable for casual dancing without being overly energetic.",
    "valence": "Medium because the lyrical themes are introspective but the musical components maintain a balance that neither feels too dark nor overly bright.",
    "mode": "Minor because the lyrical content and overall tone suggest introspection and a somewhat unresolved feeling."
  },
  "Eminem_'Till I Collapse": {
    "genre": "Hip Hop",
    "track bpm": 171,
    "lyrics summary": "The lyrics of 'Till I Collapse' focus on themes of perseverance and the relentless pursuit of success despite feelings of exhaustion and vulnerability. Eminem emphasizes the importance of pushing through hardships and never giving up.",
    "lyrics sentiment": "Mixed because while the lyrics focus on perseverance and resilience, they also express feelings of exhaustion and struggle.",
    "music energy": "High because the track is intense, fast-paced, and features aggressive instrumentation and delivery.",
    "music danceability": "Medium because the beat is strong and steady, making it somewhat suitable for casual dancing but not dominating enough for a high danceability rating.",
    "valence": "Low because the tone is intense and the lyrical content is more about struggle and overcoming adversity rather than joy.",
    "mode": "Major because the track is in the C♯/D♭ key and described as having a major mode, which gives it a brighter tonal quality despite the intense lyrical content."
  }
}