{
  "quinnie_touch tank": {
    "genre": "Indie Pop",
    "track bpm": "about 100",
    "lyrics summary": "The song 'touch tank' explores themes of intimacy, vulnerability, and the complexity of relationships. It paints a vivid picture of a youthful and passionate connection, capturing the raw emotions and desires experienced in a budding relationship.",
    "lyrics sentiment": "Mixed because the lyrics express both the thrill and uncertainty of a new relationship, combining vulnerability and desire.",
    "music energy": "Medium because the song combines emotional depth with an engaging rhythmic presence typical of Indie Pop.",
    "music danceability": "Medium because it features a steady beat suitable for light dancing, characteristic of Indie Pop's laid-back vibe.",
    "valence": "Medium because the song balances between the joy of young love and the uncertainties of deeper emotional connections.",
    "mode": "Major because the song captures a sense of hopeful and positive emotional exploration typical in Indie Pop."
  },
  "Kevian Kraemer_Attention": {
    "genre": "Pop",
    "track bpm": 175,
    "lyrics summary": "The song delves into the complexity of a relationship where one person craves genuine emotional connection and commitment, while the other keeps them at arm's length, oscillating between affection and detachment.",
    "lyrics sentiment": "Mixed because the lyrics explore both yearning for intimacy and frustration from mixed signals in a relationship.",
    "music energy": "High because the tempo is fast and described as lively, which typically indicates intense instrumentation.",
    "music danceability": "Medium because, while the song is somewhat danceable with a steady rhythm, it doesn't dominate the track entirely.",
    "valence": "Medium because the emotional tone is complex, dealing with both longing and uncertainty in the relationship theme.",
    "mode": "Major because the track is in the G♯/A♭ key with a major mode, contributing to a brighter tonal quality."
  },
  "Hozier_Too Sweet": {
    "genre": "Alternative Rock",
    "track bpm": "about 70",
    "lyrics summary": "The song explores contrasting lifestyles and love's complexities, focusing on themes of self-acceptance and independence. It portrays a speaker living a jaded, overindulgent life, who is challenged by his love interest's sweet and positive disposition, believing she should be more realistic.",
    "lyrics sentiment": "Mixed because the lyrics contrast gluttony and jadedness with positivity and sweetness, reflecting on complex emotions in relationships.",
    "music energy": "Medium because Hozier's style typically involves a balanced dynamic range with emotional intensity but moderate tempo.",
    "music danceability": "Medium because the rhythm is steady but not specifically designed for dancing, typical in alternative rock.",
    "valence": "Medium because the lyrics and themes present a complex mix of emotional tones including both positive and critical perspectives.",
    "mode": "Minor because the themes of introspection and contrast suggest a darker musical tone."
  },
  "Cavetown_Another One of Those Days": {
    "genre": "Indie Pop",
    "track bpm": 135,
    "lyrics summary": "The lyrics explore themes of routine, longing, and the desire for genuine connection amidst the cyclical nature of daily life.",
    "lyrics sentiment": "Mixed because the lyrics speak of longing for meaningful connections but also a sense of disillusionment and fear.",
    "music energy": "Medium because the track is noted for having average energy, typical of many indie pop songs.",
    "music danceability": "Medium because it is described as very danceable, suggesting a steady and engaging rhythm.",
    "valence": "Low because the overall tone of the song is described as somber and reflective.",
    "mode": "Minor because it is stated in the metadata that the track is in a minor key."
  },
  "late night drive home_Feeling Grey": {
    "genre": "Indie Rock",
    "track bpm": 118,
    "lyrics summary": "The song explores emotions of melancholy and introspection, with lyrics expressing sadness and dissatisfaction. The protagonist feels empty or numb, as indicated by the recurring phrase 'I'm feeling grey.'",
    "lyrics sentiment": "Negative because the lyrics express sadness, dissatisfaction, and a sense of emptiness.",
    "music energy": "Medium because the tempo is moderate and the tone is introspective rather than energetic.",
    "music danceability": "Medium because the beat is steady with a moderate tempo that makes it suitable for activities like walking but not necessarily dancing.",
    "valence": "Low because the tone is melancholic and the lyrics express sadness and emptiness.",
    "mode": "Minor because the melody and lyrics reflect a dark and introspective mood."
  }
}