{
  "OneRepublic_Counting Stars": {
    "genre": "Pop Rock",
    "track bpm": 122,
    "lyrics summary": "The lyrics of 'Counting Stars' by OneRepublic explore themes of ambition, faith, and the pursuit of purpose beyond material wealth, encouraging listeners to seek fulfillment through experiences and connections rather than financial success.",
    "lyrics sentiment": "Positive because the lyrics encourage optimism and finding meaning beyond financial success.",
    "music energy": "High because the song has a fast tempo and vibrant instrumentation.",
    "music danceability": "High because the track features a catchy melody and a strong, consistent beat.",
    "valence": "High because the song's uplifting melody and positive message contribute to an emotionally positive experience.",
    "mode": "Major because the melody and harmony convey a bright and hopeful message."
  },
  "Lady Gaga_Telephone": {
    "genre": "Pop",
    "track bpm": 122,
    "lyrics summary": "The song discusses the speaker's experiences with being overwhelmed by phone calls, expressing frustration and a desire to be left alone while out at a club or a party, trying to enjoy the moment.",
    "lyrics sentiment": "Mixed because while the tone is frustrated with constant interruptions, the lively and energetic music brings a sense of euphoria.",
    "music energy": "High because the tempo is fast and the instrumentation is intense, creating a lively atmosphere.",
    "music danceability": "High because the strong and consistent beat is designed to make people dance.",
    "valence": "High because the track gives off an uplifting, joyful vibe despite the lyrical content of being overwhelmed.",
    "mode": "Minor because the song is in F minor, which typically has a moody and introspective tonal quality."
  },
  "Little Mix_Wings": {
    "genre": "Pop",
    "track bpm": 115,
    "lyrics summary": "The song 'Wings' by Little Mix is an empowering anthem about self-confidence and resilience. The lyrics encourage listeners not to let detractors affect their dreams and to find strength within themselves.",
    "lyrics sentiment": "Positive because the lyrics emphasize empowerment and self-worth against adversity.",
    "music energy": "High because the tempo is upbeat and the instrumentation is intense and uplifting.",
    "music danceability": "High because the song has a strong and consistent beat that makes it easy to dance to.",
    "valence": "High because the song conveys a feeling of upliftment and positivity.",
    "mode": "Major because the song has a triumphant and uplifting tonal quality."
  },
  "Avicii_Hey Brother": {
    "genre": "EDM",
    "track bpm": 125,
    "lyrics summary": "The lyrics of \"Hey Brother\" express a promise of unwavering support and loyalty to family and friends, emphasizing themes of brotherhood and resilience in the face of challenges.",
    "lyrics sentiment": "Positive because the lyrics express themes of support, loyalty, and strong family bonds.",
    "music energy": "High because the track features driving beats and energetic instrumentation typical of EDM.",
    "music danceability": "High because the track has a steady, strong beat suitable for dancing, typical of EDM tracks.",
    "valence": "High because the lyrics and melody convey uplifting and positive emotions about familial support and loyalty.",
    "mode": "Major because the song carries a bright and resolute tonal quality, contributing to its uplifting message."
  },
  "Scissor Sisters_Take Your Mama": {
    "genre": "Pop Rock",
    "track bpm": 110,
    "lyrics summary": "The song explores a man's journey of self-discovery, particularly focusing on a homosexual man's relationship with his mother and his efforts to show her the realities of gay nightlife.",
    "lyrics sentiment": "Mixed because the lyrics express both a joyful exploration of identity and the complex emotions tied to societal expectations and acceptance.",
    "music energy": "Medium because the track has a lively yet not overpowering arrangement that balances excitement with sentiment.",
    "music danceability": "High because the track has a strong, consistent beat suitable for dancing, representative of its pop rock style.",
    "valence": "Medium because the song's themes are both celebratory and introspective, creating an emotionally complex narrative.",
    "mode": "Major because the song generally has an upbeat and triumphant sound, reflecting themes of personal acceptance and joy."
  }
}