{
  "Rihanna_We Found Love": {
    "genre": "EDM",
    "track bpm": 128,
    "lyrics summary": "An anthemic declaration that love can triumph against all odds, emerging even from desolate circumstances.",
    "lyrics sentiment": "Mixed because the lyrics express both joy and triumph as well as a sense of overcoming bleak situations.",
    "music energy": "High because the track has a fast tempo and intense instrumentation.",
    "music danceability": "High because the beat is strong and consistent, suitable for dancing.",
    "valence": "High because the song's tone is uplifting and resolves on a positive emotional note.",
    "mode": "Major because the melody and key provide a bright, triumphant sound."
  },
  "Alice Deejay_Better Off Alone": {
    "genre": "Trance",
    "track bpm": 137,
    "lyrics summary": "The lyrics explore the complexities of human relationships, focusing on the contrast between seeking solitude and desiring connection, resonating with feelings of loneliness.",
    "lyrics sentiment": "Mixed because the lyrics touch on both themes of loneliness and introspection, yet are presented in an upbeat musical setting.",
    "music energy": "High because the tempo is fast and the track is a hallmark of energetic dance culture.",
    "music danceability": "High because it features a catchy and consistent beat suitable for club dancing.",
    "valence": "Medium because despite its upbeat tempo, the underlying themes in the lyrics are introspective and relate to feelings of loneliness.",
    "mode": "Minor because the track is composed in the G♯ Minor key, which gives it a somewhat moody undertone."
  },
  "The Postal Service_Such Great Heights": {
    "genre": "Indie Pop",
    "track bpm": 175,
    "lyrics summary": "The lyrics of 'Such Great Heights' express themes of love and connection, using metaphors and imagery to describe the perfection found in a romantic relationship.",
    "lyrics sentiment": "Positive because the lyrics express optimism and joy in a romantic connection.",
    "music energy": "High because the tempo is fast and the track has an energetic vibe typical of indie pop.",
    "music danceability": "High because the beat is strong and consistent, making it suitable for dancing.",
    "valence": "High because the song's tone is upbeat and joyful, matching the positive lyrical content.",
    "mode": "Major because the song has a bright and resolved tonal quality."
  },
  "Robyn_Dancing On My Own": {
    "genre": "Pop",
    "track bpm": 117,
    "lyrics summary": "The song explores themes of heartbreak, unrequited love, and loneliness, depicting a person who painfully observes their former lover with someone new at an event, experiencing feelings of rejection and abandonment.",
    "lyrics sentiment": "Negative because the lyrics express unrequited love, loneliness, and heartbreak.",
    "music energy": "High because the track has a pulsing beat and intense emotional delivery.",
    "music danceability": "High because it has a strong beat suitable for dancing, even while conveying emotional themes.",
    "valence": "Medium because the song's upbeat pop nature contrasts with its melancholic lyrical themes.",
    "mode": "Major because the track is composed in a major key, providing a bright tonal backdrop to the melancholic lyrics."
  },
  "Europe_The Final Countdown": {
    "genre": "Rock",
    "track bpm": 118,
    "lyrics summary": "The lyrics describe a space adventure, as a group leaves Earth to explore Venus, expressing uncertainty about their return.",
    "lyrics sentiment": "Mixed because the lyrics convey both the excitement of exploration and a sense of uncertainty about the future.",
    "music energy": "High because the tempo is moderately fast and the instrumentation is intense and powerful.",
    "music danceability": "Medium because while the song has a strong beat, it is not primarily designed for dancing.",
    "valence": "Medium because the song has an adventurous yet somewhat melancholic emotional tone.",
    "mode": "Minor because the melody and harmonies create a darker, more introspective feel."
  }
}