{
  "M.I.A._Come Around": {
    "genre": "Electronic Hip Hop",
    "track bpm": 120,
    "lyrics summary": "The lyrics explore themes of globalization, cultural identity, and resilience, blending political commentary with personal expression.",
    "lyrics sentiment": "Mixed because the lyrics combine cultural commentary with personal bravado, reflecting both positive celebration and critical perspectives.",
    "music energy": "High because the track features pulsating beats and intense production by Timbaland.",
    "music danceability": "High because the infectious beats and rhythmic flow invite movement and dance.",
    "valence": "Medium because while the music is upbeat, the lyrical themes add complexity to the emotional tone.",
    "mode": "Minor because the track's exploration of darker themes through its lyrics and sonic fusion suggests a less resolved tonal quality."
  },
  "Flo Milli_Conceited": {
    "genre": "Hip Hop",
    "track bpm": 118,
    "lyrics summary": "The lyrics focus on themes of female empowerment and self-love, with Flo Milli making bold, braggadocious claims about feeling good about herself, reflecting a confident and assertive tone.",
    "lyrics sentiment": "Positive because the lyrics express self-love and empowerment, celebrating individuality.",
    "music energy": "High because the tempo is energetic and the lyrics are delivered assertively with a prominent beat.",
    "music danceability": "High because the beat is strong and consistent, designed to make people move.",
    "valence": "High because the track has an uplifting and empowering tone, encouraging confidence and self-celebration.",
    "mode": "Major because the track sounds bright and resolved, fitting its empowering theme."
  },
  "Nicki Minaj_Super Freaky Girl": {
    "genre": "Hip Hop",
    "track bpm": 133,
    "lyrics summary": "The song features bold and confident lyrics that embrace a sense of empowerment and playful sensuality.",
    "lyrics sentiment": "Positive because it expresses confidence and self-assuredness.",
    "music energy": "High because the tempo is fast and the production is vibrant and intense.",
    "music danceability": "High because the track has a strong, rhythmic beat suitable for dancing.",
    "valence": "High because the tone is exuberant and lively.",
    "mode": "Major because the track is in D major, contributing to its bright and cheerful sound."
  },
  "Nelly Furtado_Maneater": {
    "genre": "Pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics describe a seductive and exploitative woman who uses her charm and beauty to manipulate and take advantage of others.",
    "lyrics sentiment": "Mixed because the lyrics highlight both allure and exploitation, showing both attractive and darker themes.",
    "music energy": "High because the tempo is fast and the production is driven by energetic beats and instrumentation.",
    "music danceability": "High because the track has a strong and consistent rhythm that is suited for dancing.",
    "valence": "Medium because while the music is upbeat and lively, the lyrical theme is somewhat deceitful and dark.",
    "mode": "Minor because the song's tone, despite its danceable beat, is slightly moody and fits the theme of manipulation."
  },
  "Christina Milian_Dip It Low": {
    "genre": "R&B",
    "track bpm": 169,
    "lyrics summary": "The lyrics of 'Dip It Low' focus on the theme of sensuality and dance, encouraging a romantic partner to feel the rhythm and get closer.",
    "lyrics sentiment": "Mixed because the lyrics convey both romantic and playful tones.",
    "music energy": "High because the tempo is fast and the song has intense production elements.",
    "music danceability": "High because the beat is strong and consistent, making it ideal for dancing.",
    "valence": "Medium because the song has a balanced emotional tone with both playful and sensual elements.",
    "mode": "Minor because the song is set in the B Minor key, giving it a slightly moody and introspective feel."
  }
}