{
  "Murray Head_One Night in Bangkok": {
    "genre": "Pop Rock",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics depict a night in Bangkok experienced by an American chess champion, focusing on the city's vibrant nightlife and the fleeting, intense experiences it offers. The city's bars are metaphorically compared to temples, showing both temptation and allure.",
    "lyrics sentiment": "Neutral because the lyrics describe the experience and surroundings factually, with an intriguing yet detached tone.",
    "music energy": "Medium because the song has a steady groove and rhythmic spoken-word verses contrasting with a sung chorus.",
    "music danceability": "Medium because it has a steady beat with a blend of spoken verses and a catchy chorus, suitable for lighter dancing.",
    "valence": "Medium because the music combines intriguing Eastern motifs and a pop rock sensibility, offering a mix of emotions.",
    "mode": "Minor because the underlying harmonies support a complex narrative and tonal mood often associated with introspective, storytelling music."
  },
  "Lizzo_Juice": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "The song 'Juice' by Lizzo is an empowering and self-assured anthem where Lizzo unapologetically celebrates her success and vibrant lifestyle. Through playful metaphors like 'Goose' and 'juice,' she expresses her energetic spirit and confidence.",
    "lyrics sentiment": "Positive because the lyrics convey confidence, self-love, and joy in celebrating oneself and one's achievements.",
    "music energy": "High because the song features energetic and lively instrumentation typical of Pop music.",
    "music danceability": "High because the track has a strong, consistent beat that makes it easy to dance to.",
    "valence": "High because the song is uplifting and filled with positive, empowering messages.",
    "mode": "Major because the melody and harmonics sound bright and triumphant, reflecting the song's positive theme."
  },
  "Boston_Foreplay / Long Time": {
    "genre": "Classic Rock",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'Long Time' convey a sense of nostalgia and the feeling of moving on after being away for a significant period. The lyrics reflect on time passing and the realization of needing to return or continue a journey.",
    "lyrics sentiment": "Mixed because the lyrics express a blend of nostalgia and a forward-looking desire to move on.",
    "music energy": "High because the instrumentation is intense and powerful, with strong guitar and drum presence, typical of classic rock anthems.",
    "music danceability": "Medium because the steady rock beat allows for rhythmic movement, but it's not designed for formal dance styles.",
    "valence": "Medium because there is a balance between nostalgic and energetic, triumphant tones in the music and lyrics.",
    "mode": "Major because the song's triumphant and resolved sound is typical of major key compositions."
  },
  "The Doobie Brothers_Long Train Runnin'": {
    "genre": "Rock",
    "track bpm": 105,
    "lyrics summary": "The lyrics of 'Long Train Runnin'' by The Doobie Brothers use trains as a metaphor for life's journey, capturing themes of movement, change, love, and struggle.",
    "lyrics sentiment": "Mixed because the lyrics explore both the dynamic vitality of moving forward and the struggles of life's journey.",
    "music energy": "Medium because of its funky rhythm and upbeat guitar lines, typical of the Doobie Brothers' style.",
    "music danceability": "Medium because it has a catchy rhythm that supports light dancing but is not overpoweringly dance-centric.",
    "valence": "Medium because the song balances uplifting movement with introspective themes in the lyrics.",
    "mode": "Major because the tonal quality of the song is bright and upbeat, reflecting optimism despite the underlying struggles."
  },
  "The J. Geils Band_Freeze-Frame": {
    "genre": "Rock",
    "track bpm": 134,
    "lyrics summary": "The song 'Freeze-Frame' by The J. Geils Band is about capturing and preserving the magical, fleeting moments of love and infatuation. The lyrics use vivid imagery to explore the intense feelings associated with infatuation and the desire to hold onto these experiences.",
    "lyrics sentiment": "Positive because the lyrics celebrate the beauty and magic of love and infatuation.",
    "music energy": "High because the song features an upbeat tempo and energetic sound typical of 1980s rock.",
    "music danceability": "High because the track has a catchy melody and infectious beat that encourages movement.",
    "valence": "High because the upbeat tempo and playful lyrics create a joyful and positive listening experience.",
    "mode": "Major because the song has a bright and resolved tonal quality."
  }
}