{
  "The Weeknd_Call Out My Name": {
    "genre": "R&B",
    "track bpm": "about 70",
    "lyrics summary": "The lyrics of 'Call Out My Name' explore themes of love, heartbreak, and vulnerability, focusing on the emotional fallout from a failed relationship.",
    "lyrics sentiment": "Negative because the lyrics express heartbreak and regret following a breakup.",
    "music energy": "Medium because the song's tempo is slow but emotionally intense.",
    "music danceability": "Low because the track is a ballad focused on emotional expression rather than rhythmic movement.",
    "valence": "Low because the tone of the song is melancholic and centered on heartbreak.",
    "mode": "Minor because the musical elements convey a dark and unresolved emotional landscape."
  },
  "The Weeknd_Starboy": {
    "genre": "Electropop",
    "track bpm": 112,
    "lyrics summary": "Starboy by The Weeknd ft Daft Punk explores themes of opulence, living the high life, and personal transformation. The lyrics reflect a braggadocious persona, exploring struggles with fame and identity.",
    "lyrics sentiment": "Mixed because the lyrics combine themes of opulence and swagger with introspection and the challenges of fame.",
    "music energy": "High because the song features a pulsating beat and intense electronic production.",
    "music danceability": "High because the track has a strong, consistent beat and rhythm, typical for dance-oriented pop music.",
    "valence": "Medium because while the track has a catchy beat, it also conveys introspective and darker themes.",
    "mode": "Minor because the song's overall tone is dark and moody, characteristic of The Weeknd's style and its electronic production."
  },
  "The Weeknd_Die For You": {
    "genre": "R&B",
    "track bpm": 134,
    "lyrics summary": "The lyrics of 'Die For You' explore themes of love and longing, expressing a deep emotional connection and commitment to someone despite challenges and separation.",
    "lyrics sentiment": "Positive because the lyrics express devotion and willingness to sacrifice for a loved one.",
    "music energy": "Medium because the song maintains a balanced dynamic with emotive vocals and steady tempo.",
    "music danceability": "Medium because it has a steady beat but is more focused on emotional expression than dancing.",
    "valence": "Medium because the emotional tone is complex, combining feelings of longing with devotion.",
    "mode": "Minor because the song is in a minor key, contributing to its emotional depth and introspective quality."
  },
  "The Weeknd_Wasted Times": {
    "genre": "R&B",
    "track bpm": 123,
    "lyrics summary": "The lyrics express regret over time spent with someone who did not fulfill the singer compared to a former lover.",
    "lyrics sentiment": "Negative because the lyrics convey regret and reflect on unfulfilling past relationships.",
    "music energy": "Medium because while it has a steady tempo, it doesn't feature aggressive instrumentation.",
    "music danceability": "Medium because the beat is steady and suitable for casual dancing.",
    "valence": "Low because the tone is reflective and carries emotional weight with regretful lyrics.",
    "mode": "Minor because the song has a reflective and slightly somber tone, common with minor keys."
  },
  "The Weeknd_Often": {
    "genre": "R&B",
    "track bpm": 110,
    "lyrics summary": "The lyrics of 'Often' by The Weeknd explore themes of desire, pleasure, and dominance, depicting a hedonistic nightlife experience.",
    "lyrics sentiment": "Mixed because the lyrics express both allure and excess, capturing both seductive and dark nightlife themes.",
    "music energy": "High because the song features intense lyrical delivery and cinematic production.",
    "music danceability": "High because the track has a strong and consistent beat that encourages movement.",
    "valence": "Medium because although it is seductive, it also delves into darker themes.",
    "mode": "Minor because the song has a moody and introspective quality typical of The Weeknd's style."
  }
}