{
  "BigXthaPlug_Change Me": {
    "genre": "Trap",
    "track bpm": 128,
    "lyrics summary": "The lyrics convey a message about staying true to oneself despite attempts by others to change them.",
    "lyrics sentiment": "Mixed because the lyrics discuss the challenges and adversities faced, but also convey resilience and determination.",
    "music energy": "High because the tempo is fast and the track combines soulful vocals with hard-hitting trap drums.",
    "music danceability": "High because of the strong, consistent beat and rhythm typical of trap music.",
    "valence": "Medium because the track blends melancholic themes with energetic music, creating an emotionally complex mood.",
    "mode": "Minor because the key is F♯/G♭ minor, which typically gives a dark, introspective feel."
  },
  "Lil Baby_Drip Too Hard (Lil Baby & Gunna)": {
    "genre": "Trap",
    "track bpm": 140,
    "lyrics summary": "The song highlights a luxurious lifestyle emphasizing excessive strength, making boasts, and enviable fashion sense.",
    "lyrics sentiment": "Positive because the lyrics express confidence, success, and wealth.",
    "music energy": "High because the track is driven by a fast-paced rhythm and intense delivery.",
    "music danceability": "High because the beat is steady and inviting for movement.",
    "valence": "High because the tone is celebratory and confident.",
    "mode": "Major because the track has an uplifting and assertive tone."
  },
  "Kendrick Lamar_Not Like Us": {
    "genre": "Hip Hop",
    "track bpm": 101,
    "lyrics summary": "Explores themes of rivalry and confrontation between artists, focusing on competition and domination.",
    "lyrics sentiment": "Negative because the lyrics emphasize rivalry, confrontation, and a sense of conflict.",
    "music energy": "Medium because the track has a balanced dynamic range and intensity, suitable for a hip-hop diss track.",
    "music danceability": "High because the DJ Mustard-produced beat is bouncy and designed to make people move.",
    "valence": "Medium because while the beat is engaging, the lyrics carry a darker confrontational tone.",
    "mode": "Major because it's in D♭ Major, giving the track a resolved tonal quality despite its lyrical content."
  },
  "Masego_Mystery Lady": {
    "genre": "R&B",
    "track bpm": 76,
    "lyrics summary": "The song explores a man's infatuation with a mystery lady he has never met, expressing his desire to know her and write songs about her. It conveys a sense of longing and curiosity about this abstract muse while reflecting on his current relationship, where he questions whether his feelings are justified or mistaken.",
    "lyrics sentiment": "Mixed because the lyrics convey both infatuation and longing contrasted with uncertainty and confusion.",
    "music energy": "Medium because the track features smooth jazz and R&B elements, providing a balanced dynamic that supports its melodic exploration.",
    "music danceability": "High because the track is described as very danceable with a steady 4/4 beat structure and engaging rhythm.",
    "valence": "Medium because although the song is upbeat and danceable, the lyrical content explores themes of longing and uncertainty.",
    "mode": "Minor because the song is in D♯/E♭ minor, giving it a slightly moody and introspective quality."
  },
  "Future_Everyday Hustle": {
    "genre": "Trap",
    "track bpm": "about 140",
    "lyrics summary": "The song delves into the relentless pursuit of success and the harsh realities of street life, touching on themes of perseverance, loyalty, wealth, and the sacrifices made to achieve success.",
    "lyrics sentiment": "Mixed because the song conveys themes of both determination and the harsh realities of street life.",
    "music energy": "High because the music likely features intense beats and a fast tempo typical of trap music.",
    "music danceability": "Medium because while the beat is strong, the lyrical focus may reduce its dance appeal compared to more rhythm-centric tracks.",
    "valence": "Medium because the song balances themes of struggle with determination and ambition.",
    "mode": "Minor because the introspective and gritty tone of the song suggests a darker melody."
  }
}