{
  "Kanye West_POWER": {
    "genre": "Hip-Hop",
    "track bpm": 120,
    "lyrics summary": "The lyrics revolve around celebrating and letting loose at a party, with many references to drinking and enjoying the nightlife.",
    "lyrics sentiment": "Positive because the lyrics focus on having fun and celebrating with friends and drinks.",
    "music energy": "High because the song is described as intense and lively, making it suitable for a party atmosphere.",
    "music danceability": "High because the song has a strong, catchy beat and is very danceable, typically used in clubs.",
    "valence": "High because the lyrics and overall theme are joyful and focused on fun and enjoyment.",
    "mode": "Major because it is in a C♯/D♭ key and has a bright, upbeat feel."
  },
  "Survivor_Eye of the Tiger": {
    "genre": "Rock",
    "track bpm": 109,
    "lyrics summary": "The lyrics focus on themes of perseverance, resilience, and determination, often interpreted as an anthem for overcoming challenges and fighting against the odds.",
    "lyrics sentiment": "Positive because the lyrics inspire motivation and confidence through its empowering message.",
    "music energy": "High because the tempo is upbeat and the instrumentation is intense with driving guitar riffs.",
    "music danceability": "Medium because the rock rhythm provides a steady beat that encourages movement without being overly rhythmic.",
    "valence": "High because the song gives a sense of triumph and motivation, typical of its use as a pump-up anthem.",
    "mode": "Minor because the melody and chord progression create a powerful and serious tone, despite the uplifting theme."
  },
  "Eminem_Till I Collapse": {
    "genre": "Hip Hop",
    "track bpm": 90,
    "lyrics summary": "The song emphasizes overcoming challenges despite feelings of exhaustion and aims to inspire resilience and perseverance.",
    "lyrics sentiment": "Positive because the lyrics focus on determination and pushing through difficulties.",
    "music energy": "High because the lyrics are delivered with passion and urgency, supported by a dynamic beat.",
    "music danceability": "Medium because the beat is strong and consistent, suitable for nodding along rather than full dancing.",
    "valence": "Medium because while the lyrics are about struggle, they ultimately convey an uplifting message of resilience.",
    "mode": "Minor because the musical tonal quality is introspective and intense, matching the lyrical themes."
  },
  "Macklemore_Can't Hold Us (feat. Ray Dalton)": {
    "genre": "Hip Hop",
    "track bpm": 146,
    "lyrics summary": "The lyrics focus on themes of determination, perseverance, and overcoming obstacles. The song captures a confident and energetic narrative about reaching for success and the unstoppable nature of one's ambitions.",
    "lyrics sentiment": "Positive because the lyrics express a strong sense of determination and triumph over challenges.",
    "music energy": "High because the song features a fast tempo and intense, dynamic instrumentation.",
    "music danceability": "High because it has a strong, rhythmic beat and catchy melody that encourages movement.",
    "valence": "High because the tone of the track is joyful and uplifting, conveying a celebratory and triumphant feeling.",
    "mode": "Major because the harmonic progressions and overall sound convey brightness and positivity."
  },
  "J. Cole_Work Out": {
    "genre": "Hip Hop",
    "track bpm": 120,
    "lyrics summary": "The song is about finding personal happiness and fulfillment through romantic relationships, emphasizing gratitude and being young and in love.",
    "lyrics sentiment": "Positive because the lyrics express appreciation and joy in romantic connection and personal growth.",
    "music energy": "High because the tempo is upbeat and the instrumentation is lively.",
    "music danceability": "High because the song features a strong, consistent beat suitable for dancing.",
    "valence": "High because the lyrics and music convey happiness and positivity.",
    "mode": "Major because the melody and harmony sound uplifting and resolved."
  }
}