{
  "Waka Flocka Flame_No Hands (feat. Roscoe Dash & Wale)": {
    "genre": "Hip Hop",
    "track bpm": 130,
    "lyrics summary": "The lyrics describe a party scene where the artists are enjoying themselves by dancing, drinking, and interacting flirtatiously with women. The central theme focuses on nightlife, fun, and carefree partying.",
    "lyrics sentiment": "Positive because the lyrics express enjoyment and celebration of a lively party atmosphere.",
    "music energy": "High because the track features a fast tempo and intense beats typical of hip hop club anthems.",
    "music danceability": "High because the rhythm is strong and steady, designed for dancing in club settings.",
    "valence": "High because the song's tone is upbeat and celebratory, reflecting a joyful party vibe.",
    "mode": "Major because the melody and progression are bright and feel triumphant, fitting the celebratory tone."
  },
  "Future_Lookin Exotic": {
    "genre": "Rap",
    "track bpm": 90,
    "lyrics summary": "The song is about living a lavish lifestyle and enjoying the finer things in life with a significant other.",
    "lyrics sentiment": "Positive because the lyrics express joy and pride in wealth and luxury.",
    "music energy": "Medium because the song maintains a steady beat typical of rap but isn't overly intense.",
    "music danceability": "Medium because the beat is steady typical of rap music but doesn't emphasize heavy rhythm for dancing.",
    "valence": "Medium because the tone is balanced, celebrating wealth without deep emotional shifts.",
    "mode": "Major because the track projects a triumphant and proud feeling."
  },
  "Nicki Minaj_Starships": {
    "genre": "Pop",
    "track bpm": 125,
    "lyrics summary": "The lyrics of 'Starships' focus on living life to the fullest and aiming high, regardless of societal expectations.",
    "lyrics sentiment": "Positive because the lyrics emphasize enjoyment, empowerment, and celebration.",
    "music energy": "High because the tempo is fast and the beat is intense.",
    "music danceability": "High because the track has a strong, consistent beat that encourages dancing.",
    "valence": "High because the tone is upbeat and joyful, promoting a feel-good atmosphere.",
    "mode": "Minor because the track is set in the B minor key, giving it a slightly edgy but still celebratory vibe."
  },
  "Chris Brown_Back To Sleep REMIX (feat. Usher & ZAYN)": {
    "genre": "R&B",
    "track bpm": 100,
    "lyrics summary": "The song is about intimacy and physical affection, emphasizing a romantic and sexual connection between partners. It encourages staying comfortable and being oneself while expressing affection.",
    "lyrics sentiment": "Positive because the lyrics focus on romantic and physical intimacy, expressing affection and desire.",
    "music energy": "Medium because the tempo is steady and the R&B style is smooth yet dynamic.",
    "music danceability": "High because the track features a consistent beat and rhythm suitable for dancing.",
    "valence": "High because the tone is affectionate and intimate, creating a positive emotional atmosphere.",
    "mode": "Major because the melody and harmony produce a bright and uplifting sound."
  },
  "Ciara_1, 2 Step (feat. Missy Elliott)": {
    "genre": "Hip-Hop",
    "track bpm": "about 113",
    "lyrics summary": "The lyrics describe an infectious and hypnotic beat that encourages everyone to dance and enjoy the moment, with encouraging commands like 'rock it, don't stop it' and instructions to 'let me see you one, two step.'",
    "lyrics sentiment": "Positive because the lyrics express an upbeat and celebratory mood, encouraging dancing and enjoyment.",
    "music energy": "High because the song is a lively party anthem with a strong beat and energetic delivery.",
    "music danceability": "High because the track features a catchy rhythm and beat designed to get people dancing.",
    "valence": "High because the song has a joyful and energetic vibe, promoting a fun and positive atmosphere.",
    "mode": "Major because the song has a bright, upbeat tone typical of a dance party anthem."
  }
}