{
  "Tyga_Rack City": {
    "genre": "Hip-Hop",
    "track bpm": 99,
    "lyrics summary": "The lyrics celebrate nightlife and the appreciation of female beauty in nightclubs and events, with references to Las Vegas as 'Rack City'.",
    "lyrics sentiment": "Positive because the lyrics express enjoyment and admiration for nightlife and female beauty.",
    "music energy": "Low because the energy level is measured at 34/100, indicating it's more laid-back compared to high-energy tracks.",
    "music danceability": "High because the track has a strong groove suited for dancing and a danceability score of 93/100.",
    "valence": "Medium because the lyrics are celebratory but not overwhelmingly joyous, suggesting a balanced emotional tone.",
    "mode": "Major because it is described as being in the key of Db major, typically associated with a brighter sound."
  },
  "Fetty Wap_Trap Queen": {
    "genre": "Trap",
    "track bpm": 148,
    "lyrics summary": "The song 'Trap Queen' by Fetty Wap narrates a story of loyalty and ambition. It explores love and partnership in the context of a challenging environment, centered around the themes of hustle and mutual support.",
    "lyrics sentiment": "Mixed because the lyrics celebrate loyalty and ambition but are set in the harsh context of drug dealing and hustling.",
    "music energy": "High because the track features a fast tempo and intense beat typical of trap music.",
    "music danceability": "High because the beat is strong and consistent, encouraging movement and dancing.",
    "valence": "Medium because while the beat is infectious and catchy, the lyrical content involves complex themes of struggle and ambition.",
    "mode": "Major because the track is in G Major, which typically has a bright and upbeat tonal quality."
  },
  "Fetty Wap_679 (feat. Remy Boyz)": {
    "genre": "Hip-Hop",
    "track bpm": 190,
    "lyrics summary": "The lyrics describe a party and lavish lifestyle, boasting about fame, money, and the criminal crew associated with Fetty Wap.",
    "lyrics sentiment": "Negative because the lyrics focus on materialism and the challenges of being in control and dealing with rivals.",
    "music energy": "High because the tempo is very fast and the instrumentation is intense.",
    "music danceability": "Medium because while there is a consistent beat, it isn't overwhelmingly emphasized for dancing.",
    "valence": "Low because the lyrical content and minor key contribute to a darker emotional tone.",
    "mode": "Minor because the track is reported to be in a minor key which often sounds darker and more introspective."
  },
  "Mustard_Pure Water (with Migos)": {
    "genre": "Hip Hop",
    "track bpm": 202,
    "lyrics summary": "The song's lyrics describe themes of wealth, success, and lavish lifestyle, with references to material possessions like expensive jewelry and luxury cars. The artists flaunt their power and romantic appeal, celebrating their achievements with vivid imagery of opulence.",
    "lyrics sentiment": "Positive because the lyrics celebrate wealth, success, and an extravagant lifestyle.",
    "music energy": "Medium because the track has average energy according to its description and maintains a steady beat.",
    "music danceability": "High because the song is described as very danceable with a strong hip hop beat.",
    "valence": "Medium because although it celebrates success and luxury, the tone can be both upbeat and flaunting rather than purely joyful.",
    "mode": "Major because the song is in a C major key, providing a bright and resolved tonal quality."
  },
  "Lil Dicky_Freaky Friday (feat. Chris Brown)": {
    "genre": "Comedy Hip Hop",
    "track bpm": 133,
    "lyrics summary": "The song's lyrics revolve around a comedic take on body-switching, with Lil Dicky waking up as Chris Brown and experiencing life as a famous music star.",
    "lyrics sentiment": "Positive because the lyrics humorously explore the excitement and novelty of living as a celebrity with light-hearted amusement.",
    "music energy": "High because the tempo is fast and the production is lively and dynamic.",
    "music danceability": "High because the beat is strong and consistent, encouraging listeners to move.",
    "valence": "High because the tone is upbeat and the themes are humorous and fun.",
    "mode": "Major because the key of G# Major contributes to a bright and light-hearted musical atmosphere."
  }
}