{
  "Dr. Dre_Still D.R.E.": {
    "genre": "Hip-Hop",
    "track bpm": 94,
    "lyrics summary": "The lyrics of 'Still D.R.E.' express themes of resilience, dominance, and Dr. Dre's enduring influence in the hip-hop world. It is both a reminder of his legacy and a statement of his continuing relevance and power after a period away from the spotlight.",
    "lyrics sentiment": "Positive because the lyrics focus on resilience, dominance, and an assertive return to prominence.",
    "music energy": "High because the track features prominent beats and a driving rhythm typical of hip-hop anthems.",
    "music danceability": "Medium because while the beat is strong and steady, the focus is more on lyrical delivery than rhythm-driven dancing.",
    "valence": "Medium because while the track is assertive and powerful, it carries a serious and intense tone rather than a purely joyful one.",
    "mode": "Minor because the track has a darker, more serious tonality typical of hip-hop tracks emphasizing power and resilience."
  },
  "Drake_Jimmy Cooks (feat. 21 Savage)": {
    "genre": "Hip Hop",
    "track bpm": 145,
    "lyrics summary": "The lyrics of 'Jimmy Cooks' feature Drake and 21 Savage trading bars over a hard-hitting instrumental, likely discussing themes of success, resilience, and their street credentials.",
    "lyrics sentiment": "Mixed because while the lyrics involve themes of resilience and success, they also include aggressive and confrontational elements.",
    "music energy": "High because the track features a hard-hitting beat and intense delivery by both artists.",
    "music danceability": "Medium because while it has a strong beat typical for hip hop, the lyrical focus makes it less purely rhythmic.",
    "valence": "Medium because the intensity and aggressive tone balance any positive themes of success or victory.",
    "mode": "Minor because the track features a serious, intense vibe typical of minor key hip hop beats."
  },
  "Majestic_Rasputin": {
    "genre": "Dance",
    "track bpm": 128,
    "lyrics summary": "The song 'Rasputin' by Majestic is a remix of Boney M.'s disco classic, focusing on the colorful and charismatic figure of Rasputin, a mystic from Russian history. It portrays the historical intrigue with infectious dance music hooks.",
    "lyrics sentiment": "Neutral because while it celebrates Rasputin's larger-than-life persona, it does not express strong emotions beyond the storytelling.",
    "music energy": "High because the track features a fast tempo of 128 BPM and is designed for energetic dance floors.",
    "music danceability": "High because it is highly danceable with a steady 4/4 beat and an infectious dance music rhythm.",
    "valence": "Medium because while the music is upbeat and energetic, the minor mode adds a slight edge and complexity to the emotional tone.",
    "mode": "Minor because the song is set in a minor key, giving it a slightly darker or more mysterious tonal quality."
  },
  "Tommy Richman_MILLION DOLLAR BABY": {
    "genre": "Pop",
    "track bpm": 138,
    "lyrics summary": "The lyrics revolve around the theme of determination and ambition, expressing a strong desire to overcome obstacles and achieve dreams while protecting loved ones.",
    "lyrics sentiment": "Mixed because the lyrics express both a strong ambition and an introspective determination, showing contrasting emotions of urgency and introspection.",
    "music energy": "High because the tempo is fast at 138 BPM and the song pulsates with a vigorous rhythm.",
    "music danceability": "High because the track is described as 'very danceable' and contains a steady and hard-hitting beat.",
    "valence": "Medium because while the song is energetic and ambitious, its introspective quality also adds an emotional complexity.",
    "mode": "Minor because the track is set in a C♯/D♭ minor key, giving it a somewhat serious or introspective tonal quality."
  },
  "Doja Cat_Vegas (From the Original Motion Picture Soundtrack ELVIS)": {
    "genre": "Hip Hop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics critique a person who pretends to be something they're not, comparing them to a hound dog, implying they are untrustworthy or lacking in substance.",
    "lyrics sentiment": "Negative because the lyrics convey frustration and criticism towards someone pretending to be more than they are.",
    "music energy": "High because the track likely features upbeat tempos and dynamic vocal delivery typical of Doja Cat's music.",
    "music danceability": "High because the beat is likely steady and infectious, characteristic of Doja Cat's style, aiming to engage listeners and encourage movement.",
    "valence": "Medium because while the lyrics are critical, the music itself might be upbeat and engaging, leading to a balanced emotional tone.",
    "mode": "Minor because the critique and critical tone indicated by the lyrics suggest a darker, unresolved musical feel."
  }
}