{
  "Yusuf / Cat Stevens_Another Saturday Night": {
    "genre": "Classic Rock",
    "track bpm": 143,
    "lyrics summary": "The lyrics narrate a story of loneliness and yearning as the protagonist spends another Saturday night alone, despite having money and the desire for human connection.",
    "lyrics sentiment": "Negative because the lyrics express feelings of loneliness and frustration about being without companionship.",
    "music energy": "Medium because the song maintains a steady rhythm typical of classic rock, without aggressive or high-paced instrumentation.",
    "music danceability": "Medium because the song's beat is steady and consistent, suitable for casual dancing or tapping along.",
    "valence": "Low because the lyrics express isolation and longing, contributing to a melancholic tone.",
    "mode": "Major because the song features chords typical of a major key, giving a brighter sound to a story of loneliness."
  },
  "Yusuf / Cat Stevens_Can't Keep It In": {
    "genre": "Folk Rock",
    "track bpm": "around 120",
    "lyrics summary": "The lyrics focus on themes of self-expression, love, and authenticity, where the protagonist struggles with inner turmoil but feels an unstoppable need to express their love and emotions to the world.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of turmoil but also the positive desire to express love and authenticity.",
    "music energy": "Medium because the song reflects balanced dynamics of folk rock with steady rhythm and expressive lyrics.",
    "music danceability": "Medium because the rhythm supports a steady, engaging flow suitable for light movement or casual dancing.",
    "valence": "Medium because the song balances emotional struggle with an underlying theme of love and self-expression.",
    "mode": "Major because the song's tone and lyrics reflect a more positive and hopeful sound."
  },
  "Cher_Strong Enough": {
    "genre": "Disco",
    "track bpm": 130,
    "lyrics summary": "The lyrics of 'Strong Enough' express themes of empowerment and self-reliance, focusing on the strength required to move on from a broken relationship.",
    "lyrics sentiment": "Positive because the lyrics promote a sense of empowerment and self-assurance.",
    "music energy": "High because the tempo is fast and the instrumentation is intense, reminiscent of disco music.",
    "music danceability": "High because the track has a strong disco beat and rhythm that encourages dancing.",
    "valence": "High because the song has an uplifting and joyful mood, typical of disco music.",
    "mode": "Major because the track's key of C Major contributes to its bright and positive tonal quality."
  },
  "David Bowie_Rebel Rebel - 2016 Remaster": {
    "genre": "Glam Rock",
    "track bpm": 136,
    "lyrics summary": "The song 'Rebel Rebel' by David Bowie explores themes of gender identity, nonconformity, and defiance of societal norms. It has an opening with a catchy and repetitive refrain that sets a rebellious and provocative tone.",
    "lyrics sentiment": "Positive because the lyrics emphasize empowerment and challenging societal norms in a celebratory manner.",
    "music energy": "Medium because the song features a steady rock beat with notable guitar riffs typical of glam rock without being overly intense.",
    "music danceability": "Medium because the song has a strong, steady rhythm which supports some level of dancing or movement.",
    "valence": "High because the track has an upbeat rock feel combined with lyrics that celebrate individuality and rebellion.",
    "mode": "Major because the song has a bright and assertive sound characteristic of glam rock anthems."
  },
  "David Lee Roth_Just a Gigolo / I Ain't Got Nobody - 45 Version": {
    "genre": "Rock",
    "track bpm": 120,
    "lyrics summary": "The song covers two distinct themes: 'Just a Gigolo' deals with themes of transient romance and a superficial lifestyle, while 'I Ain't Got Nobody' expresses loneliness and a sense of neglect.",
    "lyrics sentiment": "Mixed because the lyrics juxtapose themes of a carefree lifestyle with feelings of loneliness.",
    "music energy": "Medium because the track is upbeat with moderate tempo and dynamic instrumentation typical of David Lee Roth's style.",
    "music danceability": "Medium because the rhythm is steady and engaging, but not overly dominant.",
    "valence": "Medium because the music is upbeat but carries an underlying bittersweet tone due to the lyrical content.",
    "mode": "Major because the overall melody and harmony have a bright and lively sound characteristic of a rock adaptation of these classic songs."
  }
}