{
  "Metro Boomin_Superhero (Heroes & Villains) [with Future & Chris Brown]": {
    "genre": "Hip Hop",
    "track bpm": 140,
    "lyrics summary": "The lyrics describe themes of transformation and empowerment, with references to becoming a 'superhero' through indulgence and success. It reflects typical bravado and self-assurance associated with hip-hop.",
    "lyrics sentiment": "Mixed because the lyrics convey empowerment but also reliance on substances for transformation.",
    "music energy": "High because the involvement of Metro Boomin and Future suggests intense, layered production with dynamic beats typical of high-energy hip-hop.",
    "music danceability": "High because the track has a rhythm and production style conducive to dancing, typical of Metro Boomin's production style.",
    "valence": "Medium because while there is empowerment, the tone is not purely positive due to the underlying tension expressed in the lyrics.",
    "mode": "Major because the track's theme of transformation and empowerment suggests a more resolved, triumphant sound."
  },
  "Oliver Tree_Miss You": {
    "genre": "Alternative/EDM",
    "track bpm": 145,
    "lyrics summary": "The lyrics of 'Miss You' revolve around themes of disillusionment and frustration in a relationship. The protagonist expresses a sarcastic tone about missing someone, indicating a lack of love or desire to reconnect.",
    "lyrics sentiment": "Mixed because the song combines elements of sarcasm and disillusionment with a breakup, portraying frustration rather than pure sadness or positivity.",
    "music energy": "High because the song has a fast tempo of 145 BPM, contributing to its intense and vibrant sound.",
    "music danceability": "Medium because while it has a steady beat suitable for dancing, the sarcastic and melancholic tone might not make it fully dance-oriented.",
    "valence": "Medium because the sarcastic and disillusioned tone adds emotional complexity, making it neither fully positive nor completely negative.",
    "mode": "Minor because the track is in F♯ minor, contributing to its melancholic and introspective mood."
  },
  "Labrinth_Still Don't Know My Name": {
    "genre": "Soul",
    "track bpm": 90,
    "lyrics summary": "The lyrics of 'Still Don't Know My Name' unfold a narrative of unrequited love, where the narrator grapples with intense feelings for someone who does not reciprocate those emotions.",
    "lyrics sentiment": "Negative because the lyrics express themes of unrequited love and a sense of isolation and vulnerability.",
    "music energy": "High because of its intense emotional delivery and dynamic sound despite the somber theme.",
    "music danceability": "Low because the track is not structured for dancing, with a somber feel and minimal rhythmic emphasis.",
    "valence": "Low because the song's themes and tone are melancholic and filled with longing.",
    "mode": "Major because the track has a major key signature, providing a contrast to its emotional weight."
  },
  "Labrinth_When I R.I.P.": {
    "genre": "Electronic",
    "track bpm": "about 120",
    "lyrics summary": "The track explores themes of mortality, substance abuse, and the complex nature of fame with a focus on finding peace in death despite ongoing struggles.",
    "lyrics sentiment": "Negative because the lyrics address themes of mortality and substance abuse, reflecting a darker aspect of the protagonist's experiences.",
    "music energy": "High because the melody is described as haunting and intense, fitting the thematic content of the lyrics.",
    "music danceability": "Medium because the track likely has a beat or rhythmic structure typical of electronic music that can support dancing.",
    "valence": "Low because the track has a chilling resonance and addresses heavy themes like mortality and seeking peace in death.",
    "mode": "Minor because the described haunting melody and complex themes suggest a darker tonal quality."
  },
  "Labrinth_Formula": {
    "genre": "Electronic",
    "track bpm": 145,
    "lyrics summary": "The song discusses the protagonist's love for excitement and feeling somewhat crazy at times, with imagery of flying in a blimp and references to famous scientific concepts.",
    "lyrics sentiment": "Mixed because the lyrics reflect excitement and thrill-seeking but also touch on feelings of craziness and introspection.",
    "music energy": "High because the track has a fast tempo of 145 BPM and an intense, upbeat rhythm.",
    "music danceability": "Medium because while the beat is fast and lively, the lyrical content and structure might not make it ideal for dancing.",
    "valence": "Medium because the song combines energetic beats with introspective and complex lyrical themes.",
    "mode": "Major because the key of B Major generally conveys a brighter and more resolved tonal quality."
  }
}