{
  "OneRepublic_I Lived - Arty Remix": {
    "genre": "EDM",
    "track bpm": "about 128",
    "lyrics summary": "The lyrics of 'I Lived' focus on embracing life's experiences, urging listeners to take risks and engage fully with their surroundings.",
    "lyrics sentiment": "Positive because the lyrics encourage embracing life's joys and challenges optimistically.",
    "music energy": "High because the remix features an intense EDM beat and lively production.",
    "music danceability": "High because the remix has a strong, consistent rhythm typical of EDM tracks, making it suitable for dancing.",
    "valence": "High because the uplifting message and energetic music convey a joyful mood.",
    "mode": "Major because the song emphasizes a bright and triumphant tone through its melody and harmony."
  },
  "Kanye West_Stronger": {
    "genre": "Hip-Hop",
    "track bpm": 104,
    "lyrics summary": "The lyrics of 'Stronger' revolve around themes of self-empowerment and resilience, emphasizing the notion that challenges and setbacks only make one stronger.",
    "lyrics sentiment": "Positive because the lyrics express a message of empowerment and overcoming adversity.",
    "music energy": "High because the track features a strong rhythmic drive and an intense electronic sample from Daft Punk.",
    "music danceability": "High because the beat is consistent and engaging, suitable for dancing.",
    "valence": "Medium because while the theme is empowering, the tone is assertive rather than purely joyful.",
    "mode": "Minor because despite the motivational lyrics, the musical sample retains a certain tension and seriousness."
  },
  "NONONO_Pumpin Blood - The Chainsmokers Remix": {
    "genre": "EDM",
    "track bpm": 128,
    "lyrics summary": "The lyrics express themes of resilience and empowerment, using metaphors of a journey on the road to convey moving forward in life despite obstacles.",
    "lyrics sentiment": "Positive because the lyrics emphasize empowerment, resilience, and a sense of moving forward with confidence and love.",
    "music energy": "High because the remix by The Chainsmokers likely features intense electronic instrumentation and a fast tempo.",
    "music danceability": "High because EDM remixes typically have strong, consistent beats suitable for dancing.",
    "valence": "High because the lyrics and musical arrangement suggest an uplifting and joyful feel.",
    "mode": "Major because the themes of empowerment and the energetic, resilient mood suggest a bright tonal quality."
  },
  "Öwnboss_Move Your Body": {
    "genre": "EDM",
    "track bpm": 125,
    "lyrics summary": "The lyrics of 'Move Your Body' emphasize seizing the current moment, with repeated phrases urging immediate action and presence, such as 'The time is now' and 'I'm here to stay.'",
    "lyrics sentiment": "Positive because the lyrics express a sense of urgency and liberation, focusing on enjoying the present moment.",
    "music energy": "High because the track is described as having high energy, with a fast tempo and intense beats.",
    "music danceability": "High because the song is designed as a dancefloor igniter with a strong and consistent beat.",
    "valence": "Medium because while the song is high energy and danceable, the presence of a somber undertone in its message adds complexity.",
    "mode": "Minor because the track is in the key of D minor, lending a darker tonal quality."
  },
  "RAYE_Escapism.": {
    "genre": "R&B",
    "track bpm": 96,
    "lyrics summary": "The lyrics of 'Escapism.' talk about escaping from reality and dealing with heartbreak, reflecting a sense of personal trauma and a quest for relief.",
    "lyrics sentiment": "Negative because the lyrics focus on themes of heartbreak and escaping from reality.",
    "music energy": "High because the track is described as having high energy with an uptempo beat.",
    "music danceability": "Medium because it is somewhat danceable with a steady beat, but it's not predominantly structured for dancing.",
    "valence": "Low because the overall tone conveys themes of heartbreak and escape, which are emotionally dark.",
    "mode": "Major because the analysis specifies it is in A Major, which typically conveys a brighter tone."
  }
}