{
  "David Guetta_Titanium (feat. Sia)": {
    "genre": "EDM",
    "track bpm": 126,
    "lyrics summary": "The lyrics of 'Titanium' discuss themes of resilience and strength, conveying a message of defiance against challenges and criticisms.",
    "lyrics sentiment": "Positive because the lyrics focus on empowerment and overcoming adversity.",
    "music energy": "High because the track features intense, driving beats characteristic of EDM.",
    "music danceability": "High because the song has a strong, consistent beat ideal for dancing.",
    "valence": "High because the empowering message and uplifting melodies contribute to a positive emotional tone.",
    "mode": "Major because the track has a triumphant and resolved tonal quality."
  },
  "Kelly Clarkson_Stronger (What Doesn't Kill You)": {
    "genre": "Pop Rock",
    "track bpm": 117,
    "lyrics summary": "The lyrics convey a journey from heartbreak to self-empowerment, emphasizing themes of resilience and personal growth. The central message is that adversities in relationships can make one stronger.",
    "lyrics sentiment": "Positive because the lyrics express themes of empowerment and overcoming difficulties.",
    "music energy": "High because the song features strong vocals and dynamic instrumentation.",
    "music danceability": "High because the song has a consistent and engaging beat suitable for dancing.",
    "valence": "High because the lyrics and music together create an uplifting and triumphant atmosphere.",
    "mode": "Major because the song has a bright and motivating tonal quality."
  },
  "Katy Perry_Roar": {
    "genre": "Pop Rock",
    "track bpm": 90,
    "lyrics summary": "The lyrics of 'Roar' by Katy Perry focus on self-empowerment and resilience, encouraging listeners to stand up for themselves and overcome personal struggles.",
    "lyrics sentiment": "Positive because the lyrics express themes of empowerment, resilience, and overcoming challenges.",
    "music energy": "Medium because the song has a steady, mid-tempo beat and a powerful yet controlled vocal delivery.",
    "music danceability": "Medium because it has a steady and engaging beat suitable for moderate dancing.",
    "valence": "High because the song conveys an uplifting and empowering message.",
    "mode": "Major because the song's melody supports a triumphant and positive theme."
  },
  "Britney Spears_Stronger": {
    "genre": "Pop",
    "track bpm": 108,
    "lyrics summary": "The lyrics tell a story of breaking free from a controlling relationship, finding strength within oneself, and embracing the journey of self-discovery and empowerment.",
    "lyrics sentiment": "Positive because the lyrics express themes of personal growth, independence, and resilience.",
    "music energy": "High because the track features sharp electronic beats and intense dynamics.",
    "music danceability": "High because the song has a consistent beat that makes it very danceable.",
    "valence": "High because the tone is uplifting and conveys empowerment.",
    "mode": "Major because the track's melody and key (B major) have a bright and resolved tonal quality."
  },
  "Destiny's Child_Survivor": {
    "genre": "R&B",
    "track bpm": 161,
    "lyrics summary": "The song addresses an opinion that Destiny's Child will not succeed without its original members. Beyoncé refutes this by asserting the group's continued success and empowerment, detailing personal and collective resilience after overcoming challenges and detractors.",
    "lyrics sentiment": "Positive because the lyrics emphasize strength, empowerment, and overcoming adversity.",
    "music energy": "High because the track features a fast tempo of 161 BPM and powerful dynamics.",
    "music danceability": "Medium because although it has a strong beat, the complexity and intensity make it more suitable for focused, rhythmic movement rather than casual dancing.",
    "valence": "Medium because it combines themes of overcoming challenges with a triumphant and empowering message, rather than simply joyful or sad tones.",
    "mode": "Minor because it is set in a C♯/D♭ minor key, which often supports the song's themes of struggle and resilience."
  }
}