{
  "Sabrina Carpenter_Espresso": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song is a playful and self-assured anthem highlighting themes of confidence, individuality, and romantic allure, using clever wordplay and layered metaphors.",
    "lyrics sentiment": "Positive because the lyrics express confidence and individuality with playful wordplay.",
    "music energy": "High because the song is described as having infectious energy and a lively melody.",
    "music danceability": "High because the track features a catchy rhythm and vibrant storytelling, making it highly danceable.",
    "valence": "High because the tone is playful and upbeat, reflecting confidence and allure.",
    "mode": "Major because the song tonally expresses confidence and a sense of triumph."
  },
  "Chappell Roan_HOT TO GO!": {
    "genre": "Pop",
    "track bpm": 140,
    "lyrics summary": "The song revolves around themes of self-expression, confidence, and owning one's sexual power, inspired by the concept of a 'cheerleader fantasy'. It reflects a bold and playful demand for attention and desire.",
    "lyrics sentiment": "Positive because the lyrics exude confidence and express desire in a playful and empowering manner.",
    "music energy": "High because the track is characterized by a fast tempo and intense synth-driven instrumentation.",
    "music danceability": "High because of its strong, energetic beat and vibrant dance-pop style, making it easy to dance to.",
    "valence": "High because the song is vibrant and exudes a playful, confident, and upbeat energy.",
    "mode": "Major because it is in the key of F♯ Major, which gives it a bright and uplifting tonal quality."
  },
  "Olivia Rodrigo_obsessed": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song expresses admiration for someone's beauty and character traits while admitting to knowing personal details about them, which is suggested by the title 'Obsessed.'",
    "lyrics sentiment": "Positive because the lyrics express admiration and appreciation of someone's beauty and persona.",
    "music energy": "Medium because the instrumentation is moderately intense and the tempo supports a lively feeling.",
    "music danceability": "High because the song is described as very danceable with a steady beat.",
    "valence": "High because the mood of the song is described as happy and uplifting.",
    "mode": "Major because the song is in a G♯/A♭ major key, which gives it a bright and resolved sound."
  },
  "Hozier_Too Sweet": {
    "genre": "Folk Rock",
    "track bpm": "about 100",
    "lyrics summary": "The song 'Too Sweet' explores themes of love and lifestyle contrasts within a relationship. Hozier sings to his partner about her healthy, balanced lifestyle choices, while he enjoys indulging in the pleasures of life more freely. The lyrics present a playful rejection of disciplined living, highlighting differences in their approaches to life.",
    "lyrics sentiment": "Mixed because the lyrics express playful rejection and differences in lifestyle, blending lighthearted critique with affection.",
    "music energy": "Low because the melodies are soft and create a soothing, relaxing vibe.",
    "music danceability": "Medium because the track has a mellow beat that is steady enough for light movement, though not dominant.",
    "valence": "Medium because the track blends soothing melodies with a playful but slightly critical lyrical theme.",
    "mode": "Minor because the melodies are described as soothing and introspective, suggesting an introspective tone."
  },
  "Ariana Grande_we can't be friends (wait for your love)": {
    "genre": "Synth-pop",
    "track bpm": "about 120",
    "lyrics summary": "The song revolves around the theme of unreciprocated love and longing. The singer wishes to maintain a friendship while hoping for the other person to eventually return their feelings of love.",
    "lyrics sentiment": "Mixed because the lyrics express a sense of hopeful longing but also the sadness of unreciprocated love.",
    "music energy": "Medium because it combines danceable beats with an electropop style, providing a steady and engaging rhythm.",
    "music danceability": "High because the beat is described as dance-able and supports a strong, consistent rhythm typical of pop and electropop.",
    "valence": "Medium because the music is upbeat with a danceable rhythm, yet the lyrical content conveys longing and unreciprocated love.",
    "mode": "Minor because the themes of longing and emotional complexity suggest a more introspective and unresolved tonal quality."
  }
}