{
  "Kacey Musgraves_Butterflies": {
    "genre": "Country Pop",
    "track bpm": "about 110",
    "lyrics summary": "The lyrics of 'Butterflies' by Kacey Musgraves convey a sense of new, fresh love and the feelings of joy and excitement that accompany it.",
    "lyrics sentiment": "Positive because the lyrics express joy, romantic excitement, and the uplifting feelings associated with falling in love.",
    "music energy": "Medium because the song has a lively, upbeat feel without being aggressive or overly fast.",
    "music danceability": "Medium because the rhythm has a steady beat suitable for light dancing typical in Country Pop.",
    "valence": "High because the song's emotional tone is joyful and uplifting, capturing the happiness of new love.",
    "mode": "Major because the melody and harmonies convey a bright and happy emotional quality."
  },
  "Zach Bryan_I Remember Everything (feat. Kacey Musgraves)": {
    "genre": "Singer-Songwriter",
    "track bpm": 77,
    "lyrics summary": "Reflects on nostalgia and longing for emotional security, as well as comfort found in familiar places and relationships.",
    "lyrics sentiment": "Mixed because the lyrics express longing and nostalgia, capturing both warmth and a sense of yearning.",
    "music energy": "Medium because the song captures a reflective mood with steady dynamics.",
    "music danceability": "Medium because the song has a steady tempo suitable for light swaying or slow dancing.",
    "valence": "Medium because the tone blends melancholic nostalgia with warmth and familiarity.",
    "mode": "Major because the key is F♯/G♭ major, contributing to a brighter tonal quality despite the reflective theme."
  },
  "Kacey Musgraves_Deeper Well": {
    "genre": "Pop",
    "track bpm": "about 80",
    "lyrics summary": "The song reflects on a recurring romantic relationship with contrasting emotions of affection and frustration. It shows a desire to reconnect despite previous challenges.",
    "lyrics sentiment": "Mixed because the lyrics express both love and frustration within the relationship.",
    "music energy": "Medium because the song maintains a steady rhythm typical of pop ballads, without intense dynamics.",
    "music danceability": "Medium because the song has a noticeable beat suitable for casual dancing or swaying.",
    "valence": "Medium because the song has both positive and negative emotional tones.",
    "mode": "Major because the melody and harmony convey a hopeful and resolved feeling."
  },
  "Kacey Musgraves_Moving Out": {
    "genre": "Country Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song 'Moving Out' by Kacey Musgraves expresses feelings of change and new beginnings, focusing on the emotional journey involved in leaving a familiar place behind.",
    "lyrics sentiment": "Mixed because while the theme involves new beginnings and changes, it may carry underlying tones of nostalgia and uncertainty.",
    "music energy": "Medium because the track likely combines pop and country elements for a steady but not overly intense dynamic.",
    "music danceability": "Medium because country pop often includes a steady beat suitable for light or casual dancing.",
    "valence": "Medium because the theme suggests a balance of positive and possibly melancholic emotions due to its reflective nature.",
    "mode": "Major because it likely incorporates a bright, uplifting tonal quality typical of Kacey Musgraves' music."
  },
  "Kacey Musgraves_Too Good to be True": {
    "genre": "Pop",
    "track bpm": "about 88",
    "lyrics summary": "The lyrics of 'Too Good to be True' reflect an introspective exploration of love and relationships, showcasing an internal struggle with romance, reality, and self-perception. It highlights the complexity of emotions experienced when faced with superficial charm and the difficulty in believing in something that seems perfect, yet unreal.",
    "lyrics sentiment": "Mixed because the lyrics present both a sense of vulnerability regarding love and cynicism about what appears too good to be real.",
    "music energy": "Medium because the song conveys a balanced dynamic range with intimate yet confident elements, as suggested by the atmospheric intro and transition into more powerful sections.",
    "music danceability": "Medium because the song likely contains a groove suitable for casual or light dancing, indicated by the rhythm described as steady yet not overpowering.",
    "valence": "Medium because the song combines potential emotional warmth with hints of skepticism and doubt, reflecting a complex emotional narrative.",
    "mode": "Minor because the song likely features introspective and moody tones, fitting the theme of emotional conflict and introspection."
  }
}