{
  "Charli xcx_Guess featuring billie eilish": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics explore playful themes of flirtation and intimacy, touching on fan culture and obsession.",
    "lyrics sentiment": "Mixed because the lyrics combine playful flirtation with themes of obsession, creating both lighthearted and intense emotional tones.",
    "music energy": "Medium because the remix likely features a balanced intensity typical of contemporary pop with active yet not overwhelming dynamics.",
    "music danceability": "Medium because the track probably has a steady, engaging beat suitable for casual dancing but not overwhelming.",
    "valence": "Medium because while the lyrics have a playful side, the mention of obsession introduces a more complex emotional tone.",
    "mode": "Minor because the involvement of Billie Eilish often leans towards introspective and moody musical structures."
  },
  "The Weeknd_Timeless (feat Playboi Carti)": {
    "genre": "Trap Pop",
    "track bpm": 140,
    "lyrics summary": "The song explores themes of success, legacy, and self-confidence, declaring the artists' enduring influence and relevance in the music industry. It features boastful lyrics about material wealth and self-assuredness.",
    "lyrics sentiment": "Positive because the lyrics express confidence, celebration of success, and an untouchable status.",
    "music energy": "High because the track features vibrant energy typical of hip-hop and trap genres, with intense production.",
    "music danceability": "High because the strong beat and engaging rhythm encourage movement and dancing.",
    "valence": "High because the tone is triumphant and the lyrics celebrate success and confidence.",
    "mode": "Major because the track invokes a bright and triumphant feeling, consistent with themes of success and confidence."
  },
  "Playboi Carti_EVIL J0RDAN": {
    "genre": "Hip Hop",
    "track bpm": 154,
    "lyrics summary": "The lyrics discuss themes of chaos and unpredictability in life, with references to striving for popularity and the unpredictable nature of personal experiences.",
    "lyrics sentiment": "Mixed because the lyrics reflect feelings of chaos and uncertainty but also empowerment and defiance.",
    "music energy": "Low because the snippet describes it as having low energy despite a higher tempo, suggesting a subdued intensity.",
    "music danceability": "High because it is described as very danceable and has a consistent 4/4 time signature.",
    "valence": "Medium because while the lyrics express themes of chaos and uncertainty, the major mode suggests a balance that avoids a purely negative tone.",
    "mode": "Major because it is explicitly mentioned in the key signature description, adding a bright tonal quality to the track."
  },
  "Billie Eilish_CHIHIRO": {
    "genre": "Pop",
    "track bpm": 110,
    "lyrics summary": "The lyrics explore themes of identity and transformation, possibly inspired by the character of Chihiro from the film Spirited Away, drawing parallels between fictional and personal growth journeys.",
    "lyrics sentiment": "Mixed because the themes of identity and transformation can encompass both challenges and hopeful developments.",
    "music energy": "Medium because the track is described as having average energy.",
    "music danceability": "High because it is described as very danceable with a steady beat.",
    "valence": "Medium because while the song's mode is major, the themes of identity search suggest complex emotional tones.",
    "mode": "Major because the track is specifically noted to be in G Major, lending a brighter tonal quality."
  },
  "bbno$_check": {
    "genre": "Hip Hop",
    "track bpm": 134,
    "lyrics summary": "The song explores themes of wealth, success, and self-confidence with a playful and self-celebratory tone. The lyrics discuss bbno$'s luxurious life, his financial status, and relationships, infusing humor and irony.",
    "lyrics sentiment": "Positive because the lyrics express confidence, humor, and an upbeat celebration of wealth and success.",
    "music energy": "High because the tempo is fast and the track is described as exuberant with high energy.",
    "music danceability": "High because it is described as very danceable with a consistent 4 beats per bar rhythm.",
    "valence": "High because the tone is vibrant, joyful, and the lyrics are humorous and upbeat.",
    "mode": "Major because the track is in C major, contributing to its bright and triumphant sound."
  }
}