{
  "Ely Oaks_Mission": {
    "genre": "EDM",
    "track bpm": 140,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey sentiment.",
    "music energy": "High because the track has a fast tempo and intense electronic production typical of EDM.",
    "music danceability": "Medium because, despite its high energy, the structure is somewhat complex but still allows for dancing.",
    "valence": "Low because the track is described as somber, which suggests a darker emotional tone.",
    "mode": "Minor because the melody and general mood of the track are described as somber and in a minor key, contributing to a darker, introspective quality."
  },
  "Consilium_The Way I Are - Techno Remix": {
    "genre": "Techno",
    "track bpm": 150,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track does not contain lyrics to express any sentiment.",
    "music energy": "High because the tempo is fast and the techno style typically features intense instrumentation.",
    "music danceability": "High because techno music generally has a strong beat that encourages dancing, especially at a high BPM.",
    "valence": "Medium because while techno can sound intense, it often balances energy in a way that is neither overly dark nor particularly joyful.",
    "mode": "Minor because the key is F# minor, which often conveys a darker or more serious tone."
  },
  "Marnik_Boyz In Paris (with VINAI)": {
    "genre": "EDM",
    "track bpm": 128,
    "lyrics summary": "The lyrics convey themes of confidence, defiance, and success, set against a backdrop of luxury and fame.",
    "lyrics sentiment": "Positive because the lyrics express self-confidence, success, and defiance in the face of challenges.",
    "music energy": "High because the track is described as a hard rave edit, which suggests intense and fast-paced instrumentation.",
    "music danceability": "High because the track is an EDM collaboration with a strong beat suitable for dancing.",
    "valence": "High because the expressions of success, confidence, and luxury convey an emotionally positive tone.",
    "mode": "Major because the themes of confidence and success typically align with a bright and resolved tonal quality."
  },
  "R3SPAWN_E": {
    "genre": "Techno",
    "track bpm": 135,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "High because the track is described as a Techno song, which typically features intense and fast-paced instrumentation.",
    "music danceability": "High because Techno music usually has a strong and consistent beat designed for dancing.",
    "valence": "Medium because Techno music can have both dark and uplifting elements, leading to a complex emotional mix.",
    "mode": "Minor because Techno often features darker, more introspective tonalities."
  },
  "Lost Frequencies_Freestyler (Rock The Microphone)": {
    "genre": "Dance / Electro Pop",
    "track bpm": 160,
    "lyrics summary": "A rework of Bomfunk MC's 'Freestyler', which is known for themes of confidence and mastery in freestyle rapping and DJ performance.",
    "lyrics sentiment": "Positive because the lyrics express confidence and mastery in freestyle rapping and DJ performance.",
    "music energy": "High because the track is described as upbeat with a fast tempo of 160 BPM.",
    "music danceability": "High because the track is very danceable with a strong beat and rhythm.",
    "valence": "High because the song is described as upbeat and energetic, suggesting a positive emotional tone.",
    "mode": "Minor because it is specifically noted to be in a minor key, which often gives a slightly more introspective or dark feel despite the upbeat nature."
  }
}