{
  "Lovelyz_Bookmark": {
    "genre": "K-Pop",
    "track bpm": "approximately 124",
    "lyrics summary": "The lyrics of 'Bookmark' by Lovelyz express a desire for an unfinished love story not to end. It conveys longing to fill the emotional gaps with the presence of the other person and a hope to cherish the memories deeply embedded in the heart.",
    "lyrics sentiment": "Negative because the lyrics express longing, unfulfilled desires, and sadness over an unfinished relationship.",
    "music energy": "Medium because it maintains a steady rhythm typical in K-pop ballads.",
    "music danceability": "Medium because while it has a consistent tempo, the lyrical focus suggests a slower pace suitable for light movements.",
    "valence": "Medium because the emotional tone balances between longing and hope.",
    "mode": "Minor because the lyrics and mood suggest a melancholic and introspective feel."
  },
  "BOL4_Hug": {
    "genre": "K-Pop",
    "track bpm": 90,
    "lyrics summary": "The song 'Hug' by BOL4 expresses affection and longing. It describes the feeling of excitement and joy brought on by seeing someone special, wishing to be in their warm embrace, and pouring out feelings of love through letters.",
    "lyrics sentiment": "Positive because the lyrics express joy and longing for a loved one's embrace and presence.",
    "music energy": "Medium because the song has a gentle yet emotionally engaging dynamic.",
    "music danceability": "Medium because the rhythm is steady, enabling some movement but not dominating the track.",
    "valence": "High because the lyrics and melody convey a bright and joyful emotion.",
    "mode": "Major because the tone and chord progressions convey a happy and resolved feel."
  },
  "Crush_NAPPA 나빠": {
    "genre": "R&B",
    "track bpm": 100,
    "lyrics summary": "The lyrics describe a situation where the singer feels misunderstood by their partner, who is pretending that everything is fine but doubts and distances themselves.",
    "lyrics sentiment": "Mixed because the lyrics portray a sense of misunderstanding and tension but also an underlying emotional connection.",
    "music energy": "Medium because the song has a smooth R&B vibe with a moderate tempo and balanced dynamics.",
    "music danceability": "Medium because the track has a steady and groovy rhythm typical of R&B, making it suitable for casual dancing.",
    "valence": "Medium because the emotional tone is complex, reflecting sadness and misunderstanding but also a connection.",
    "mode": "Minor because the chord progression (Cm, Eb, Ab, Bb) gives a moody and introspective feel."
  },
  "Zion.T_Just (From Young)": {
    "genre": "R&B",
    "track bpm": 70,
    "lyrics summary": "The lyrics of the song 'Just' by Zion.T ft Crush depict the turmoil of emotions from unrequited love. The singer struggles with feelings of indifference, pain, and loneliness in a one-sided relationship.",
    "lyrics sentiment": "Negative because the lyrics express feelings of pain, indifference, and loneliness due to unrequited love.",
    "music energy": "Low because the song conveys soft, mellow emotions and features minimal instrumentation typical of many R&B ballads.",
    "music danceability": "Low because the rhythm is subtle and the track focuses more on emotional expressions rather than a danceable beat.",
    "valence": "Low because the song conveys themes of loneliness and emotional struggle, indicating a melancholic tone.",
    "mode": "Minor because the music likely supports the somber and introspective lyrical content."
  },
  "N.Flying_Spring Memories": {
    "genre": "K-Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics reflect on memories of a past relationship that took place in the spring, discussing feelings of nostalgia and the magic of the season, while acknowledging that it won't be like the first time.",
    "lyrics sentiment": "Mixed because the lyrics express both fondness for past memories and a sentimental yearning for a relationship that is no longer as it was.",
    "music energy": "Medium because the song is reflective with a steady rhythm typical of pop ballads.",
    "music danceability": "Medium because while the beat is present, it is not overpowering, allowing for light dancing.",
    "valence": "Medium because there is a balance between nostalgic warmth and the emotional complexity of yearning for the past.",
    "mode": "Minor because the theme of longing and sentimental reflection suggests a moody, unresolved quality."
  }
}