{
  "Megan Thee Stallion_Thot Shit": {
    "genre": "Hip-Hop",
    "track bpm": 130,
    "lyrics summary": "Megan Thee Stallion's 'Thot Shit' is a defiant anthem that celebrates female empowerment, self-confidence, and audacious sexuality. The lyrics present a dual theme focused on asserting her female strength and twerking, intertwined with maintaining a dominant, successful persona in a male-dominated industry.",
    "lyrics sentiment": "Positive because the lyrics assert female empowerment and self-confidence, embracing sexuality and success confidently.",
    "music energy": "High because the tempo is fast, and the lyrics are delivered with intensity and assertiveness.",
    "music danceability": "High because the track has a strong, consistent beat ideal for dancing, particularly twerking as highlighted by the artist.",
    "valence": "High because the tone is assertive, celebratory, and empowering.",
    "mode": "Major because the track conveys a bright, triumphant, and confident sound."
  },
  "The Pussycat Dolls_When I Grow Up": {
    "genre": "Pop",
    "track bpm": 118,
    "lyrics summary": "The song revolves around the theme of fame and the desire for recognition and success, expressing aspirations and dreams of achieving stardom and its associated perks.",
    "lyrics sentiment": "Positive because the lyrics express ambition and the desire for success and fame.",
    "music energy": "High because the track features a fast tempo and intense pop elements typical of dance tracks.",
    "music danceability": "High because the beat is strong and rhythmically consistent, designed for dancing.",
    "valence": "Medium because while the theme of ambition is positive, the tone reflects the complex yearning for fame.",
    "mode": "Minor because the key and chord progression sound moody and introspective despite the high energy."
  },
  "Rihanna_S&M": {
    "genre": "Eurodance",
    "track bpm": 128,
    "lyrics summary": "The lyrics of 'S&M' explore themes of love, desire, and the complexity of pleasure and pain, with a focus on sexual empowerment and agency. Rihanna uses double entendre and direct language to describe a blurred line between pain and pleasure.",
    "lyrics sentiment": "Mixed because the lyrics convey themes of empowerment and controversial topics like pain and pleasure which can be interpreted in both positive and provocative ways.",
    "music energy": "High because the song features a fast tempo, driving beat, and intense instrumentation typical of dance tracks.",
    "music danceability": "High because the track has a strong and steady beat that is perfect for dancing, aligning with its Eurodance genre.",
    "valence": "Medium because, while the song is upbeat and makes you want to dance, its themes are a mix of empowerment and controversy, resulting in complex emotions.",
    "mode": "Minor because the song is composed in E-flat minor, contributing to its edgy and slightly dark feel despite its danceable rhythm."
  },
  "Rihanna_SOS": {
    "genre": "Pop",
    "track bpm": 89,
    "lyrics summary": "Rihanna's 'SOS' is about intense love and infatuation, using the metaphor of an emergency distress signal to describe overwhelming emotions triggered by a lover.",
    "lyrics sentiment": "Positive because the lyrics express intense love and passion, even though there's an element of emotional urgency.",
    "music energy": "Low because the overall track is described as having low energy despite its catchy nature.",
    "music danceability": "High because the track is very danceable, supported by the strong and consistent beat.",
    "valence": "Medium because the song's emotional message is complex, highlighting both the uplifting and burdensome aspects of infatuation.",
    "mode": "Minor because the track is in a minor key, which contributes to its introspective and slightly melancholic tone."
  },
  "Rihanna_Shut Up And Drive": {
    "genre": "Pop",
    "track bpm": 133,
    "lyrics summary": "The song uses car-related metaphors to express themes of confidence, control, and empowerment. It equates the singer to a high-speed machine, emphasizing self-assuredness and authority.",
    "lyrics sentiment": "Positive because the lyrics express themes of empowerment, confidence, and self-assuredness through metaphors of driving and speed.",
    "music energy": "High because the track features driving beats, powerful vocals, and an upbeat tempo.",
    "music danceability": "High because the song has a strong, consistent beat and a tempo conducive to dancing.",
    "valence": "High because the song's upbeat and confident tone promotes positive emotions.",
    "mode": "Major because the song is in D♭ major, which conveys a bright and triumphant feel."
  }
}