{
  "LOSTBOYJAY_COULD BE WRONG": {
    "genre": "Dance",
    "track bpm": 129,
    "lyrics summary": "The song 'COULD BE WRONG' by LOSTBOYJAY expresses a theme of uncertainty and doubt, with a repeated phrase suggesting a strong intuition about a situation that might be happening.",
    "lyrics sentiment": "Mixed because the lyrics convey both uncertainty and conviction about the singer's intuition.",
    "music energy": "High because the tempo is fast and the song is described as exuberant.",
    "music danceability": "High because the song has a strong and danceable beat.",
    "valence": "Medium because the song combines a danceable and energetic sound with lyrics of uncertainty.",
    "mode": "Major because the song is described in a major key."
  },
  "Felix Ross_Lost": {
    "genre": "Indie Pop",
    "track bpm": 80,
    "lyrics summary": "The song 'Lost' by Felix Ross explores themes of identity, struggle, and the harsh realities of life, with poignant and introspective lyrics.",
    "lyrics sentiment": "Mixed because the lyrics combine introspection about life's struggles with a sense of identity and uncertainty, reflecting both negative elements and a search for meaning.",
    "music energy": "Medium because the song is introspective yet steady, without aggressive dynamics or tempo changes.",
    "music danceability": "Medium because the track has a steady beat that supports casual or light dancing, but is not primarily dance-focused.",
    "valence": "Medium because the song balances introspection and struggle with a search for identity, avoiding overly dark or overly bright tones.",
    "mode": "Minor because the song's introspective and somewhat moody themes suggest a more unresolved tonal quality."
  },
  "Gracie Abrams_That’s So True": {
    "genre": "Pop",
    "track bpm": 95,
    "lyrics summary": "The song 'That’s So True' revolves around themes of self-awareness, relationships, and emotional complexity, with insights into feelings of jealousy and moving on from past experiences.",
    "lyrics sentiment": "Mixed because the lyrics feature themes of overcoming difficulties and self-discovery, but also hint at underlying feelings of jealousy and loss.",
    "music energy": "Medium because the track balances emotional depth with a steady and engaging rhythm.",
    "music danceability": "Medium because the beat is described as catchy and supports light dancing or movement.",
    "valence": "Medium because while the track has emotional honesty, there is a subtle blend of optimism and melancholy.",
    "mode": "Minor because the lyrics reflect introspective and complex emotions, typical of a minor tonal quality."
  },
  "Florence + The Machine_Dog Days Are Over": {
    "genre": "Indie Rock",
    "track bpm": 150,
    "lyrics summary": "The song describes a transformative journey from hardship to joy, encapsulated in the line 'Happiness hit her like a train on a track,' suggesting an unexpected and powerful shift towards happiness and freedom.",
    "lyrics sentiment": "Positive because the lyrics express a sense of triumph, liberation, and the overcoming of past difficulties.",
    "music energy": "High because the song features intense vocal delivery and dynamic instrumentation with a driving rhythm.",
    "music danceability": "Medium because although there is a strong rhythm, the complexity of the arrangement and the emotional depth make it more suited for spirited appreciation rather than purely dancing.",
    "valence": "High because the song conveys uplifting and euphoric themes of joy and overcoming obstacles.",
    "mode": "Major because the song has a bright and triumphant tonal quality."
  },
  "Mac Miller_Love Lost": {
    "genre": "Hip Hop",
    "track bpm": 85,
    "lyrics summary": "A song about a relationship that ended due to misunderstandings and the pursuit of success, reflecting on love, loss, and personal growth.",
    "lyrics sentiment": "Mixed because the lyrics express both the pain of a lost relationship and the resilience to move forward.",
    "music energy": "Medium because the track has a balance of reflective lyrics and steady beat.",
    "music danceability": "Medium because the rhythm is steady but not overpowering, suitable for casual listening.",
    "valence": "Medium because the emotion is complex, involving both sadness and hope.",
    "mode": "Minor because the overall tone is introspective and reflects on the emotional challenges of love and loss."
  }
}