{
  "Mobb Deep_Shook Ones, Pt. II": {
    "genre": "Hip-Hop",
    "track bpm": 95,
    "lyrics summary": "The lyrics of 'Shook Ones, Pt. II' delve into themes of street life and violence in Queensbridge, New York, conveying the gritty and raw realities faced by those growing up in such environments. It addresses the challenges and the mindset necessary to survive in a harsh urban landscape.",
    "lyrics sentiment": "Negative because the lyrics explore themes of violence, danger, and the harsh realities of street life.",
    "music energy": "Medium because the track has a steady and intense beat, but maintains a laid-back flow typical of 90s hip-hop.",
    "music danceability": "Medium because the rhythm is steady and the beat is engaging, making it suitable for head-nodding and light movement.",
    "valence": "Low because the themes and tone are dark, focusing on struggle and survival.",
    "mode": "Minor because the music features a dark, moody tone that complements the serious and somber lyrical themes."
  },
  "Nas_N.Y. State of Mind": {
    "genre": "Hip Hop",
    "track bpm": 84,
    "lyrics summary": "The lyrics are a raw and vivid narrative of urban life in New York City, revealing the harsh realities and resilience of its residents.",
    "lyrics sentiment": "Mixed because the lyrics are vivid and gritty, portraying the struggles and strength of urban life with both negative and resilient tones.",
    "music energy": "High because the track has intense and compelling lyrical flow and beats that drive the narrative strongly.",
    "music danceability": "Medium because the beat is steady but more focused on lyrics than pure rhythmic groove.",
    "valence": "Medium because the track captures a mix of gritty realism and empowerment, portraying challenges but also resilience.",
    "mode": "Minor because the song is in F# minor, contributing to its dark and introspective tone."
  },
  "Nas_The World Is Yours": {
    "genre": "Hip Hop",
    "track bpm": 87,
    "lyrics summary": "The lyrics explore themes of personal empowerment and societal challenges, with references to noir narratives and self-reflection.",
    "lyrics sentiment": "Mixed because while the lyrics encourage empowerment ('The world is yours'), they also examine challenging societal issues.",
    "music energy": "High because the track has a driving beat and intense lyrical delivery typical of Hip Hop.",
    "music danceability": "High because the rhythm and beat are consistent and engaging.",
    "valence": "Medium because the track balances motivational themes with introspective and challenging topics.",
    "mode": "Minor because the song is in the A♯/B♭ minor key, contributing to a reflective and introspective tone."
  },
  "The Notorious B.I.G._Juicy - 2005 Remaster": {
    "genre": "Hip-Hop",
    "track bpm": 96,
    "lyrics summary": "The lyrics of 'Juicy' describe The Notorious B.I.G.'s rise from a difficult childhood to becoming a successful and influential rapper, reflecting on his past struggles and his current success.",
    "lyrics sentiment": "Mixed because the lyrics reflect both the challenges and hardships faced in the past and the triumphs achieved in the present.",
    "music energy": "Medium because the track has a steady and laid-back beat typical of 90s Hip-Hop.",
    "music danceability": "Medium because the beat is steady and has a strong groove, but it is not primarily a dance track.",
    "valence": "High because the overall tone of the track is triumphant and celebratory, reflecting on accomplishments.",
    "mode": "Minor because the track is in Db Minor, contributing to a slightly moody backdrop which contrasts the celebratory lyrics."
  },
  "Wu-Tang Clan_C.R.E.A.M. (Cash Rules Everything Around Me)": {
    "genre": "Hip-Hop",
    "track bpm": 96,
    "lyrics summary": "The song discusses the harsh realities of street life and the influence of money, as expressed through the acronym 'C.R.E.A.M.' meaning 'Cash Rules Everything Around Me'.",
    "lyrics sentiment": "Negative because it conveys a message about the struggles of street life and the pervasive, sometimes destructive influence of money.",
    "music energy": "Medium because it has a steady rhythm and dynamic, though not overly aggressive instrumentation.",
    "music danceability": "Medium because the steady beat and rhythmic flow suit casual head-nodding or light dancing.",
    "valence": "Low because the thematic focus is on socioeconomic struggles and the darker aspects of urban life.",
    "mode": "Minor because the melody and piano riff suggest a somber and introspective mood."
  }
}