{
  "Petit Biscuit_Sunset Lover": {
    "genre": "Chillhop",
    "track bpm": 80,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to express a specific sentiment.",
    "music energy": "Medium because the track features ambient sounds combined with a moderate beat characteristic of chill electronic music.",
    "music danceability": "Medium because the track has a relaxing groove that can engage listeners in casual movement.",
    "valence": "Medium because the music conveys a calm yet uplifting mood characteristic of chillhop.",
    "mode": "Major because the track sounds bright and soothing, giving an uplifting auditory experience."
  },
  "Rex Orange County_Best Friend": {
    "genre": "Indie Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics offer an uplifting narrative focused on friendship and camaraderie.",
    "lyrics sentiment": "Positive because the lyrics express gratitude and appreciation for a close friend who provides support and happiness.",
    "music energy": "Medium because the track features a balanced dynamic range with a steady, upbeat rhythm.",
    "music danceability": "Medium because while it has a pleasant beat suitable for movement, it isn't primarily designed as a dance track.",
    "valence": "High because the tone is joyful and celebrates positive relationships.",
    "mode": "Major because the melody and harmony convey a sense of happiness and positivity."
  },
  "Briston Maroney_Freakin' Out On the Interstate": {
    "genre": "Indie Rock",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics are about dealing with emotional turmoil and introspection while on the road.",
    "lyrics sentiment": "Mixed because the lyrics explore themes of anxiety and self-reflection but with a sense of acceptance and moving forward.",
    "music energy": "Medium because the song features steady guitar riffs and a build-up that maintains a moderate intensity.",
    "music danceability": "Medium because the song has a steady rhythm suitable for casual listening rather than intense dancing.",
    "valence": "Medium because the song conveys a balance between introspective melancholy and subdued optimism.",
    "mode": "Minor because the melody and lyrical themes suggest introspection and emotional depth."
  },
  "High Highs_Open Season": {
    "genre": "Indie Pop",
    "track bpm": "about 90",
    "lyrics summary": "The lyrics of 'Open Season' by High Highs revolve around introspection and self-reflection, suggesting that the challenges and experiences we face are subjective and primarily exist 'in your mind.'",
    "lyrics sentiment": "Mixed because the lyrics express an introspective and contemplative mood, acknowledging burdens but also suggesting a subjective interpretation of reality.",
    "music energy": "Medium because the track features a lush, melodic sound with a steady rhythm without being overly intense.",
    "music danceability": "Medium because the song has a gentle, rhythmic flow suitable for casual listening.",
    "valence": "Medium because the tone is introspective yet musically vibrant, balancing between melancholic introspection and melodic beauty.",
    "mode": "Minor because the introspective and contemplative nature of the track's theme is characteristic of minor keys."
  },
  "flipturn_August": {
    "genre": "Indie Rock",
    "track bpm": "unknown",
    "lyrics summary": "The track explores emotions and experiences typically centered around introspection and personal growth, though specific lyrics are not provided.",
    "lyrics sentiment": "Mixed because the lyrics likely touch on themes of self-reflection and personal struggle, offering both hopeful and challenging perspectives.",
    "music energy": "Medium because indie rock often features a balanced dynamic range and steady rhythm without extreme intensity.",
    "music danceability": "Medium because indie rock generally has a steady beat that allows for some movement, but it's not predominantly dance-oriented.",
    "valence": "Medium because indie rock tends to navigate complex emotions with a subtle mix of uplifting and introspective vibes.",
    "mode": "Minor because indie rock often embraces moody and introspective tones, which align with the themes of personal reflection."
  }
}