{
  "BL3SS_Kisses (feat. bbyclose)": {
    "genre": "Trance",
    "track bpm": 142,
    "lyrics summary": "The lyrics revolve around themes of romantic desire and longing, with expressions of wanting affirmation of love. It suggests a yearning for emotional connection and physical intimacy.",
    "lyrics sentiment": "Positive because the lyrics express romantic longing and desire for mutual affection.",
    "music energy": "High because the tempo is fast and described as high energy.",
    "music danceability": "High because the track has a regular beat suitable for dance.",
    "valence": "High because it is an upbeat song that suggests a positive emotional atmosphere.",
    "mode": "Minor because the track is in a minor key, which often lends a slightly darker or introspective tonal quality despite the upbeat energy."
  },
  "Ella Henderson_Alibi (feat. Rudimental)": {
    "genre": "Dance / Pop",
    "track bpm": 87,
    "lyrics summary": "The song 'Alibi' by Ella Henderson features themes of confrontation and revelation, suggesting the singer knows where someone was last night, leading to a dramatic consequence.",
    "lyrics sentiment": "Mixed because the lyrics involve themes of both confrontation and intensity, creating a blend of emotional tones.",
    "music energy": "High because the track includes elements typical of the drum and bass genre, marked by strong percussion and a driving rhythm.",
    "music danceability": "Medium because while it contains a rhythmic beat suitable for dancing, it is not overly dance-centric.",
    "valence": "Low because the lyrics contain themes of confrontation and the minor mode contributes to a darker tone.",
    "mode": "Minor because the track is in C minor, adding a moody and slightly tense quality to the music."
  },
  "Dani Vidi_I like the way you kiss me": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song explores themes of physical intimacy and emotional detachment, focusing on the act of kissing to convey feelings of desire and longing, while simultaneously avoiding deep emotional attachment.",
    "lyrics sentiment": "Mixed because the lyrics express both desire and intimacy as well as emotional detachment and reluctance to form a romantic connection.",
    "music energy": "Medium because the song likely maintains a steady rhythm and dynamic typical of pop music focused on personal relationships.",
    "music danceability": "Medium because the song features a catchy and consistent beat suitable for moderate dancing typical of pop ballads about relationships.",
    "valence": "Medium because the lyrics suggest a mix of positive attraction and negative emotional distance, making the emotional tone complex.",
    "mode": "Minor because the lyrical content discusses emotional detachment alongside physical connection, suggesting a somewhat unresolved tonal quality."
  },
  "Alok_LET'S GET FKD UP": {
    "genre": "EDM",
    "track bpm": 160,
    "lyrics summary": "An invitation to let go of inhibitions, enjoy the moment, and indulge in a wild, carefree night.",
    "lyrics sentiment": "Positive because the lyrics celebrate freedom and enjoyment, encouraging a fun and carefree experience.",
    "music energy": "High because the tempo is fast and the track is described as a vibrant party anthem.",
    "music danceability": "High because it is very danceable with a strong beat typical for a party anthem.",
    "valence": "High because the song's intent is to create a euphoric and uplifting atmosphere.",
    "mode": "Major because it uses the A♯/B♭ major key, which typically sounds bright and positive."
  },
  "Matt Sassari_It Feels So Good": {
    "genre": "Tech House",
    "track bpm": 128,
    "lyrics summary": "The lyrics convey a heartfelt appreciation for the small yet significant touches that a partner provides, illustrating how those moments contribute to a deeper emotional bond. Ultimately, 'It Feels So Good' celebrates the joy and life-affirming nature of love, reminding us of its ability to make us feel complete and truly alive.",
    "lyrics sentiment": "Positive because the lyrics express joy and appreciation for the partner's small gestures and the happiness they bring.",
    "music energy": "High because the tempo is fast and the beat is strong, characteristic of tech house.",
    "music danceability": "High because the beat is consistent and energetic, making it suitable for dancefloors.",
    "valence": "High because the mood is described as very happy and cheerful, aligning with positive lyrical content.",
    "mode": "Major because the song conveys a bright and joyful atmosphere typical of major tonalities."
  }
}