{
  "Glass Animals_Heat Waves": {
    "genre": "Psychedelic Pop",
    "track bpm": 122,
    "lyrics summary": "The song 'Heat Waves' deals with themes of loss and longing, featuring reflective lyrics about missing someone and getting lost in nostalgic memories. The repeated hook expresses the pervasive memory of a loved one.",
    "lyrics sentiment": "Negative because the lyrics express themes of loss and longing, focusing on absence and nostalgia.",
    "music energy": "Medium because although the lyrics are melancholic, the instrumentals are upbeat with electronic influences.",
    "music danceability": "Medium because the beat is steady and engaging, suitable for casual dancing despite the slower tempo.",
    "valence": "Low because the song conveys a sense of nostalgia and melancholy through its lyrics and sound.",
    "mode": "Minor because the melody and lyrical themes convey a moody and unresolved feeling."
  },
  "Rick Astley_Never Gonna Give You Up": {
    "genre": "Pop",
    "track bpm": 113,
    "lyrics summary": "A declaration of steadfast love and commitment, promising never to let the partner down or desert them.",
    "lyrics sentiment": "Positive because the lyrics express joy, assurance, and a commitment to a loyal relationship.",
    "music energy": "Medium because the song has a steady rhythm and an uplifting beat that is dynamic but not overly intense.",
    "music danceability": "High because the track has a strong, catchy beat and rhythm typical of danceable pop tunes.",
    "valence": "High because the tone is joyful, the melody is upbeat, and the lyrics convey a positive message of love and trust.",
    "mode": "Major because the song features bright and uplifting melodies characteristic of the major scale."
  },
  "AJR_Bang!": {
    "genre": "Indie Pop",
    "track bpm": 70,
    "lyrics summary": "The song explores the tension between youthful exuberance and adult responsibilities, expressing a desire for change while feeling caught in a limbo between youth and adulthood.",
    "lyrics sentiment": "Mixed because the lyrics convey both the restless energy of youth and the burden of impending adult responsibilities.",
    "music energy": "Medium because despite the slower tempo, the song's dynamic arrangement and vocal delivery create an engaging intensity.",
    "music danceability": "Medium because the song has a rhythmic swagger reminiscent of reggae, which encourages movement even at a moderate pace.",
    "valence": "Medium because while it addresses serious themes, there is an underlying tone of optimism in the desire to embrace change.",
    "mode": "Minor because the song is composed in C-sharp minor, which contributes to its introspective and slightly somber tone."
  },
  "Panic! At The Disco_Hey Look Ma, I Made It": {
    "genre": "Pop",
    "track bpm": "about 150",
    "lyrics summary": "'Hey Look Ma, I Made It' is a celebratory yet cynical look at success in the music industry, highlighting the hustle and challenges faced by Brendon Urie.",
    "lyrics sentiment": "Mixed because the lyrics celebrate success but also critique the harsh realities of the music industry.",
    "music energy": "High because the song features an energetic tempo and dynamic instrumentation typical of modern pop.",
    "music danceability": "High because the track has a strong, upbeat rhythm that is easy to dance to.",
    "valence": "Medium because the song conveys both triumph and critique, balancing joyful and critical tones.",
    "mode": "Major because the song has a bright, triumphant sound typical of celebratory themes."
  },
  "Panic! At The Disco_High Hopes": {
    "genre": "Pop Rock",
    "track bpm": 82,
    "lyrics summary": "The song emphasizes the themes of having high aspirations and believing in oneself to achieve greatness despite difficulties.",
    "lyrics sentiment": "Positive because the lyrics express optimism and the importance of pursuing one's dreams.",
    "music energy": "High because the song has strong, uplifting instrumentation and a vibrant tempo.",
    "music danceability": "Medium because the song has a steady beat but is not traditionally structured for dance.",
    "valence": "High because the uplifting and positive lyrical content creates an emotionally positive tone.",
    "mode": "Major because the song is in F major, giving it a bright and resolved tonal quality."
  }
}