{
  "Alok_LET'S GET FKD UP": {
    "genre": "EDM",
    "track bpm": 160,
    "lyrics summary": "The song portrays a wild and carefree attitude towards having a good time, inviting listeners to let go of inhibitions and indulge in the freedom of losing control.",
    "lyrics sentiment": "Positive because the lyrics express a joyful and carefree attitude towards partying and letting loose.",
    "music energy": "High because the tempo is fast and the instrumentation is intense, typical of an EDM party anthem.",
    "music danceability": "High because the tempo and rhythm are designed to make people dance energetically, typical of a dance track.",
    "valence": "High because the tone is uplifting and focused on having a good time.",
    "mode": "Major because the melody and chord progression give a bright and resolved tonal quality."
  },
  "Ely Oaks_Spectrum (Say My Name)": {
    "genre": "Hypertechno",
    "track bpm": "about 140",
    "lyrics summary": "A call to action or a plea for recognition, as suggested by the title 'Spectrum (Say My Name)', indicates themes of identity and acknowledgment.",
    "lyrics sentiment": "Mixed because the phrase 'Say My Name' can imply both assertiveness and a desire for validation or emotional connection.",
    "music energy": "High because Hypertechno music typically features intense sounds and fast tempos.",
    "music danceability": "High because Hypertechno is designed to be rhythmic and club-oriented, encouraging dancing.",
    "valence": "Medium because while the genre often includes uplifting beats, the call for recognition could add an introspective layer.",
    "mode": "Minor because Hypertechno frequently employs electronic minor scales for an intense and edgy sound."
  },
  "NO EMOTION_Wings (Techno)": {
    "genre": "Techno",
    "track bpm": 150,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any emotional content.",
    "music energy": "High because the tempo is fast and the genre typically involves intense beats.",
    "music danceability": "High because techno is characterized by a strong, consistent rhythm that encourages dancing.",
    "valence": "Medium because techno can have a repetitive melodic structure that is neither distinctly happy nor sad.",
    "mode": "Minor because the chords Em, C, G, D suggest a progression starting in E minor, which gives a slightly dark and moody feel typical of techno."
  },
  "Nicolas Julian_Mask Off": {
    "genre": "Dance / Electro Pop",
    "track bpm": 155,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because this track has no lyrics, only musical elements.",
    "music energy": "High because the track has a fast tempo of 155 BPM and is described as high energy.",
    "music danceability": "High because the track has a strong, fast tempo and is categorized under dance music, making it highly danceable.",
    "valence": "Medium because while the song is energetic and danceable, it is described as somber which might balance the emotive content to a more neutral level.",
    "mode": "Major because it is in the key of D Major, which typically sounds bright and resolved."
  },
  "cassö_Prada (feat. D-Block Europe) - Valexus Remix": {
    "genre": "EDM",
    "track bpm": 124,
    "lyrics summary": "The lyrics discuss themes of luxury and wealth, including taking a lady shopping, selling bricks, and flying to new destinations.",
    "lyrics sentiment": "Mixed because the lyrics convey excitement about luxury and wealth but also imply illegal activities which adds a darker tone.",
    "music energy": "High because the remix nature tends to involve energetic beats and intense production.",
    "music danceability": "High because the track peaked on dance charts, indicating a strong and driving beat suitable for dancing.",
    "valence": "Medium because while the subject matter is upbeat in terms of wealth and luxury, there is an underlying tension from the mention of illegal activities.",
    "mode": "Major because the overall bright and celebratory tone is typical of tracks aiming for dance hits."
  }
}