{
  "The Weeknd_Save Your Tears": {
    "genre": "Pop",
    "track bpm": 118,
    "lyrics summary": "The song narrates a story of heartbreak and regret where the protagonist asks a former lover not to cry over them and reflects on past mistakes in their relationship.",
    "lyrics sentiment": "Negative because the lyrics express themes of regret and emotional pain.",
    "music energy": "Medium because the track has a steady yet moderate tempo and dynamics.",
    "music danceability": "Medium because the rhythm is consistent with elements suitable for dancing but not overpowering.",
    "valence": "Medium because, despite the melancholic lyrics, the music has a catchy and slightly upbeat vibe.",
    "mode": "Minor because the tonal quality conveys a sense of introspection and emotional depth."
  },
  "Whitney Houston_I Wanna Dance with Somebody (Who Loves Me)": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song expresses a longing for love and connection, with a desire to find someone who cares deeply for the singer and with whom she can share joyous, dance-filled moments.",
    "lyrics sentiment": "Positive because the lyrics express a yearning for joyful connection and companionship through dancing with someone who loves them.",
    "music energy": "High because the upbeat tempo and powerful vocal performance create an invigorating and intense listening experience.",
    "music danceability": "High because the song features a strong, rhythmic beat and an infectious chorus designed to get people on the dance floor.",
    "valence": "High because the energetic music and uplifting lyrics create a joyful and euphoric atmosphere.",
    "mode": "Major because the song has an upbeat, triumphant sound consistent with bright, happy emotional tones."
  },
  "Fleetwood Mac_Dreams - 2004 Remaster": {
    "genre": "Rock",
    "track bpm": 120,
    "lyrics summary": "The lyrics reflect on themes of love and romantic relationships, expressing feelings of longing and contemplation.",
    "lyrics sentiment": "Mixed because the lyrics convey both hopeful longing and a sense of wistful contemplation.",
    "music energy": "Medium because the track has a steady beat and dynamic vocals, but not aggressively intense.",
    "music danceability": "Medium because the tempo allows for swaying and easy movement but isn't tailored for dancing.",
    "valence": "Medium because the song balances melancholic introspection with a hopeful vibe.",
    "mode": "Major because the chords and harmonies provide a brighter, more resolved tonality."
  },
  "Robin Thicke_Blurred Lines": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics revolve around themes of flirtation and attraction, with references to blurred lines between friendship and romantic interest.",
    "lyrics sentiment": "Mixed because while the lyrics suggest playful and seductive tones, they also evoke controversy and discomfort due to their ambiguous nature.",
    "music energy": "High because the track features a lively tempo and dynamic instrumentation.",
    "music danceability": "High because it has a strong rhythm and catchy beat that encourages dancing.",
    "valence": "Medium because the upbeat and fun sound is mixed with lyrics that can be interpreted negatively.",
    "mode": "Major because the tonal quality of the song is bright and energetic."
  },
  "Post Malone_Circles": {
    "genre": "Pop",
    "track bpm": 118,
    "lyrics summary": "The lyrics of 'Circles' deal with the themes of a relationship that is stuck in a repetitive and unproductive cycle, exploring feelings of frustration and the inevitability of an eventual breakup.",
    "lyrics sentiment": "Mixed because the lyrics reflect both the sadness of a failing relationship and the resignation to its outcome, but there is also a sense of acceptance.",
    "music energy": "Medium because the song has a steady, moderate tempo with prominent melodic elements that create an engaging but not overly intense sound.",
    "music danceability": "Medium because the rhythm is steady and has a groove suitable for light dancing, though not overly dominant.",
    "valence": "Medium because the song blends elements of melancholy with a catchy, fluid melody that gives a nuanced emotional feel.",
    "mode": "Minor because the tonal quality of the song is somewhat introspective and moody, despite its pop sensibilities."
  }
}