{
  "AFROJACK_Hero": {
    "genre": "Dance",
    "track bpm": 125,
    "lyrics summary": "The song 'Hero' tells the story of two individuals, a young girl and an old man, who are facing challenges and finding inner strength and resilience in difficult times.",
    "lyrics sentiment": "Mixed because the lyrics acknowledge difficulties and challenges faced by the characters, but also convey a message of hope and resilience.",
    "music energy": "High because the track is produced by Afrojack and David Guetta, known for their energetic dance music, and it features a fast tempo (125 BPM).",
    "music danceability": "High because the strong and consistent beat at 125 BPM is typical of dance music designed to make people move.",
    "valence": "Medium because the song combines themes of struggle with messages of hope, creating a complex emotional tone.",
    "mode": "Major because it's in the key of D Major, which lends the song a resolved and bright tonal quality."
  },
  "Fleetwood Mac_The Chain - 2004 Remaster": {
    "genre": "Rock",
    "track bpm": 152,
    "lyrics summary": "The Chain speaks of the themes of unity, betrayal, and perseverance, emphasizing the idea of being unbreakable despite emotional challenges.",
    "lyrics sentiment": "Mixed because the lyrics capture both a strong sense of determination and underlying themes of betrayal.",
    "music energy": "High because the tempo is fast and the instrumentation builds intensity over time.",
    "music danceability": "Medium because the strong steady beat supports some dance elements but not a dominant dance track.",
    "valence": "Medium because while the music contains a vibrant energy, it also conveys emotional complexity due to underlying themes.",
    "mode": "Major because the song is in A major, which gives it a bright tonal quality despite its complex emotional themes."
  },
  "Coldplay_Higher Power": {
    "genre": "Pop Rock",
    "track bpm": 124,
    "lyrics summary": "The lyrics of 'Higher Power' depict a soul tangled in life's unpredictability, conveying a sense of resilience, hope, and connection to a higher power, whether cosmic, emotional, or spiritual.",
    "lyrics sentiment": "Positive because the lyrics express themes of resilience, hope, and joy derived from love and connection to a higher power.",
    "music energy": "High because the song has vibrant musical composition and energetic instrumentation praised by some reviewers.",
    "music danceability": "High because the beat encourages dancing, as suggested by the lyrics mentioning dancing every hour.",
    "valence": "High because the song celebrates connection and love, creating a euphoric and joyous feeling.",
    "mode": "Major because the themes of hope and joy are complemented by a brighter, resolved tonal quality."
  },
  "The Who_Baba O'Riley": {
    "genre": "Classic Rock",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics of 'Baba O'Riley' reflect themes of youthful rebellion, existential reflection, and an ominous sense of societal change, encapsulated in the phrase 'teenage wasteland'.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of rebellion and hope for change, while also expressing existential and societal disillusionment.",
    "music energy": "High because the track features a driving rhythm and dynamic instrumentation characteristic of classic rock.",
    "music danceability": "Medium because while it has a strong and consistent beat, the focus on lyrical depth may reduce its general suitability for dancing compared to more rhythm-focused tracks.",
    "valence": "Medium because the music and lyrics combine a sense of upliftment with introspective and somber themes.",
    "mode": "Major because the chord progressions and overall tonality sound bright and anthemic despite the complex themes."
  },
  "Olly Murs_Up (feat. Demi Lovato)": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song 'Up' by Olly Murs featuring Demi Lovato explores a couple navigating a challenging phase in their relationship, highlighting themes of reconciliation and determination to mend their bond despite past hurts.",
    "lyrics sentiment": "Mixed because the lyrics express both the pain of a troubled relationship and the hopeful determination to fix it.",
    "music energy": "Medium because the track balances emotional vocal performances with upbeat pop instrumentation.",
    "music danceability": "High because it features a steady rhythm and catchy melody that encourages movement.",
    "valence": "Medium because the song conveys both emotional depth and resilience, combining hopeful and somber tones.",
    "mode": "Major because the overall feeling is one of optimism and resolution, despite the difficulties described in the lyrics."
  }
}