{
  "TobyMac_Lord It Feels Good": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics express joy and gratitude for the feeling of being loved by God, with metaphors comparing God's love to sunlight shining on one's face.",
    "lyrics sentiment": "Positive because the lyrics celebrate the joy and warmth of being loved and the gratitude felt towards God.",
    "music energy": "Medium because the song likely features a balanced dynamic range typical of Pop music.",
    "music danceability": "Medium because the steady beat and joyful rhythm suit light to moderate dancing.",
    "valence": "High because the lyrics and mood are uplifting and joyful.",
    "mode": "Major because the song conveys a bright, happy feeling consistent with its positive message."
  },
  "Crowder_Good God Almighty": {
    "genre": "Contemporary Christian",
    "track bpm": 81,
    "lyrics summary": "The song conveys a message of unwavering faith, gratitude, and trust in God, expressing the singer's personal experiences and emotions.",
    "lyrics sentiment": "Positive because the lyrics express gratitude and unwavering trust in a higher power.",
    "music energy": "High because the tempo and intensity were described as high despite the somber themes, indicating a powerful delivery.",
    "music danceability": "High because it is mentioned as very danceable with a steady beat.",
    "valence": "High because the themes of faith and gratitude convey a positive emotional tone.",
    "mode": "Major because the song is described to be in a major key, which typically conveys a bright and resolved tonal quality."
  },
  "CAIN_I'm So Blessed - Best Day Remix": {
    "genre": "Contemporary Christian Music",
    "track bpm": "about 125",
    "lyrics summary": "The song lyrics emphasize gratitude and the feeling of being blessed despite life's ups and downs, due to faith and a relationship with God.",
    "lyrics sentiment": "Positive because the lyrics express joy and gratitude, emphasizing being blessed regardless of circumstances.",
    "music energy": "High because the song's upbeat tempo and energetic vocal delivery convey a lively and spirited mood.",
    "music danceability": "High because the remix features a strong, consistent beat that facilitates dancing.",
    "valence": "High because the song conveys uplifting and joyful themes, celebrating a sense of spiritual fulfillment.",
    "mode": "Major because the melody and harmonies produce a bright and optimistic sound."
  },
  "Forrest Frank_GOOD DAY": {
    "genre": "Christian Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song is about having a positive and joyful day, filled with gratitude and recognition of divine support, celebrating simple life pleasures.",
    "lyrics sentiment": "Positive because the lyrics express joy and gratitude for life's blessings and a connection to the divine.",
    "music energy": "Medium because while it is upbeat, the track balances energetic instrumentation with a laid-back vibe typical of pop.",
    "music danceability": "High because the beat is catchy and encourages movement suitable for dancing.",
    "valence": "High because the track exudes positivity and happiness.",
    "mode": "Major because the melody supports a bright and uplifting tonal quality."
  },
  "Jimmy Dooley_Oh My Goodness": {
    "genre": "Christian Pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics express jubilant celebration and excitement, reflecting on God's moments and encouragement in faith.",
    "lyrics sentiment": "Positive because the lyrics convey joy and a sense of spiritual celebration.",
    "music energy": "High because the tempo is fast and the song likely uses lively instrumentation typical of upbeat Christian pop.",
    "music danceability": "High because the track has a fast tempo and energetic beat that encourages movement and dance.",
    "valence": "High because the song conveys a joyful and celebratory mood through its lyrical content.",
    "mode": "Major because the music and lyrics exude an uplifting and positive feeling."
  }
}