{
  "Fleetwood Mac_Everywhere": {
    "genre": "Rock",
    "track bpm": "about 106",
    "lyrics summary": "A person expresses their contrasting feelings of sadness and hopefulness as they perceive changes in their life, but recognizes that their current situation is temporary.",
    "lyrics sentiment": "Mixed because the lyrics convey both optimism about fleeting moments and underlying sadness.",
    "music energy": "Medium because the instrumentation is balanced with a steady rhythm, characteristic of Fleetwood Mac's style.",
    "music danceability": "High because the song has a steady beat and rhythmic pulse that encourages movement.",
    "valence": "Medium because the lyrics and music offer a blend of emotional tones, neither fully joyful nor entirely melancholic.",
    "mode": "Major because the song has a bright and uplifting melodic and harmonic quality characteristic of Fleetwood Mac's pop rock style."
  },
  "ABBA_Money, Money, Money": {
    "genre": "Pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics describe a yearning for wealth and the belief that money can solve problems, showcasing ambition and desperation for a better life.",
    "lyrics sentiment": "Mixed because the lyrics express both ambition and desperation.",
    "music energy": "High because the tempo is brisk and the instrumentation is lively.",
    "music danceability": "Medium because the rhythm is steady and the song has a catchy beat, but it's not primarily dance-focused.",
    "valence": "Medium because there is an energetic and lively tone, but the lyrical content reflects a more complex emotional outlook.",
    "mode": "Minor because the melody and chord progressions have a somewhat moody and unresolved quality."
  },
  "Taylor Swift_gold rush": {
    "genre": "Pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics address romantic feelings and emotional vulnerabilities, starting with a casual meeting over the weekend and quickly escalating towards a deep emotional connection. The singer reflects on the impulsive nature of love and the difficulty of maintaining self-control.",
    "lyrics sentiment": "Mixed because the lyrics convey both the excitement of a new romance and the inner conflict of swiftly developing feelings.",
    "music energy": "Medium because while the tempo is upbeat, the pop instrumentation maintains a controlled intensity suitable for a mainstream pop track.",
    "music danceability": "High because the song features a steady, catchy beat and upbeat tempo that is typical of mainstream pop designed for dancing.",
    "valence": "High because the music and lyrics exude a sense of euphoria and romantic excitement despite some emotional complexity.",
    "mode": "Major because the song's harmony and overall tonality sound bright and uplifting."
  },
  "Lorde_Green Light": {
    "genre": "Pop",
    "track bpm": "about 124",
    "lyrics summary": "The lyrics of 'Green Light' convey a sense of restlessness and anticipation, reflecting on the feelings of disappointment and waiting for something that may never come. The song captures a mix of youthful resilience and self-discovery, as the narrator moves past heartbreak and pursues newfound freedom.",
    "lyrics sentiment": "Mixed because the song acknowledges the pain and frustration of waiting and heartbreak but also embraces a sense of empowerment and moving forward.",
    "music energy": "High because the song features an upbeat tempo and dynamic instrumentation typical of dance-pop anthems.",
    "music danceability": "High because the track has a strong, consistent beat and rhythm that encourages movement and dancing.",
    "valence": "Medium because the song blends melancholic themes of heartbreak with an upbeat and empowering musical arrangement.",
    "mode": "Major because the overall tone of the song is bright and the chord progression resolves in a triumphant manner."
  },
  "Harry Styles_Golden": {
    "genre": "Pop Rock",
    "track bpm": 120,
    "lyrics summary": "The song 'Golden' by Harry Styles primarily explores themes of love and romantic devotion, highlighting feelings of warmth, happiness, and longing.",
    "lyrics sentiment": "Positive because the lyrics express happiness and romantic devotion, with an upbeat feel.",
    "music energy": "Medium because the track has a balanced dynamic range with soothing, steady rhythms typical of pop rock.",
    "music danceability": "Medium because it has a steady beat suitable for casual dancing but not intensely rhythmic like EDM.",
    "valence": "High because the tone is uplifting and joyful, resonating with the bright theme of the song's title.",
    "mode": "Major because the overall tonal quality is bright and happy, fitting the positive sentiment of the lyrics."
  }
}