{
  "ROLE MODEL_minimal": {
    "genre": "Indie Pop",
    "track bpm": 170,
    "lyrics summary": "The song 'Minimal' by ROLE MODEL delves into themes of emotional detachment, self-destructive behaviors, and a yearning for simpler relationships. It expresses disillusionment with societal norms and a lack of fulfillment in romantic connections.",
    "lyrics sentiment": "Negative because the lyrics convey a sense of disillusionment, emotional detachment, and a lack of fulfillment.",
    "music energy": "High because the tempo is fast at 170 BPM, which contributes to an intense musical experience.",
    "music danceability": "Medium because although it has a high tempo, the somber mood may limit some aspects of danceability.",
    "valence": "Low because the tone is melancholic and the lyrics express themes of sadness and disillusionment.",
    "mode": "Major because the song is in a C♯/D♭ key and a major scale, which gives it a brighter tonal quality despite its melancholic themes."
  },
  "SZA_The Weekend - Funk Wav Remix": {
    "genre": "Funk",
    "track bpm": 102,
    "lyrics summary": "The song is an ode to female empowerment, celebrating independence and enjoyment over the weekend.",
    "lyrics sentiment": "Positive because the lyrics express themes of female empowerment and enjoyment.",
    "music energy": "Medium because the track is described as having average energy, suitable for a funk remix with Calvin Harris's production.",
    "music danceability": "High because the beat is very danceable as noted in the snippet, consistent with a Calvin Harris funk influence.",
    "valence": "High because the track is upbeat and has a positive, empowering feel.",
    "mode": "Major because it is specifically mentioned as being in a major key, consistent with the upbeat and positive tone."
  },
  "Rex Orange County_Corduroy Dreams": {
    "genre": "Alternative R&B",
    "track bpm": 90,
    "lyrics summary": "The song is a metaphorical reflection on longing for deep and meaningful connections, feeling trapped in unfulfilling relationships, and navigating the complexities of teenage romance.",
    "lyrics sentiment": "Mixed because the lyrics express both longing and hope within the complexity of teenage romance.",
    "music energy": "Medium because the song blends soulful ballads with a steady rhythm.",
    "music danceability": "Medium because it has a groove typical of Alternative R&B, suitable for swaying rather than active dancing.",
    "valence": "Medium because the song balances themes of longing and romantic hopefulness.",
    "mode": "Minor because the emotional tone is introspective and contemplative, fitting the reflective lyrical themes."
  },
  "Rex Orange County_Best Friend": {
    "genre": "Indie Pop",
    "track bpm": 145,
    "lyrics summary": "The lyrics explore the complexities of unrequited love and the tension between friendship and romance. The protagonist expresses feelings of loneliness and disconnection, despite being surrounded by friends.",
    "lyrics sentiment": "Mixed because the lyrics convey both loneliness and a longing for connection amidst a backdrop of friendship.",
    "music energy": "High because the tempo is fast and the song is dynamic with emotional intensity.",
    "music danceability": "Medium because the track has a steady beat and rhythm typical of indie pop, suited for light dancing or swaying.",
    "valence": "Medium because it combines upbeat musical elements with introspective and emotionally complex lyrics.",
    "mode": "Major because the track is in the key of F# Maj, which typically sounds bright and resolved despite the emotional complexity of the lyrics."
  },
  "BØRNS_Electric Love": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics of 'Electric Love' revolve around the theme of intense romantic attraction, using metaphors and vivid imagery to compare love to an electrifying force that affects the singer profoundly.",
    "lyrics sentiment": "Positive because the lyrics express joy and excitement about a deep romantic connection.",
    "music energy": "High because the track features powerful live drums and energetic guitar riffs, simulating the exhilaration of falling in love.",
    "music danceability": "High because the song has a prominent beat and vibrant instrumentation that makes it suitable for dancing.",
    "valence": "High because the exuberant and joyful tone of both the music and lyrics reflect a positive emotional state.",
    "mode": "Major because the overall tonal quality of the song is bright and uplifting, typical of pop music focused on love and joy."
  }
}