{
  "Cherub_Doses & Mimosas": {
    "genre": "Indie Pop",
    "track bpm": 115,
    "lyrics summary": "The lyrics describe indulgence in hedonistic pleasures like drinking, along with feelings of disillusionment and introspection. The narrator experiences regret and the slow passage of time, hinting at a struggle with substance abuse and a desire to escape from societal judgments.",
    "lyrics sentiment": "Mixed because the lyrics reflect both indulgence and disillusionment, as well as pleasure and regret.",
    "music energy": "High because the track has an energetic tempo and intense synthesizer elements.",
    "music danceability": "High because the steady beat and upbeat tempo make it very suitable for dancing.",
    "valence": "Medium because the music is lively and danceable while the lyrics express a mix of pleasure and introspection.",
    "mode": "Major because the track is noted to be in the F major key, giving it a bright tonal quality despite its somber themes."
  },
  "Lil Nas X_INDUSTRY BABY (feat. Jack Harlow)": {
    "genre": "Hip Hop",
    "track bpm": "about 150",
    "lyrics summary": "The lyrics center around themes of triumph and overcoming adversity, with Lil Nas X and Jack Harlow rapping about their fame, success, and confident defiance against challenges in the rap industry.",
    "lyrics sentiment": "Positive because the lyrics express confidence and celebration of success despite adversities.",
    "music energy": "High because the track features intense beats and assertive rapping typical of a triumphant hip-hop anthem.",
    "music danceability": "High because it has a strong, rhythmic beat that is characteristic of energetic hip-hop tracks, suitable for dancing.",
    "valence": "High because the song is celebratory and uplifting, focusing on success and self-confidence.",
    "mode": "Major because the song has a bright and triumphant feel, typical of music celebrating victory and success."
  },
  "Young Thug_F Cancer (Boosie) [feat. Quavo]": {
    "genre": "Hip Hop",
    "track bpm": 140,
    "lyrics summary": "The song discusses Young Thug's disdain for cancer, his tribute to rapper Boosie who battled cancer, and includes themes of resilience, materialism, loyalty, success, wealth, and sexual encounters.",
    "lyrics sentiment": "Mixed because while there is disdain for cancer and aggressive tones, there is also praise and loyalty expressed towards friends and peers.",
    "music energy": "High because the song features aggressive vocals and intense beat.",
    "music danceability": "High because the track has a strong and consistent beat typical for hip hop.",
    "valence": "Medium because the song balances aggressive themes with affirmations of success and loyalty.",
    "mode": "Minor because the themes of aggression and dark tones suggest a minor key."
  },
  "Mac Miller_Donald Trump": {
    "genre": "Hip Hop",
    "track bpm": 163,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Mixed because it was described with both high energy and exuberance but also contains tension due to the feud it generated.",
    "music energy": "High because the tempo is fast and the song is described as having high energy and being very exuberant.",
    "music danceability": "High because it is described as very danceable with a strong, consistent beat.",
    "valence": "High because it is described as exuberant and the mood of the song is happy.",
    "mode": "Minor because the song is in a minor key (C♯/D♭) which traditionally implies a darker or unresolved tonality."
  },
  "Mac Miller_The Spins": {
    "genre": "Hip-Hop",
    "track bpm": 127,
    "lyrics summary": "The lyrics express the carefree and exuberant nature of youth, along with dreams of success and the hedonistic pleasures that come with fame. Mac Miller reflects on his lifestyle and aspirations while acknowledging the complexities of love and infidelity.",
    "lyrics sentiment": "Mixed because the lyrics combine feelings of youthful exhilaration and ambition with moments touching on infidelity and the complexities of love.",
    "music energy": "High because the song features a vibrant and upbeat tempo with intense instrumentation.",
    "music danceability": "High because the song has a strong, consistent beat suitable for dancing.",
    "valence": "High because the overall tone is upbeat and joyful, capturing a sense of youthful exuberance.",
    "mode": "Minor because the track is set in a minor key, giving it a slightly introspective edge despite its upbeat tempo."
  }
}