{
  "Jac & Harri_Voices": {
    "genre": "Big Room",
    "track bpm": 128,
    "lyrics summary": "The track is instrumental.",
    "lyrics sentiment": "Neutral because the track is instrumental and contains no lyrics.",
    "music energy": "High because the tempo is fast and it has intense, driving beats consistent with Big Room tracks.",
    "music danceability": "High because the track's steady and strong rhythm is designed for dancing, typical of the Big Room genre.",
    "valence": "Medium because while the track is upbeat, it lacks explicit emotional content due to being instrumental.",
    "mode": "Minor because Big Room tracks often utilize Minor keys for a dramatic and energetic feel, although specific key information isn't provided for 'Voices.'"
  },
  "Vigel_Guangzhou": {
    "genre": "Trance",
    "track bpm": 132,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to express emotion.",
    "music energy": "High because the song has a fast tempo and intense instrumental arrangement.",
    "music danceability": "Medium because although it is somewhat danceable due to its rhythm, it may not be strongly oriented towards a dance floor setting.",
    "valence": "Medium because the overall tone might offer a mix of both energetic and somber elements defined by its trance genre.",
    "mode": "Major because the track is noted to be in a major mode which generally gives a brighter tone."
  },
  "Ruslan Radriges_Giving Off Light": {
    "genre": "Trance",
    "track bpm": "about 138",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and does not have lyrical content for sentiment analysis.",
    "music energy": "High because the track is described as hyper-energetic with a surreal amount of power.",
    "music danceability": "High because Trance music typically features a strong and consistent beat suitable for dancing.",
    "valence": "High because the track is described as luminescent and uplifting, typical of Trance's vibrant tones.",
    "mode": "Major because Trance music often utilizes bright and resolved tonal structures."
  },
  "Abstract Vision_Turbulence": {
    "genre": "Trance",
    "track bpm": 132,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and does not contain any lyrics.",
    "music energy": "High because the track features intense pulsating basslines and soaring pads, typical of trance music.",
    "music danceability": "High because the track has a consistent and driving beat, characteristic of trance and electronic dance music.",
    "valence": "Medium because while the track is energetic and powerful, it maintains an emotionally neutral tone due to the lack of lyrics.",
    "mode": "Minor because trance music often uses minor scales to create a more intense and emotive atmosphere."
  },
  "Fast Distance_Odin": {
    "genre": "Trance",
    "track bpm": 134,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics, only music.",
    "music energy": "High because the tempo is fast and it is a Trance track designed for energetic dance floors.",
    "music danceability": "High because Trance music is known for its strong, consistent beat suitable for dancing.",
    "valence": "Medium because while the track is likely uplifting as is common with Trance music, it does not have explicit lyrics to fully convey emotional positivity.",
    "mode": "Major because the key is F# Major, typically associated with a bright and triumphant sound."
  }
}