{
  "Childish Gambino_Redbone": {
    "genre": "R&B/Soul",
    "track bpm": 85,
    "lyrics summary": "The lyrics of 'Redbone' express suspicion and warning, cautioning a lover to stay woke and beware of deceit and betrayal.",
    "lyrics sentiment": "Mixed because the lyrics warn about deception, inducing a sense of vigilance, but also convey a determination to stay aware.",
    "music energy": "Medium because the track has a steady tempo and a groovy soulful backing that gives it a grounded feel.",
    "music danceability": "Medium because the groove is smooth and conducive to relaxed, rhythmic movements without being overpoweringly rhythmic.",
    "valence": "Low because the tone of the song is dark and tense, reflecting themes of caution and mistrust.",
    "mode": "Minor because the melody and harmonies contribute to a moody and introspective sound."
  },
  "Rihanna_Love On The Brain": {
    "genre": "Pop",
    "track bpm": 66,
    "lyrics summary": "The lyrics of 'Love On The Brain' describe a tumultuous romantic relationship characterized by deep passion and longing. It captures the complexity of love that can cause both pain and pleasure.",
    "lyrics sentiment": "Mixed because the lyrics explore both the yearning and pain associated with a passionate but difficult relationship.",
    "music energy": "Medium because the song has a steady pace and features powerful vocal delivery, though it is not fast-paced.",
    "music danceability": "Medium because the song has a strong, swinging beat that supports rhythmic movement, yet it is more soulful than dance-centric.",
    "valence": "Medium because the song explores both uplifting and sorrowful emotional aspects of love.",
    "mode": "Minor because the melody and harmony convey a feeling of emotional intensity and longing."
  },
  "Khalid_Location": {
    "genre": "Alternative R&B",
    "track bpm": 160,
    "lyrics summary": "The song 'Location' by Khalid explores themes of longing and connection, with the lyrics focusing on the desire to share a meaningful moment or place with someone special, highlighting both physical and emotional intimacy.",
    "lyrics sentiment": "Positive because the lyrics express a desire for intimacy and connection through genuine and heartfelt expressions.",
    "music energy": "Medium because the track features a smooth and laid-back instrumental that is moderately paced and relies on steady rhythms rather than intense dynamics.",
    "music danceability": "Medium because while the track has a steady beat and groove, it is more suited to casual and intimate settings rather than high-energy dancing.",
    "valence": "Medium because the song balances feelings of longing with hopeful undertones of connection and shared experiences.",
    "mode": "Major because the melody creates a warm and inviting sound typical of a major key."
  },
  "GoldLink_Some Girl (feat. Steve Lacy)": {
    "genre": "Hip-Hop/Rap",
    "track bpm": "about 90",
    "lyrics summary": "The song 'Some Girl' revolves around romantic themes, exploring attraction and the nuances of relationships.",
    "lyrics sentiment": "Mixed because the lyrics discuss both attraction and complex emotions surrounding a relationship.",
    "music energy": "Medium because the track features a steady rhythm typical of Hip-Hop with moderate intensity.",
    "music danceability": "Medium because the beat is steady and groovy, suitable for moderate dancing.",
    "valence": "Medium because the track has a balanced emotional tone, mixing romantic themes with introspective ones.",
    "mode": "Minor because the musical accompaniment often features introspective and slightly melancholic tones."
  },
  "Childish Gambino_Sober": {
    "genre": "Alternative R&B",
    "track bpm": 90,
    "lyrics summary": "The lyrics of 'Sober' explore the theme of longing and frustration, as the narrator struggles with wanting to be with someone while battling personal issues.",
    "lyrics sentiment": "Mixed because while the lyrics deal with themes of longing and struggle, they also convey a sense of hope and desire for connection.",
    "music energy": "Medium because the track features a steady rhythm with emotional vocal delivery, without overly intense instrumentation.",
    "music danceability": "Medium because the beat is smooth and consistent, suitable for casual dancing.",
    "valence": "Medium because the song balances emotional depth and a sense of yearning with melodic appeal.",
    "mode": "Minor because the song features a moody and introspective chord progression."
  }
}