{
  "Rend Collective_My Lighthouse": {
    "genre": "Worship",
    "track bpm": 111,
    "lyrics summary": "The song 'My Lighthouse' by Rend Collective speaks of finding hope and security in God's love amidst challenging times, using the metaphor of a lighthouse guiding through a troubled sea, symbolizing life's struggles and uncertainties.",
    "lyrics sentiment": "Positive because the lyrics convey hope and assurance in divine guidance and protection.",
    "music energy": "Medium because the tempo is moderate and the song has a steady uplifting drive without being overly intense.",
    "music danceability": "Medium because the rhythm is steady and conducive to movement, typical of worship music inviting participatory engagement.",
    "valence": "High because the song's message is uplifting and emotionally positive, focusing on hope and divine support.",
    "mode": "Major because the song is in C Major, typically associated with a bright and uplifting sound."
  },
  "Blanca_Different Drum": {
    "genre": "Christian",
    "track bpm": 109,
    "lyrics summary": "The song 'Different Drum' by Blanca is an anthem for individuality and authenticity, encouraging listeners to embrace their unique qualities and break free from societal expectations or conformity.",
    "lyrics sentiment": "Positive because the lyrics express encouragement and pride in one's uniqueness and identity.",
    "music energy": "Medium because the tempo is mid-range and the song has a confident and steady rhythm.",
    "music danceability": "Medium because while the beat is clear, it is more focused on delivering a message rather than a rhythm for dancing.",
    "valence": "High because the tone is uplifting and celebrates individuality and authenticity.",
    "mode": "Major because the melody and chords support a positive and triumphant message."
  },
  "Aaron Cole_Right on Time (feat. Tobymac)": {
    "genre": "Christian Hip Hop",
    "track bpm": 95,
    "lyrics summary": "The lyrics focus on themes of reassurance and faith, encouraging listeners not to worry and to trust in God's timing and love.",
    "lyrics sentiment": "Positive because the lyrics convey reassurance and faith in divine timing, encouraging positivity in the face of problems.",
    "music energy": "Medium because the track has a balanced dynamic range with a steady, uplifting rhythm.",
    "music danceability": "Medium because while it has a strong rhythm, the primary focus is on the lyrical message and not on driving dance beats.",
    "valence": "High because the song's message is uplifting and offers hope and assurance.",
    "mode": "Major because the melody and chord progressions suggest a bright and positive tone."
  },
  "Third Day_Soul On Fire (feat. All Sons & Daughters) (feat. All Sons & Daughters)": {
    "genre": "Gospel/Christian",
    "track bpm": "about 100",
    "lyrics summary": "The lyrics express a strong spiritual longing and dedication, emphasizing a desire to be spiritually rejuvenated and passionate, symbolized by being a 'soul on fire'.",
    "lyrics sentiment": "Positive because the lyrics express spiritual devotion and a yearning for divine connection.",
    "music energy": "Medium because the song likely has a strong but balanced dynamic typical of worship music.",
    "music danceability": "Medium because the rhythm is steady, allowing for sway and movement typical in worship settings.",
    "valence": "High because it conveys an uplifting and passionate plea for spiritual fervor.",
    "mode": "Major because the tone and lyrics convey joyful and hopeful sentiments."
  },
  "Mandisa_Overcomer": {
    "genre": "Contemporary Christian",
    "track bpm": 120,
    "lyrics summary": "The song 'Overcomer' by Mandisa inspires listeners to stay strong and persist through challenges, reassuring them of God's support in difficult times.",
    "lyrics sentiment": "Positive because the lyrics are motivational and emphasize perseverance and faith.",
    "music energy": "High because the tempo is fast and the song is spirited and uplifting.",
    "music danceability": "High because the beat is steady and prominent, making it suitable for dancing.",
    "valence": "High because the song's tone is uplifting and empowering.",
    "mode": "Minor because the track is in the G minor key, which gives it a certain emotional depth despite its positive message."
  }
}