{
  "The Neighbourhood_Daddy Issues": {
    "genre": "Alternative Rock",
    "track bpm": "about 110",
    "lyrics summary": "The song 'Daddy Issues' by The Neighbourhood explores themes of emotional struggles and complex relationships, likely focusing on familial issues that impact romantic and personal life.",
    "lyrics sentiment": "Mixed because the lyrics explore complicated emotions involving struggle and desire for connection, possibly touching on both negative aspects like sadness and positive elements such as hope for resolution.",
    "music energy": "Medium because The Neighbourhood's style in this period typically features a blend of mellow and intense elements, maintaining a balanced but engaging sound.",
    "music danceability": "Medium because the song likely has a steady rhythmic foundation typical of alternative rock, suitable for casual listening rather than intense dancing.",
    "valence": "Medium because while the themes may be emotionally complex, the music itself supports a range of feelings, neither too dark nor overly bright.",
    "mode": "Minor because The Neighbourhood often employs moody, introspective melodies in their music, contributing to a more reflective sound quality."
  },
  "The Neighbourhood_Afraid": {
    "genre": "Indie Rock",
    "track bpm": 85,
    "lyrics summary": "The lyrics express feelings of anxiety and vulnerability, discussing struggles with fear and self-doubt.",
    "lyrics sentiment": "Negative because the lyrics focus on themes of fear, anxiety, and self-doubt.",
    "music energy": "Medium because the song has a steady rhythm and a consistent intensity without aggressive dynamics.",
    "music danceability": "Medium because the beat is steady, allowing for some movement though it is not overwhelmingly driving.",
    "valence": "Low because the overall tone of the song is melancholic and introspective.",
    "mode": "Minor because the song's mood is dark and expresses feelings of anxiety and tension."
  },
  "The Neighbourhood_The Beach": {
    "genre": "Alternative Rock",
    "track bpm": 115,
    "lyrics summary": "The song 'The Beach' by The Neighbourhood explores themes of solitude, emotional detachment, and longing, as reflected in situations and metaphors related to a beach setting.",
    "lyrics sentiment": "Negative because the lyrics express feelings of loneliness and emotional struggle.",
    "music energy": "Medium because the track has a steady tempo and balanced instrumentation typical of alternative rock.",
    "music danceability": "Medium because the rhythm is steady, though not overly dominant, suited for casual dancing or head-nodding.",
    "valence": "Low because the song's themes and tonal quality convey sadness and introspection.",
    "mode": "Minor because the song has a moody and introspective tonal quality, typical of The Neighbourhood's style."
  },
  "The Neighbourhood_Cry Baby": {
    "genre": "Indie Rock",
    "track bpm": 90,
    "lyrics summary": "The lyrics explore feelings of vulnerability, emotional struggle, and romantic uncertainty, highlighting the tension in personal relationships.",
    "lyrics sentiment": "Mixed because the lyrics convey both introspective sadness and a sense of longing or hope for resolution.",
    "music energy": "Medium because the track features a steady rhythm with moderately intense instrumentation typical of indie rock.",
    "music danceability": "Medium because the track has a consistent groove that supports casual dancing.",
    "valence": "Medium because the song intertwines melancholic themes with a hopeful undertone.",
    "mode": "Minor because the song's tonality reflects a darker, more introspective mood."
  },
  "The Neighbourhood_Stargazing": {
    "genre": "Alternative Rock",
    "track bpm": 160,
    "lyrics summary": "The song 'Stargazing' by The Neighbourhood explores themes of ambition and intimacy, reflecting on a race against time and the emotional complexities of patience and desire.",
    "lyrics sentiment": "Mixed because the lyrics describe both a race against time that suggests anxiety and themes of intimacy which are more positive.",
    "music energy": "Medium because it is described as having average energy despite its high tempo of 160 BPM.",
    "music danceability": "Medium because it is somewhat danceable and has a steady rhythm with a time signature of 4 beats per bar.",
    "valence": "Medium because the song has a somber feel despite the major key, suggesting an emotionally complex tone.",
    "mode": "Major because it is explicitly stated to be in the key of C Maj, which typically has a brighter, resolved tonal quality."
  }
}