{
  "pinoko_One More Night": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "Unknown",
    "lyrics sentiment": "Neutral because there are no available lyrics or descriptive context to suggest emotional content.",
    "music energy": "Medium because pop music typically has a balanced dynamic range with a steady rhythm.",
    "music danceability": "High because pop music often features strong, consistent beats ideal for dancing.",
    "valence": "Medium because pop tracks often have a mix of emotional tones, common in contemporary charts.",
    "mode": "Major because pop music frequently uses bright, happy tonal qualities associated with the major mode."
  },
  "yonawo_Rhodes (feat. どんぐりず)": {
    "genre": "J-Pop",
    "track bpm": 90,
    "lyrics summary": "The lyrics explore the struggles of recognition, authenticity, and the hustle to stay true amidst life's distractions. The narrator reflects on hard work, lack of confidence in others, and the desire to be acknowledged while questioning the authenticity of relationships.",
    "lyrics sentiment": "Mixed because the lyrics convey a struggle with themes of perseverance and questioning authenticity amid positive aspirations.",
    "music energy": "Medium because the song has an average tempo and balanced dynamics.",
    "music danceability": "High because the song is described as very danceable with a strong and consistent beat.",
    "valence": "Medium because while the song is upbeat and major, it also explores themes of struggle and perseverance which add complexity.",
    "mode": "Major because the song is in a major key, contributing to its upbeat feel."
  },
  "mihoro*_えっか": {
    "genre": "J-Pop",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics in the track.",
    "music energy": "Medium because the track is likely to have a balanced dynamic range typical of J-Pop.",
    "music danceability": "Medium because J-Pop often has a steady rhythm suitable for light dancing.",
    "valence": "Medium because the typical mood of J-Pop is emotionally complex with both upbeat and introspective elements.",
    "mode": "Major because J-Pop often features bright and resolved tonal qualities."
  },
  "クボタカイ_夢で逢えたら": {
    "genre": "J-Pop",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to analyze.",
    "music energy": "Medium because the instrumentation is balanced and not overly intense.",
    "music danceability": "Medium because there is likely a steady beat suitable for casual dancing.",
    "valence": "Medium because without lyrics, the emotional tone is balanced through music alone.",
    "mode": "Major because J-Pop typically features bright and resolved tonal qualities."
  },
  "Matt Cab_First Love": {
    "genre": "R&B",
    "track bpm": "about 70",
    "lyrics summary": "Likely about experiencing a romantic or emotional connection for the first time.",
    "lyrics sentiment": "Positive because themes of 'First Love' usually focus on joyful and romantic feelings of experiencing love for the first time.",
    "music energy": "Low because R&B often has a smooth, mellow instrumentation and relaxed tempo.",
    "music danceability": "Medium because R&B usually has a steady beat that allows for gentle dancing.",
    "valence": "High because the theme of first love is often associated with joyful and positive emotions.",
    "mode": "Major because songs about love often have a bright and resolved tonal quality."
  }
}