{
  "Gaullin_Moonlight": {
    "genre": "EDM",
    "track bpm": 125,
    "lyrics summary": "The lyrics detail feelings of loneliness and desire for connection, as the singer asks someone to call them to make them feel right.",
    "lyrics sentiment": "Mixed because the lyrics express vulnerability and loneliness but also imply moments of comfort when the person is called.",
    "music energy": "High because the song has a fast tempo and intense instrumentation, which are characteristic of high-energy tracks.",
    "music danceability": "High because it features a strong and consistent beat suitable for dancing, which is common in EDM tracks.",
    "valence": "Low because the song's tone is somber and introspective, despite its danceability.",
    "mode": "Minor because the song is in A♯/B♭ minor, contributing to its brooding and introspective atmosphere."
  },
  "Alesso_TIME": {
    "genre": "EDM",
    "track bpm": 120,
    "lyrics summary": "The song 'TIME' by Alesso explores the theme of embracing the feeling of wasting time and finding pleasure in it. The lyrics suggest that although wasting time might seem counterintuitive, it can feel right and fulfilling in certain contexts.",
    "lyrics sentiment": "Mixed because the lyrics convey both the seemingly negative concept of wasting time and the positive, fulfilling feeling that can accompany it.",
    "music energy": "High because the track has a fast tempo and intense instrumentation typical of EDM.",
    "music danceability": "High because the song features an upbeat tempo and a strong, consistent beat that is conducive to dancing.",
    "valence": "Medium because while the theme involves positive emotions about wasting time, there is an element of conflict in the lyrics' tone.",
    "mode": "Major because the track is in the F major key, giving it a bright and resolved sound."
  },
  "Kungs_This Girl (Kungs Vs. Cookin' On 3 Burners)": {
    "genre": "House",
    "track bpm": 124,
    "lyrics summary": "The song features a playful and catchy repetition about a girl that captures attention and exudes charm.",
    "lyrics sentiment": "Positive because the lyrics have an upbeat and catchy tone centered around admiration of the girl's charm.",
    "music energy": "High because the track features a strong beat and vibrant instrumentation typical of house music.",
    "music danceability": "High because the remix is designed with a strong, consistent beat that encourages dancing.",
    "valence": "High because the song's mood is upbeat and joyful, characteristic of mainstream house music.",
    "mode": "Major because the uplifting and bright sound aligns with the major scale typical of dance tracks."
  },
  "Pham_Movements": {
    "genre": "Chillhop",
    "track bpm": 95,
    "lyrics summary": "The song revolves around themes of gratitude, love, and embracing change. The lyrics express admiration for a girl, acknowledging her beauty and the positive impact she has on the speaker.",
    "lyrics sentiment": "Positive because the lyrics express gratitude, admiration, and the positive influence of love.",
    "music energy": "Medium because the track maintains a steady rhythm with a relaxed yet engaging beat.",
    "music danceability": "Medium because it has a groove suitable for relaxed or chill dancing.",
    "valence": "High because the lyrics and music convey positive and uplifting emotions.",
    "mode": "Major because the overall tone of the track is bright and uplifting."
  },
  "Don Diablo_Survive (feat. Emeli Sandé, Gucci Mane)": {
    "genre": "EDM",
    "track bpm": 126,
    "lyrics summary": "The song's lyrics speak about overcoming challenges, with themes of survival and resilience expressed through the imagery of escaping thunder and hunger.",
    "lyrics sentiment": "Positive because the lyrics focus on survival and overcoming difficulties as a testament to resilience.",
    "music energy": "High because the upbeat tempo and intense electronic production contribute to a lively and energetic atmosphere.",
    "music danceability": "High because the track has a strong, consistent beat typical of EDM, designed to make people move.",
    "valence": "High because the uplifting theme of triumph and the vibrant production create a positive emotional tone.",
    "mode": "Major because the song conveys a bright and triumphant mood through its melodic and harmonic content."
  }
}