{
  "Sabrina Carpenter_Bed Chem": {
    "genre": "Pop",
    "track bpm": 90,
    "lyrics summary": "The lyrics of 'Bed Chem' by Sabrina Carpenter explore intense physical attraction and the anticipation of a passionate romantic connection, highlighting feelings of excitement and longing.",
    "lyrics sentiment": "Positive because the lyrics express excitement and anticipation about a new romantic connection.",
    "music energy": "Medium because the tempo is moderate and the song combines elements of pop and R&B, giving it a steady but not overly intense feel.",
    "music danceability": "High because the song projects a very danceable vibe with its consistent rhythm and pop influences.",
    "valence": "Medium because while the song has a playful and attractive theme, it also includes elements that give it a balanced emotional tone with both yearning and excitement.",
    "mode": "Major because the lyrical content and musical style generally have a bright and engaging tone."
  },
  "FLO_Fly Girl (feat. Missy Elliott)": {
    "genre": "Pop",
    "track bpm": "about 100",
    "lyrics summary": "The lyrics emphasize female empowerment and independence, stating that women do not need men for validation and celebrate self-care and community among women.",
    "lyrics sentiment": "Positive because the lyrics promote empowerment, independence, and self-assurance.",
    "music energy": "High because the track features an upbeat, lively production typical of pop music with its engaging rhythm.",
    "music danceability": "High because the consistent beat and rhythmic flow are designed to make people move.",
    "valence": "High because the upbeat energy and positive themes contribute to a joyful, empowering atmosphere.",
    "mode": "Major because the track evokes a triumphant and affirming tone through its melodic structure."
  },
  "Big Boss Vette_Pretty Girls Walk": {
    "genre": "Hip-Hop",
    "track bpm": 90,
    "lyrics summary": "Pretty Girls Walk is an upbeat anthem celebrating confidence and empowerment, focusing on the power and influence of pretty women.",
    "lyrics sentiment": "Positive because the lyrics emphasize confidence and empowerment, celebrating the impact of pretty girls.",
    "music energy": "High because the song has a fast tempo and upbeat production, contributing to a vibrant and lively feel.",
    "music danceability": "High because the strong, consistent beat and rhythm make it very suitable for dancing.",
    "valence": "High because the tone is uplifting and celebrates positive qualities.",
    "mode": "Major because the key of A Major gives it a bright and triumphant feel."
  },
  "The Kid LAROI_GIRLS": {
    "genre": "Pop",
    "track bpm": 101,
    "lyrics summary": "The lyrics of 'GIRLS' by The Kid LAROI explore themes of empowerment and self-worth, focusing on the desire for freedom and fun. The singer portrays a conversation where a girl expresses the simple wish to dance and enjoy life, moving past toxic relationships and embracing confidence in new romantic pursuits.",
    "lyrics sentiment": "Positive because the lyrics emphasize empowerment, joy, and the desire for freedom.",
    "music energy": "High because the song has an upbeat tempo, high energy, and is described as very danceable.",
    "music danceability": "High because the track is described as very danceable with a steady 4/4 beat and upbeat tempo.",
    "valence": "High because the lyrics and music convey feelings of joy, freedom, and positivity.",
    "mode": "Minor because the track is in the G minor key, creating a slightly introspective tone despite the upbeat energy."
  },
  "Addison Rae_Diet Pepsi": {
    "genre": "Pop",
    "track bpm": 150,
    "lyrics summary": "The song 'Diet Pepsi' by Addison Rae explores themes of youthful romance and passionate summer flings, using imagery like 'losing all my innocence in the backseat' to convey its message.",
    "lyrics sentiment": "Positive because the lyrics express the joy and excitement of young love and new experiences.",
    "music energy": "Medium because despite the lively tempo, the description suggests a balanced dynamic with a synth-pop style.",
    "music danceability": "High because the song is described as very danceable with a strong beat typical of pop anthems.",
    "valence": "High because the track captures the essence of youthful joy and romance.",
    "mode": "Major because the song is in the B♭ Major key, which lends a bright and resolved tonal quality."
  }
}