{
  "Megan Thee Stallion_Thot Shit": {
    "genre": "Hip-Hop",
    "track bpm": 130,
    "lyrics summary": "The song 'Thot Shit' by Megan Thee Stallion is a self-assertive anthem about female empowerment, independence, and confidence. The lyrics celebrate twerking and the artist's 'boss' status, as well as addressing critics and reinforcing personal pride.",
    "lyrics sentiment": "Positive because the lyrics express confidence, empowerment, and enjoyment.",
    "music energy": "High because the tempo is fast and the lyrics are delivered with intensity and assertiveness.",
    "music danceability": "High because the track has a strong, consistent beat suitable for dancing, particularly twerking.",
    "valence": "High because the mood is celebratory and confident, focusing on empowerment and enjoyment.",
    "mode": "Major because the track has a bright and assertive feel characteristic of dance tracks focused on empowerment."
  },
  "Saweetie_Tap In": {
    "genre": "Hip-Hop",
    "track bpm": 100,
    "lyrics summary": "The lyrics of 'Tap In' by Saweetie are centered around themes of self-assurance, female empowerment, and materialistic pleasure, as the artist encourages listeners to embrace their confidence and success.",
    "lyrics sentiment": "Positive because the lyrics promote self-confidence and empowerment.",
    "music energy": "High because the track features a fast tempo and intense delivery characteristic of braggadocio and confident hip-hop.",
    "music danceability": "High because the song has a strong, steady beat making it suitable for dancing.",
    "valence": "Medium because, although the energy is high, the minor mode may lend a slightly darker or more serious undertone to the positive lyrics.",
    "mode": "Minor because the song is in the A♯/B♭ key in a minor mode, which suggests a more introspective or serious tonality despite the confident themes."
  },
  "Saweetie_My Type": {
    "genre": "Hip Hop",
    "track bpm": 118,
    "lyrics summary": "The chorus of 'My Type' by Saweetie features a powerful declaration of Saweetie's preferences, focusing on an attraction to affluent men.",
    "lyrics sentiment": "Positive because the lyrics express confidence and celebratory themes around personal empowerment and preferences.",
    "music energy": "High because the track features bass-heavy beats and a powerful, anthemic feel.",
    "music danceability": "High because the track's consistent beat and tempo support a club-friendly, danceable rhythm.",
    "valence": "High because the tone is uplifting and celebratory, particularly in its empowering lyrics and energetic delivery.",
    "mode": "Major because the song is in the key of D major, contributing to its bright and assertive sound."
  },
  "Saweetie_ICY GRL": {
    "genre": "Hip Hop",
    "track bpm": 103,
    "lyrics summary": "The lyrics of 'ICY GRL' revolve around themes of success, confidence, and self-assurance. Saweetie raps about her luxurious lifestyle and determination to maintain her status, countering naysayers and expressing her independence.",
    "lyrics sentiment": "Positive because the lyrics express confidence and empowerment.",
    "music energy": "Medium because the track has average intensity and steady rhythm.",
    "music danceability": "High because the beat is strong and consistent, encouraging movement.",
    "valence": "High because the tone is uplifting and empowering, with a focus on confidence and success.",
    "mode": "Major because the song is in the G major key, contributing to its bright and triumphant sound."
  },
  "Megan Thee Stallion_Girls in the Hood": {
    "genre": "Hip Hop",
    "track bpm": 95,
    "lyrics summary": "An empowering track celebrating independence and defying societal norms, especially focusing on themes like self-assurance and confidently taking control of one's life as a 'hot girl'.",
    "lyrics sentiment": "Positive because the lyrics focus on themes of empowerment, self-confidence, and asserting independence.",
    "music energy": "High because the track features assertive bass and 808 drum beats, contributing to an intense and vibrant sound.",
    "music danceability": "High because the track has a strong, consistent beat suitable for dancing, enhanced by the prominent 808 drums.",
    "valence": "High because the overall tone is uplifting and empowering, celebrating independence and personal strength.",
    "mode": "Minor because despite its empowering and positive themes, hip hop often uses minor modes for depth and resonance."
  }
}