{
  "Thomas Rhett_Unforgettable": {
    "genre": "Country",
    "track bpm": 130,
    "lyrics summary": "A song that beautifully captures the essence of a special and memorable night between two people, narrating a vivid recollection of a specific date, when the singer met someone significant. The song is themed around nostalgia and cherishing cherished memories.",
    "lyrics sentiment": "Positive because the lyrics express joyful and romantic recollections of a special night, highlighting nostalgia.",
    "music energy": "High because the song has a fast tempo and exuberant dynamics.",
    "music danceability": "High because of the strong and consistent rhythm that suits dancing.",
    "valence": "High because of the uplifting and joyful theme in both music and lyrics.",
    "mode": "Major because the song is in a G major key, giving it a bright and resolved tonal quality."
  },
  "Thomas Rhett_Marry Me": {
    "genre": "Country",
    "track bpm": 86,
    "lyrics summary": "The song tells a poignant and emotionally charged story of unrequited love and missed opportunities. The lyrics revolve around unfulfilled romantic aspirations, where a woman desires a perfect wedding but realizes she's about to marry someone she doesn't truly love.",
    "lyrics sentiment": "Negative because the central theme is about unrequited love and the pain of missed romantic connections.",
    "music energy": "Medium because although the emotional content is strong, the tempo and instrumentation are typical for a relaxed country ballad.",
    "music danceability": "Low because the song features introspective lyrics and a slower tempo typical of narrative country songs.",
    "valence": "Low because the theme revolves around heartbreak and unfulfilled love.",
    "mode": "Minor because the song's emotional tone and lyrical content are dark and somber."
  },
  "Thomas Rhett_Life Changes": {
    "genre": "Country Pop",
    "track bpm": 88,
    "lyrics summary": "The song 'Life Changes' portrays the evolution of the narrator's life through various stages, reflecting on the unexpected and transformative aspects of life, emphasizing a sense of growth and acceptance.",
    "lyrics sentiment": "Positive because the lyrics express acceptance and a positive outlook on life's unpredictability.",
    "music energy": "Medium because the song maintains a steady rhythm and dynamic range typical of country pop.",
    "music danceability": "Medium because it has a consistent beat suitable for casual dancing.",
    "valence": "High because of the positive and uplifting lyrical themes concerning life changes.",
    "mode": "Major because the song is in G Major, which typically has a bright and resolved tonal quality."
  },
  "Walker Hayes_You Broke Up with Me": {
    "genre": "Country Pop",
    "track bpm": 120,
    "lyrics summary": "The song explores themes of self-empowerment, resilience, and moving on after a breakup. The narrator, who has been left by their partner, is determined to enjoy life without being burdened by regret or guilt.",
    "lyrics sentiment": "Positive because the lyrics express confidence and independence despite a breakup.",
    "music energy": "High because the track has an upbeat vibe that gets your feet tapping.",
    "music danceability": "High because the song's steady and upbeat rhythm invites movement.",
    "valence": "High because the tone is uplifting, expressing resilience and positivity.",
    "mode": "Major because the key is C Major, which typically conveys a bright and positive tonal quality."
  },
  "Old Dominion_Snapback": {
    "genre": "Country Pop",
    "track bpm": 100,
    "lyrics summary": "The lyrics reminisce about past experiences with a focus on nostalgia and timeless style, specifically symbolized by a snapback cap. The song describes falling for a girl wearing a snapback and cherishing memories.",
    "lyrics sentiment": "Positive because the lyrics express nostalgia and the joy of reminiscing about cherished memories.",
    "music energy": "Medium because the track has a steady rhythm and dynamic instrumentation typical of country pop music.",
    "music danceability": "Medium because it has a moderate beat suitable for casual dancing and tapping along.",
    "valence": "High because the tone is upbeat and the lyrics convey a joyful and nostalgic feeling.",
    "mode": "Major because the song has a bright and positive tonal quality common in country pop."
  }
}