{
  "MercyMe_Dear Younger Me": {
    "genre": "Contemporary Christian Music",
    "track bpm": 99,
    "lyrics summary": "The lyrics are a message from the present self to the younger self, imparting wisdom gained from personal experiences. The song acknowledges past pain and struggles while offering hope and encouragement for the future.",
    "lyrics sentiment": "Mixed because the lyrics reflect both the difficult experiences of the past and a hopeful message for the future.",
    "music energy": "Medium because the song has a reflective but steady tempo and instrumental intensity.",
    "music danceability": "Medium because the song has a steady beat suitable for light movement and sway.",
    "valence": "Medium because it combines themes of past struggles with hopeful and reflective tones.",
    "mode": "Major because the song conveys an overall hopeful and reflective message, typical of major key tonality."
  },
  "MercyMe_Shake": {
    "genre": "Contemporary Christian",
    "track bpm": 172,
    "lyrics summary": "The lyrics convey a story of personal transformation and redemption, focusing on a newfound sense of identity and freedom in faith.",
    "lyrics sentiment": "Positive because the lyrics express joy and a sense of hope through personal transformation.",
    "music energy": "High because the fast tempo and upbeat instrumentation convey enthusiasm and excitement.",
    "music danceability": "High because the song has a strong, energetic rhythm that encourages movement.",
    "valence": "High because the song's tone is joyful and uplifting.",
    "mode": "Major because the bright and cheerful melody supports a positive message."
  },
  "Sia_Never Give Up (From \"Lion\" Soundtrack)": {
    "genre": "Soundtrack",
    "track bpm": 120,
    "lyrics summary": "The song 'Never Give Up' by Sia is an inspirational anthem about resilience and determination. The lyrics emphasize not allowing setbacks to defeat oneself and continuing to rise after challenges.",
    "lyrics sentiment": "Positive because the lyrics express resilience, determination, and an uplifting message of not giving up.",
    "music energy": "Medium because the pace is steady and encouraging without being overly intense.",
    "music danceability": "Medium because the rhythmic structure supports gentle movement, fitting for an inspirational track.",
    "valence": "High because the overall tone is uplifting and encouraging, promoting a sense of hope and perseverance.",
    "mode": "Major because the track conveys a bright and inspirational sound throughout."
  },
  "Imagine Dragons_Thunder": {
    "genre": "Rock",
    "track bpm": 168,
    "lyrics summary": "The song 'Thunder' by Imagine Dragons lyrically focuses on lead vocalist Dan Reynolds' journey of overcoming various challenges to achieve his dreams of becoming a global icon in the music industry. The lyrics reflect themes of persistence and triumph over adversity.",
    "lyrics sentiment": "Positive because the lyrics express themes of overcoming challenges and achieving dreams.",
    "music energy": "High because the tempo is fast and the song is performed with the intensity typical of rock music.",
    "music danceability": "High because the beat is strong and consistent, driving the energetic feel of the song.",
    "valence": "High because the song conveys a triumphant and uplifting mood through both its lyrics and musical composition.",
    "mode": "Major because the song is in C Major, which generally has a bright and resolved tonal quality."
  },
  "Hailee Steinfeld_Most Girls": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song celebrates the strength, diversity, and individuality of women, highlighting societal expectations and affirming personal identity. It encourages embracing one's uniqueness while promoting solidarity among women.",
    "lyrics sentiment": "Positive because the lyrics are empowering and celebrate the diversity, strength, and individuality of women.",
    "music energy": "Medium because the track has pulsating beats suitable for a pop anthem, but not overly aggressive.",
    "music danceability": "High because the song features a strong, steady beat typical of pop music designed to be catchy and danceable.",
    "valence": "High because the lyrics and music together create an uplifting and empowering atmosphere.",
    "mode": "Major because the song has an uplifting and resolved tonal quality, supporting the theme of strength and positivity."
  }
}