{
  "Lady Gaga_Born This Way": {
    "genre": "Pop",
    "track bpm": 124,
    "lyrics summary": "The lyrics of 'Born This Way' promote self-acceptance, empowerment, and celebrate being true to oneself regardless of identity or background.",
    "lyrics sentiment": "Positive because the lyrics express empowerment and self-love.",
    "music energy": "High because the song features pulsating beats and intense rhythm.",
    "music danceability": "High because it has a consistent and strong beat ideal for dancing.",
    "valence": "High because the song's uplifting messages and energetic performance evoke joy and optimism.",
    "mode": "Major because the song's musical structure supports its uplifting and triumphant themes."
  },
  "La Roux_Bulletproof": {
    "genre": "Electropop",
    "track bpm": 123,
    "lyrics summary": "The lyrics are about self-empowerment and resilience, expressing an unwillingness to be hurt or manipulated again in love.",
    "lyrics sentiment": "Mixed because although the lyrics empower and assert self-confidence, there is an element of past struggle and emotional resilience.",
    "music energy": "High because the tempo is fast and the track features intense synth-driven instrumentation.",
    "music danceability": "High because of the strong, consistent beat and rhythm designed for dancing.",
    "valence": "Medium because although the song has an upbeat tempo and empowering lyrics, there's an underlying tone of defiance and past hurt.",
    "mode": "Minor because the melody and chord progression are in a minor key, giving it a slightly darker edge despite its upbeat energy."
  },
  "Flo Rida_Low (feat. T-Pain)": {
    "genre": "Crunk",
    "track bpm": 128,
    "lyrics summary": "The lyrics are focused on a club setting where the artists express admiration for women, particularly strippers, who 'get low' on the dance floor.",
    "lyrics sentiment": "Positive because the lyrics celebrate a fun, party atmosphere and admiration for dance moves.",
    "music energy": "High because the track features a fast pace and intense electronic beats.",
    "music danceability": "High because the song emphasizes a strong, consistent beat ideal for club dancing.",
    "valence": "High because the song evokes a fun, celebratory mood associated with dancing and nights out.",
    "mode": "Major because the song's tone is bright and upbeat, characteristic of many club hits."
  },
  "fun._Some Nights": {
    "genre": "Alternative Rock",
    "track bpm": 108,
    "lyrics summary": "The lyrics of 'Some Nights' explore themes of identity, internal conflict, and uncertainty, reflecting the millennial struggle with purpose and existential angst.",
    "lyrics sentiment": "Negative because the lyrics express existential angst, internal conflict, and uncertainty.",
    "music energy": "High because the melody is energetic and paired with powerful vocal delivery.",
    "music danceability": "High because the overall vibe is very danceable despite its introspective lyrics.",
    "valence": "Medium because the music contrasts emotionally charged lyrics with anthemic and energetic production.",
    "mode": "Minor because the song's introspective and conflicted themes create a moody atmosphere."
  },
  "Christina Aguilera_Lady Marmalade": {
    "genre": "Pop",
    "track bpm": 110,
    "lyrics summary": "The lyrics of 'Lady Marmalade' revolve around female empowerment, confidence, and allure, with characters exuding boldness and charisma.",
    "lyrics sentiment": "Positive because the lyrics express empowerment, confidence, and sensuality.",
    "music energy": "High because the track is described as having high energy and an upbeat tempo.",
    "music danceability": "High because the track is very danceable with a strong, consistent beat.",
    "valence": "High because the song's upbeat nature and empowering lyrics create a joyful and energetic atmosphere.",
    "mode": "Major because it is noted to be in F major, contributing to its bright and triumphant sound."
  }
}