{
  "Kanye West_Black Skinhead": {
    "genre": "Hip Hop",
    "track bpm": 130,
    "lyrics summary": "The lyrics of 'Black Skinhead' address racial tensions, societal critique, and the mental turmoil of the persona West embodies. It is a powerful statement of self-empowerment and defiance against conformity, rich with cultural references and personal reflections.",
    "lyrics sentiment": "Negative because the lyrics address racial tensions and depict a crumbling mental state, reflecting societal and internal conflicts.",
    "music energy": "High because the track features a strong drum kit and aggressive tone, maintaining intense dynamics throughout.",
    "music danceability": "High because the song has a pulsating beat and a consistent rhythm that makes it very danceable.",
    "valence": "Medium because, despite its aggressive and somber tone, the empowerment themes provide some emotional complexity.",
    "mode": "Major because the track, while aggressive, is composed in a key that offers a resolved tonal quality."
  },
  "Florence + The Machine_Dog Days Are Over": {
    "genre": "Indie Rock",
    "track bpm": 150,
    "lyrics summary": "The lyrics are about transformation and liberation, exploring themes of change, freedom, and leaving hardships behind.",
    "lyrics sentiment": "Positive because the lyrics express themes of freedom and overcoming difficulties, suggesting an uplifting and hopeful message.",
    "music energy": "High because the tempo is brisk and the instrumentation is vibrant and intense.",
    "music danceability": "High because the brisk tempo and strong rhythm make it easy to dance to.",
    "valence": "High because the tone is uplifting, celebrating liberation and the end of hardships.",
    "mode": "Major because the song has a bright and triumphant tonal quality that supports its positive message."
  },
  "Fred again.._Baxter (these are my friends)": {
    "genre": "Electronic",
    "track bpm": "about 120",
    "lyrics summary": "The song conveys mutual support and camaraderie between friends, where Baxter Dury expresses appreciation and connection to his friends, emphasizing their vital role in his life and his gratitude for their presence.",
    "lyrics sentiment": "Positive because the lyrics express appreciation, camaraderie, and gratitude towards friends.",
    "music energy": "Medium because it has a cheery and relaxing beat, indicating a balanced dynamic range.",
    "music danceability": "Medium because the beat is steady and relaxing, suitable for casual dancing.",
    "valence": "High because the elements of camaraderie and appreciation create an emotionally positive tone.",
    "mode": "Major because the music's cheery and uplifting feel suggests a resolved tonal quality."
  },
  "ODESZA_Across The Room": {
    "genre": "Electronic",
    "track bpm": "about 110",
    "lyrics summary": "The song captures a captivating encounter at a social gathering, detailing the narrator's attraction to an individual with a glowing appearance. It explores the magic of human connection and finding love in unexpected places.",
    "lyrics sentiment": "Positive because the lyrics express the joy and excitement of making a meaningful connection.",
    "music energy": "Medium because the song has a balanced dynamic range with a steady, soulful rhythm.",
    "music danceability": "Medium because the beat is present, facilitating light dancing, but not overpowering.",
    "valence": "High because the tone is uplifting and speaks to the joy of connection and romance.",
    "mode": "Major because the melody and overall song feel bright and resolved."
  },
  "cassö_Prada": {
    "genre": "EDM",
    "track bpm": 142,
    "lyrics summary": "The lyrics of 'Prada' explore themes of luxury, success, and self-confidence, likely focusing on affluent lifestyles and personal achievements.",
    "lyrics sentiment": "Positive because the lyrics express self-confidence and success within a luxurious lifestyle.",
    "music energy": "High because the tempo is fast and the track is described as having high energy.",
    "music danceability": "High because the track is described as very danceable with a consistent beat.",
    "valence": "High because the themes of success and luxury convey emotional positivity.",
    "mode": "Major because the track is in a G♯/A♭ major key, which gives it a bright and triumphant sound."
  }
}