{
  "The Script_The Man Who Can't Be Moved": {
    "genre": "Pop Rock",
    "track bpm": 125,
    "lyrics summary": "The lyrics follow the story of a man who waits hopelessly on a corner for a girl he loves, hoping she will come back to him. He refuses to move despite being talked about, illustrating his devotion and hope.",
    "lyrics sentiment": "Mixed because while the lyrics express hopeful devotion, there is an underlying sadness and longing about waiting for someone who might not return.",
    "music energy": "Medium because the song has a steady and driving rhythm typical of pop rock, but not overly intense instrumentation.",
    "music danceability": "Medium because the track has a steady and predictable beat that could be danced to, but is more focused on storytelling.",
    "valence": "Medium because the music has an uplifting yet emotionally complex tone, reflecting both hope and melancholy.",
    "mode": "Major because despite the sad theme, the music sounds uplifting and resolved."
  },
  "Gavin DeGraw_Not Over You": {
    "genre": "Pop Rock",
    "track bpm": 142,
    "lyrics summary": "The song deals with themes of lingering feelings and unreciprocated love, as the narrator struggles to move on from a past relationship while pretending to be fine.",
    "lyrics sentiment": "Negative because the lyrics express unresolved longing and heartache over a past relationship.",
    "music energy": "High because of the fast tempo and intense instrumentation.",
    "music danceability": "High because the song has a strong and consistent beat conducive to dancing.",
    "valence": "Medium because the lyrical content is melancholic but the music itself is upbeat.",
    "mode": "Major because the song's key is A# major, which gives it a brighter tonal quality despite sad lyrics."
  },
  "The Script_Breakeven": {
    "genre": "Pop Rock",
    "track bpm": 94,
    "lyrics summary": "A song exploring the emotional aftermath of a failed romantic relationship, focusing on heartbreak and the unequal distribution of pain.",
    "lyrics sentiment": "Negative because the lyrics express heartbreak and the emotional toll of a breakup.",
    "music energy": "High because the track has a powerful emotional delivery and strong instrumentation.",
    "music danceability": "Medium because it has a steady beat and can be grooved to, though not intensely dance-focused.",
    "valence": "Low because the themes are about heartbreak and loss, reflecting a more somber tone.",
    "mode": "Major because it is in a major key which adds a sense of brightness despite the somber lyrical themes."
  },
  "Andy Grammer_Fine By Me": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'Fine By Me' express romantic contentment and the willingness to embrace the uncertainties of love.",
    "lyrics sentiment": "Positive because the lyrics express joy and commitment in a romantic relationship.",
    "music energy": "Medium because the track has a balanced dynamic range typical of pop music.",
    "music danceability": "High because the song has an easygoing and rhythmic beat conducive to dancing.",
    "valence": "High because the tone is joyful and uplifting, reflecting positive emotions in the lyrics.",
    "mode": "Major because the melody and harmony sound bright and resolved, typical of pop love songs."
  },
  "John Mayer_Say": {
    "genre": "Pop Rock",
    "track bpm": 168,
    "lyrics summary": "The lyrics of 'Say' urge listeners to express what needs to be said, promoting authenticity and communication in the face of emotional restraint.",
    "lyrics sentiment": "Positive because the lyrics encourage open communication and self-expression as a means to overcome emotional barriers.",
    "music energy": "Medium because the song has a strong balladic quality with dynamic instrumentation but is not overly intense.",
    "music danceability": "Medium because the tempo is fast and the rhythm is steady, suitable for a relaxed groove.",
    "valence": "Medium because while the lyrics promote a positive message, the reflective nature adds emotional depth.",
    "mode": "Major because the key of A# Major provides a bright and resolved tonal quality, enhancing the song's uplifting message."
  }
}