{
  "Aretha Franklin_Respect": {
    "genre": "R&B/Soul",
    "track bpm": 115,
    "lyrics summary": "The lyrics of 'Respect' by Aretha Franklin convey a demand for dignity and equal treatment, particularly in the context of relationships, but have also been interpreted as an anthem for civil rights and women's rights movements.",
    "lyrics sentiment": "Positive because the lyrics emphasize empowerment and asserting one's value, resonating with themes of dignity and equality.",
    "music energy": "High because of its strong vocal delivery and dynamic instrumentation that drive the message powerfully.",
    "music danceability": "High because the track has a strong, steady beat suitable for dancing, typical of R&B.",
    "valence": "High because of its uplifting and empowering message conveyed through vibrant instrumentation and a major key.",
    "mode": "Major because the song is set in C Major, which supports its positive and empowering tone."
  },
  "Gloria Gaynor_I Will Survive - Single Version": {
    "genre": "Disco",
    "track bpm": 117,
    "lyrics summary": "The song expresses themes of resilience and empowerment, focusing on moving forward and overcoming challenges after a breakup with a callous ex.",
    "lyrics sentiment": "Positive because the lyrics express themes of overcoming adversity and personal empowerment after a breakup.",
    "music energy": "High because of its intense and pulsating disco beats, strong rhythm, and dynamic vocals.",
    "music danceability": "High because it has a strong, consistent beat suitable for dancing, typical of disco music.",
    "valence": "High because the song conveys feelings of empowerment and triumph.",
    "mode": "Minor because the song is in a minor key, which adds a slightly introspective tone despite its upbeat nature."
  },
  "Marvin Gaye_I Heard It Through The Grapevine": {
    "genre": "Soul",
    "track bpm": 115,
    "lyrics summary": "The song's lyrics convey a sense of shock and sadness as the narrator learns about his partner's unfaithfulness through rumors and gossip.",
    "lyrics sentiment": "Negative because the lyrics express betrayal and emotional pain due to infidelity.",
    "music energy": "Medium because the soulful rhythm maintains a steady and emotional groove.",
    "music danceability": "Medium because the groove is infectious, making it suitable for dancing, yet it's not overly fast-paced.",
    "valence": "Medium because the music well balances the soulful groove with a melancholic theme of betrayal.",
    "mode": "Minor because the melody and lyrical themes underscore a sense of emotional depth and introspection."
  },
  "Sam & Dave_Soul Man": {
    "genre": "Soul",
    "track bpm": 115,
    "lyrics summary": "The lyrics speak about a confident and generous 'soul man' who is self-assured and eager to bring love and help to those in need, coming like a hero on a journey to support others.",
    "lyrics sentiment": "Positive because the lyrics express confidence, generosity, and a sense of joyful self-assurance.",
    "music energy": "High because the tempo is upbeat and the instrumentation is lively, which creates an energetic feel.",
    "music danceability": "High because the song has a strong, consistent beat and rhythm that naturally encourages movement.",
    "valence": "High because the tone is joyful and uplifted, with themes of assurance and celebration.",
    "mode": "Major because the song is in C major key, which gives it a bright and resolved tonal quality."
  },
  "Marvin Gaye_Ain't No Mountain High Enough": {
    "genre": "Soul",
    "track bpm": 130,
    "lyrics summary": "The song communicates a message of unwavering devotion and support in the face of obstacles. It emphasizes that love knows no bounds, and no physical or emotional barriers can prevent one from being there for their loved one.",
    "lyrics sentiment": "Positive because the lyrics express unwavering romantic commitment and the joyous assurance of overcoming obstacles.",
    "music energy": "Medium because the song has a balanced dynamic range typical of soul music, with strong vocals and steady instrumentation.",
    "music danceability": "High because the rhythm and beat are strong and consistent, making it suitable for dancing.",
    "valence": "High because the song has an uplifting and joyous tone, celebrating love and commitment.",
    "mode": "Major because the melody and chord progressions are bright and resolved, typical of an uplifting soul song."
  }
}