{
  "Tate McRae_greedy": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song emphasizes themes of self-love, confidence, and self-worth with playful undertones. A recurring line suggests self-admiration and a nod to the idea of being smitten by oneself.",
    "lyrics sentiment": "Positive because the lyrics express self-love and confidence in a playful manner.",
    "music energy": "High because the track is described as an insatiable dance track and instant floor-filler.",
    "music danceability": "High because it is a dance track designed to be an instant floor-filler with a catchy pop melody.",
    "valence": "High because the tone is playful, uplifting, and revolves around themes of confidence and self-love.",
    "mode": "Major because the song exudes a bright, confident, and playful vibe."
  },
  "Olivia Rodrigo_vampire": {
    "genre": "Pop",
    "track bpm": 137,
    "lyrics summary": "The song is about feeling used and betrayed by someone who pretended to care but only took advantage.",
    "lyrics sentiment": "Negative because the lyrics express feelings of betrayal, hurt, and being used.",
    "music energy": "Medium because the song is described as having average energy and features emotional lyrics and instrumentation.",
    "music danceability": "Medium because while it has a steady tempo of 137 BPM, it's more driven by emotional storytelling than a strong dance beat.",
    "valence": "Low because the tone is somber and the lyrics convey sadness and betrayal.",
    "mode": "Major because it's in F Major, contributing to a bright, resolved tonal quality despite the sad lyrical content."
  },
  "Olivia Rodrigo_bad idea right?": {
    "genre": "Pop",
    "track bpm": 130,
    "lyrics summary": "The song 'bad idea right?' by Olivia Rodrigo humorously explores the well-known temptation to reconnect with an ex, especially for physical reasons, even when knowing it's a bad idea.",
    "lyrics sentiment": "Mixed because the lyrics acknowledge the humorous yet regretful nature of acting on an impulse to reconnect with an ex.",
    "music energy": "High because the tempo is fast and the song is described as exuberant.",
    "music danceability": "High because the song has a strong and consistent beat, making it very danceable.",
    "valence": "Medium because while the song has an upbeat and energetic feel, the theme of wrestling with poor decisions tempers the overall mood.",
    "mode": "Major because the key is described as A major, giving it a bright and resolved tonal quality."
  },
  "Olivia Rodrigo_all-american bitch": {
    "genre": "Pop-Rock",
    "track bpm": 156,
    "lyrics summary": "The lyrics of 'all-american bitch' explore the pressures and expectations on women to conform to ideal American standards.",
    "lyrics sentiment": "Negative because the lyrics address societal pressures and expectations, which often carry a critical tone.",
    "music energy": "High because it is described as energetic with a fast tempo.",
    "music danceability": "Medium because it is noted as somewhat danceable, likely due to the consistent beat at 156 BPM.",
    "valence": "Medium because while the energy is high, the thematic content is critical and addresses societal issues.",
    "mode": "Major because the track is in a major key, which often conveys brightness despite the lyrical content."
  },
  "Olivia Rodrigo_get him back!": {
    "genre": "Pop Rock",
    "track bpm": 162,
    "lyrics summary": "The lyrics reflect a longing to reconnect with someone loved in the past, capturing feelings of missing personal connections and romantic emotions.",
    "lyrics sentiment": "Mixed because the lyrics express both longing and negativity towards past actions and relationships.",
    "music energy": "High because the tempo is fast and the song has a major mode which supports intense performances.",
    "music danceability": "Medium because despite the high energy, its pop-rock structure is somewhat danceable but not primarily groove-centered.",
    "valence": "Medium because the song mixes feelings of regret and longing with an upbeat and energetic tone.",
    "mode": "Major because the melody and harmonic structure convey an upbeat and resolved tonal quality."
  }
}