{
  "Joji_TEST DRIVE": {
    "genre": "R&B",
    "track bpm": 75,
    "lyrics summary": "The song 'TEST DRIVE' by Joji explores the tension between fleeting and lasting romantic desires, with the narrator expressing frustration and heartache over unaligned intentions with their partner.",
    "lyrics sentiment": "Mixed because the lyrics convey both longing for a deeper connection and the pain of unfulfilled desires.",
    "music energy": "High because the track is described as having intense emotional delivery and driven production.",
    "music danceability": "High because it has a strong beat and is very danceable, despite its emotional tone.",
    "valence": "Low because the lyrics and minor key create a melancholic and introspective atmosphere.",
    "mode": "Minor because the track has a dark and unresolved tonal quality, supported by the emotional lyrics."
  },
  "keshi_right here": {
    "genre": "R&B",
    "track bpm": 160,
    "lyrics summary": "The song reflects on the end of a relationship, expressing a sense of moving on while cherishing past memories. It delves into the emotional complexity and ambivalence following a breakup, capturing the universal sentiment of post-relationship dynamics.",
    "lyrics sentiment": "Mixed because the song captures both melancholic reflections on a past relationship and a sense of moving forward.",
    "music energy": "Medium because while the song has emotional depth, it utilizes gentle melodies and a moderate tempo.",
    "music danceability": "Medium because the track has a steady beat that allows for some movement but is more focused on lyrical content and emotional delivery.",
    "valence": "Low because the overall tone is reflective and somewhat melancholic, dealing with the aftermath of a breakup.",
    "mode": "Minor because the song's mood is introspective and captures the complexity of post-breakup emotions."
  },
  "Sasha Alex Sloan_Older": {
    "genre": "Indie Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics of 'Older' by Sasha Alex Sloan explore the realization that parents are imperfect humans, similar to oneself. It reflects on the desire for an ideal family relationship filled with harmony and security but acknowledges the complexity and challenges of loving relationships as one matures.",
    "lyrics sentiment": "Mixed because the lyrics reveal a sense of longing for familial harmony but also acceptance of imperfections and the reality of human relationships.",
    "music energy": "Medium because the song likely has a balanced dynamic range and a moderate tempo.",
    "music danceability": "Medium because while the song has a steady rhythm, it is likely more reflective and introspective than dance-centric.",
    "valence": "Medium because the song balances themes of acceptance and understanding with a sobering realization about adult life.",
    "mode": "Major because the song is about acceptance and understanding, which likely resonates with a positive resolution."
  },
  "Chase Atlantic_Friends": {
    "genre": "Alternative Pop",
    "track bpm": 107,
    "lyrics summary": "The song 'Friends' by Chase Atlantic explores themes of past relationships, combining introspective lyrics and a haunting melody, reflecting on love, lust, and emotional distress.",
    "lyrics sentiment": "Negative because the lyrics delve into themes of love, emotional distress, and the darker sides of human emotions.",
    "music energy": "High because the combination of dark and moody elements with contemporary beats creates a sense of intense emotional expression.",
    "music danceability": "Medium because the song features a strong beat and contemporary rhythms, but is not solely focused on danceable structures.",
    "valence": "Low because the song has a melancholic tone and the lyrics express emotional distress.",
    "mode": "Minor because the song is in the key of B minor, contributing to its dark and moody atmosphere."
  },
  "Jeremy Zucker_scared": {
    "genre": "Pop",
    "track bpm": 108,
    "lyrics summary": "The lyrics of 'scared' explore themes of vulnerability and fear, depicting a confessional conversation about human emotions and relationships.",
    "lyrics sentiment": "Mixed because the lyrics express vulnerability and fear but also touch on themes of introspection and presence.",
    "music energy": "Low because the song has a somber and intimate feel and is described with low energy.",
    "music danceability": "Medium because the tempo is moderately paced and allows for some groove, but it's not primarily dance-focused.",
    "valence": "Medium because the song balances somber and introspective themes against a major key, creating a nuanced emotional landscape.",
    "mode": "Major because the song is in the F major key, which typically conveys a brighter, more resolved sound."
  }
}