{
  "video_id": "-5ztdzyQkSQ",
  "title": "30-Minute Full-Body Strength-Training Workout With Weights",
  "description": "Get ready for a full-body strength-training workout with Nike Global Master Trainer Betina Gozo. This workout includes circuits to work every muscle. Grab a pair of medium weights, anywhere from 8 to 20 pounds, and get ready for a challenge with a series of exercises including tempo squats, single-leg deadlifts, and skaters. After this workout, you'll feel strong, sculpted, and just the right amount of sore.\r\n\r\nFind more from Betina on:\r\nhttps://www.instagram.com/betinagozo/\r\nhttps://www.trainwithbetina.com/\r\n\r\n\r\nOn Betina: Nike\r\nOn Anna: Victoria Sport bra and leggings, Glyder tank, and APL shoes\r\nOn Kristel: Victoria Sport outfit and APL shoes\r\n\r\nPOPSUGAR Fitness offers fresh fitness tutorials, workouts, and exercises that will help you on your road to healthy living, weight loss, and stress relief.  Check out Class FitSugar, our do-it-along-with-us real-time workout show hosted by Anna Renderer who will inspire you to sweat alongside fitness experts and Hollywood’s hottest celebrity trainers. Class FitSugar regularly covers the most buzzed-about workout classes and trends, including the Victoria's Secret workout, Tabata, P90X, Bar Method, and more.\r\n\r\nSubscribe to POPSUGAR Fitness!\r\nhttps://www.youtube.com/subscription_center?add_user=popsugartvfit\r\n\r\nLike us on Facebook!\r\nhttps://www.facebook.com/PopSugarFitness/\r\n\r\nCheck us out on Instagram!\r\nhttps://www.instagram.com/popsugarfitness/\r\n\r\nEat Clean with POPSUGAR\r\nGet a full 2-week clean-eating plan with our brand-new app! 70 recipes for breakfast, lunch, dinner, snacks, and treats, simple shopping lists, and more!  Get the app here: https://itunes.apple.com/us/app/clean-eating-plan-and-recipes/id1262482098?mt=8\r\n\r\nVisit POPSUGAR!\r\nhttps://www.popsugar.com/fitness/30-Minute-Strength-Training-Workout-Weights-46353427",
  "channelTitle": "PS Fit ",
  "channelDescription": "The brand you know and love as POPSUGAR is now PS, and our popular workout series (including Class Fitsugar, Dance Fitsugar, and Breathe Fitsugar) are now united under a single brand: PS Fit.\n\nPS has long dominated the fitness space as the No. 1 source for free at-home workouts on YouTube, and that’s not changing. We will continue to create workouts for every fitness level, including no-equipment exercises, HIIT workouts, yoga flows, and more. \n\nOn PS Fit, you’ll find videos ranging from five to 60 minutes in length. You can choose to exercise specific body parts and select the level of intensity that works for you. Maybe you want to combine your cardio with dance via a salsa, ’90s pop, or hip-hop workout. If you’re in the mood for stretching, yoga, or meditation, we’ve got you covered there, too. Whatever you choose, you can be confident that all of our workouts are designed and led by knowledgeable and credentialed experts.\n",
  "tags": [
    "POPSUGAR Fitness",
    "FitSugarTV",
    "workout class",
    "fitness",
    "fitness video",
    "10 minute workout",
    "bikini body",
    "work out",
    "class fitsugar"
  ],
  "publishedAt": "2019-07-14T16:43:09Z",
  "duration": 2078,
  "durationFormatted": "34:38",
  "viewCount": 4039088,
  "likeCount": 55734,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-5ztdzyQkSQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-5ztdzyQkSQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-5ztdzyQkSQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-5ztdzyQkSQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-5ztdzyQkSQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-5ztdzyQkSQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "their perkiness while im dying in this workout <br>is like a morning person chatting with me before I&#39;ve had my coffee.<br>props for the energy though guys",
    "I did this 3 years after Covid. This had helped me reduce from a hefty 93 kg to 77 kg. Now I am again out of shape but staying optimistic by restarting where I had begun. Wish me luck! ❤😊",
    "By far, one of the best instructors, She combined compound exersices within a well designed workout",
    "This channel helped me lose 50lbs in 4 months in 2019 I effed around got lazy now here we are to see how fast and much I can lose again. Back to the basics!",
    "I cried at the end of this video, because I finally found an exercise that pushes me and that I can do even with my injuries I’ve had for years. They were tears of joy and accomplishment. This video is SO GOOD!!"
  ],
  "channelSubscriberCount": 6500000,
  "channelVideoCount": 1928
}