{
  "video_id": "-_6uhR46pvE",
  "title": "20 MIN EXPRESS PILATES WORKOUT || Power Pilates For Energy (Moderate/Intermediate)",
  "description": "Get ready to move with this Express Power Pilates Workout! This faster paced class is perfect for when you are short on time but still want to sweat and feel energised! 😊\n\n\n🤍 INSTAGRAM: @movewithnicole\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole Pty Ltd will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 20 minutes full body",
    "pilates workout 20 minutes",
    "20 minutes pilates workout",
    "20 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates workout",
    "20 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "move with nicole",
    "mat pilates",
    "everyday pilates",
    "express pilates",
    "power pilates",
    "pilates"
  ],
  "publishedAt": "2023-11-02T10:46:53Z",
  "duration": 1473,
  "durationFormatted": "24:33",
  "viewCount": 1829766,
  "likeCount": 43758,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-_6uhR46pvE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-_6uhR46pvE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-_6uhR46pvE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-_6uhR46pvE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-_6uhR46pvE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-_6uhR46pvE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I hope you enjoy this new express class! Let me know what you would like to see next.😊<br><br>Apologies if my voice sounds odd in this one. I just bought a new microphone and it might take me a while to get the settings right. 🙈 <br><br>Sending you all big hugs 🩷",
    "I’ve been working out with your videos for 15 months and words can’t express how profoundly grateful I am for what you share so freely, lovingly and skillfully. My daily workouts with you have given me a pathway out of pain and into the strength I’ve needed to maintain a pain-free existence. My deepest thanks and well wishes to you dear Nicole!",
    "brother how y&#39;all doing this, i had to take a 5 minute break after 10 minutes 😭<br><br>Also thank you Nicole for these 20-30 minute videos, between college and work these little pilates sessions help me get a bit of excercise in, I&#39;ve grown to fall in love with your videos, the last few weeks were exceptionally hard and coming to your page and listening to your voice and working out with you helped me a lot, I&#39;d always just drop by your page whenever i feel overwhelmed or anxious, im really grateful to have found your videos &lt;33",
    "What a great workout! Truly a killer for only 20 minutes. Love to see Remmy be a guest in todays video too &lt;33",
    "83 days ago I had a bilateral mastectomy to remove breast cancer. I have SLOWlY worked my way back to my former strength and flexibility. I can now do this complete video. 🎉 Surgery #2 is in two days, and I will go back to limitations for a while. But I am so happy that you have standing workouts and other tools that I can modify on my road to recovery. Nicole, my life is better for your work! Immeasurable gratitude sent your way."
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}