{
  "video_id": "-D_xz-wSnaw",
  "title": "60 MIN (FULL BODY) WALKING CARDIO & STRENGTH WORKOUT! 💪 LOW IMPACT HIIT! 😅",
  "description": "#lowimpactcardio #strengthtraining #over50fitness \n\nWelcome to this Standing Walking Cardio & Strength Full Body HIIT workout, designed specifically for women over 50! This 60-minute HIIT workout combines 30 minutes of cardio and 25 minutes of strength training, including a standing cooldown and stretch. Perfect for those looking to boost metabolism, improve muscle tone, and increase overall fitness.  This full-body workout is ideal for women who want to stay strong, energized, and fit at any age.  This walking cardio has about 3,000 steps!\n\nWe do the hard work for 45 seconds, followed by 15 seconds of rest.  We will repeat some moves after the rest and boost the intensity the second time around!  \n\nThere is a short warm up and cooldown in the 30 minute cardio routine, then we take a 30 second rest and go right into the 25 minutes of strength training (with 5 lb weights) which also works in 45 and 15 second intervals and includes a standing stretch and cool down at the end. ￼   Beginners can work with 1, 2 or 3 lb weights or no weights, it will still be an effective workout.\n\nThis workout is geared towards an intermediate to advanced level, but beginners are very welcome. I give you options so you can work at your own level, so give it a try! ￼\n\nWhy HIIT is Great for Women Over 50:\nHigh-Intensity Interval Training (HIIT) is one of the most effective workouts for women over 50. Why? HIIT workouts involve alternating periods of intense effort with short rest periods, which boosts your heart rate, improves cardiovascular health, and helps to burn fat even after your workout is over (known as the \"afterburn\" effect). This makes HIIT a time-efficient way to get maximum benefits in a short amount of time—perfect for busy lifestyles.\n\nHIIT also improves muscular endurance, builds lean muscle mass, and supports bone health—all crucial aspects of aging well. Plus, it increases the body’s ability to use oxygen efficiently, improving stamina for daily activities. The combination of cardio and strength in this workout will leave you feeling stronger, more energized, and more confident, while also promoting fat loss and muscle definition.\n\nWhether you’re new to fitness or looking to challenge yourself with a comprehensive, low-impact routine, this workout will help you build endurance, increase flexibility, and promote a healthy heart. I will guide you through every move, ensuring proper form and modifications, making it perfect for all fitness levels.\n\nJoin this cardio-strength workout today and take control of your health and wellness. It's time to feel strong, confident, and empowered—no matter your age!  Grab some water and let’s get started!\n\nIf you enjoy this workout, please subscribe and hit the notification bell for more great workouts for women over 50.  Your likes, comments and shares are also appreciated, as it helps me know what videos are working for you! Thank you.\n\nPlease follow me on my socials:\n\nhttps://www.facebook.com/carly.mckinlay.92  \nhttps://www.instagram.com/carly_mckinlay/\nhttps://www.tiktok.com/@carlymckinlay13\n\nDisclaimer: Be sure to consult your doctor before beginning this or any exercise program. Not all exercises are suitable for everyone. By engaging in these workouts, you agree that you do so at your own risk, and assume all associated risk of injury.\n\nCHAPTERS:\n00:00  INTRO 60 MIN FULL BODY HIIT \n00:35  WARM-UP\n03:25  WALKING CARDIO WORKOUT\n28:25  CARDIO COOLDOWN\n31:07   30 SECOND BREAK\n31:37  STRENGTH TRAINING\n49:44  COOLDOWN/STRETCH\n56:50  EXTRO\n\n#hiitworkout \n#walkingcardio",
  "channelTitle": "CARLY MCKINLAY",
  "channelDescription": "I’m so glad you found my lifestyle channel! \n\nI love to share my passions for FITNESS, FASHION, FOOD & FUN!  That's the '4' in Crazy 4 Carly.  I'm actually Crazy 4 You! \n\nI am a certified fitness instructor and offer doable, fun, multi level and safe, home fitness workouts for 'mature' women and men, 45-75 years and beyond.  I love to inspire you to help you achieve your health and fitness goals!  \n\nI include some meditation videos as well.  The benefits of meditation on mental health, complements the physical health I like to promote. \n\nI also have a passion for fashion so I love to share fun fashion hacks and tips.  And more food tips coming soon!\n\nMy mandate:  Life should always be a fun, positive, beautifully healthy and fabulous experience! \n\nI appreciate you working out with me. 🤗\n\nLet’s get and stay fit together and have some fun!  Let's get started!",
  "tags": [
    "HIIT workout",
    "fitness for women over 50",
    "full body workout",
    "cardio and strength",
    "cardio for women over 50",
    "strength training over 50",
    "low impact workout",
    "workout for older women",
    "fitness for seniors",
    "metabolism booster",
    "strength and cardio routine",
    "50+ fitness",
    "60-minute workout",
    "women’s fitness",
    "fitness over 50",
    "full body HIIT",
    "workout for all fitness levels",
    "low impact HIIT",
    "women’s strength training",
    "fitness routine for women",
    "healthy aging",
    "standing workout over 50"
  ],
  "publishedAt": "2025-02-21T01:09:50Z",
  "duration": 3457,
  "durationFormatted": "57:37",
  "viewCount": 931,
  "likeCount": 31,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-D_xz-wSnaw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-D_xz-wSnaw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-D_xz-wSnaw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-D_xz-wSnaw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-D_xz-wSnaw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-D_xz-wSnaw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hope you enjoy this full body workout!  It really does cover all the bases.  Have fun with it and please let me know how you liked it and if you did the entire workout!  Enjoy!  🙂",
    "gonna try it now! thank you so much for the vid <a href=\"UCkszU2WH9gy1mb0dV-11UJg/dv90XtfhAurw8gTgzar4DA\"></a>",
    "I just saw this video clip and am going to subscribe and try.  Thank you"
  ],
  "channelSubscriberCount": 1340,
  "channelVideoCount": 153
}