{
  "video_id": "-jq1zpwk6gI",
  "title": "METABOLIC CONDITIONING [30 min Full Body Dumbbell Workout]",
  "description": "Boost your metabolism and get strong! This 30 minute full body strength session is a metabolic conditioning workout! The purpose of a metabolic conditioning workout is to increase your metabolism even after the workout is complete! We will do this with intense pushes and short rest sets! This workout is fun, but it is also tough! Lift heavy and give it your all!\n\n30 MINUTE METABOLIC CONDITIONING WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 15lbs to 45lbs / 7 - 20kg. Aim for a moderately heavy weight for your fitness level!\n\nSTRUCTURE\n2 FULL BODY FOCUSED CIRCUITS\nREPEAT EACH CIRCUIT TWICE\n4 TOTAL CIRCUITS\n7 EXERCISES PERCIRCUIT\nWORK: 45 SECONDS REST: 10 SECONDS\nREST BETWEEN ROUNDS: 45 SECONDS\n\nI am so glad you joined me for this workout! It's always better to workout with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://liketk.it/43vK1\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2023-04-13T08:59:38Z",
  "duration": 1872,
  "durationFormatted": "31:12",
  "viewCount": 207606,
  "likeCount": 5233,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-jq1zpwk6gI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-jq1zpwk6gI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-jq1zpwk6gI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-jq1zpwk6gI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-jq1zpwk6gI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-jq1zpwk6gI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I am in love with how I feel after a workout with you-NOT during 🤣but after I feel freaking amazing!",
    "I&#39;m just so happy to start coming across channels that are doing strength training. Honestly, it is so important for women!",
    "Epic. I started following your rides in February, but didn&#39;t subscribe to the calendar until March.. I have type 1 diabetes, addison&#39;s disease (I don&#39;t make adrenaline), and have Hashimoto&#39;s..my weight has been hard to control, but GIRL... with your calendars, workouts, and motivation and modifications, I&#39;ve lost 20 lbs and feel better than I have in years. Thank you for doing this. I couldn&#39;t have done it without you rallying me on. 💕",
    "I love that you’re not overly peppy while I’m struggling with my weights. I feel like I’m training with a good friend.",
    "I felt like I needed a full body workout tonight as we have been iced in for all week and I&#39;m starting to lose my mind! I don&#39;t remember doing this one and I hadn&#39;t liked it, so I must have missed it. I love this type of format! Here&#39;s to being stronger to weather the &quot;storms&quot; that come our way. As always thank you for being part of my journey."
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}