{
  "video_id": "-rwby0zA6Vs",
  "title": "Easy Leg Exercises for Stroke Patients (Guided by a Physical Therapist)",
  "description": "Regain your strength and mobility with these gentle leg exercises designed specifically for stroke patients!\n\nLed by a friendly and experienced physical therapist, this 10-minute video guides you through a series of exercises you can easily do from the comfort of your chair. Lily, your therapist, will be right there with you every step of the way, offering clear instructions and helpful tips.\n\nWe'll focus on strengthening your glutes, hips, and ankles – key areas for improving your overall mobility.  Lily will show you how to modify each exercise, ensuring they're just right for you, no matter where you are in your recovery journey.\n\nWhether you're a stroke survivor looking to regain your independence or a caregiver wanting to support your loved one, this video is your perfect companion. Let's take those first steps towards a stronger, more active you – together!\n\nYou can also download our free eBook + recovery newsletter with over 25 pages of free physical therapy exercises in a beautifully illustrated PDF.\n\nVisit https://www.flintrehab.com to learn more!\n\n @Flintrehab  is a leader in research backed stroke and neuro rehabilitation tools designed to provide faster, more effective recovery from stroke, TBI, and spinal cord injury. Safe, FDA listed, and clinically validated to help you recover, Flint Rehab customers include 300+ rehab facilities, 45% of top-ranked hospitals, and over 10,000+ home customers across more than 41+ countries.\n\nLearn more at https://www.flintrehab.com/",
  "channelTitle": "Flint Rehab",
  "channelDescription": "We build resources and tools for people recovering from stroke, TBI, and SCI. Learn more at www.flintrehab.com",
  "tags": [
    "leg exercises for stroke patients",
    "stroke exercises",
    "stroke exercises for legs",
    "stroke exercises physical therapy",
    "stroke recovery",
    "stroke rehabilitation"
  ],
  "publishedAt": "2018-07-05T21:18:10Z",
  "duration": 623,
  "durationFormatted": "10:23",
  "viewCount": 942286,
  "likeCount": 8836,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-rwby0zA6Vs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-rwby0zA6Vs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-rwby0zA6Vs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-rwby0zA6Vs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-rwby0zA6Vs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-rwby0zA6Vs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Download Flint Rehab&#39;s FREE rehab exercise PDF here: <a href=\"https://flnt.rehab/2LpX5yT\">https://flnt.rehab/2LpX5yT</a>",
    "I&#39;m a retired Home Health Aide and work with stroke patients. I thank the therapist that came in the home and show me exercise to work with my patients.",
    "Thank you madam I&#39;ve got my 3rd stroke last Nov.2019 before pandemic thank God still I&#39;m here the first time I had stroke Jan 2021 I&#39;ve brought to rural hospital in Pampanga were 5  who brought to the hospital then but sadly four of them died Ang I survived  luckily!! GOD STILL HAVE A PLAN ON ME! I WILL CONTINUE TO BE GOOD TO EVERYONE THIS IS THE ONLY STRENGTH<br>THAT I IKNEW  I POSSES.DAN OÑATE FROM PHILIPPINES ❤️",
    "I’m a stroke survivor myself. I suffered from Ischemic stroke 2 years ago. but life goes on keep fighting stroke survivors.",
    "Am Stroke recover since 2012. Don&#39;t give up, these exercises Hav seen to be very good and have encouraged me. I thank u so much for these exercises are keeping me busy and energetic. It&#39;s wonderful<br> I thank u sincerely"
  ],
  "channelSubscriberCount": 29400,
  "channelVideoCount": 66
}