{
  "video_id": "-SD_MucCa6c",
  "title": "13 min. Full Body Stretch Routine For Tight Muscles| Beginner Friendly",
  "description": "Build Muscle & Sculpt Your Body with my Full Body Workout Guides:\n↪︎ https://tonimitchell.com/\n\n\nRelax with me during this full body stretch routine while loosening up tight muscles. This stretch session is great for flexibility and mobility. No equipment needed.\n \n\nMy Instagram: \n@toningtoni\nhttps://www.instagram.com/toningtoni",
  "channelTitle": "Toni Mitchell",
  "channelDescription": "Learn to feel stronger, healthier, and fitter by staying active and adding more plant-based foods into your diet! \n\nHey there, I'm Toni!  My journey to veganism began in 2014, driven by a desire for peak health, a greener planet, and a lighter carbon footprint. Year 2016 sparked my passion for fitness—discovering the power of a plant-based diet when matched with weight training I decided to document my journey. \nI started sharing my experiences online, not just to show how, but to show others that it’s possible to build muscle while thriving on plants! As a vegan certified personal trainer & nutrition coach with a B.S. in Dietetics, I know firsthand that plant-based nutrition and movement can unlock your best self!\n\n\n\nVegan| Fitness| Health & Wellness| Lifestyle\n",
  "tags": [],
  "publishedAt": "2021-05-30T21:43:56Z",
  "duration": 806,
  "durationFormatted": "13:26",
  "viewCount": 4412181,
  "likeCount": 102938,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-SD_MucCa6c/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-SD_MucCa6c/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-SD_MucCa6c/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-SD_MucCa6c/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-SD_MucCa6c/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-SD_MucCa6c\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "love this warm up stretch in 2024 - anyone else watching in 2024 - this will prolly be my warm up",
    "this one is so thorough, thank you! I made a lot of progress with these stretch routines",
    "Day 1 of my health and wellness journey and this video was a great way to start my morning. Glad I found it. Thank you.",
    "Your clock and heads up clips are more than just helpful. They seem like an obvious necessity for any person doing workout videos. <br><br>Thanks for being so thoughtful to your viewers.",
    "I just tried these stretches. Stiff as I can be but kept doing them anyway! I will continue to do these stretches every day. Hey gotta start somewhere!"
  ],
  "channelSubscriberCount": 528000,
  "channelVideoCount": 109
}