{
  "video_id": "-Ts01MC2mIo",
  "title": "Chair Yoga | Yoga With Adriene",
  "description": "Chair Yoga invites you to find mobility in a way that is soft and gentle but also really supportive and beneficial. This 17 minute practice invites awareness and integrity into the body, specifically the line of the spine. Activate the muscles that help you find length up through the spine for better posture and energy flow. Great Yoga For Seniors as well!\n\nShare with a friend and let me know how it goes do. Chair Yoga invites you to find mobility that can be soft and gentle but also really supportive, strengthening, stabilizing and beneficial. This 17 minute practice invites awareness and integrity into the body, specifically the line of the spine. Activate the muscles that help you find length up through the spine for better posture and energy flow. Great Yoga For Seniors as well!\n\nShare with a friend and let me know how it goes down below! Namaste.\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga",
    "chair yoga",
    "yoga for seniors",
    "gentle exercise",
    "chair yoga for seniors",
    "yoga at home",
    "seniors",
    "gentle yoga",
    "yoga for beginners",
    "beginners yoga",
    "office yoga",
    "seated yoga",
    "yoga (sport)",
    "beginner yoga",
    "adriene mishler",
    "desk yoga",
    "yoga at your desk",
    "yoga in chair",
    "yoga for senior citizens",
    "senior yoga",
    "yoga for disabilities",
    "chair yoga exercises",
    "free yoga",
    "wellness",
    "online yoga class",
    "austin yoga instructor",
    "morning yoga"
  ],
  "publishedAt": "2017-07-23T08:00:00Z",
  "duration": 1045,
  "durationFormatted": "17:25",
  "viewCount": 3393919,
  "likeCount": 33747,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-Ts01MC2mIo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-Ts01MC2mIo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-Ts01MC2mIo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-Ts01MC2mIo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-Ts01MC2mIo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-Ts01MC2mIo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hi, Adriene! I am an 81 year old woman. I have been doing your chair yoga routine for a few days. I find that when I&#39;m done I feel very relaxed. This routine is giving me more strength and allowing me to move better. I even breathe better. Thank you so much for this video, you have made a real difference in my life.",
    "I am 54, but my doctor recommended this chair yoga with Adrienne due to my numerous illnesses and sedentary lifestyle.  This shouldn&#39;t be called for seniors maybe newbies or easy yoga.  This is great in many ways!!!! Thank you.",
    "I&#39;m partnered via FB with a friend 2,000 miles distant. We&#39;re trying this program to challenge our sedentary life style. I&#39;m 87; she&#39;s in her late 70s. Will try to stay with the program!",
    "I had started yoga with Adriene during the Pandemic and my fight with cancer.  It helped with my physical and spiritual strength.  Thank you!",
    "<a href=\"https://www.youtube.com/watch?v=-Ts01MC2mIo&amp;t=1028\">17:08</a> <br>I’m 67 and been following Adrien for years now . <br>This was the first chair yoga ever for me .  The arthritis in my hands makes  it super painful to do down dogs and flow when using hands for bearing weight  so painful. <br><br>I just loved this chair practice  and found that comfortable healthful feeling of breath and movement in equanimity .<br>Even on a Chair!<br>Thank you <br>Much gratitude"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}