{
  "video_id": "-W_8e357wYA",
  "title": "HIIT Workout - Insane 30 Minute Treadmill Workout",
  "description": "Looking for a HIIT workout on the treadmill TO BURN SOME FAT!? Try this Insane 30 Minute Treadmill Workout with Dr. Kevin Sarich, DC. #HIIT #HIITWorkout #Treadmill\n\nRunning on the treadmill can be easier than running outdoors, for a variety of good reasons. Treadmills give you complete control, enabling you to adjust the speed, incline, warm-up period, cool-down period, and amount of energy you expend. \n\nI recommend you try this 30 minute treadmill workout to take your fitness to the next level!\n\nI will be your own personal fitness instructor, motivating you to the very end of the treadmill workout!\n\nHIIT workouts - known as High Intensity Interval Training, are the most effective way to burn fat in the shortest amount of time possible. However, most people don't utilize this type of workout enough. \n\nIt's recommend to perform a 10-30 minute HIIT workout 2-3 times a week, with 24 hour rest in between HIIT workouts, in addition to other variety of fitness activities. \n\nThis treadmill workout video is 30 minutes of sprint training, going as hard as you can for 12 rounds of 30 seconds, spaced with 90 seconds of low intensity. \n\nWe start the treadmill workout with a 5 minute warm-up and finish the workout with a 3 minute cool-down. Please make sure you do both to reduce risk or injury! \n\n\nTo learn more visit:\nhttps://www.abundantyouchiro.com/ - Holistic Wellness Center Columbus, Ohio\nhttps://abundantyou.com/ - Natural Health Made Easy Blog\nhttps://askdrkevin.com/ - Ask Dr. Kevin a question!\n\n-~-~~-~~~-~~-~-\nCheck out our NEWEST killer HIIT video done on any type of static bike: \"HIIT Workout - Insane 25 Minute Spin Bike Workout\" \nhttps://www.youtube.com/watch?v=-_BlExYIimM\n-~-~~-~~~-~~-~-",
  "channelTitle": "AbundantYou with Dr Kevin",
  "channelDescription": "Abundant You is a natural health website dedicated to all aspect of health and wellness as it relates to you! Helping people accomplish higher overall health and better well-being.\n\nOur YouTube channel is a great shortcut to stay connected with us and help others online! The Abundant You team will upload new natural health made easy videos, natural  articles, workouts and of course delicious recipes!\n\nPlease subscribe and share our channel!  Let's make a positive impact in the natural health & wellness community! \n\nFeel free to leave constructive comments or ask questions! We appreciate you, thanks for watching. You can learn more about our natural health made easy website by visiting https://www.abundantyou.com/\n\nP.S. Do you live around Columbus Ohio? Or know someone that does? We have a natural holistic wellness center you can visit and get personal 1 on 1 help to reach your specific health goals. You can learn more about our clinic at https://abundantyouchiro.com/",
  "tags": [
    "HIIT",
    "HIIT Workout",
    "Treadmill Workout",
    "Fat Loss Workout",
    "Treadmill Fat Loss",
    "High Intensity Interval Training",
    "30 Minute Treadmill Workout",
    "Fat Burning",
    "30 Minutes",
    "Fitness",
    "Health",
    "fat loss",
    "weight loss",
    "interval training",
    "30 minute workout for belly fat",
    "fat burning workout",
    "cardio workout"
  ],
  "publishedAt": "2019-01-19T23:16:16Z",
  "duration": 1893,
  "durationFormatted": "31:33",
  "viewCount": 853955,
  "likeCount": 10753,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/-W_8e357wYA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/-W_8e357wYA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/-W_8e357wYA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/-W_8e357wYA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/-W_8e357wYA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/-W_8e357wYA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "✅ Don&#39;t forget to hit the LIKE button and SUBSCRIBE 👍\r<br>📕 Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕 ►<a href=\"https://www.abundantyou.com/7-hiit-secrets-ebook/\">https://www.abundantyou.com/7-hiit-secrets-ebook/</a>",
    "These HIIT workouts dropped my fat from 14% to 8% with a clean diet. Would really reccomend!",
    "I tried doing this workout 2 months ago ane couldn&#39;t complete 6 rounds. I did it again today , completed all rounds and had more energy for a couple more rounds. It&#39;s amazing to see your body getting stronger. To anyone who couldn&#39;t finish it the first time , hang in there , you&#39;ll make  it as you get fitter.",
    "This workout really helps with my depression, whenever I feel down I do this workout and I always get in a better mood! 😄",
    "Hands down the best workout I’ve done. I love that the video is the duration of the workout. Awesome!  It’s like having a personal trainer."
  ],
  "channelSubscriberCount": 58900,
  "channelVideoCount": 45
}