{
  "video_id": "0A3EgOztptQ",
  "title": "The ONLY Dumbbell Workout That You NEED (FULL BODY)",
  "description": "The ONLY Dumbbell Workout That You Need! Minimal Equipment Needed for Maximum Gains!\nSubscribe to Mind Pump TV: https://www.youtube.com/mindpumptv\nINSTAGRAM: https://www.instagram.com/mindpumpmedia/\n\nFollow this Dumbbell Workout for Optimal Muscle Growth!\n\n1. Walking Lunges 3x8-12 Reps\n2. Dumbbell Rows 3x8-12 \n3. Chest Press 3x8-12\n4. Dumbbell Shoulder Press 3x8-12 \n5. Dumbbell Bicep Curls Alternating 3x8-12\n6. Dumbbell Tricep Extension 3x8-12 \n\nRest for 60 Seconds Between Sets.\n\nFor Added ABS Exercise add 3 Sets of 60 Second Planks.\n\nFollow these with good form and achieve maximum health. \n\nCONNECT WITH US:\nINSTAGRAM: http://bit.ly/mindpumpmedia\nTWITTER: http://bit.ly/2vN1qpE\nFACEBOOK: http://bit.ly/2vq95cd\n\nSHOP MIND PUMP:\nhttp://bit.ly/2uvQY6b\n\nPRIVATE FACEBOOK GROUP:\nhttp://bit.ly/2vuntia\n\nPODCAST:\niTUNES - http://apple.co/2vMEPcA\nSTITCHER - http://bit.ly/2hQSIAS",
  "channelTitle": "Mind Pump TV",
  "channelDescription": "Mind Pump Media presents MIND PUMP TV exclusively for YouTube! MPTV is where you can find all the latest free workouts, nutrition and wellness advice to get you on your way to becoming the healthiest version of yourself without any supplements and BS lies that we’re so often fed in the fitness space. \n\nLearn from health and fitness veterans Adam, Justin and Sal as they shed the light of TRUTH on health, fitness and a variety of other topics. Combined, this trio has over 40 years of fitness experience as personal trainers, club managers, IFBB fitness competitors and fitness thought leaders. \n\nSubscribe to this channel and try to keep up with the FREE content we publish and share daily. Once you’ve got a feel for who we are and what we do, explore some of our MAPS programs that have helped thousands take their health and fitness to the next level. If you find value in our content, the greatest compliment you can give us is referring our channel to a friend. \n\nWelcome to RAW FITNESS TRUTH",
  "tags": [
    "dumbbell",
    "workout",
    "dumbbell workout",
    "fitness",
    "lunges",
    "rows",
    "bodybuilding",
    "gym",
    "exercise",
    "muscles",
    "curls",
    "dumbbell lunges",
    "dumbbell curls",
    "bicep curls",
    "dumbbell rows",
    "dumbbell shrugs",
    "shrugs",
    "dumbbell tricep extension",
    "tricep extensions",
    "dumbbell chest press",
    "chest press",
    "chest workout",
    "dumbbell press",
    "shoulders",
    "dumbbell exercises",
    "muscle",
    "abs",
    "strength",
    "form",
    "health",
    "bodybuilder",
    "weight training",
    "training",
    "entertainment",
    "mind pump",
    "mind pump tv",
    "mptv",
    "mind pump media",
    "build muscle",
    "technique"
  ],
  "publishedAt": "2018-07-10T00:24:46Z",
  "duration": 385,
  "durationFormatted": "6:25",
  "viewCount": 3801531,
  "likeCount": 107413,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0A3EgOztptQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0A3EgOztptQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0A3EgOztptQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0A3EgOztptQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0A3EgOztptQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0A3EgOztptQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Walking Lunges: <a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=80\">1:20</a> <br>Dumbell Rows: <a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=125\">2:05</a><br>Chest Press: <a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=160\">2:40</a><br>Dumbell Shoulder Press: <a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=198\">3:18</a><br>Dumbell Biceps Curls Alternating: <a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=226\">3:46</a><br>Dumbell Tricep Extension: <a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=255\">4:15</a><br>Time Stamps for people like me who need to see it multiple times to be sure they&#39;re doing it right haha",
    "I love how you&#39;re articulate about the presentation. You say it as you do it. <br>There are 1000 of YouTubers who talk for an hour verbally without showing you what the heck they are talking about. Or they use complicated exercise names without really showing what the exercise looks like and how it&#39;s done.<br><br>Your style is short, simple, articulate, easy to follow.",
    "1. Walking Lunges (3x8-12) [<a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=57\">0:57</a>]<br><br>Purpose: Builds strength in the legs, glutes, and core while improving balance and coordination.<br>How to Perform:<br><br>Hold a dumbbell in each hand, arms by your sides.<br><br>Step forward with one leg, lowering your hips until both knees are bent at a 90-degree angle.<br><br>Push off the front leg and step forward with the other leg.<br><br>Repeat for 8-12 reps per leg.<br>Correct Placement: As a compound movement targeting the lower body, it’s a good starting exercise to activate large muscle groups.<br><br><br><br>---<br><br>2. Dumbbell Rows (3x8-12) [<a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=120\">2:00</a>]<br><br>Purpose: Strengthens the back, lats, and biceps.<br>How to Perform:<br><br>Hold a dumbbell in each hand, bend slightly forward at the hips, and keep your back straight.<br><br>Pull the dumbbells toward your torso, keeping elbows close to your body.<br><br>Lower the weights slowly.<br>Correct Placement: Back exercises early in the workout are fine, but a row can come later if you want to prioritize pushing movements first.<br><br><br><br>---<br><br>3. Chest Press (3x8-12) [<a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=156\">2:36</a>]<br><br>Purpose: Targets the chest, shoulders, and triceps.<br>How to Perform:<br><br>Lie flat on a bench or the floor with a dumbbell in each hand, arms extended above your chest.<br><br>Lower the weights until your elbows are at a 90-degree angle.<br><br>Push back up.<br>Correct Placement: This is a foundational pushing exercise and works well early in a workout.<br><br><br><br>---<br><br>4. Dumbbell Shoulder Press (3x8-12) [<a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=194\">3:14</a>]<br><br>Purpose: Strengthens shoulders, triceps, and stabilizer muscles.<br>How to Perform:<br><br>Sit or stand with a dumbbell in each hand, held at shoulder level with palms facing forward.<br><br>Press the weights overhead until arms are fully extended.<br><br>Lower them slowly.<br>Correct Placement: It fits after chest press, as both are pushing movements.<br><br><br><br>---<br><br>5. Dumbbell Bicep Curls (Alternating, 3x8-12) [<a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=234\">3:54</a>]<br><br>Purpose: Isolates and strengthens the biceps.<br>How to Perform:<br><br>Hold a dumbbell in each hand with arms fully extended by your sides.<br><br>Curl one dumbbell toward your shoulder while keeping your upper arm still.<br><br>Alternate arms.<br>Correct Placement: Biceps are smaller muscles, so isolating them later in the workout makes sense.<br><br><br><br>---<br><br>6. Dumbbell Tricep Extension (3x8-12) [<a href=\"https://www.youtube.com/watch?v=0A3EgOztptQ&amp;t=256\">4:16</a>]<br><br>Purpose: Targets the triceps.<br>How to Perform:<br><br>Hold one dumbbell with both hands, extending your arms overhead.<br><br>Slowly lower the dumbbell behind your head by bending your elbows.<br><br>Push back to the starting position.<br>Correct Placement: Triceps follow naturally after shoulder press and chest press, as they assist in those movements.",
    "This seems like a great video for someone getting into fitness. Small number of simple exercises to target the whole body. It&#39;s very intimidating for a beginner trying to learn to work out seeing &quot;you need to use these 5 exercises for the arms, 3 for your chest etc&quot; this video right here is what beginners need",
    "I started this work out roughly 8 months ago and I made it a goal to do this work out each week. I started with strictly workouts and no changes to my diet other than drinking a protein shake before or after a workout. I eventually added additional workouts that focused more on my core and legs. I noticed my eating habits adapt to healthier choices such as prioritizing high protein meals rather than eating take out. I eventually dropped fast food I have dropped 45lbs of fat. This was due to being in a calorie deficit and eating ~0.7-1g of protein per lb of goal weight. My muscle mass has definitely increased during this process and I can visually see my muscles have become more toned and visible. My best advice to anyone starting their strength training journey is to set small stepping stones such as being motivated to complete x numbers of work outs per week without missing a day."
  ],
  "channelSubscriberCount": 794000,
  "channelVideoCount": 1305
}