{
  "video_id": "0BDbn9cFxt0",
  "title": "20 Minute 2nd Trimester Prenatal Cardio Workout-- (but good for ALL Trimesters of Pregnancy!)",
  "description": "Check out my full pregnancy fitness guides HERE:\nIntermediate/Advanced Pregnancy Fitness Guide:  https://bit.ly/3wYYfGQ\nBeginner Pregnancy Fitness Guide : https://bit.ly/3iJ09Xa\n\nCHECK OUT MY FULL PROGRAMS HERE: http://bit.ly/2En0HvR\nGET MY NUTRITION GUIDE HERE: https://bit.ly/360sOPl\nFOLLOW ME ON FB, IG, AND TWITTER @BodyFitbyAmy\nFIND MY FAVORITE PREGNANCY ITEMS HERE: http://bit.ly/pregnancyfavs\nFIND MY FAVORITE BABY ITEMS HERE: http://bit.ly/Favs4Baby\nFIND MY FAVORITE POSTPARTUM ITEMS HERE: http://bit.ly/postpartumfavs\nCHECK OUT MY WEBSITE: https://bodyfitbyamy.com/\n\nThis 20 minute cardio workout features pregnancy safe moves, all from a standing position, with options for all fitness levels.  Get your heart pumping in a gentle yet effective way to stay fit during pregnancy and prepare for delivery and recovery.  Made for 2nd trimester, but safe and appropriate for any trimester of pregnancy, \n\nTop and pants from Public Myth  www.publicmyth.com",
  "channelTitle": "BodyFit By Amy",
  "channelDescription": "Welcome to positive and uplifting fitness! This is your go-to destination for fun, effective, and empowering workouts that will help you sculpt a stronger, healthier, and happier you! I'm Amy, a certified personal trainer, and I'm thrilled to be your virtual workout friend on your fitness journey. I believe fitness is for everyone, regardless of fitness level, age, or background. Whether you're a beginner taking your first steps into the world of fitness or a seasoned pro looking for a new challenge, I've got you covered.\n\nMake sure to subscribe: it's FREE and helps me SO much! I am on a mission to reach one million subscribers, and your support would mean the world to me! \n\nGrab your mat, get ready to sweat, and transform your relationship with fitness! No toxic fitness culture here! To learn more about my offerings, check out the links below! ❤️\n\nAmy\n",
  "tags": [
    "prenatal workout",
    "pregnancy workout",
    "fit moms",
    "momsintofitness",
    "bodyfitbyamy",
    "prenatal fitness",
    "pregnancy fitness",
    "pregnancy exercises",
    "safe pregnancy workout",
    "fit pregnancy",
    "fit bump",
    "prenatal cardio",
    "cardio workout",
    "pregnancy cardio",
    "safe cardio",
    "low impact cardio",
    "beginner workout",
    "workout for women",
    "workout for moms",
    "perinatal",
    "perinatal fitness",
    "perinatal workout"
  ],
  "publishedAt": "2018-05-20T03:46:04Z",
  "duration": 1463,
  "durationFormatted": "24:23",
  "viewCount": 1824350,
  "likeCount": 16964,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0BDbn9cFxt0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0BDbn9cFxt0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0BDbn9cFxt0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0BDbn9cFxt0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0BDbn9cFxt0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0BDbn9cFxt0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Your pregnancy workouts are my favorite out of all the videos I&#39;ve tried.  I like how you go easy because going hard while pregnant makes me nervous so thank you for being realistic and easy going.  Hope everybody watching have a safe pregnancy and delivery :)",
    "Favorite pregnancy workout of all time! I watched this almost daily with my first baby and am continuing the tradition now as I&#39;m pregnant with my second baby! Thank you so much Amy! You are the best out there!",
    "I was just diagnosed with Gestational diabetes on top of being morbidly obese. I also lost my mom to a heart attack due to diabetes a few weeks before finding out I was pregnant. So basically a fear of mind is somewhat coming true, I’ve been working on a life style change and today for the first time I worked out the full 30mins,I was able to do that! At the end you said “we did it” and I shattered! Yes we did! <br><br>Thank you for making these videos and helping people from all sides of life. You made it feel like we were right in the same room together and were so patient and kind. I haven’t worked out in years and today, thanks to YOU it happened. Can’t wait to work out tomorrow",
    "Hi Amy!  Thank you so much for these videos Amy. My Wife had gestational diabetes throughout the pregnancy this allowed her to keep her blood sugars down after meals and stopped any back pains etc in late pregnancy! I also really enjoyed doing them with my wife! We could not have got through this pregnancy without you! My wife was able to do the exercises well into the 37th week. Baby was born on the 38th week!! Thanks again!",
    "26 weeks in and just did this for the 2nd time. I love the workouts. I don&#39;t feel like the lazy mum I&#39;ve been. Please post more."
  ],
  "channelSubscriberCount": 937000,
  "channelVideoCount": 1877
}