{
  "video_id": "0BNejY1e9ik",
  "title": "Wim Hof Method Guided Breathing for Beginners (3 Rounds Slow Pace)",
  "description": "!! Don't do the breathing exercises in a swimming pool, before going underwater, beneath the shower, or piloting any vehicle. Always practice sitting or lying down in a safe environment. Tinnitus symptoms may appear as a result of pushing too forcefully during the breathing exercise. If this happens, take a step back in your future practice, it’s important to increase gradually, not forcefully !!\n\nThis is a slower paced Wim Hof Method breathing exercise that starts with a 30 seconds hold building up to 90 seconds breath hold. Very suitable for beginners or anyone who prefers a more gentle guidance. \n\nSafety: Read about Shallow Water Blackout:\nhttps://www.wimhofmethod.com/what-is-shallow-water-blackout\n\nThis Breathing Bubble is an audiovisual guide that helps you maintain rhythm and pace during your breathing sessions. Simply watch the bubble as it expands and contracts, and follow with your breath. You'll hear Wim breathe alongside you, and entrancing background sounds help tune out your surroundings, allowing you to focus on nothing but your breath.\n\nIf you prefer Wim Hof to explain this in person:\nhttps://www.youtube.com/watch?v=nzCaZQqAs9I\n\nIf you want a faster paced guided breathing exercise:\nhttps://www.youtube.com/watch?v=tybOi4hjZFQ\n\nCheck out our INTERACTIVE guided breathing in our FREE mobile app:\nhttps://www.wimhofmethod.com/wim-hof-method-mobile-app\n\nGo deeper into the Wim Hof Method practice with our online video courses:\nhttps://www.wimhofmethod.com/elearning\n\nWanna help us TRANSLATE this video in your local language? We would love to have your contribution: \nhttps://www.youtube.com/timedtext_cs_panel?c=UCxHTM1FYxeC4F7xDsBVltGg&tab=2\n\n=====\r\n\r\nWant to discover & learn more about the Wim Hof Method?\r\n\r\nJOIN THE FREE MINI CLASS:\r\nhttps://www.wimhofmethod.com/free-mini-class\r\n\r\nDOWNLOAD THE FREE MOBILE APP:\r\nhttps://www.wimhofmethod.com/wim-hof-method-mobile-app\r\n\r\nVISIT THE WEBSITE:\r\nhttps://www.wimhofmethod.com/\r\n\r\nCONNECT WITH WIM:\r\nYouTube: https://www.youtube.com/subscription_center?add_user=wimhof1\r\nFacebook: https://facebook.com/icemanwimhof/\r\nInstagram: https://instagram.com/iceman_hof\r\nTwitter: https://twitter.com/iceman_hof\r\n\r\nFREE E-BOOK:\r\nhttps://www.wimhofmethod.com/ebook-journey-of-the-iceman\r\n\r\nWIM HOF METHOD ONLINE COURSES:\r\nhttps://www.wimhofmethod.com/elearning\r\n\r\nFOR WORKSHOPS/SEMINARS/TRAVELS:\r\nhttps://www.wimhofmethod.com/activities\r\n\r\n\r\n=====\r\nABOUT WIM HOF\r\n=====\r\n\r\n“The Iceman” Wim Hof is a Dutch athlete and multiple Guiness World Record holder known for his ability to withstand extreme cold and his extraordinary achievements.\r\n\r\nWim believes that EVERYONE is capable of doing the same exceptional things his body allows him to do. That’s why he developed the Wim Hof Method - a combination of breathing exercises, cold therapy and commitment - to give YOU the tools to take control over your body.\r\n\r\nHe’s on a mission to share the potential health benefits of his method, working with scientists around the world to prove that his techniques work.\r\n\r\nDiscover more at wimhofmethod.com",
  "channelTitle": "Wim Hof",
  "channelDescription": "\"There is nothing superhuman about me. I am just a man who loves fulfilling human potential.\"\n\nWim Hof (\"The Iceman\") is the creator of the Wim Hof Method. Through more than thirty years of training in nature, he has developed a method that combines specific breathing techniques, cold exposure and mindset. This method has been the first to scientifically prove the ability to actively influence the innate immune system and the autonomic nervous system.\n\nWim holds 26 world records, and has numerous other feats under his belt. He ran a marathon under the Polar Circle in nothing but shorts, holds the world record for sitting in ice —at almost two hours— and has climbed Mt. Everest to the Death Zone point, also in shorts.\n\n*FREE WIM HOF METHOD MINI CLASS*:\nhttps://wimhofmethod.com/free-mini-class\n\n",
  "tags": [
    "breathwork",
    "breathing",
    "breathing exercises",
    "breathing techniques",
    "boost immune system",
    "brown fat",
    "cold shower",
    "cold therapy",
    "cold training",
    "deep breathing",
    "ice bath",
    "ice man",
    "ice therapy",
    "iceman",
    "immu"
  ],
  "publishedAt": "2020-04-10T16:02:52Z",
  "duration": 660,
  "durationFormatted": "11:00",
  "viewCount": 22460992,
  "likeCount": 315934,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0BNejY1e9ik/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0BNejY1e9ik/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0BNejY1e9ik/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0BNejY1e9ik/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0BNejY1e9ik/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0BNejY1e9ik\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I suffer from Agoraphobia and have been housebound for 2 years now...I&#39;m on day 3 and left the house without a care in the world....tears of joy are running down my face as I type this. Thank you wim,",
    "It&#39;s crazy, I&#39;m a stage 4 lung &amp; liver cancer survivor &amp; used to struggle to breathe. Now not only can I breathe better. I can hold my breath for a while with ease! So happy I found this!",
    "started doing the breathing exercises for a month and I don’t get anxiety attacks like often before. I suffered from depression because I am a double leg amputee. I thought the world was done for <a href=\"http://me.now/\">me.now</a> I feel calm , ready and positive. I told myself this is not my destiny. I’m getting my prosthetic legs next week and ready to explore this world. I love it. Wim Hof 4 life!!!",
    "I am 81 years old and have been doing this for two months evverydsy. I am now doing it three times a day. When I started I could now remember many words in a conversation. My memory was so bad. Now it is like it was when I was much younger. Thank you Win for sharing your time and knowledge to help other people.",
    "To everyone who has come to watch is:<br>You haven&#39;t come here accidently, you&#39;ve come here to heal yourself, both physically as well as mentally, and for that I salute you. All the best. <br>May everyone heal and become the best version of themselves !<br>Edit: Thank you all for 1k likes ! :)"
  ],
  "channelSubscriberCount": 2940000,
  "channelVideoCount": 446
}