{
  "video_id": "0d9zRae1Aj0",
  "title": "Standing Pilates Cardio & Abs Workout | 20 Min Dance Inspired Workout",
  "description": "Standing Pilates Cardio & Abs Workout | 20 Min Dance Inspired Workout\n\nWelcome to class! This workout will boost your heart rate as you move through a series of standing Pilates and simple dance inspired exercises which will work the core, hips, legs, glutes, shoulders, arms and back. It's a full body session to give you a boost of endorphins without using any high impact exercises. Low impact on the joints with high intensity movements that require concentration and focus and may leave you a little sweaty! A great workout for mind and body, especially if you're feeling sluggish and need motivation. The class is based on my Pilates and Dance background and mixes very simple dance and pilates exercises for a fun and functional workout that will leave you feeling fully awake and ready for your day. \n\nPlease click the Like button and Subscribe to the channel to help me make more films just for you.  \n\nHave a wonderful day,\nMuch love,  Rachel  ❤️\n#girlwiththepilatesmat  #standingpilates #danceworkout #cardioworkout \n\nIf you enjoyed this video, feel free to buy me a coffee to show your support: \nhttps://ko-fi.com/thegirlwiththepilatesmat\n\nI am currently featured in the Stay in, Work out campaign with Sport England here:\nhttps://www.sportengland.org/jointhemovement#get_active_at_home\n\nIf you'd like to join my live online classes via Zoom, pop to my website for details;\nhttp://www.rachellawrencepilates.com\n\nWant to keep in touch? Come join me on my other social channels:\nhttps://facebook.com/RachelLawrencePilates\nhttp://www.instagram.com/thegirlwiththepilatesmat\nhttp://twitter.com/rachel_pilates\n\nDisclaimer: It is recommended that you consult your Doctor or Healthcare Professional before starting any exercise programme. If you experience any pain or discomfort during this workout you should stop immediately and if necessary seek medical attention. When participating in any exercise or exercise programme, you agree that you do so at your own risk and assume all risk of injury to yourself. By using this video you understand and agree that Rachel Lawrence- The Girl with the Pilates Mat- will not be held responsible or liable for any injury or loss you may suffer as a result of undertaking the workout.\n\nstanding pilates,standing core workout,standing abs workout,warm up exercises before workout for beginners,runners warm up,standing pilates workout,standing pilates for beginners,active recovery,30 minute standing workout,30 minute pilates,30 minute leg and core workout,standing abs workout no jumping,standing workout no jumping,standing legs bums and tums,standing legs and bum,fat burning workout,low impact cardio workout,barre workout,standing cardio",
  "channelTitle": "The Girl With The Pilates Mat",
  "channelDescription": "Welcome to My Channel!\n\nI'm Rachel—a Certified Pilates Instructor with 25 years of Pilates practice and a background as a Professional Dancer. I'm passionate about ageing gracefully through Pilates and believe everyone deserves to feel good in mind and body, no matter their age or stage in life.\n\nOn this channel, you'll find Pilates and Dance-based fitness for all abilities and ages, from Beginners to Advanced Levels. Our focus is on nurturing a healthy mind, body, and spirit in a supportive, positive, and kind community.\n\nI also share health and wellbeing tips during livestream chats and classes, where my beloved rescue dog often makes an appearance! Originally from London, I now enjoy life in Brighton on the beautiful South Coast of England.\n\nSubscribe today and join our warm, welcoming community of wellbeing enthusiasts from around the world.\n\nMy book: The Little Book of Pilates is available now.\nTo Order UK: https://amzn.to/3WvZ074\nTo Order US/Worldwide: https://amzn.to/3XqD4LT\n",
  "tags": [
    "Standing Pilates Cardio & Abs Workout | 20 mins",
    "Standing Pilates Cardio and Abs Workout",
    "Standing Pilates Cardio & Abs Workout | 20 min Dance Inspired Workout",
    "girl with the pilates mat standing cardio and abs workout",
    "girl with the pilates mat standing abs",
    "girl with the pilates mat dance inspired cardio",
    "full body workout no equipment",
    "20 minute full body standing workout",
    "20 minute standing pilates girl with the pilates mat",
    "standing abs cardio core low impact",
    "standing pilates"
  ],
  "publishedAt": "2025-03-19T07:30:07Z",
  "duration": 1462,
  "durationFormatted": "24:22",
  "viewCount": 39018,
  "likeCount": 1201,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0d9zRae1Aj0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0d9zRae1Aj0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0d9zRae1Aj0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0d9zRae1Aj0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0d9zRae1Aj0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0d9zRae1Aj0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Helo and Welcome to my newest cardio class! Hope you enjoy doing this as much as I did making it for you! With much love, RAchel 💕",
    "I enjoyed this so much I did it again! Brilliant coordination your stunning green outfit, your furry companion with his green collar and ……. a green ball too at the end 😂. Jacky",
    "Loving the Cardio classes, I do these in between your weekly Monday and Friday live sessions.  Thank you Rachel.  Good balance challenges too.  Not sure if it was my connection or your connection but a couple of times the video jumped on the second half of the class.  Kind regards B",
    "Love love love it!~ Had a bit of trouble at the end as Im waiting on knee replacement but still could do the stretches!  Thank you!",
    "Rachel, Wow this was a great one! I am 76 and recently had both knees replaced.  I can do so much more than before!  I mostly do senior workouts but sometimes I try more advanced ones and can do quite a bit!  Thanks so much!  My knee procedures were so much easier since I had been doing pilates with you for such a long time!"
  ],
  "channelSubscriberCount": 302000,
  "channelVideoCount": 793
}