{
  "video_id": "0hTllAb4XGg",
  "title": "Runner's Yoga - Yoga With Adriene",
  "description": "Yoga For Runner's - or joggers, or brisk walkers. This practice offers great release and rehab after a good run or cardio. Also, a wonderful practice to repeat to up or maintain your running or cardio game. \n\nThis sequence stays low to the ground. Use the breath to stretch and soothe the muscles of the body, stabilize the joints, and Find What Feels Good. This 30 min practice uses the principles of yoga to cultivate balance and find ease. Thirty minutes of practice to allow, release, balance, and restore!\n\nWant more yoga for runners? Check out this Yoga for Runners playlist: https://www.youtube.com/playlist?list=PLui6Eyny-UzzoiewtypZsiw2OIUz2btnD\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for runners",
    "runners yoga",
    "yoga",
    "yoga with adriene",
    "yoga for athletes",
    "post workout yoga",
    "yoga stretching",
    "yoga for flexibility",
    "yoga therapy",
    "physical therapy",
    "restorative yoga",
    "yogic breathing",
    "yoga basics",
    "hatha yoga",
    "yoga for strength",
    "yoga for stress relief",
    "yoga for weight loss",
    "pranayama"
  ],
  "publishedAt": "2016-03-23T13:00:00Z",
  "duration": 1830,
  "durationFormatted": "30:30",
  "viewCount": 4321571,
  "likeCount": 46965,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0hTllAb4XGg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0hTllAb4XGg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0hTllAb4XGg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0hTllAb4XGg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0hTllAb4XGg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0hTllAb4XGg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Community check in! Where in the world are you practicing today?",
    "Great start to Saturday morning! Thankyou, Adriene xx",
    "AWAKEN 🦋 | April 12, 2025 | I&#39;m not a runner, and I wouldn&#39;t call myself a fierce walker 😆 but I do walk. At least I used to before my four legged walking buddy left us last summer. Since then I&#39;ve been struggling to get walking again by myself, it&#39;s just not the same. But now as the winter is finally loosening its grip on us, I&#39;m determined to get back to it. I probably should have saved this for after my walk today, but I had already rolled out the mat when I realized and I&#39;m sure it&#39;s going to make my walk that much sweeter. It really was such a treat today, getting into those hips and the low back too. Loved it! 🙏",
    "Tried to talk myself out of this practice this morning,  but found the strength to conquer it!!! Glad I did <br>Day 12 explore 2025<br>We are One<br>🙏🏼",
    "Awaken day 12! I’ve been uncovering some trauma this evening and this practice came at the perfect moment. That hip release was something else. I’m very grateful for this practice💕<br>Thank you, Adriene and YWA community🧡🧡🧡"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}