{
  "video_id": "0hYDDsRjwks",
  "title": "30 minute Full Body Strength Training with Dumbbells",
  "description": "Join me as we tone and strengthen our upper body, lower body, and abs with this strength session! This is a seriosuly rocking workout that will help you build total body strength! Grab some heavy dumbbells and let's get STRONG!\n\nFULL BODY STRENGTH TRAINING DUMBBELL WORKOUT STRUCTURE AND EXERCISES\nMUSCLES TARGETED:  BACK, CHEST, BICEPS, TRICEPS, SHOULDERS, GLUTES, HAMSTRINGS, QUADS, AND ABS.\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 45lbs\n- EXERCISE MAT\nOPTIONAL EQUIPMENT\n\nSTRUCTURE\n10 TOTAL EXERCISES\nREPEAT TWO TIMES THROUGH \nWORK: 50 SECONDS REST: 30 SECONDS\n\nEXERCISE LIST \n- SQUAT WITH ALTERNATING SIDE LATERAL LEG LIFT\n- REAR DELT FLYES\n- SUMO SQUAT W/ HOLD AT BOTTOM\n- CLOSE GRIP SHOULDER PRESS\n- BICEP CURLS - NEUTRAL AND WIDE\n- SUMO RDL\n- GLUTE BRIDGE WALKOUTS\n- CHEST FLYES\n- MARCHING CRUNCH AND CLAP\n- REVERSE CRUNCH\n\nThanks for working out with me! It's always better to work out with a friend!\n\nKaleigh\n\n⭐️ Find tips, recipes, and more here! 👉  https://www.kaleighcohen.com \n\n⭐️ Find all of the equipment used for these workouts here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/channel/UC0PZtgIWY5__DxIR0iVttQA\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ Tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.\n\n\n#fullbody  #strengthtraining  #dumbbells",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2022-12-06T10:02:09Z",
  "duration": 1899,
  "durationFormatted": "31:39",
  "viewCount": 631885,
  "likeCount": 10908,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0hYDDsRjwks/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0hYDDsRjwks/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0hYDDsRjwks/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0hYDDsRjwks/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0hYDDsRjwks/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0hYDDsRjwks\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’m the dog on the background chilling on the couch every time I watch a fitness video",
    "To all the people who completed this workout: GOOD JOB! 💪🏼👏🏼🔥",
    "I am soooo glad I found this. I&#39;ve been looking for a workout that has instructions, and not just music.",
    "The dog just won my heart, I&#39;ll subscribe just because of him ❤",
    "I’ve been doing this routine for about 6 weeks, I’m seeing so much improvement and new strength in my body. You’re so encouraging in your commentary~ ❤️❤️"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}