{
  "video_id": "0LlT7MSKJBc",
  "title": "15 Minute Fat Burning HIIT Workout | Full Body at Home or Gym (No Equipment)",
  "description": "A no equipment, super sweaty HIIT workout you can do anywhere and follow-along easily 🙏 For 45 more unique HIIT workouts all available in app form, and training + nutrition programmes approved by a world leading dietetics expert go to www.natachaoceane.com ❤️\n\nThe 15 minute HIIT workout: each exercise is performed for 30s and followed by 30s rest. It’s a circuit, so we complete Move 1, Move 2, Move 3, Move 4, Move 5 and then repeat for 3 total rounds.\n\n1. Squat to knee drive\n2. Reverse plank marches - see video for easier variation\n3. Shoulder tap plank jacks - see video for easier variation\n4. Kneel to squat thrust\n5. Explosive jacks\n\nMUSIC:\n\nThis is where I get my youtube music from!  http://share.epidemicsound.com/zBRBF (30day free trial) — (this is an affiliate link so it helps support my channel without costing you extra, but if you’d prefer not to use it that’s ok too ❤️)\n\nOutfit:\nGymshark geo seamless black: https://gym.sh/Shop-Natacha-Oceane2\nThis is a commission link, it doesn’t change the price of your purchase it just helps support my channel but if you prefer not to use it I still love you 😘 \n\n#HIIT #workout",
  "channelTitle": "Natacha Océane",
  "channelDescription": "Health is wealth 🤍 ",
  "tags": [
    "hiit",
    "15 minute",
    "fat",
    "burn",
    "workout",
    "full body",
    "follow",
    "along",
    "home",
    "gym",
    "no equipment",
    "exercise",
    "fitness",
    "fit",
    "calories",
    "natacha",
    "natacha oceane"
  ],
  "publishedAt": "2019-12-11T18:11:58Z",
  "duration": 1034,
  "durationFormatted": "17:14",
  "viewCount": 2357692,
  "likeCount": 54008,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0LlT7MSKJBc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0LlT7MSKJBc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0LlT7MSKJBc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0LlT7MSKJBc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0LlT7MSKJBc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0LlT7MSKJBc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "My friends! ♥️ My second workout video this week is a 15 minute sweat session you can do wherever, whenever! 💦<br><br>I choose what content to make based on your feedback, so don’t forget to thumbs up the video if you want more follow-along workouts! I’m always listening! Love ya! 😘",
    "I feel the prettiest when i sweat and look like a tomato, because i feel so strong and healthy haha. Proud of myself for doing this work out 2 times in a row:)",
    "I love that there’s no toxic pep talks mid-workout with these like “oh do this so you can eat the snack you want later!!” Or “it’s not working if you’re not hurting” Instead, she wants us to challenge ourselves while listening to our bodies, for whatever purpose we want to be working out. I appreciate that so much.",
    "I love how she doesn&#39;t talk much about it and just gets straight to the workout",
    "your editing skills are so fire girl, love the choices you made with the timer, visual look, positioning, and featuring the upcoming moves within the timer!! no other home workout video can compare. haven&#39;t seen such level of viewer-centred content creation from anyone else than from you. ily, keep doing you, will try this out asap ♡"
  ],
  "channelSubscriberCount": 1670000,
  "channelVideoCount": 230
}