{
  "video_id": "0MfKBouPSME",
  "title": "30 min. Traditional Full Body Strength Training Workout | Build Muscle with Dumbbells",
  "description": "Get your December calendar here! https://buymeacoffee.com/kaleighcohen/extras\n\nThis full-body workout is all about building muscle!! This workout is a more traditional-style strength training workout with a bit of a twist! The twist comes from the structure that we will follow. The structure includes 8 exercises alternating between upper and lower allowing more rest between sets, so we can keep using HEAVY WEIGHTS!!\n\nThis workout is great for building full-body muscle in minimal time! Optional equipment is your exercise bench and wrist weights. I'll also have modifications if you don't have a bench! The focus today will be on good form, a slow tempo, and lifting heavy!\n\n30-MINUTE TRADITIONAL FULL-BODY STRENGTH WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS: LIFT HEAVY!!! TODAY'S WORKOUT WILL BE MOST EFFECTIVE WITH HEAVY DUMMBEELS. THE WEIGHT YOU USE IS RELATIVE TO YOU! AS A REFERENCE I AM USNG 15LB-35LB / 6.8KG-15.8KG.\n\nOPTIONAL EQUIPMENT\n- EXERCISE BENCH\n- WRIST WEIGHTS\n\nSTRUCTURE:\n8 EXERCISES REPEATED THREE TIMES\nWORK: 45 \nSECONDS REST: 15 SECONDS\n\nEXERCISE LIST:\n-ROMANIAN DEADLIFT\n-REVERSE GRIP ROW\n-SQUAT\n-SHOULDER PRESS\n-ALTERNATING REVERSE LUNGE\n-PULLOVER\n-HIP THRUST\n-CHEST PRESS\n\nI am so glad you joined me for this workout! It's always better to work out with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2024-11-29T09:59:50Z",
  "duration": 1796,
  "durationFormatted": "29:56",
  "viewCount": 60642,
  "likeCount": 1464,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0MfKBouPSME/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0MfKBouPSME/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0MfKBouPSME/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0MfKBouPSME/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0MfKBouPSME/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0MfKBouPSME\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I just wanted to tell you how much I appreciate you. I’ve been following your workouts for about a year now and you’re my favorite trainer. I especially appreciate your focus on strength instead of weight loss. It would have been easy to slip into traditional weight loss talk after coming back from having a baby, but you continue to hold true to the mission of building strength. You are deeply appreciated for your authenticity, tenacity, and talents. Thank you 🙏",
    "I&#39;ve never been this consistent but since I found your videos I actually enjoy working out  again! You are truly a blessing.🙌🏻❤️",
    "Day 29 - N C &amp; S - Done. It’s nice that the November calendar ends with a LIVE session! Grateful for the upcoming December calendar! Thank you Kaleigh for strong and amazing workout sessions!🏁WINNING🏁⚡️🔥⚡️🔥⚡️🔥⚡️",
    "Love the traditional workouts! Feeling strong and good! Thanks for helping us through it Kaleigh!",
    "I was LITERALLY screaming on that last rep! But boy, I feel so strong!!💪❤ Thanks so much!"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}