{
  "video_id": "0yYiErHenzs",
  "title": "Full Body Beginner Dumbbell Workout",
  "description": "Its time to get our sweat on, but with a STRENGTH workout this time! \nThis full body dumbbell workout at home is perfect to build lean muscle and see amazing changes in your physique.\n\nThis dumbbell workout is complete with a warm up (bodyweight) and cool down to make sure that your heart rate comes up at a safe pace, and you cool down for maximum recovery. https://www.youtube.com/watch?v=x4MHzjnSayc&t=9s\n\n\n0:00 Full Body Warm Up\n5:15 Full Body Dumbbell Workout \nUpper Cut to Shoulder Raise\n6:15 Dumbbell pull down with Knee Raise\n7:14 Dumbbell Swings\n8:13 Row Step Out\n9:13 Squat push Press\n10:13 Shoulder Raise to Press Up\n11:11 Bicep Curl to Open Arm Press\n12:10 Wide Curls\n13:10 Tricep Kick Back to Stand and Press\n14:09 Good Mornings\n15:09 Heel Elevated Squats\n16:07 Dumbbell weighted In-In-Out-Out Step\n17:07 Lunge to curtsy lunge (Right)\n18:07 Lunge to curtsy lunge (Left)\n19:06 Sumo Squat Pulses\n20:05 Straight Leg Donkey Tap Overs \n21:05 Fire Hydrant to Kick Out\n22:04 Alternating Renegade Rows (on knees)\n23:04 Kneeling Bent Over Rows\n24:03 Glute Bridge to Chest Press\n25:02 Glute Bridge Hold Curl to Press\n26:01 Chest Pull Throughs\n27:00 Full Body Cool Down\n\nIf you have read this caption the entire way through, I consider you one of the few who are paying close attention (and I really appreciate that about you), so to let me know that you are one of the few, comment below; what I loved most about this workout is….( you fill in the blank- maybe it is a certain move, or the way the video was laid out). I cant wait to hear what you love about strength training!\n\n\nKEEP UP WITH ME\n\nINSTAGRAM → https://www.instagram.com/growwithjo/?hl=en\nFACEBOOK → https://www.facebook.com/growwithjoofficial/\nPINTEREST → https://www.pinterest.ca/growwithjo/\nTIKTOK → https://www.tiktok.com/@growwithjo?lang=en\nCONTACT EMAIL → mgmt@growwithjo.com\n\n_________________________________________________________________\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.\n\ngrowwithjo beginner workouts abs workout walking all standing low impact fun fitness videos",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "no jumping",
    "low impact",
    "low impact workouts",
    "women beginner workout",
    "fitness videos",
    "abs",
    "absworkout",
    "dumbbell workout",
    "dumbbell full body workout",
    "dumbbell bicep workout",
    "strength training",
    "strength training at home",
    "strength workout",
    "strength training for women",
    "madfit weights",
    "Chloe ting weights",
    "pamela reif",
    "Sydney cummings",
    "Sydney Cummings full body",
    "full body workout",
    "home workout",
    "easy workout",
    "beginner weights",
    "30 min dumbbell"
  ],
  "publishedAt": "2021-10-05T13:00:11Z",
  "duration": 1820,
  "durationFormatted": "30:20",
  "viewCount": 4733187,
  "likeCount": 91533,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0yYiErHenzs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0yYiErHenzs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0yYiErHenzs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0yYiErHenzs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0yYiErHenzs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0yYiErHenzs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "PREMIERE VIEWERS have a chance at the giveaways! Turn on notifications so you don&#39;t miss them! ALSO Cant wait to hear what you think of the new strength training workouts coming to this channel! Love you hunnies xo",
    "What I loved most about this is; you show exactly what muscles are being worked per move. It’s very important to know where you should feel the work when lifting. I also love the   Fact the  timers are both visible and have sound. And I love you Jo! Thank you keep doing what you do .",
    "Today is February 13th. 2025. Starting weight 225. Goal is 140/150. Please like to keep me motivated and to check in. I completed the workout today and worked up a good sweat. Made me realize how weak i really am.😂 Had to modify a bit to my level. I am using 10 lbs but maybe i ahould have started with 5 to instead. Will be on the Mediterranean diet as well",
    "3months ago I was at my heaviest which was 220lbs, it got hard down the line but staying consistent really does work! I have lost 31lbs and im not stopping! I haven&#39;t felt this good about myself in years and im telling you all jo&#39;s workouts are so good! Thank you Jo and God bless you all! &lt;3",
    "To anyone who&#39;s doing this in 2024, don&#39;t give up. It&#39;s my second time doing this workout and it feels a lot easier than the first time, you got this &lt;33"
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}