{
  "video_id": "0zjiVQ950EE",
  "title": "40 MIN FULL BODY WORKOUT || At-Home Pilates",
  "description": "Enjoy this 40-Minute Full Body Pilates Workout that will sculpt and tone your entire body. This at-home pilates class will have you feeling stronger, energised and leave you with a post-workout glow! Let me know you go in the comments below. xx\n\n\n♡ INSTAGRAM: @movewithnicole\n♡ EMAIL: movewithnicole.yt@gmail.com\n\n\n\n♫ Music:\nMerry Bay by Ghostrifter Official https://soundcloud.com/ghostrifter-of... Creative Commons — Attribution-ShareAlike 3.0 Unported — CC BY-SA 3.0 Free Download / Stream: https://bit.ly/merry-bay \n\nWhere Are We Going by Tokyo Music Walker https://soundcloud.com/user-356546060 Creative Commons — Attribution 3.0 Unported — CC BY 3.0\n\nWarm Nights by LAKEY INSPIRED https://soundcloud.com/lakeyinspired\n\nMusic from https://www.epidemicsound.com/\n\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 40 minutes full body",
    "pilates workout 40 minutes",
    "40 minutes pilates workout",
    "40 minute pilates",
    "pilates class",
    "nicole kastoun",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "40 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "nicole kastoun pilates",
    "mat pilates",
    "no equipment"
  ],
  "publishedAt": "2020-05-28T22:35:27Z",
  "duration": 2427,
  "durationFormatted": "40:27",
  "viewCount": 3481597,
  "likeCount": 76785,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/0zjiVQ950EE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/0zjiVQ950EE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/0zjiVQ950EE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/0zjiVQ950EE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/0zjiVQ950EE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/0zjiVQ950EE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks!",
    "I&#39;m 68.  Second bout of breast cancer during lock-down, more surgery, radiation.  I&#39;m coming back to Pilates.  There&#39;s so much I can&#39;t do yet.  But after two classes I finally feel okay again.  Thank you, Nicole.",
    "as a university student who does not have the budget to spend on Pilates classes finding your channel was an absolute game changer in my workout routine love your voice your pace and the effort you made for quality content looking forward to see more of your videos &lt;3",
    "I love it when you acknowledge how much certain exercises hurt and burn. Often instructors seem demoralizingly peppy and impervious. Love your empathy",
    "One of the rare men here, I can say that your class was amazing. If only people could understand how important these workouts are for our backs, glutes and hips! Thank you Nicole."
  ],
  "channelSubscriberCount": 4470000,
  "channelVideoCount": 229
}