{
  "video_id": "1H2Cgc60UlU",
  "title": "20 Minute Guided Meditation with Jon Kabat-Zinn PhD",
  "description": "Jon Kabat-Zinn, Ph.D. is internationally known for his work as a scientist, writer, and meditation teacher engaged in bringing Mindfulness into the mainstream of medicine and society. He is Professor of Medicine emeritus at the University of Massachusetts Medical School, where he founded its world-renowned Mindfulness-Based Stress Reduction Clinic (in 1979), and the Center for Mindfulness in Medicine, Health Care, and Society (in 1995).",
  "channelTitle": "No Nonsense Meditation",
  "channelDescription": "Not for financial gain. Simply a channel for those who want to learn the practice and theory of meditation. No mumbo jumbo, just scientifically validated guided meditations and good information from meditation masters.",
  "tags": [],
  "publishedAt": "2021-10-04T09:01:08Z",
  "duration": 1207,
  "durationFormatted": "20:07",
  "viewCount": 1208993,
  "likeCount": 12017,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/1H2Cgc60UlU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/1H2Cgc60UlU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/1H2Cgc60UlU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/1H2Cgc60UlU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/1H2Cgc60UlU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/1H2Cgc60UlU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I have been doing it daily since 2015. It rescued me from a nasty, disgusting and stinky mental state. A living hell!<br> I just wish that meditation was taken more seriously. This world would be a way better place. Bliss and Peace!",
    "I have been doing this for 60 days now. The mental chatter has reduced a lot. Long way to go, but definitely making progress. Please pray for me 🙏",
    "I have had asthma, COPD and other lung conditions my entire adult life; for more than fifty years. Focusing on my&quot;breath&quot; in meditation has been difficult for me. It&#39;s a trauma trigger. But today, as I listened to you, for the first time I discovered that focusing on the movement of my diaphragm instead of breathing was a safer, less traumatic way to focus and clear my mind. I know I am not the only person with lung and breathing problems who have this issue. I thought this insight might be of interest to you.",
    "I like how &quot;No Nonsense&quot; is super close to &quot;No Bullshit&quot; lol Thank you Jon, for your beautiful book &quot;Wherever You Go, There You Are&quot;. I just finished that today.",
    "I love the silence we are allowed."
  ],
  "channelSubscriberCount": 23400,
  "channelVideoCount": 9
}