{
  "techniqueDifficulty": [
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.6
    }
  ],
  "techniqueDifficultyConfidence": 0.9,
  "techniqueDifficultyExplanation": "The video description and title reference an 'INTENSE Fat Burning TABATA' workout, suggesting a higher level of coordination and effort than a typical beginner-friendly routine. The TAG references such as 'intense ab workout' indicate more complex movements than basic exercises. Tabata typically involves interval training which requires maintaining form under fatigue. However, the mention of 'walking workouts' and 'low impact' may offer some simpler movements, leading to a mixed assessment of Intermediate to Advanced difficulty.",
  "effortDifficulty": [
    {
      "level": "Challenging",
      "score": 0.8
    },
    {
      "level": "Extreme",
      "score": 0.7
    }
  ],
  "effortDifficultyConfidence": 0.85,
  "effortDifficultyExplanation": "The workout is labeled as having an intensity of 10/10, with a calorie burn of 515 calories over 40 minutes, indicating a very demanding routine. The video duration is over 40 minutes, and as it is a Tabata workout (known for high intensity and minimal rest), the effort required is significant. The recommendation to 'walk it out' if overwhelmed and user comments about crying due to difficulty suggest it is challenging to extreme for many users.",
  "requiredFitnessLevel": [
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.8
    },
    {
      "level": "Elite",
      "score": 0.4
    }
  ],
  "requiredFitnessLevelConfidence": 0.9,
  "requiredFitnessLevelExplanation": "Given the technique difficulty levels of Intermediate to Advanced and the effort difficulty being Challenging to Extreme, this workout is most suitable for intermediate to advanced users who have some experience with high-intensity training. It can't be recommended for beginners due to its intensity and technical demands, as evidenced by comments about struggling with the workout. However, seasoned users can modify, making the inclusion of an elite level appropriate, but primarily focusing on Intermediate to Advanced due to the scalability and modification options mentioned."
}