{
  "video_id": "1jZVEqgeO4U",
  "title": "20 MIN PILATES CARDIO & ABS || Low Impact Workout (Stretch Included)",
  "description": "Raise your heart rate and work your abs in this 20 Minute Low Impact Workout! \n\n🌸 Mat from Liforme \nUse code 'MOVEWITHNICOLEYOGA' for a discount.\n\n🤍 INSTAGRAM: @movewithnicole\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "cardio and abs",
    "cardio and abs workout",
    "cardio and abs workout at home",
    "move with nicole",
    "cardio and core",
    "cardio and core workout",
    "cardio and core workout at home",
    "low impact cardio",
    "low impact cardio workout",
    "low impact cardio workout 20 minutes",
    "20 min pilates",
    "20 min pilates workout",
    "cardio pilates",
    "low impact hiit",
    "20 min cardio workout no jumping",
    "20 min cardio workout",
    "20 min cardio and abs workout",
    "20 min cardio and abs",
    "pilates abs workout",
    "cardio abs workout"
  ],
  "publishedAt": "2022-04-20T09:42:55Z",
  "duration": 1425,
  "durationFormatted": "23:45",
  "viewCount": 1127228,
  "likeCount": 30404,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/1jZVEqgeO4U/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/1jZVEqgeO4U/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/1jZVEqgeO4U/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/1jZVEqgeO4U/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/1jZVEqgeO4U/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/1jZVEqgeO4U\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Merci !",
    "I just wanna say please don&#39;t stop making pilates workout videos, they really helped me lose weight and be lean, idk how to thank u but tysm 💜",
    "I don’t know if you will see this but THANK YOU! I’m a mom of two and homeschool my girls. I finally started putting myself first but didn’t know where to start. Your videos are the best thing I’ve found. I’ve been doing your videos for 6 months and finally feel so proud of myself and so beautiful again.. You have no idea how amazing this is. I’m beyond grateful. My girls start my videos every morning for me and even started doing them with me. Thank you again.",
    "I&#39;m really grateful that there is a 20min class included in this week&#39;s plan. I&#39;m having a stressful day and this was a breath of fresh air and brought strength and joy to my day. 🌞🥰",
    "After years of your workouts, I look better now at 68 than I did at 28, you’re the absolute best ❤ many many thanks"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}