{
  "video_id": "1VgMbYujjS8",
  "title": "20 Minute Guided Meditation for New Beginnings and Habit Change | Mindful Movement",
  "description": "This is a guided meditation for new beginnings and habit change.  This is a great way to start a new year or a new chapter in your life.  Replace old habits with new, positive habits.  Write the story of your life the way you want to live. Go on a journey of growth, and make a choice to change.   \n\nWritten by Les Raymond and read by Sara Raymond \nMusic: Oxygen Garden by Chris Zabriskie and Deliberate Thought by Kevin MacLeod \n\nFor a powerful experience for new beginnings and habit change, this meditation can be paired with this practice for the evening: https://youtu.be/3gMIV1OwFWI\n\nDo not listen while driving. Meditation and mindful movement are powerful tools to support you. This is not a substitute for medical care. Consult a doctor or trusted health professional if needed.\n---------------------------------------------\nRESOURCES:\nMEMBERS OASIS: Unlimited access to all AD FREE Mindful Movement Content\nhttps://www.themindfulmovementcourses.com/pricing\nRECORDINGS: Purchase your favorite recordings from the Mindful Movement for download\nhttps://themindfulmovement.com/recordings-store/\n---------------------------------------------\nFree Programs\nNew Beginnings Personal Retreat https://www.themindfulmovementcourses.com/new-beginnings \n21 day Movement and Meditation Commitment Program.  Start NOW! https://www.themindfulmovementcourses.com/21day-commitment\n7-day Foundations of Meditation Course: https://www.themindfulmovementcourses.com/\n ---------------------------------------------\nWorkshops & Courses\nSix Week Move and Meditate for Self-Care Program: https://www.themindfulmovementcourses.com/offer-page\nBUILD SELF-WORTH: https://www.themindfulmovementcourses.com/self-worth\nRELEASE ANXIETY: https://www.themindfulmovementcourses.com/Anxiety-course\nREGAIN CONFIDENCE:  https://www.themindfulmovementcourses.com/Building-Confidence\nHEALING HYPNOTHERAPY: https://www.themindfulmovementcourses.com/healing-hypnotherapy\n---------------------------------------------\n1:1 Sessions\nPERSONALIZED HYPNOTHERAPY with Sara:  \nhttps://www.themindfulmovementcourses.com/90-minute-session \nPERSONALIZED EXERCISE AND LIFESTYLE PROGRAM DESIGN with Les: https://www.themindfulmovementcourses.com/1-1-coaching-with-les\n---------------------------------------------\nMORE FROM THE MINDFUL MOVEMENT:\n🙏 The Mindful Movement is happy to provide these meditations, podcasts, and videos free of charge. We don't ask for anything in return but if you wish to make a donation, please know that whatever you offer will be received with much gratitude. http://themindfulmovement.com/donations/\n \nConnect with The Mindful Movement community of like-minded people on Facebook.  https://www.facebook.com/themindfulmovementpodcast/\n \nAnd on Instagram https://www.instagram.com/themindfulmovementpodcast/\n#meditation #personaldevelopment #newyearsresolution",
  "channelTitle": "The Mindful Movement",
  "channelDescription": "Welcome!  Here at the Mindful Movement, we are an oasis where you can come to tap into your inner calm, develop a positive mindset and heal from the stress that’s blocking your fulfillment. We offer guided meditation, visualizations, and hypnosis as well as Yoga, Pilates and a variety of mindful movement practices to help you live mindfully, move well and feel great!\n\nWe would love to continue working with you personally if you are interested.  We offer self-paced, online courses, group coaching, and 1:1 services.  You can learn more at our website:  Themindfulmovement.com \n\nAdditionally, check out Sara's new book, You Are Not Broken: https://amzn.to/4g6Omyh\n\nThe Mindful Movement is happy to provide these meditations, podcasts, and videos free of charge. If you wish to make a donation, please know that whatever you offer will be received with much gratitude. http://themindfulmovement.com/donations/\n\nOur second channel: @theMindfulMovementinMotion\n\nMuch love!\nSara and Les\n",
  "tags": [
    "New year",
    "new beginning",
    "habit change",
    "Sara Raymond",
    "relaxation",
    "Self-acceptance",
    "Meditation",
    "hypnosis",
    "stress reduction",
    "personal development",
    "growth",
    "loving kindness",
    "mindfulness meditation",
    "mindfulness",
    "mindful",
    "The Mindful Movement",
    "breathing",
    "body scan",
    "letting go of negativity",
    "connect with yourself",
    "open your heart",
    "emotions",
    "anxiety reduction",
    "Les Raymond",
    "journey"
  ],
  "publishedAt": "2017-01-02T15:09:20Z",
  "duration": 1294,
  "durationFormatted": "21:34",
  "viewCount": 1138196,
  "likeCount": 16662,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/1VgMbYujjS8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/1VgMbYujjS8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/1VgMbYujjS8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/1VgMbYujjS8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/1VgMbYujjS8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/1VgMbYujjS8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "🌅 Embark on a Transformative Journey with Our FREE New Beginnings Personal Retreat! 🌅 Take time for yourself to enjoy a rejuvenating experience where, in just one full day or two half days, you&#39;ll be guided through every essential step to catalyze a profound internal transformation, paving the way for you to achieve your most impactful external goals. <a href=\"https://www.themindfulmovement.com/new-beginnings\">https://www.themindfulmovement.com/new-beginnings</a>",
    "I had tears on my face at the end of this meditation. I feel great and free, thank you. A new me",
    "I can&#39;t stop the tears streaming down my cheeks and onto my shirt. It seems too good to be true right this minute, but I believe that as I continue on my journey, and remind myself of the changes I can make by listening to these and others in your amazing set of meditations, I can begin to start writing in my new book. I don&#39;t even have the words to thank you and your group for sharing these meditations. Thank you. 💜",
    "Crying like crazy over here 😢 ...this pandemic stripped me of my Colorado dreams I worked incredibly hard to achieve and sent me back home to the 1 place I dont want to be. This reminds me of hiking in the Rocky Mountains and even though I am crying, this meditation is so powerful and it makes me feel good knowing this is all temporary and things will be ok eventually and it&#39;s ok to let go of the burdens we carry that we have no control over, such as this worldy situation. Thank you so much for creating it. Its my absolute favorite meditation now. Stay safe 💚",
    "This mediation made me cry happy tears. Makes me excited for my new journey I am about to embark on. This was a perfect meditation for me to really feel and visualize my future. Thank you so much!"
  ],
  "channelSubscriberCount": 936000,
  "channelVideoCount": 586
}