{
  "video_id": "1vx8iUvfyCY",
  "title": "Guided Meditation for Detachment From Over-Thinking (Anxiety / OCD / Depression)",
  "description": "This meditation encourages a calm awareness of the breath, and also a gentle detachment from the habits of rumination (ie. over-thinking). This session is useful for alleviating symptoms of anxiety, OCD, and depression. \n\nDownload this track: https://michael-sealey.dpdcart.com/cart/add?product_id=112597&method_id=118958\n\nMy iTunes: ► https://itunes.apple.com/au/artist/michael-sealey/id921827456\n\nMy Depression & Anxiety Recovery Pack 5 x MP3 Digital Audio Collection here:  ► https://michael-sealey.dpdcart.com/cart/add?product_id=121819&method_id=129715\n\nSubscribe for more positive meditation: http://www.youtube.com/subscription_center?add_user=MichaelSealey\n\nPopular Playlists: \n7 Day Self Hypnosis Personal Transformation Challenge: https://www.youtube.com/playlist?list=PLO9OtUmChpP_G2Tu_XPdT3I7M_My4HEI2\nHypnosis for Confidence & Self Esteem: https://www.youtube.com/playlist?list=PLO9OtUmChpP8PUMtzlu4P6br5Rzb2hx79\n\nWelcome to this guided meditation which is designed to train your mind for calm detachment from any unwanted patterns of over-thinking.  \n\nBy practicing these mindful techniques of conscious observation and self acceptance, you will find you are more able to quieten and relax an overly active mind -- and also naturally increase your body's healthy energy, to become a more self assured person in the present moment. \n\nThis meditation experience may be repeated as often as you choose to reinforce your positive intentions.\n\nBy your own inner direction may you continue to find your greatest waking potential.\n\nThis session is suitable and recommended for repeated listening, and regular listening will help compound positive suggestions and / or your own positive results.  \n\nThe end of this session will provide options for either drifting into a sound night's sleep, or for returning to your fully conscious, awake and alert, positive mind state.\n\nDo not listen to this recording whilst driving or operating machinery. \n\nThis recording is in no way a replacement for any prescribed medication; nor is it intended to contraindicate or supersede any medically diagnosed conditions. Please always consult your health care professional for your best advice in all medical issues. \n\nAll hypnosis is self hypnosis. The power for positive change resides within your own mind. If you choose to accept the suggestions presented in this session, you can rest comfortably knowing that you are the one safely in control of your own positive experience.\n\nThis channel uses positive voice suggestions, often accompanied with calm images, background sounds and meditation music, to allow you your very best state of relaxation, inner change, to remove negative blocks, and to create self guided healing therapy; with techniques from the fields of hypnotherapy, modern psychotherapy, trance work, guided relaxation, NLP, cognitive behavioural psychology, mindfulness meditation, and ASMR.\n\nPeace & Enjoy\n\nP.S. Please LINK & SHARE this video with those who you think might benefit from positive hypnosis and guided meditation. Thank you.\n\n.........................\n\nMore MP3 Download Collections: \n\n5 Hypnosis Sessions Special Collection MP3s:\nhttps://michael-sealey.dpdcart.com/cart/add?product_id=77324&method_id=80294\n\nSleep Hypnosis Ultimate Special Collection 5 x MP3s\nhttps://michael-sealey.dpdcart.com/cart/add?product_id=99374&method_id=104471\n\nMore positive Playlists & Video Sessions for your consideration: \n\nGeneral Hypnosis & Hypnotherapy: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP_I3ALG2Zl_LcR53um6zSyu\nAll Guided Meditations: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8Co6HAHWqYCrE5xQyA1u62\nHypnosis for Bedtime Sleep & Insomnia: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP_Po7RGMHFJ4kNbavmHhYhJ\nSubconscious Confidence, Motivation, Self Esteem & Success: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8PUMtzlu4P6br5Rzb2hx79\nGuided Self Healing & Positive Energy: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8Cwlg0Frc7NiFHPl9B50YV\nLucid Dreaming Hypnosis: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8M3iWPQtEl9fOZfvLOjxnK\nAstral Travel & Astral Projection: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP97AatRUEsk99H3TJAj7QbL\nHypnosis for Brain Power & Improved Self Mind Control: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8zNHZiQ6z_Ymtqy1HO1ka-\nHypnosis with Binaural Beats & Brainwaves Music: ► https://www.youtube.com/watch?v=GI5yDfkv4a4\nHypnosis for Higher Self & Spirit Guide: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP_TulTkpff6oRzJiRhbz2L1\nHypnosis for ASMR: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP-QH1sXBEnG7LT06yjLFfcS\n\n____\nOriginal footage and photography by Michael Sealey © 2015\n\nRoyalty Free Stock Footage and Animations credits:\nFootage Island \nhttp://www.youtube.com/user/footageisland/videos\n\nMusic credit:\n\"Tranquility Base\"\nKevin MacLeod\nhttp://incompetech.com/",
  "channelTitle": "Michael Sealey",
  "channelDescription": "Hypnosis | Hypnotherapy | Sleep Hypnosis | Guided Meditation\n\nHi, my name is Michael and welcome to my channel, where I hope you can stop by to relax, listen in, and see for yourself the power of positive hypnosis.\n\nHypnosis is a completely natural state of often deeply felt relaxation and focused attention, where positive suggestions can be more easily accepted by our subconscious minds. Imagine a fantastic and tranquil state of daydreaming, and that is very close to hypnosis!  \n\nHypnosis can bring us improved self control, clearer and empowered behavioural choices, and allow us to listen to our best inner resources. Many people experience a deep sense of calmness and serenity during hypnotic meditation and are often pleasantly surprised to see the ongoing, life enhancing results. \n\nThank you greatly for your support, feel free to subscribe and comment on your great results, and I trust you will benefit from your time spent with positive hypnosis.\n\nPeace & Enjoy",
  "tags": [
    "guided meditation",
    "meditation",
    "mindfulness meditation",
    "mindfulness",
    "meditation for anxiety",
    "meditation for ocd",
    "OCD",
    "meditation for depression",
    "obsessive-compulsive disorder",
    "sleep meditation",
    "meditation for sleep",
    "anxiety",
    "depression",
    "thinking",
    "positive affirmations",
    "detachment",
    "thoughts",
    "clear",
    "negative",
    "energy",
    "stress",
    "mind",
    "control",
    "body",
    "voice",
    "music",
    "relaxation",
    "lucid dreaming",
    "higher self",
    "spirit",
    "self hypnosis",
    "hypnosis",
    "sleep hypnosis",
    "sleep",
    "consciousness",
    "relaxation music",
    "meditation music"
  ],
  "publishedAt": "2015-07-15T02:00:50Z",
  "duration": 2536,
  "durationFormatted": "42:16",
  "viewCount": 26559036,
  "likeCount": 219367,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/1vx8iUvfyCY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/1vx8iUvfyCY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/1vx8iUvfyCY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/1vx8iUvfyCY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/1vx8iUvfyCY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/1vx8iUvfyCY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "proud of any person who is trying to make a change for themselves knowing how hard it could be at times. <br>bless your souls everyone.",
    "This video taught me the only technique that worked for my overthinking, anxiety and staying present  . Every time a thought comes to my head. I just say, Don’t evaluate . And immediately I stop thinking and become present. It’s life changing. Please try it.",
    "So I fell asleep listening to this guided meditation. It really puts in perspective how many people like me are suffering. It has 20 million views. That means 20 million people with ocd,anxiety, and depression. I hope everyone who comes across this video to have a happy and healthy year.",
    "If you’re reading this, you will overcome the battle in your mind. Each day you’re becoming more resilient. Watching this videos shows that. You could’ve let your thoughts eat you alive, but instead you found a solution. You rock💛 Keep on healing💕 you got dissssssss",
    "If you are scrolling to the comments because you&#39;re having difficulty and are distracted, that&#39;s totally normal. Keep listening. It gets easier with time. &lt;3"
  ],
  "channelSubscriberCount": 1970000,
  "channelVideoCount": 229
}