{
  "video_id": "1YdKRdxZ9uI",
  "title": "Grounding Yourself into Positive Energy (15 Minute Guided Meditation)",
  "description": "Grounding yourself into Positive Energy...This is an Original guided meditation recorded by us.  \n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "10 minute meditation",
    "meditation 10 minutes",
    "guided meditation 10 minutes",
    "grounding",
    "positive energy"
  ],
  "publishedAt": "2024-07-22T09:00:02Z",
  "duration": 931,
  "durationFormatted": "15:31",
  "viewCount": 145242,
  "likeCount": 3749,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/1YdKRdxZ9uI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/1YdKRdxZ9uI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/1YdKRdxZ9uI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/1YdKRdxZ9uI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/1YdKRdxZ9uI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/1YdKRdxZ9uI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "just been diagnosed with quite a rare disease for my age (I&#39;m 21 and about 90% of people who get this are over 60!!) and starting treatment has been rough🙏 this has come at a perfect time! Trying to be positive even at the worst times♡ x",
    "Thank you in a room full of noise I am quiet and calm within.",
    "This is the perfect kind of meditation to listen to for my birthday! Thank you GM for helping me bring out my best self every year! 🎉🎊😁",
    "Thanks!",
    "I felt very tired and no energy through my body. I am glad I found you  to help me feel grounded and remind myself that I am enough just the way I am. Ready to face the rest of the day. Thanks 🤗"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}