{
  "video_id": "24Rn_u5ow-Q",
  "title": "Deep Relaxation in 7 Minutes (Guided Meditation) “The Circle of Wisdom”",
  "description": "A short guided meditation that will induce deep relaxation as it conveys you to a mysterious land within a circle of wisdom stones, under the star-filled night sky.  This deep relaxation guided mediation will allow you to communicate with the universe and receive wisdom, leaving you deeply relaxed and at peace. \n\nThis track is a remaster of the original track from our \"GATEWAYS TO SERENITY\" album; a unique collection of 13 short, fantasy guided meditations, designed to quickly calm your mind and bring you into a deep state of relaxation within the shortest possible time. \n\nThe GATEWAYS TO SERENITY MP3 album is here:  https://www.thehonestguys.co.uk/digital-downloads/gts1-mp3\n\n____________________________________\n\nWe are The Honest Guys and since 2009 we have been providing very high-quality guided sleep meditations, mindfulness meditations, and sleep music for anyone who needs it.\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. \nMany of our guided sleep meditations are done as fantasy sleep stories containing wonderful guided imagery and visualizations, often in first-person perspective, where you get to meet mythical beings of legend, elves and others who interract with you and help you on your journey toward sleep. \n\nAll of our very high quality productions are produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer others.\n\n___________________________________\n\nIf you enjoy our work, please consider purchasing one of our high-quality productions: https://www.thehonestguys.co.uk/products\n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n___________________________________\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n___________________________________\n\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\n___________________________________\n\n#gatewaystoserenity #shortmeditations #quickmeditation #guidedmeditation #thehonestguys",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "deep relaxation",
    "short meditation",
    "deep relaxation guided mediation",
    "guided meditation",
    "meditation",
    "meditation guided",
    "guided imagery",
    "male voice",
    "english male voice",
    "the honest guys",
    "quick meditation",
    "relax quickly"
  ],
  "publishedAt": "2023-05-21T20:12:58Z",
  "duration": 403,
  "durationFormatted": "6:43",
  "viewCount": 56875,
  "likeCount": 664,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/24Rn_u5ow-Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/24Rn_u5ow-Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/24Rn_u5ow-Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/24Rn_u5ow-Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/24Rn_u5ow-Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/24Rn_u5ow-Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Wishing everyone hope, peace and health and hoping that you will find this short guided meditation exercise useful. This is remastered from an older work and is created to enable you to find relaxation in a few minutes. It’s especially useful when we’re pushed for time because even 5 or ten minutes is healing and healthful to both mind and body. We hope you find it useful",
    "Wow, this guided meditation really helped me find a peaceful sanctuary within myself. The soothing voice and tranquil visuals transported me to a serene world of wisdom stones. In just 7 minutes, I was able to let go of all my stress and worries, leaving me feeling recharged and at ease. Thank you for sharing this incredible experience!",
    "Dear Honest Guys, you make me happy. You two look honestly nice. ❤❤❤ it’s hard to believe in good people in this world, since 95% people are egotism pure (and don’t even realise it). selfless people suffer horribly. Honestly nice people are honestly even better than meditation, which can be an mere escape from dishonest and egotistical world. So thanks for being who you are.",
    "Recommended by the Nerve Doctors. SO GLAD I FOUND YOU..will be passing this amazing channel on to my daughters and friends.THANK YOU ❤",
    "wowowowow!<br><br>the voice, the sound effects, the proper guidance with the right words! <br>it made my whole body shiver! <br>I was RELEASING tension from my body, litterally without my control, it was shaking itself.<br>I was shaking like crazy, and all the tension I had in my body got released and I feel so relieved! <br>I&#39;ve NEVER experienced something like this ever before!!!<br>This was MAGIC!<br><br>I even connected with my inner insecurities, and they asked questions like &quot;am I loved?&quot; &quot;will I be okay?&quot; <br><br>and the voice responded back &quot;yes you will, yes you are!&quot; <br><br>it was INTENSE!"
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}