{
  "video_id": "2DXqMBXmP8Q",
  "title": "The Powerful Release of Letting Go!  Guided Meditation",
  "description": "This is an Original guided meditation recorded by us.    Letting go is not just about releasing attachments to material possessions or past relationships, it's also a spiritual practice that involves surrendering to the flow of life and trusting in a higher power.  It requires us to release our fears, doubts, and worries, and have faith that everything is happening for a divine reason.  Letting go allows us to connect with our true selves and the universe, and to live in a state of peace, love, and harmony.  May we all have the courage to let go of what no longer serves us and trust in the infinite wisdom of the universe.\n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "30 minute meditation",
    "guided meditation 30 minutes",
    "letting go",
    "letting go meditation",
    "releasing meditation",
    "guided meditation releasing",
    "guided meditation letting go"
  ],
  "publishedAt": "2023-04-19T09:00:01Z",
  "duration": 1683,
  "durationFormatted": "28:03",
  "viewCount": 1916641,
  "likeCount": 31368,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/2DXqMBXmP8Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/2DXqMBXmP8Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/2DXqMBXmP8Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/2DXqMBXmP8Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/2DXqMBXmP8Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/2DXqMBXmP8Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;ve been suffering from a terrible broken heart. I am I&#39;m about to do everything I can to let go. Please say a prayer for me I just want to  heal. <br>Update, thank you everyone for the kind words. I needed each and everyone. That being said it was around seven months. I started to finally feel better. I did a lot of research and I had to feel my way through it and grieved fully. I will say that I didn&#39;t realize how unhappy I was even though I didn&#39;t go. I will say that I am now living the life of my dreams. Without an ending, there would not be a new beginning. I learned a lot about myself as I had to dig deeper than I have ever had to dig. I am forever grateful. Love and light. Remember the universe has a plan. Some people are just not in it.",
    "I’ve come to understand that my worth isn’t defined by my struggles. When anxiety had a grip on me, reading Shift Your Mind by Alexander Brooks completely changed my outlook. It gave me the tools to let go of fear and find calm within. Now, I remind myself daily that I deserve happiness, love, and inner peace.",
    "to whoever needs to hear this, it’ll be okay! this is only temporary and all of your dreams will come true!🍀",
    "obsession,depression,anxiety,Worrying ,nervousness,detachedment is all gone and I’m a new brand person with a new mindset.",
    "Let us release those things that no longer serve us!"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}