{
  "video_id": "2En0LrCWoGI",
  "title": "35 MIN FULL BODY PILATES WORKOUT FOR BEGINNERS || No Equipment",
  "description": "Hope you enjoy this 35 Minute Full Body Pilates Workout for Absolute Beginners. Whether you are new to Pilates or just want to slow things down, this workout is for you. No equipment needed, just you and your mat. 😊\n\n\n🌸 Wearing Dharma Bums Active\nhttps://www.dharmabums.com.au/\n\n\n🤍 INSTAGRAM: @movewithnicole\n🤍 EMAIL: movewithnicole.yt@gmail.com\n\n\n🎥 Videography by Bodie Rex\n♫ Music from Epidemic Sound\nhttps://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 35 minutes full body",
    "pilates workout 35 minutes",
    "35 minutes pilates workout",
    "35 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "35 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "pilates for beginners",
    "move with nicole",
    "beginner pilates",
    "absolute beginners"
  ],
  "publishedAt": "2021-06-06T11:06:11Z",
  "duration": 2206,
  "durationFormatted": "36:46",
  "viewCount": 2571128,
  "likeCount": 56058,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/2En0LrCWoGI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/2En0LrCWoGI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/2En0LrCWoGI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/2En0LrCWoGI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/2En0LrCWoGI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/2En0LrCWoGI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To be honest I feel a little bit ashamed of myself for finding this workout hard after reading the comments but I know I got myself into a very bad deep hole after getting diagnosed with my thyroid diseases and gaining a lot of weight surely did noting good but here I am trying to get myself together I hope in the future It will be an easier beginner workout for me too until than I am going to practice and fight. Have a good day today and tomorrow everyone 🥰",
    "Taking it back to basics today with this 35 minute Beginner Pilates class. If you are new to pilates or just want to slow things down, this class is for you.😊 Let me know how you go and if you would like to see more beginner classes. 💕",
    "This was my first pilates workout, i usually did hiit&#39;s and weight workouts, after which felt like I was doing these workouts not because I want to be healthy, but because I am chasing beauty standards, it is very tiring and I decided to change my routine to stay active but with less intensity, and as it turned out, I really liked Pilates! I really liked how you explained each step and taught how to breathe, because I often forget about breathing, I felt many muscles and for the first time in a long time I feel more positive and cheerful than tired with just the desire to lie down, thank you very much for your work.",
    "I loved doing the moves more mindfully instead of rushing through to sweat it out. Thank you!!",
    "Thank you for going slow and using a soothing voice. I’m 75 and this is a first Pilates experience for me. Looking forward to being a better me ❤"
  ],
  "channelSubscriberCount": 4470000,
  "channelVideoCount": 229
}