{
  "video_id": "2LjHKZQLrkg",
  "title": "Guided Meditation to Reduce Anxiety - Relax and Calm Your Mind and Body",
  "description": "This guided mindfulness meditation will provide deep healing and positive karma as you focus on relief from anxiety and stress while finding a way to relax and calm your thoughts and mind. The clarity of a clear and present mind means that you can better enjoy the joyful mysteries of life and greater positive karma could come your way! This session has insight into our connection to our mind and how we are benefitted from staying present and still in each moment. Regular mediation practice can be transcendental to your health and wellness. You are strong and you really do have the power to calm your mind and reduce unnecessary stress and anxiety.\n\nThis meditation session is about 13 minutes long followed by 3 minutes of ambient background music to ease you back into the rest of your day or night. This can be a great session either in the morning, midday, or before sleep… really any time daily that you need it!\n--------\nMindful Peace Journey is a YouTube channel where I strive to create some of the most calming and relaxing online guided meditations on YouTube - I hope you find them to be some of the best out there for self-help! Many videos are under 15 minutes. Some of the most popular topics are better sleep, morning sessions, 432hz healing frequency focus, self love, and healing anxiety. Some believe that meditation is especially healing when there is a full moon! \n\nThe ambient music sessions can be great for either non-verbal meditation or yoga, or those into zen or chakra meditation. If you enjoyed these sessions, please subscribe and visit my website for a meditation guide and more information: http://www.mindfulpeacejourney.com​\n\nMindful Peace Journey and Relax and Sleep Journey are for any spirituality, whether Christian, Buddhist, Non-religious, or any other belief system!\n\nSUPPORT THIS CHANNEL ON PATREON and get SoundCloud streaming:\n🙏 https://www.patreon.com/mindfulpeace\n------------\nSEE ALL OF THE MEDITATION VIDEO SESSIONS AND SUBSCRIBE: \n💛https://www.youtube.com/c/mindfulpeace\n------------\nLIKE THE MINDFUL PEACE JOURNEY FACEBOOK PAGE:\n🤝https://www.facebook.com/mindfulpeacejourney\n\nPlease note that this content is for educational/entertainment purposes only. No information is to be taken as medical advice. Do not drive or operate machinery while listening to this or any meditation session.\n----\nMeditation can help with mental health and wellness, but it may not be a complete solution alone. Don't hesitate to use these important resources depending on your situation:\n\nSubstance Abuse and Mental Health Services Administration\n1-800-662-HELP (4357)\nhttps://www.samhsa.gov/find-help/\n\nSuicide and Crisis Lifeline: Dial 988\nhttps://www.samhsa.gov/find-help/988\n\nOnline or in-person therapy can be a beneficial health resource!\n----\nAll dialogue and music is original by Mindful Peace Journey. The beautiful particle video is by a favorite Pond5 creator, davedigitalfx. Thank you! Thank you also to my wonderful Patreon supporters. And lastly, thank YOU for watching/listening and please subscribe!\n\nSome keywords associated with this meditation include: \nAnxiety, Stress, Meditation, Relaxation, Mindfulness, Breathing exercises, Calmness, Peacefulness, Yoga practice, Deep breathing, Grounding techniques, Guided imagery, Self-care, Progressive muscle relaxation, Mental clarity, Inner peace, Tranquility, Stress management, Mind-body connection, Serenity\n\n#anxietyrelief #meditationjourney #relaxation",
  "channelTitle": "MindfulPeace",
  "channelDescription": "Original deep, calming meditation videos to promote mindfulness and inner peace for any spiritual belief. Have less anxiety, get better sleep, and experience more joy through mindfulness and meditation!",
  "tags": [],
  "publishedAt": "2024-05-14T11:00:02Z",
  "duration": 961,
  "durationFormatted": "16:01",
  "viewCount": 171547,
  "likeCount": 2437,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/2LjHKZQLrkg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/2LjHKZQLrkg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/2LjHKZQLrkg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/2LjHKZQLrkg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/2LjHKZQLrkg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/2LjHKZQLrkg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I found a lot of peace while making this meditation, I hope that you find it, too! 🙏",
    "We&#39;re ok guys, we are ok.. hugs and love to all who need it. We got this",
    "This new meditation opened my eyes to the fact that I have been living in the future, and that is where the stress is coming from. Thank you for opening my eyes and giving me peace.❤",
    "I could feel my stress melting away with every breath. This guided meditation is a reminder that peace is always within reach.",
    "After endless panick attacks hospitals and all. This is the bessstttt meditation the only one that’s helping ❤❤❤❤❤ didn’t have a panick attack after listening to this every night for 2 weeks now! <br>Even if had smth just small heart palpilations but no more severe attacks it is regressing and my heart brain mind all is coming back to normal day by day. Very calming and helping❤"
  ],
  "channelSubscriberCount": 229000,
  "channelVideoCount": 217
}