{
  "video_id": "2XfT8iWx394",
  "title": "20 Minute Yoga For Beginners And Athletes",
  "description": "20 minute yoga flow practice for beginners and athletes on your rest day or to get started with the asana practice.\n🧘Truly deepen your practice with our Breathe and Flow wolfpack platform (free 7 day trial!): https://practice.breatheandflow.yoga\n🌈 Daily yoga 30 day calendars: https://www.breatheandflow.yoga/ritual\n🐺 Join the wolfpack:\nhttps://www.instagram.com/breatheandflow\nhttps://www.tiktok.com/@breatheandflow\nhttps://www.youtube.com/breatheandflow\nhttps://twitter.com/breatheandflow\n\n📚 Book and equipment suggestions: https://bit.ly/bnfkits\n🛜 Website: https://www.breatheandflow.yoga\n💬 Join the discussion: https://bit.ly/3z8P1JU\n🎧 Music for yoga: https://spoti.fi/3gpV2c6\n🍄 Mushroom supplements (use code BREATHEFLOW): https://bit.ly/3xjrIOI\n🔥 Our medicine family and shamans: https://bit.ly/2Ufi4fW\n☯️ Structural integration bodywork with Flo: https://bit.ly/FLO-SI\n\nMusic: Animal Hug - Giants_ Nest\n\nLove and Gratitude,\nBre & Flo\n\n***\n\nBreathe and Flow is a travel, yoga and lifestyle channel owned by Bre and Flo Niedhammer. Knowing that the body benefits from movement while the mind benefits from stillness, we share our philosophy of mental stillness through the fluidity of a strong practice. Bre and Flo are Registered Yoga Teachers (RYT) with Yoga Alliance® holding the highest certifications as E-RYT500, and are also Yoga Alliance Continuing Education Providers (YACEP). Combined they are trained in Vinyasa yoga, Hatha yoga, Yin yoga, Myofascial Release (MFR), Reiki, pre- and postnatal yoga, Functional Movement Screen (FMS) Level 1 and 2, Animal Flow, Kinstretch, Functional Range Conditioning (FRC) mobility training, Functional Range Assessment (FRA) and structural bodywork (Anatomy Trains). Bre and Flo have taught at several premium yoga studios for many years and are teaching their teacher trainings, retreats, workshops and at festivals around the world. They currently live in Las Vegas, Nevada. Learn more about them and their certifications on their website: https://www.breatheandflow.yoga/about\n\nOur disclaimer: https://www.breatheandflow.yoga/disclaimer\n\n#breatheandflow #yoga #yogawithbnf",
  "channelTitle": "Breathe and Flow",
  "channelDescription": "We teach yoga retreats, teacher trainings and online classes to help you live your most authentic life. Learn more https://www.bnf.yoga ❤️🙏\n",
  "tags": [
    "breathe and flow",
    "vinyasa yoga",
    "bre and flo",
    "bre niedhammer",
    "flo niedhammer",
    "flo.yoga",
    "bre.yoga",
    "yoga practice",
    "vinyasa flow",
    "breathe and flow yoga",
    "power yoga",
    "movement",
    "full body yoga",
    "total body yoga",
    "functional yoga",
    "functional flow",
    "functional movement",
    "yoga flow",
    "vinyasa yoga flow",
    "yoga fascia",
    "myofascia yoga"
  ],
  "publishedAt": "2023-08-14T14:00:02Z",
  "duration": 1271,
  "durationFormatted": "21:11",
  "viewCount": 1167703,
  "likeCount": 11534,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/2XfT8iWx394/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/2XfT8iWx394/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/2XfT8iWx394/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/2XfT8iWx394/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/2XfT8iWx394/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/2XfT8iWx394\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "🧘Truly deepen your practice with our Breathe and Flow wolfpack platform: <a href=\"https://practice.breatheandflow.yoga/\">https://practice.breatheandflow.yoga</a>",
    "I&#39;m 50 years young getting into yoga . <br>Thank you for the routine , enjoyed very much, got a lot out of it . Good pace and claim. Thanks again see you tomorrow 🇬🇧",
    "Preparing for the mcat and getting Covid shook me. I began losing control of my mind and body over the past few months. I want to feel safe with myself again and this video combined with a day of cleaning, my first run in over a month, and lots of rest give me hope. Thank you Bre and Flo.",
    "This is my favorite gentle yoga by far for recovery or right after workouts.   I neglected my yoga and meditation practice for over a year.  I was not being consistent every day and I practiced yoga and meditation here and there.  Life got in the way and it started to turn into a vicious cycle.  I live with chronic pain and illness, my pain started to get worse and I started to get nightmares again every night from my childhood trauma.  I started watching your channel again and implemented Tara Brach’s meditation practices the last 3 days and I’m already noticing a difference.  Thank you Bre and Flo!  I’ve been waking up with less pain and my nightmares have settled down.  Much gratitude!  I will make sure to stay committed and not go off track.  It’s not worth it.  Namaste 🙏🏼🩷",
    "My first week stretching for a long time. Every day I end up beaten thanks to flow, keep it going man, I feel the weakness leaving my body. As in mindfulness we say: just begin again. Good job sr"
  ],
  "channelSubscriberCount": 4270000,
  "channelVideoCount": 836
}