{
  "video_id": "2xPxOHXyBJk",
  "title": "15 min Full Body Workout with Dumbbells",
  "description": "We have 3 rounds to work from head to toe and the only thing you need is a set of dumbbells and 15 minutes! This full body workout targets the lower body, upper body, and abs to give you an awesome strength session when you are short on time or want to add a quick dumbbell workout to your cardio session!\n\nThis workout includes several compound exercises to ensure an awesome total body blast! I will also include modifications for some exercises, so this full body workout is great for all levels from beginner to advanced!\n\nFULL BODY WORKOUT EQUIPMENT, STRUCTURE, AND EXERCISES\n\nEQUIPMENT\n- DUMBBELLS - I used 5kg, 7.5kg, and 10kg.\n- EXERCISE MAT\n- WATERBOTTLE\n- TOWEL\n\nSTRUCTURE\nWORK: 50 REST: 15\n3 ROUNDS 3 EXERCISES PER ROUND\nREPEAT EACH EXERCISE IN A 2-1-2  STRUCTURE \n\nEXERCISE LIST\nLOWER BODY ROUND\n- SQUAT TO REAR STEPPING LUNGE\n- SUMO SQUAT PULSE\n- GLUTE BRIDGE\n\nUPPER BODY ROUND\n- CURL TO PRESS\n- TRICEP PUSHUPS\n- BENT OVER ROW\n\nABS/CORE ROUND\n- CRUNCH AND TWIST\n- ISO HOLD OR C-SIT\n- PLANK DUMBBELL PASS\n\n\nDon't forget to complete a proper warm-up before each workout or check this 5-minute warm-up out here! https://www.youtube.com/watch?v=LKSC_KujZ4g\n\nThanks for working out with me! It's always better to work out with a friend!\n\nKaleigh\n\n⭐️ Find tips, recipes, and more here! 👉  https://www.kaleighcohen.com \n\n⭐️ Find all of the equipment used for these workouts here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/channel/UC0PZtgIWY5__DxIR0iVttQA\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ Tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.\n\n\n#Dumbbell #FullBody #AtHome",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [
    "full body workout with dumbbells",
    "dumbbell workout",
    "full body workout",
    "full body dumbbell workout",
    "dumbbell workout at home",
    "home workout",
    "total body workout",
    "workout with weights",
    "strength training",
    "full body workout at home",
    "dumbbell full body workout",
    "strength workout",
    "dumbbell strength workout full body",
    "full body dumbbell workout follow along",
    "full body dumbbell workout at home follow along",
    "at home dumbbell workout",
    "full body workout with weights",
    "Kaleigh cohen"
  ],
  "publishedAt": "2022-07-14T09:00:02Z",
  "duration": 1028,
  "durationFormatted": "17:08",
  "viewCount": 226222,
  "likeCount": 3442,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/2xPxOHXyBJk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/2xPxOHXyBJk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/2xPxOHXyBJk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/2xPxOHXyBJk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/2xPxOHXyBJk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/2xPxOHXyBJk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "It’s only 15 minutes I thought , how hard can it be I thought , it was an intense 15  minute all over workout , short breaks in between , loved it . Thank you kaleigh",
    "I didn&#39;t think you could kick my ass in 15 minutes, but you slaughtered me!!!! I love it! Thank you ❤",
    "This is like, the perfect strength workout for me! Only 15 minutes and covers all the bases! Definitely going in my playlist! 🥵",
    "I just looked at Stella the whole time, wishing I was a plumped up pug. She was my motivation ❤ amazing work out.",
    "I got up early and thought I’ll pick a full body work out to do before I go to work…and I’ll I had to do was come to KCF strength and here’s a new one waiting for me!  Thanks Kaleigh!  What a great way to start the day!"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}