{
  "video_id": "30PqX2zvK88",
  "title": "8 Bodyweight Exercises EVERYONE Should Do! (Hit Every Muscle)",
  "description": "8 of the best bodyweight exercises to tone and strengthen your muscles at home. Includes beginner, intermediate, and advanced options for upper body, lower body, and core exercises to maximize your results. Keep reading for links mentioned in the video!\n\nJARED’S DOORWAY PULL-UP BAR: https://urlgeni.us/amzn/pullupbar\n\n======================================\nOTHER HOME WORKOUTS YOU MIGHT ENJOY\n\nAT HOME BACK WORKOUT - NO EQUIPMENT: https://youtu.be/J6de47GLTKQ\n\n30-MINUTE LISS CARDIO WORKOUT - NO EQUIPMENT: https://youtu.be/sPGNkGU2LqY\n\n10-MINUTE PLANK CHALLENGE: https://youtu.be/LYvB7TwpC6E \n======================================\n\nNo gym membership? No equipment? NO PROBLEM!\n\nYou don’t need weights, pulleys, or bands to get in a great strength-training workout. In fact when performed correctly, the right bodyweight exercises can yield similar gains in strength and muscle tone as performing resisted training in the gym.\n\nThe key is scaling your home exercises to the appropriate intensity to stimulate the muscle to grow. To put it simpler - if your exercises are hard enough, you can still see great gains without the need for any equipment.\n\nWHAT ARE THE BEST BODYWEIGHT EXERCISES?\n\nWhenever anyone asks me my opinion for which bodyweight exercise is the “best”, I never quite know how to answer the question. “Best” can mean so many different things - best for muscle strength? Best for power? Best for muscle tone? Best upper body? Best lower body? Etc etc.\n\nFor the purposes of this video, I’ve decided to focus on the “best” bodyweight exercises for each of the major muscle groups in the body - Best Bodyweight PUSH Exercises (for the upper body and lower body), Best Bodyweight PULL Exercises (for the upper body and lower body), Best Bodyweight Core Exercises, and we finish off with my Best Bodyweight Total Body Exercise.\n\nI created this list for you based off my expertise with movement, function, anatomy, and EMG studies. These 8 bodyweight exercises should be foundational in any effective home workout plan and I hope you’re performing them regularly.\n\nTHE BEST BODYWEIGHT EXERCISES - NO EQUIPMENT REQUIRED! (Click on the time stamps to see that part in the video)\n\nPush Ups (1:11)\nPull Ups (2:20)\nPlanks (3:47)\nSide Planks (4:46)\nSingle Leg Glute Bridge (5:51)\nSquats (7:01)\nLunges (8:22)\nBurpees (9:52)\n\nIncluding these 8 standard bodyweight exercises is the fastest way to see gains in muscle strength and development with no equipment available.\n\nBe sure to LIKE this video if you found it useful!\n\nAlso SUBSCRIBE to Tone and Tighten here on YouTube so you never miss a new video from me\n\nThanks so much for watching!\n\n\n\n-DISCLAIMER- this video is intended for educational purposes only. Any participation in any activity demonstrated is completely voluntary and the act of the participant only. By watching and participating in these activities you are solely responsible for any and all consequences and disclaim Tone and Tighten from any damage or injury caused or perpetuated by your participation in these exercises.",
  "channelTitle": "Tone and Tighten",
  "channelDescription": "Hi - I'm Jared! I am a doctor of physical therapy who specializes in rehabilitating orthopedic (back, neck, shoulder, knee, etc) and postpartum (diastasis recti) conditions. I love being fit, healthy, strong, and active, and hope to help you accomplish your fitness goals. On this channel you'll learn best treatments for common injuries through exercising and stretching, and how to become a fitter, healthier version of yourself. Please consider subscribing!\n\nDISCLAIMER: The content on this channel is NOT medical advice and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Use of this content is at your sole risk.\n",
  "tags": [
    "bodyweight exercises",
    "best bodyweight",
    "best bodyweight exercises",
    "body weight exercises",
    "bodyweight workout",
    "upper body bodyweight exercises",
    "lower body bodyweight exercises",
    "strength exercises at home",
    "at home exercises",
    "at home strength exercises",
    "no equipment exercises",
    "no equipment exercise at home",
    "no equipment workout",
    "home exercises",
    "bodyweight exercises for men",
    "bodyweight exercises for women",
    "tone and tighten",
    "jared beckstrand"
  ],
  "publishedAt": "2020-09-17T12:45:00Z",
  "duration": 717,
  "durationFormatted": "11:57",
  "viewCount": 1688611,
  "likeCount": 40880,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/30PqX2zvK88/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/30PqX2zvK88/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/30PqX2zvK88/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/30PqX2zvK88/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/30PqX2zvK88/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/30PqX2zvK88\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "What’s your favorite bodyweight exercise? Did it make the list? Comment below and we’ll continue to grow the list together! Thanks so much for watching, be sure to leave a “THUMBS UP” if you found the video helpful, and I’ll see you again soon.",
    "<a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=78\">1:18</a> the push up<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=183\">3:03</a> inverted row<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=230\">3:50</a> plank<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=309\">5:09</a> side plank<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=364\">6:04</a> single leg bridge<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=428\">7:08</a> air squat<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=506\">8:26</a> lunge<br><a href=\"https://www.youtube.com/watch?v=30PqX2zvK88&amp;t=606\">10:06</a> burpee",
    "I’ve read a lot of fitness books, but this one truly stands out! Muscles: Every Man’s Dream helped me finally understand how to build muscle the right way.",
    "1. Push up<br>2. Pull up<br>3. Plank<br>4. Side Plank<br>5. Single raise leg<br>6. Squats<br>7. Lunges<br>8. Burpee<br>(Watch the whole video for easy-difficult version and  variations of each exercise)",
    "Im 14. Ive been doing this everyday for three months. I look feel and am doing better then most young adults. This man is a savior. Thanks to him I’m winning"
  ],
  "channelSubscriberCount": 2750000,
  "channelVideoCount": 641
}