{
  "video_id": "358IFvrnyKY",
  "title": "Guided Meditation for Calm (Anxiety / OCD / Depression / Pain) Spoken by Michael Sealey",
  "description": "If you're in need of some healing serenity, or you would simply like a soothing, relaxing time out to calm yourself down, I have created this guided meditation for calm, just for you. This spoken meditation encourages a relaxing awareness of the breath, and also a gentle detachment from any effects of anxiety, OCD, depression, or pain. This meditation session is also useful for alleviating symptoms of rumination, or overthinking, and for relaxing the mind and body into your very best of nightly, calm and deep sleep. \n\nFollow along with my channel and subscribe: http://www.youtube.com/subscription_center?add_user=MichaelSealey\n\nDownload this Guided Meditation as a FREE audio MP3 track: ► https://michael-sealey.dpdcart.com/cart/add?product_id=213206&method_id=232417\n\n==================\n\nEnjoy and explore more of my sleep meditation and sleep hypnosis experiences: \n\nSleep Meditation for Detachment from Over-Thinking: https://youtu.be/jbw8VSkWxxs\n\nSleep Hypnosis Fall Asleep Fast 4 HOURS Collection: https://youtu.be/FwH25p7vlao\n\nSleep Hypnosis for Regaining Confidence: https://youtu.be/2H1On9pr7y4 \n\nDeep Sleep Meditation Rain Relaxation Healing: https://youtu.be/NInvVfexyfA\n\nSleep Hypnosis for Clearing Subconscious Anxiety: https://youtu.be/hCWzJ_Tk8io\n\nHypnosis to Let Go of Negative Attachments: https://youtu.be/IrY_b_teSX8\n\nSleep Meditation Fall Asleep in Minutes: https://youtu.be/obvfbKND-fM\n\n==================\n\nThis guided meditation is a form of mindfulness meditation and guided visualisation, using techniques of mindful witnessing, body scan, and elements of self hypnosis; with spoken voice suggestions, accompanied with a soothing soundscape of gentle background sleep music and tranquil ocean waves, to encourage the best of your relaxing, inner peace.\n\nThis meditation may be repeated as often as you choose, to strengthen and reinforce all of your positive intentions for your inner calm; for anytime of the day, or for relaxing into a deep sleep.\n\nThis guided meditation is suitable for repeated listening. Regular listening to this meditation will help compound all positive suggestions for your own mind, body and spirit's holistic healing.  \n\nThe ending of this session will offer suggestions for relaxing into a comforting, refreshing and rejuvenating sleep, or for re-orienting to a fully alert, conscious and aware, more peaceful presence.\n\nDo not listen to this recording whilst driving or operating machinery. \n\nPeace & Enjoy!\n\nP.S. Please LIKE & SHARE this video with those who you think might benefit from this positive guided meditation for calm, thank you.\n\n==================\n\nDownloads on iTunes: ► https://itunes.apple.com/au/artist/michael-sealey/id921827456\n\nSleep Meditation 4 x MP3 Digital Audio Collection: ► https://michael-sealey.dpdcart.com/cart/add?product_id=155119&method_id=165916\n\nDepression & Anxiety Recovery Pack 5 x MP3 Digital Audio Collection: ► https://michael-sealey.dpdcart.com/cart/add?product_id=121819&method_id=129715\n\nPopular Playlists: \nGuided Meditations: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8Co6HAHWqYCrE5xQyA1u62\nSleep Hypnosis: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP_Po7RGMHFJ4kNbavmHhYhJ\nHypnosis for Anxiety: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8mmOMo4zFsk7JeSxdEeZbt\nGuided Self Healing & Positive Energy: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8Cwlg0Frc7NiFHPl9B50YV\nLucid Dreaming Hypnosis: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP8M3iWPQtEl9fOZfvLOjxnK\nSleep Talk Down: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP9MF2TElm8PibC9DgVk-C-N\nHypnosis for ASMR: ► https://www.youtube.com/playlist?list=PLO9OtUmChpP-QH1sXBEnG7LT06yjLFfcS\n\nOriginal vocals and video by Michael Sealey © 2021\n\nImages via Shutterstock.",
  "channelTitle": "Michael Sealey",
  "channelDescription": "Hypnosis | Hypnotherapy | Sleep Hypnosis | Guided Meditation\n\nHi, my name is Michael and welcome to my channel, where I hope you can stop by to relax, listen in, and see for yourself the power of positive hypnosis.\n\nHypnosis is a completely natural state of often deeply felt relaxation and focused attention, where positive suggestions can be more easily accepted by our subconscious minds. Imagine a fantastic and tranquil state of daydreaming, and that is very close to hypnosis!  \n\nHypnosis can bring us improved self control, clearer and empowered behavioural choices, and allow us to listen to our best inner resources. Many people experience a deep sense of calmness and serenity during hypnotic meditation and are often pleasantly surprised to see the ongoing, life enhancing results. \n\nThank you greatly for your support, feel free to subscribe and comment on your great results, and I trust you will benefit from your time spent with positive hypnosis.\n\nPeace & Enjoy",
  "tags": [
    "guided meditation",
    "guided meditation for calm",
    "meditation for calm",
    "calm meditation",
    "meditation",
    "michael sealey",
    "sleep meditation",
    "meditation for sleep",
    "guided meditation for sleep",
    "sleep meditation guided",
    "calm",
    "sleep",
    "guided meditation for anxiety",
    "meditation for anxiety",
    "anxiety",
    "OCD",
    "depression",
    "pain",
    "sleep meditation anxiety",
    "sleep hypnosis",
    "hypnosis",
    "hypnosis for sleep",
    "guided meditation depression",
    "guided meditation pain",
    "meditation sleep",
    "pain relief",
    "guided meditation sleep"
  ],
  "publishedAt": "2021-06-28T02:17:39Z",
  "duration": 2721,
  "durationFormatted": "45:21",
  "viewCount": 1112052,
  "likeCount": 12624,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/358IFvrnyKY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/358IFvrnyKY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/358IFvrnyKY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/358IFvrnyKY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/358IFvrnyKY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/358IFvrnyKY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hi all, I just wanted to let you know there is a free bonus MP3 download for this meditation, and you can find the link in the description box. May today be calm and wonderful for you :) <br>I&#39;d love for you to join me on my channel, and you can subscribe here: <a href=\"http://www.youtube.com/subscription_center?add_user=MichaelSealey\">http://www.youtube.com/subscription_center?add_user=MichaelSealey</a><br>For more relaxation, you might also enjoy this sleep meditation: <a href=\"https://www.youtube.com/watch?v=jbw8VSkWxxs\">https://youtu.be/jbw8VSkWxxs</a>",
    "When it gets to 4.00 in the morning and the ill-health and  depression is really settling in then Michael is my go- to place.",
    "10 week old puppy was crying in her crate. I clicked Michael&#39;s voice. Pup began to quiet almost instantly. I turned it up as much as I could on my phone. She didn&#39;t whimper when he talked. Completely silent in under 45 seconds. THANK YOU!",
    "Words don’t describe the anxiety I get along with true physical symptoms. I’ve been combating this as well as working with it. Your videos have done wonders in this world full of modern medicine. I cannot thank you enough for these videos. 🙏 It’s been a struggle and still is randomly dealing with my unpredictable panics and anxious moments. These moments could take up hours or days of my time, if I didn’t listen to your videos. The voice is now my calm, literally. I’ve woken in the middle of the night and been filled with panic, then I turn this on and it takes a few moments but normalcy and grounding comes back to me, thank you so much again. Honestly to anyone who reads this, whatever you are going through, you are not alone and you will be strong enough to get past this moment and any that may come. ❤️  It just takes time, trust me, then you can look back and see what you have overcome. That is where you build strength.",
    "Michael I work in a hospital and whenever a patient tells me they have trouble sleeping, I tell them to listen to you....thanks again for your wonderful video and your soothing voice. 🙂"
  ],
  "channelSubscriberCount": 1970000,
  "channelVideoCount": 229
}