{
  "video_id": "3eay48JwTPI",
  "title": "LAZY GIRL Full Body WORKOUT - 7 min. (NO JUMPING)",
  "description": "👉🏼Please visit my store and if you purchase anything please shop here ( https://shoppinest.com/ )\n\nTRY MY WORKOUT APP FREE:  https://dailythrive.app/  HI babies! Here is an EASY workout that you can do in 7 minutes. You can do half this workout in bed, there is no jumping here so it is an apartment friendly workout as well! Let's do this lazy girl workout💕\n♡ WOMENS BEST promo code: VICKY\nSHOP HERE: https://Womens.Best/Vickyjustiz\n\n♡ MY PERSONAL IG with travel, style, and more: https://www.instagram.com/vickyjustiz/ \n♡ FITNESS IG with workout clips and fit tips: https://www.instagram.com/vickyjustizfitness\n\n♡ My VLOG Youtube channel: https://www.youtube.com/channel/UCrCqdWGQ-Z5U6ep9MBGka_A\n\n♡ Johnny's Channel / Travel Vlogs: https://www.youtube.com/johnnyurra\n\n♡ Shop my current faves on Amazon! https://www.amazon.com/shop/vickyjustiz\n\n♡ My blog: https://www.vickyjustiz.co/Blog\n\n♡♡♡♡♡♡♡♡♡♡♡♡♡♡\n\n♡ Partnership Inquiries: Hello@Vickyjustiz.com\n\n\nIMPORTANT DISCLAIMER: Vicky Justiz is a NASM Certified Personal Trainer. She strongly recommends that you consult with your physician before beginning any exercise program. You should be in good physical condition and be able to participate in the exercise. Vicky Justiz is not a licensed medical care provider and represents that she has no expertise in diagnosing, examining, or treating medical conditions of any kind, or in determining the effect of any specific exercise on a medical condition. Some titles and descriptions may include certain SEO keywords that may be perceived as misleading or may be perceived as a guaranteed result. Results vary from person to person and a video title / description should not be taken as an absolute truth.",
  "channelTitle": "Vicky Justiz",
  "channelDescription": "MY WORKOUT APP ➡️ https://www.dailythrive.app \n\nHey Friends!! Welcome to my channel. Here you will find all my home workouts, fitness advice, recipes and nutrition tips. All my knowledge comes from 8+ years of experience and all my studies (qualifications: NASM-CPT). I am passionate about empowering you to move your body in the way that feels right for you, right from home. About inspiring you to put yourself first, getting to know yourself, and in that process, falling in love with yourself too.\n\nYou are not just a subscriber to me, but part of a beautiful, international community of women that will motivate each other and push each other to be the best possible versions of themselves. \n\nInsta: @VickyJustiz & @VickyJustizFitness\nTiktok: @VickyJustiz\n\nFor more personal videos and vlogs, check out my vlog channel! 💛\n\nVicky is a sponsored Women's Best Athlete\n\nBRIGHT4U",
  "tags": [
    "vicky justiz",
    "home workout",
    "exercises",
    "Home Gym",
    "summer",
    "body",
    "spring",
    "break",
    "tiny waist",
    "Small waist",
    "motivation",
    "fitness",
    "workout",
    "how to",
    "waist training",
    "full body",
    "kim kardashian",
    "toned legs",
    "lose weight",
    "gain muscle",
    "LAZY GIRL",
    "lazy girl workout",
    "no jumping workout",
    "no jumping",
    "workout for lazy girls",
    "low impact",
    "low intensity workout",
    "leg workout at home",
    "fat burn",
    "7 minutes",
    "7 min workout",
    "apartment friendly workout",
    "apartment friendly cardio",
    "full body workout"
  ],
  "publishedAt": "2020-03-03T16:38:27Z",
  "duration": 510,
  "durationFormatted": "8:30",
  "viewCount": 6667059,
  "likeCount": 212397,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/3eay48JwTPI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/3eay48JwTPI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/3eay48JwTPI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/3eay48JwTPI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/3eay48JwTPI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/3eay48JwTPI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "BIG NEWS BABES! ! I just launched my very own real-time workout app! Try it free for 7 days: <a href=\"https://dailythrive.app/\">https://dailythrive.app/</a> ♡<br>28 day kickstart challenge just started within the app, you&#39;re not too late to join and Please visit my store and if you purchase anything please shop here ( <a href=\"https://shoppinest.com/\">https://shoppinest.com/</a> )<br><br>➕ Unlimited access to all workout videos<br>➕ EXCLUSIVE workouts ranging from 10 mins to 60 mins +<br>➕ FULL LENGTH workouts including warm up &amp; cool down<br>➕ A new exclusive workout EVERY SINGLE MONDAY<br>➕ These are ALL follow along, real time workouts (no GIF workouts here 👀)<br>➕ Workout programs, challenges, &amp; schedules<br>➕ No equipment &amp; low impact options<br>➕ Some of your favorite YT videos without the ads and sponsors - go straight into the workout with no interruptions <br>➕ Available on iPhone, iPad, Apple TV, Android, Roku, Amazon Fire TV, and you can cast it form your phone to your TV!",
    "Me: Does a sit up.<br>My heart: If you don’t stop right now, I will.",
    "I love how shes straight to the point and doesnt talk about how her day has been for 20 minutes",
    "I love how she says &quot;almost at the end girls let go&quot; because I almost gave tf up.",
    "to all the people that are secretly doing this in their bedrooms with headphones in: you are perfect. and you are amazing for trying to lose some wait. i love that your putting in the effort. keep it up and i promise you will see results &lt;3."
  ],
  "channelSubscriberCount": 2000000,
  "channelVideoCount": 640
}