{
  "video_id": "3gq9HMtLGM0",
  "title": "20 Minute Everyday Yoga Flow | Daily Routine To Feel Your Best",
  "description": "Welcome to your 20 min everyday yoga flow. This class is great for all levels and includes a full body routine that you can do daily to feel your best.\n\nThis yoga flow includes options to suit all levels and is intended to give you a well rounded practice that you can come back to every day.\n\nThe sequence includes a steady vinyasa flow with hip openers, backbends, standing balances and twists. It's designed to help you feel like you've given your body everything it needs to have a great day. \n\nI hope you enjoy this everyday yoga flow. \n\nCharlie x\n\nLinks:\nOnline Programs: https://www.charliefollows.com/programs\nNewsletter: https://www.charliefollows.com/newsletter\n\nSocial Media:\nInstagram: https://www.instagram.com/charlieafollows?igsh=MWdxMjE0ZHR1bzlydg%3D%3D&utm_source=qr\nFacebook: https://www.facebook.com/charliefollowsyoga\nTikTok: https://www.tiktok.com/@charlieefollows?_t=8jbfibQBEiO&_r=1\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2024-08-11T13:00:05Z",
  "duration": 1277,
  "durationFormatted": "21:17",
  "viewCount": 487018,
  "likeCount": 10801,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/3gq9HMtLGM0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/3gq9HMtLGM0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/3gq9HMtLGM0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/3gq9HMtLGM0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/3gq9HMtLGM0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/3gq9HMtLGM0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hey guys I’ve been so excited to share this class with you. I hope you enjoy the experience practicing by the stream with me 🙏",
    "I will tell you that you are doing incredible social service to the globe. Cuz lot of them try to sell their course only but you teach a lot for free. Love from india ❤",
    "Such peace there is in the simplicity you share your wisdom with us. No self promotion, no ads,  no sponsor mentions, only nature and yoga. Your channel deserves the highest praise. THANK YOU ❤",
    "Thanks! A perfect way to start the day, loved the sound of the stream 😌",
    "I really enjoy your variety of 20 min classes. I’m much more likely to take the time to do those. Thanks"
  ],
  "channelSubscriberCount": 990000,
  "channelVideoCount": 1004
}