{
  "video_id": "3kluurmB2Kw",
  "title": "Pilates Reformer | Intermediate Pilates | Full Body Workout",
  "description": "Get ready to sweat and feel strong in this quick Pilates workout with Alex. Tone your entire body in less than 30 minutes.\n\nPlease review the following carefully\n**The purpose of this DISCLAIMER AND NOTICE is to make you conscious of the potential risks connected with activity in any exercise, physical fitness or training program. And to help you make an informed decision about whether you should participate in these activities.\nYou should understand that participating in any exercise or exercise program carries the possibility of physical injury. You should be in good physical condition and able to participate in the exercise. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.\nInjuries of all types can occur when participating in exercise, physical fitness and training programs, hence Holistic Movement Pilates strongly encourages all members to obtain a comprehensive physical examination by a licensed physician PRIOR to undertaking any exercise or training demonstrated on this website, and/or any videos, offered on this website. **Holistic Movement Pilates is not liable for any injury.**\n\n@BalancedBodyPilates @Vuoriclothing @rodemic",
  "channelTitle": "HolisticMovementPilates",
  "channelDescription": "Certified Pilates Instructor\nCertified Holistic Nutritionist \nNew videos every Monday and Wednesday. Friday bonus video Members Only.\n\nTen years ago I discovered the transformative and healing qualities of Pilates. Though I continue to instruct in studio classes, I wanted to make this practice more accessible to everyone. With over 350 Mat, Reformer, and Chair Videos and new videos being added every week you can learn the basics and continue your skills with intermediate and advanced practices as you grow and transform your body at your own pace.\n\n❊ DM or email for inquiries\n❊ https://www.instagram.com/the.holistic.movement/\n❊ holisticmovementpilates@gmail.com\n",
  "tags": [],
  "publishedAt": "2023-09-04T07:00:01Z",
  "duration": 1571,
  "durationFormatted": "26:11",
  "viewCount": 349724,
  "likeCount": 5157,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/3kluurmB2Kw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/3kluurmB2Kw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/3kluurmB2Kw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/3kluurmB2Kw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/3kluurmB2Kw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/3kluurmB2Kw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks!",
    "WOW- quick way to effectively hit the whole body. Great series! Thank you",
    "This was my first at home reformer class and it was perfect!! You are amazing! Can’t wait for my next class with you.",
    "Thanks!",
    "Thank you for the clear instructions! I could follow without looking!!🎉"
  ],
  "channelSubscriberCount": 53400,
  "channelVideoCount": 400
}