{
  "video_id": "3Mbq12LErvE",
  "title": "10 MIN BEGINNER FLOOR STRETCHES | growwithjo",
  "description": "Stretching is a fun and easy way to boost your body's flexibility and improve your overall physical health! When you stretch, you increase the range of motion in your joints and muscles, which can help to reduce the risk of injury and improve your performance in sports and other physical activities.\n\nIn addition to these physical benefits, stretching can also be a great way to relax and de-stress. Taking a few minutes to stretch can help you unwind after a long day, or provide a little pick-me-up during a busy workday.\n\nSo why not give stretching a try? Whether you're a seasoned athlete or just looking for a new way to relax and stay healthy, there's something for everyone to enjoy in the wonderful world of stretching! So, go ahead and stretch your way to a happier and healthier you!\n\nAll of the stretches will be on the floor today, so grab your mat and get ready to have a comfy stretch!\n\n_______\n\nRESULTS\n\nShare your progress on TikTok, YouTube or Instagram for a chance to be featured in my next video or on our community Youtube: @growwithjo unified\n\nRecord a video or take a picture of you doing the workout, tag me @growwithjo #growwithjo @growwithjo_unified\n\nTo get the BEST (AND QUICKER) RESULTS, follow a workout protocol that supports your goals. Get a Monday-Friday beginner-friendly plan: https://growwithjo.com/calendar/agenda\n\n_______\n\nSHOP\n\ngrowwithjo home →https://growwithjo.com/\nWorkbooks & Video Programs → https://www.godaily.ca/\nBig Booty Tight Tummy Guided Video Program (BEST SELLER): https://www.godaily.ca/bbtt-go\n\n_______\nKEEP UP WITH ME\n\nINSTAGRAM → https://www.instagram.com/growwithjo/?hl=en\nFACEBOOK → https://www.facebook.com/growwithjoofficial/\nPINTEREST → https://www.pinterest.ca/growwithjo/\nTIKTOK → https://www.tiktok.com/@growwithjo?lang=en\nCONTACT EMAIL → support@growwithjo.ca\n\n_______\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "low impact",
    "fitness videos",
    "abs",
    "absworkout",
    "workouts",
    "fit",
    "fitness journey",
    "transformation",
    "morning yoga routine",
    "10 minute yoga",
    "morning yoga stretch",
    "quick yoga",
    "10 min yoga stretch",
    "10 min yoga",
    "10 min yoga for beginners",
    "morning yoga for beginners",
    "full body stretch yoga",
    "morning yoga",
    "beginners yoga",
    "yoga for flexibility",
    "yoga for beginners",
    "yoga",
    "quad stretches",
    "yoga 10 min",
    "yoga stretch",
    "beginner yoga",
    "10 min morning stretch"
  ],
  "publishedAt": "2022-12-16T16:00:10Z",
  "duration": 646,
  "durationFormatted": "10:46",
  "viewCount": 701045,
  "likeCount": 12560,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/3Mbq12LErvE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/3Mbq12LErvE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/3Mbq12LErvE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/3Mbq12LErvE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/3Mbq12LErvE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/3Mbq12LErvE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "when is the last time you treated your body to a stretch?",
    "So, today I hit 50 pounds lost with your videos since August 1st! I rewarded myself with this stretch video ❤ Jo, you saved my life. I wish you knew how grateful I am.",
    "If you’re overweight and out of shape.. this is the video for you!!! I felt so comfortable doing all the stretching I tried doing other “stretches for beginners” videos but I had a hard time doing the damn stretches lol I’m so glad I found this video!!",
    "What a beautiful stretching routine, The music was on point and I loved the filming spot it was so peaceful and calming just what my joints needed today. Thank you Jo ❤",
    "This may sounds a bit cliché but I teared up in the middle of these stretches. Maybe it was due to the music too, but it was all sorts of emotional that I was feeling. Felt sad and fulfilled that I am now doing something for myself starting today and onward. Growing up I was always fat/overweight for my height. Tried many things in my life that never seem to work or last on the long run so I gave up for a few years. Now I am slowly pushing myself to be a healthier me. I am not getting any younger and my weight has have a tremendous affect on me that I have noticed. <br><br>Thank you for these amazing videos. I am going to be following your workout routines. It is a lot of fun and seeing you smile through these workouts made me feel the positive energy you were sending to your viewers."
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}