{
  "video_id": "3oeimlA6s68",
  "title": "20 Min ABS WORKOUT at Home [NO EQUIPMENT + NO REPEAT] Caroline Girvan",
  "description": "No equipment needed for this 20 minute at home abs workout. I do love some stretching and some extra ab work on my active rest days so I thought I would record this simple routine for you to save for those low impact days when you want to move but not affect your training the next day!\n\nThese movements are all different each performed for 50 seconds, 10 seconds brief rest. This is a slow paced routine to really encourage that extra focus on lower back flat on mat and core braced throughout.\n\nJust grab your mat and join me for a 20 minute ab routine, targeting the lower abs, upper abs, obliques and entire core!\n\nPLANK TWIST\nPLANK ALT KNEE SIDE TUCK\nDEAD BUG\nTOE TAPS\nELBOWS ALT TUCK TO EXT\nREACH TO LEG LOWER\nSTRAIGHT LEG REVERSE CRUNCH\nHIP LIFT\nLEG LOWER TO FROG TUCK\nTABLE TOP SINGLE LEG EXT\nTABLE TOP SINGLE LEG EXT (switch)\nOPP HAND TO FOOT CHOP\nOPP HAND TO FOOT CHOP (switch)\nHIP LIFT TO ALT TWIST\nCRUNCH WITH PULSE\nOPP ELBOW TO KNEE CRUNCH\nOPP ELBOW TO KNEE CRUNCH (switch)\nHUG TO HOLLOW\nBUTTERFLY CRUNCH W/ PULSE\n\nIf you are currently doing the EPIC Program, you will be aware there is a lot of movements involving stabilisation and strengthening of the core including full body movements, HIIT training, also overhead press and even back work! Also there are ab specific exercises towards the end of at beginning of many of the workouts too... however I also love training abs solely occasionally! \n\nI hope you all enjoy this routine and feel awesome for it!! \n\nCx\n\nCheck Out My FREE 10 Week EPIC Program\n\n▶ Day 1 of my EPIC Program: https://youtu.be/c_-v1fYJGO8\n▶ Download my EPIC Program Guide and Schedule: https://carolinegirvan.com/epic-program.pdf\n▶ EPIC Program Playlist (Intermediate / Advanced): https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\n▶ EPIC Beginner Series: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\n▶ My 5 Min Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n\nThe Equipment I Use from Amazon\n\n▶ Amazon UK: https://amazon.co.uk/shop/carolinegirvan\n▶ Amazon US: https://amazon.com/shop/carolinegirvan\n\nNever Miss a Video or Community Update\n\n▶ Subscribe to my YouTube Fitness Channel for FREE: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nMy Social Channels\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Facebook: https://facebook.com/carolinegirvanfitness\n▶ Twitter: https://twitter.com/carolinegirvan\n\n▶ Business Enquires: info@carolinegirvan.com\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness program, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or program is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "abs workout",
    "abs",
    "core workout",
    "core",
    "20 minute ab workout",
    "20 min abs workout",
    "lower abs workout",
    "caroline girvan abs",
    "caroline girvan",
    "intense ab workout",
    "ab",
    "no equipment",
    "no repeat",
    "follow along workout",
    "abs workout at home",
    "bodyweight",
    "workout",
    "exercise",
    "routine",
    "ab workout",
    "lower abs",
    "no equipment workout",
    "abs exercise",
    "six pack abs",
    "six pack",
    "flat belly workout",
    "flat stomach",
    "core training",
    "obliques",
    "best ab workout",
    "six pack workout"
  ],
  "publishedAt": "2020-10-22T16:20:17Z",
  "duration": 1256,
  "durationFormatted": "20:56",
  "viewCount": 5613288,
  "likeCount": 84880,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/3oeimlA6s68/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/3oeimlA6s68/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/3oeimlA6s68/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/3oeimlA6s68/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/3oeimlA6s68/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/3oeimlA6s68\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "After doing it regularly for 2 months, I can feel much more control of my abs. It&#39;s really effective. 👍",
    "One of those days where I didn’t feel like working out and this one was easy and effective to get through. You are amazing!",
    "Dear Caroline, I really doubt you will personally read this but here goes. I discovered you last year as you were suggested online as one of the few really good online workout coaches, especially for women. This video is what got it all started. I started doing this twice weekly when I was in some shape already. Then, end of last year, I had very sudden extensive surgery that saw me bedbound for 3 months. I gained a lot of weight and lost all my progress during this time, first because of immobility then because of the depression that resulted from it.  But then, one day I just suddenly decided to at least start exercise again and it was this exact video I was drawn to. Couldn&#39;t even finish half of it when I started and that with poor posture. But now, three months later, I&#39;m at a point I could not have imagined 3 months ago. I&#39;m active again, I feel strong and resilient. I&#39;m not yet where I want to be but with you, the journey towards that, has been made possible. So thank you. Thank you so much for all you do. Your positivity, your hard work and most of all the light you shine into people&#39;s lives.",
    "Me: does this.<br>Also me: goes directly to the mirror to see if I got abs.",
    "I started doing this workout with you after 7 year break from physical exercising. At first i was doing -10s/exercise, now after a 1,5 week I&#39;m doing -5s/exercise, next week I&#39;m gonna make the whole! It&#39;s a bunch of really good, effective exercises and the pace of my progress is a proof. Thank you!"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}