{
  "video_id": "3tH88dN3PaI",
  "title": "PILATES ABS FAT BURN 🔥 Tone, Sculpt & Belly Fat Burn | 5 min Workout",
  "description": "This pilates abs fat burn workout challenge will help you get toned 6 pack abs with no equipment needed. It's an intense 5 minute at home core workout packed with intense flat stomach ab exercises to help you sculpt and lose belly fat. These abs exercises will target your full core for visible 6 pack abs. For the best abs fat loss results, do this with my longer fat burn workouts on the LEAN App and healthy nutrition.\n\n🔥 7 Day Free Trial on the LEAN App! 🔥 Get access to structured guides, personalised meal plans, hundreds of recipes, and so much more right at your fingertips! Get the best results on a 7 day free trial: https://leanwithlilly.page.link/download-app-free-trial\n\n👩‍🎓 Students get 20% off the LEAN App and Products here: https://www.leanwithlilly.com/student?ref=lillysabri\n\n🥤 The supplements & protein bars I use to get results: https://leanwithlilly.com/collections/nutrition?ref=lillysabri\n\n💪 Get your Free Home Workout programs here: https://leanwithlilly.com/pages/Lilly-Sabri-workout-guides?ref=lillysabri\n\n💙 Gymshark Outfit: https://gym.sh/Shop-LillySabri-YT\n\n🤍 FOLLOW ME:\nInstagram:  https://instagram.com/lillysabri\nTikTok: https://www.tiktok.com/@lillysabri?lang=en\nPrivate Facebook Group- Lean with Lilly Guides\nhttps://www.facebook.com/groups/508730913266325/\nTwitter:  https://twitter.com/lillysabri\nFacebook:  https://www.facebook.com/lilly.sabri/\n\n🔔 DON'T FORGET to Subscribe for daily uploads xx\nHit that bell icon to get a notification when I upload.\n\n0:00 Pilates Abs Fat Burn Exercises\n0:41 Achieve Your Fitness Goals\n0:54 Get Toned 6 Pack Workout\n5:58 Complete Flat Stomach Exercise\n\nDisclaimer: Please remember that we cannot spot reduce fat, meaning we can’t choose the areas on our body where we lose fat. However to get fat loss results I recommend the following:\n1. Being in calorie deficit\n2. Cardio/ HIIT workout (I often call these Fat Loss/Burn workouts on my channel)\n3. Resistance training and specific muscle targeted workouts. To strengthen and develop specific muscles.\nI have hundreds of other home workouts available on my channel, so you can pick and choose which workouts you want to do, to not only make you build a strong body, but also feel amazing.\nPlease remember every body is different and we all progress at different rates. The fact that you have shown up and completed this workout is incredible. You should be very proud of yourself for taking the steps to improve not only your physical, but also your mental health.\nThe key to achieving your fitness and health goals is consistency and healthy lifestyle changes, without restriction. I don’t believe in crazy fad diets. Simply eat nutritious food, move your body, smile and enjoy the journey! Love Lilly",
  "channelTitle": "Lilly Sabri",
  "channelDescription": "Subscribe for weekly Full Body Home Workouts and Pilates exercises!\n\nI’m Lilly Sabri, founder of LEAN with Lilly. I’ve been a Chartered Physiotherapist since 2010, APPI Pilates instructor, Fitness, Heath and Lifestyle Influencer.\n\nOver the years, I’ve educated and empowered hundreds of thousands of people around the world to live a healthier lifestyle in a way that encourages increased body confidence regardless of shape, size and fitness level. Their transformations have been my driving force.\n\nMy aim is to create a supportive community, accessible to anyone wanting to take control and make changes towards leading a healthier, happier lifestyle!\n\nI've now taken my years of physio experience and poured it into my guides, workout videos, and more to develop a fit, confident and healthy lifestyle for myself and others! Join the #LeanWithLilly family to take control, feel confident and live a healthier, happier lifestyle!\n\nSocials: @lillysabri\nWebsite: www.leanwithlilly.com",
  "tags": [
    "home workout",
    "home exercise",
    "workout program",
    "from home workout",
    "at home workout",
    "workout challenge",
    "abs workout",
    "abs",
    "lose belly fat",
    "belly fat loss workout",
    "ab workout",
    "flat stomach",
    "how to get abs",
    "6 pack abs",
    "ab",
    "11 line abs",
    "abs workout at home",
    "tone abs",
    "belly fat burn",
    "fat loss workout",
    "11 line abs exercises",
    "6 pack abs workout",
    "ab tone",
    "abs fat loss",
    "core workout",
    "ab exercises",
    "best workout",
    "pilates abs workout",
    "fat burn workout",
    "fat loss",
    "fat burn",
    "pilates"
  ],
  "publishedAt": "2023-01-24T14:00:04Z",
  "duration": 362,
  "durationFormatted": "6:02",
  "viewCount": 1711912,
  "likeCount": 27134,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/3tH88dN3PaI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/3tH88dN3PaI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/3tH88dN3PaI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/3tH88dN3PaI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/3tH88dN3PaI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/3tH88dN3PaI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "🔥 Join the LEAN Summer Method and get 40% off! 🔥 Get in the best shape and feel your most confident this summer with the LEAN Summer Method! Get access to my structured 8 week guide including my exact style of training - Pilates, HIIT and Strength. This LEAN Method has got tens of thousands of women in the best shape of their lives - the results are incredible!\r<br>Plus you get personalised meal plans, hundreds of recipes, and so much more right at your fingertips! Get 40% off the LEAN App right now: <a href=\"https://leanwithlilly.page.link/get-the-app-today\">https://leanwithlilly.page.link/get-the-app-today\r</a><br>\r<br>The LEAN Summer Method Phase 2 launches Monday 5 June and the sale starts Friday 2 June - make sure you enrol now, on the LEAN App, to not miss out!",
    "I already had a flat stomach I needed this workout to gain strength and from the very first time I saw abs!! Literally amazing",
    "It was really hard to do yesterday but today it was much more manageable. It gets easier everyday if anyone thinks it’s too overwhelming",
    "doing this for 2 weeks !!!<br><br>day 1: ✅ OH MY GOD IT BURNS i had to take a break halfway LOL<br>day 2: ✅ me eating this exercise up? no. the exercise is eating me up. but i did not take a break so that’s something<br>day 3: ✅<br>day 4: ✅<br>day 5: ✅<br>day 6: ✅<br>please like this comment so i can come back to it!! ❤️",
    "doing this every day for a week!<br><br>day 1- burns like anything but not too difficult, had to pause in the middle as my abs were aching😂<br><br>day 2- still burns like crazy, feels like my abs are knotting, had to take a little break 5 mins in<br><br>day 3- icl this is getting easier, didn’t have to take a break this time, i’m beginning to see minor results too <br><br>day 4- i absolutely ate this up icl<br><br>day 5- this is definitely getting easier<br><br>day 6- seeing results, this is so easy now <br><br>day 7- devoured<br><br><br><br>HEY BABYCAKES IM BACK IN BUSINESS<br><br>day 1- ptsd. i’m gonna wake up in PAIN.<br>day 2- getting better"
  ],
  "channelSubscriberCount": 6080000,
  "channelVideoCount": 1352
}