{
  "video_id": "40bPxbFUCj4",
  "title": "Restorative Yoga For Stress Relief | 30 Minute Practice",
  "description": "De-stress with this 30 minute calming yoga routine that includes gentle and simple full body stretches for relaxation. Each pose is held for around 2 minutes to give time for the body and mind to slow down, and to help reduce cortisol levels. \nBring a pillow and/or block to this session, if you have them. No worries if not. \n\nLet me know how this practice goes for you in the comment section down below!\n\nNamaste,\nJess\n\n\nSPONSOR\nThank you Happyhaves for sponsoring this video!\nClick the link below to check them out:\n\nEarth Diffuser:\nhttps://www.happyhaves.com/collections/essential-oil-diffusers/products/earth-diffuser\nEssential Oils 6-Pack Box:\nhttps://happyhaves.co/collections/aromatherapy-essentials\n\n-\n\nMOBILE APP 📲🧘🏽‍♀️\nAccess exclusive classes on the Jess Yoga App! Available worldwide on iOS & Android. \nFREE to download:\nhttp://onelink.to/jessyogayt \n\n\nFAVORITES ✨ \nYoga Mat:\nLiforme (Use code 'JESSICARICHBURG' for 10% off)\nhttp://bit.ly/2uH0xNf​​​​​\n\nActivewear:\nStudio Kolektif Organic Yogawear (Use code 'JESSICARICHBURG' for 15% off)\nhttps://bit.ly/2WDxXtr\n\nJournal:\nWeekly Reset Planner + Artist of Life Workbook from Lavendaire\nhttps://shop.lavendaire.com/JESSICA10 (Use code 'JESSICA10' for 10% off)\n\n\nDONATE 🦋\nDonations to this channel allows me to keep creating new content + keeps yoga free & accessible to all.  \nIf you'd like to donate you can click the link below:\nhttps://bit.ly/31WdAZE\nThank you for supporting my work! \n\n\nCONNECT 🙏 \nBlog: https://jessicarichburgyoga.com​​​​​\nInstagram: https://instagram.com/Jessicarichburg​\nFacebook: https://www.facebook.com/jessicarichburgyoga/\n💌 Sign up for my newsletter:\nhttps://jessicarichburgyoga.com/newsletter/\n\n- \n\nDISCLAIMER\nThe information and practices on this website are not meant to diagnose, treat or cure any illness and and should not be used as a substitute for professional medical care. As with any exercise program, you take the risk of personal injury when you practice yoga. Please be mindful and listen to your body. By voluntarily participating in these practices, you acknowledge this risk and release Jessica Richburg from any liability. You are responsible for your own body's well being. Please consult with your physician prior to beginning exercise.",
  "channelTitle": "Jess Yoga",
  "channelDescription": "Welcome to the channel! \n\nI'm Jessica, a 500-hr certified yoga instructor with a passion for health, wellness and sharing mindful movement. I'm here to support you on your yoga journey and give you the tools to live a more balanced and mindful life, both on and off the mat. \n\nOn this channel you will find a variety of classes with different styles, lengths and levels, along with the occasional vlog or sit-down chat.\n\nIf you enjoy practicing with me and want more exclusive yoga classes, meditations + courses then check out my app, Jess Yoga - available worldwide for iOS and Android (link below). \n\nThank you for practicing with me, and I’ll see you on the mat! \n\nFor business inquiries/collaborations please email richburg.jessica@gmail.com. ",
  "tags": [],
  "publishedAt": "2020-12-04T12:00:01Z",
  "duration": 1892,
  "durationFormatted": "31:32",
  "viewCount": 1438593,
  "likeCount": 26267,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/40bPxbFUCj4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/40bPxbFUCj4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/40bPxbFUCj4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/40bPxbFUCj4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/40bPxbFUCj4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/40bPxbFUCj4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Got a rough diagnosis. Psychologist recommended Restorative Yoga.  This is exactly what I needed. <br>Thanks Jess<br>DG",
    "Honestly recommend this to anyone suffering from anxiety. Sometimes all we really need is a self-loving practice like this to relieve us from all the stress and tensions we feel in our body. Thank you so much for this!",
    "Honestly i wasn&#39;t having a good day, i was feeling so stressed so sad so angry so bored so tired but still trying to relax and to tell myself everything is gonna be fine. I always come back to this 30 min video bc it helps me to connect with my body and to relax my mind, thank u 🤍",
    "This was one of the most calming yogas I&#39;ve done for releaving my stress and anxiety, thanks for this. Made me feel so much better and at peace.",
    "For the first time I don’t check the time every minute I actually enjoyed it so much it felt like massaging the body and the brain! It’s like the best thing I can ever do to myself"
  ],
  "channelSubscriberCount": 837000,
  "channelVideoCount": 141
}