{
  "video_id": "44HquH6QyXc",
  "title": "Introduction to Pilates - Workout 1 | NHS",
  "description": "Keep safe, while keeping active. \nView our safety video before you begin this workout: \nhttps://www.youtube.com/watch?v=JcykLowYWGc\n\nThe recommended frequency of doing this exercise is 2 to 3 times a week.\n\nIf you’re looking for an introduction to the best online Pilates workouts for beginners, this Introduction to Pilates course is made up of extremely gentle and slow-paced classes making it ideal for people who are completely new to Pilates or have a low fitness level. With low-impact movements, Pilates is an extremely effective way to get a full-body workout without risking injury. It also makes this programme suitable for people with conditions or past injuries. \n\nThese workouts have been created in collaboration with fitness experts InstructorLive and range from 10 to 45 minutes. \n\nThe benefits you will see include:\n• Improved fitness\n• Improved core strength\n• Improved flexibility, balance, and body control\n• Increased muscle tone and weight loss\n\nFor more free exercise ideas, check out our other popular exercise programmes, such as the Fitness Studio, the Couch to 5K running plan for beginners, Strength and Flex podcast, and the 10-minute workout series.\n\nhttps://www.nhs.uk/conditions/nhs-fitness-studio/\n\n“We, and our partner InstructorLive, have taken reasonable endeavours to ensure that the content of these videos is, to the best of our knowledge, accurate and suitable for most people undertaking general exercise. However, it is not professional advice or tailored to any specific condition, characteristic or person. Before following and undertaking the exercises in this video, you (and anyone else taking part) should consult with a health professional and/or your GP if you: consider it necessary; have any concerns about your health; are not sure whether the exercises are suitable; have any pre-existing health problems, injuries, or any current symptoms. Undertaking these exercises and use of information within the video is at your own risk. You should stop exercising immediately and seek medical attention if you should feel any discomfort. Neither we nor InstructorLive shall be held liable or responsible for any injury, loss or damage of any kind (including, (without limitation) any direct, special, indirect or consequential damages) arising out of or in connection with the use of this video by you or anyone else except to the extent that such liability cannot be limited or excluded by law.”\n\n0:00 Disclaimer\n0:23 Workout",
  "channelTitle": "NHS",
  "channelDescription": "We are here to help you and your loved ones stay happy and healthy. We are the NHS.\n\nThe NHS website is a comprehensive information service that helps to put you in control of your healthcare. \n\nFor general enquiries about the NHS website or about our videos please contact us directly rather than via YouTube. You can email us at nhswebsite.servicedesk@nhs.net\n\nWe cannot give personal clinical advice on YouTube, therefore nhs.uk cannot accept any liability that may arise from the content of your message. This channel is monitored Monday-Friday 9am-5.30pm.\n\nYou can view our privacy policy here https://www.nhs.uk/our-policies/privacy-policy/",
  "tags": [
    "pilates",
    "introduction to pilates",
    "NHS",
    "instructor live",
    "instructor",
    "exercise",
    "lockdown",
    "home",
    "home exercise",
    "low intensity",
    "fit",
    "get fit",
    "fitness",
    "workout",
    "class"
  ],
  "publishedAt": "2020-05-20T09:05:07Z",
  "duration": 1883,
  "durationFormatted": "31:23",
  "viewCount": 960259,
  "likeCount": 8450,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/44HquH6QyXc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/44HquH6QyXc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/44HquH6QyXc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/44HquH6QyXc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/44HquH6QyXc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/44HquH6QyXc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I never knew the NHS made exercise videos,  so cool. God bless the NHS",
    "I like how she&#39;s talking slowly and clearly &amp; saying &quot;it&#39;s ok, if you can&#39;t&quot; like she understands that some of the viewers are here for the first time &amp; they&#39;re not used to working out. When can we see more of these lessons?",
    "Thank you for making this available for free!",
    "I have just found out now that NHS made these. Thank you. I have started my pilates journey today.",
    "The NHS videos of exercises for occasional aches and pains...knees, backs etc are first rate, too."
  ],
  "channelSubscriberCount": 203000,
  "channelVideoCount": 458
}