{
  "video_id": "47ExgzO7FlU",
  "title": "Upper Body (Chest & Back) Strength Workout with Dumbbells for Seniors & Beginners",
  "description": "Chest and Back strength building workout for seniors and beginners. 20 minutes \n\nThe focus of these exercises are all for the upper body. Women especially tend to neglect the focused area of the chest and back. Don’t worry, this workout will not make you look bulky. For reference I’m using 8 pound dumbbells. Please make sure you start with light weights and work your way up as you gain strength and become familiar with the exercises.\n\nThis workout will be performed entirely on the floor/mat. After a few warmup stretches we will lay on our backs working the chest, shoulders, triceps and biceps. Then, we move to our hands and knees for a little more back and tricep. Finally, we flip to our front of the body working on toning the back of our arms and more back. We finish in a seated position with some stretching.\n\nIf you are not comfortable on your hands and knees, that section can all be done seated in a chair. Simply engage your core and hinge forward at your waist. Support your torso by placing your forearm (that’s not holding the weight) on your thigh.\n\nThis workout is great for improving posture and standing taller! Let me know how you liked it in the comments.\n\nThanks for working out with me!\n\nhttps://www.amazon.com/shop/seniorshapefitness\nas an Amazon associate/influencer I earn from qualifying purchases \n\nSeniorShape is on Facebook\nhttps://www.facebook.com/SeniorShapefitness/",
  "channelTitle": "SeniorShape Fitness",
  "channelDescription": "Hello and welcome to SeniorShape with Lauren! I’m thrilled you have found my channel! I am an ACE (American Council on Exercise) certified fitness instructor. I also hold a specialization in senior fitness. \nIt is my passion to create fun, new exercises and routines that are never boring. \nMy videos are easy to follow and the exercises featured are specifically curated for beginners, and active older adults. The workouts are challenging and at a great pace that works well for anyone. \nPlease subscribe so you never miss a new workout.\n\nEquipment I use or recommend can be purchased on my Amazon store page www.amazon.com/shop/seniorshapefitness\n*as an Amazon associate/influencer I earn from qualifying purchases\n\nFor those who have graciously asked to donate so I can continue to provide free videos can contribute through \nVenmo: @SeniorShape\nI appreciate your support!\n\nThanks for working out with me!\nLauren\n\n",
  "tags": [
    "Chest and back workout",
    "Upper body workout for seniors",
    "Upper body workout for beginners",
    "Chest and back workout for women",
    "Upper body exercises for seniors",
    "Upper body strength workout",
    "Upper body workout with dumbbells",
    "At home workout with dumbbells",
    "SeniorShape",
    "Upper body strength workout with dumbbells",
    "Chest and back strength for seniors",
    "Chest and back strength for beginners",
    "Seated strength for seniors",
    "Chest and back dumbbell workout",
    "20 minute dumbbell workout"
  ],
  "publishedAt": "2021-06-14T10:20:00Z",
  "duration": 1423,
  "durationFormatted": "23:43",
  "viewCount": 104059,
  "likeCount": 2688,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/47ExgzO7FlU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/47ExgzO7FlU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/47ExgzO7FlU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/47ExgzO7FlU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/47ExgzO7FlU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/47ExgzO7FlU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is a great weight workout.  I especially like it because lying on your back keeps it out of your neck.  I keep coming back to your workouts:  the best!",
    "It&#39;s a shame you can&#39;t give a like every time you revisit a video. I go back to older videos to check for any progress or to see if I&#39;ve kept a well rounded practice. It&#39;s easy for me to fall into working out more on areas that aren&#39;t as challenging for me.  Thank you Lauren",
    "I recently broke my ankle, and have been unable to do your standing cardio routines.  I filtered through to this exercise, which is more complete than I would have developed on my own.  I alternate this with another of yours, the strength training on the mat.  My wife and enjoy all of your videos.  Keep up the great work!",
    "Outstanding yet again!! So appreciate your focus on the upper body for strength and mobility!  Thank you Lauren.❤",
    "Oh, more of chest and back...please...such underrated areas in women workouts❤🎉"
  ],
  "channelSubscriberCount": 599000,
  "channelVideoCount": 290
}