{
  "video_id": "4C-gxOE0j7s",
  "title": "5-Minute Morning Yoga",
  "description": "5 Minute Morning Yoga With Adriene. Don't have a lot of time? Take 5 to promote healthy flow of energy so that you can do your best, be authentic and Find What Feels Good! \n\nFeb is a short month so we decided to answer the requests for short practice video with a month of Yoga Quickies. Set the tone for your day and remember, a little goes a long way!\n\nYoga Quickies show us that we do not need 30, 60, 75 min. That we don't always have to do legs on leg day. But rather, that the reward, the cookie, the good stuff actually just arrives when you do too. \n\n5 min to show up and check in. Enjoy!\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga",
    "morning yoga",
    "yoga for beginners",
    "yoga for flexibility",
    "yoga (sport)",
    "yoga practice",
    "yoga at home",
    "yoga workout",
    "adriene mishler",
    "hatha yoga",
    "yoga with adrienne",
    "yoga camp",
    "free yoga",
    "online yoga",
    "fitness",
    "adriene yoga",
    "austin yoga instructor",
    "yogi",
    "yoga for wellness",
    "morning yoga for beginners",
    "yoga in bed"
  ],
  "publishedAt": "2017-02-06T07:00:00Z",
  "duration": 350,
  "durationFormatted": "5:50",
  "viewCount": 10654899,
  "likeCount": 84032,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4C-gxOE0j7s/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4C-gxOE0j7s/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4C-gxOE0j7s/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4C-gxOE0j7s/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4C-gxOE0j7s/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4C-gxOE0j7s\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This was gorgeous! A practice like this is perfect because you can integrate this into any day, no matter how busy you are! Thank you Adriene!",
    "My trainer recommended I start my day with this... 2 wks later and I&#39;m still with it, before I take my morning walk.  I absolutely love it.  Thank you!",
    "Can I tell you how much you&#39;ve changed my life in the 28 days I&#39;ve been watching your videos. I have breast cancer and never could imagine being as strong, focused and balanced as I am today. Thank you with every fiber of my being. Namaste 🙏🏼❤️💪🏼",
    "Greet Day <a href=\"https://www.youtube.com/watch?v=4C-gxOE0j7s&amp;t=61524\">17:05:24</a>✅.🌅😊 Just love to say. ..Thank you 💖 Adriene 💖, Short Beautiful  to jump start the body and revisit again and again. Blessings yogi lovelies. Namaste☮️💜🙏🏾",
    "Awesome short yoga practice today Adriene.  Thank you for this little beauty, it is good to reconnect to our bodies, especially in this fast paced, world that we live in. Before this practice I had a little awakening, and a realising everything, about me is connected. I&#39;ve always thought all my bits of personality were separate,  but there not there connected to each other. I know that might sound a little odd to some people,  but it makes sense to me. And it had helped me, to feel a bit more connected, and as one in life. Your yoga you teach me has helped me greatly, especially in finding myself, and getting through life&#39;s struggles. Thank you so much Adriene,  are a beautiful person inside, and out, and an awesome yoga teacher. See you again. Namaste. 🙏🧡☀️💛🧘‍♀️🦋"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}