{
  "video_id": "4cVWtiRV0wY",
  "title": "Our full 5 minute guided routine for helping with INTERCOSTAL MUSCLE PAIN!",
  "description": "Our 5 minute video series as requested by our clients demonstrates a guided routine for managing symptoms & pain associated with intercostal muscle pain. Louise takes you through each exercise explaining what you should do if you are struggling or feeling discomfort. \n\nAs with all our videos we recommend getting your ribs & spine assessed properly first and seeking advice from a musckuloskeletal expert to determine the correct diagnosis for you and the best course of treatment, exercises and management! \n\nFor more information about Osteo and Physio including what we do and why, check out our website at :\nhttps://osteoandphysio.co.uk/\nOr find us on Facebook: \nhttps://www.facebook.com/osteoandphysio\n\nThanks for watching, please SUBSCRIBE, LIKE and COMMENT!",
  "channelTitle": "Osteo and Physio",
  "channelDescription": "Get back to doing what you love!\nThree expert osteopaths sharing their top tips, advice and exercises on a variety of conditions and symptoms. ",
  "tags": [
    "5 minute routine for rib pain",
    "routine for rib pain",
    "routine to help rib pain",
    "why do my ribs hurt",
    "how do stop intercostal p[ain",
    "intercostal strain pain"
  ],
  "publishedAt": "2021-05-13T17:20:29Z",
  "duration": 388,
  "durationFormatted": "6:28",
  "viewCount": 234577,
  "likeCount": 4333,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4cVWtiRV0wY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4cVWtiRV0wY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4cVWtiRV0wY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4cVWtiRV0wY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4cVWtiRV0wY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4cVWtiRV0wY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Holy cow! I was one pain spike away from calling an Uber to the hospital. So glad these exercises helped!",
    "Just wanted to say thanks for your video. I haven&#39;t been able to play golf for about 6 weeks because of strained rib muscles/tendons. Been doing your stretches for the past several days. Already feel the difference in my strength and mobility. 👊",
    "I got intercostal pain and think I strained it from bracing too hard on one of my heavy squat reps. This helped me TREMENDOUSLY thank you so much!!",
    "Intercostal pain can be frustrating but I totally agree, breathing and isolating the rib cage can be so helpful for pain relief. Awesome video!",
    "I’m so thankful for your video about intercostal problems, especially this one. After being diagnosed 1,5 months ago, I’m finally pain free. And I’m sure this routine played a huge role in my recovery since I followed it every evening. <br>If anyone who still has intercostal pain reads this: my osteopath showed me a great exercise! Lay flat on the ground, your right and left arm stretched out to the side, then raise your right leg over your left, keep it straight and above the ground. Hold it high enough to feel it in your muscles, it has to be tiring. Hold it a minute and change sides. Do this everyday and increase the time. I can do it five minutes now for each leg. If you do it right, you feel the side muscles of your tight, your butt and your belly and rib cage. And after the exercise your muscles are incredibly relaxed. That helped me a lot and released my pain for at least a few seconds when the pain was unbearable. <br>I also used a fascia ball for the muscle that was in pain and massages it everyday. <br>I’m so glad the pain is finally gone."
  ],
  "channelSubscriberCount": 29300,
  "channelVideoCount": 459
}