{
  "video_id": "4dSEvdsDpHE",
  "title": "Follow Along 20 Minute Beginner Calisthenics Home Workout",
  "description": "Hey Fam! This follow along calisthenics workout is aimed at helping all those people looking to improve their core and general body strength. Grab your mat, workout gear (or PJ's, im not judging) and follow along with this calisthenics beginner workout to get you started on your calisthenics journey.\n\nRemember, do the reps that work for you. You don't have to go as fast as me or do as many reps as me. The more you practice, the stronger and therefore the better you will get!\n\nIntro: 0:00\nBeginner Calisthenics Workout: 1:21\n\nOutfit gifted from @JedNorth \n\nFollow me on Instagram for unique #fitnessinspiration. @summerfunfitness_ https://www.instagram.com/summerfunfitness_/\nCalisthenics \nHand Balancing 🤸🏽‍♀️ \n& more 🏋🏽‍♀️🧘🏽‍♀️🧗🏽‍♀️\n\n#calisthenicsbeginner #calisthenicsforwomen #calisthenicsfollowalong #calisthenicsnoequipment",
  "channelTitle": "Summerfunfitness",
  "channelDescription": "Build muscle, strength and calisthenics skills with me.\n\nhttps://linktr.ee/summerfunfitness_\n#calisthenics\n#handstands\n#veganathlete\n",
  "tags": [
    "calisthenics for beginners",
    "basic calisthenics",
    "basic calisthenics workout",
    "beginner calisthenics workout",
    "calisthenics workout at home for beginners",
    "calisthenics workout at home",
    "beginner calisthenics",
    "beginner calisthenics routine",
    "how to start calisthenics at home",
    "calisthenics home workout",
    "calisthenics home workout no equipment",
    "how to start calisthenics at home for beginners",
    "how to start calisthenics at home no equipment",
    "learncalisthenics",
    "calisthenics women"
  ],
  "publishedAt": "2021-07-10T02:42:01Z",
  "duration": 1440,
  "durationFormatted": "24:00",
  "viewCount": 92102,
  "likeCount": 3515,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4dSEvdsDpHE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4dSEvdsDpHE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4dSEvdsDpHE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4dSEvdsDpHE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4dSEvdsDpHE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4dSEvdsDpHE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Ready to commit to starting calisthenics? Check out my 3 Day True Beginner Calisthenics Program: <a href=\"http://summerfunfitness.com/3-day-true-beginner-calisthenics-program/\">summerfunfitness.com/3-day-true-beginner-calisthenics-program/</a><br><br>- 3 days per week, 30-40 minute workouts, 6 weeks<br>- Program focus: Pull-Ups, Push-Ups &amp; Lower Body Mobility<br>- Minimal equipment: Pull-Up Bar &amp; Resistance Bands<br>- Modifications are included for every exercise<br>- Group chat for community support<br>This is meant to be an easier introduction to calisthenics for those who prefer a more gradual approach, who don’t already go to the gym",
    "Calisthenics has been calling me for years now and today is the day for me to start . I am 60 years old and out of shape and ready to transform .<br>I’ve watched many videos on the subject and Summer you are the one I resonate the most with and want to learn from .<br>You are an excellent teacher and very inspiring .<br>This video is perfect .<br>Thank You for sharing and for being You .",
    "Calisthenics is a thing of progression. You cannot start doing anything HARD right away, because your body cannot respond to the demands that it takes to do the really advanced things. It&#39;s all progression,  little by little daily and constant training. You have to give your body time to adjust to this. It takes years to condition your body, like a dancer or a contortionist etc., You cannot do anything in one day or a few months. Also exercise is a discipline for life, not something you do for a little while, it&#39;s forever. One day at a time!",
    "I love that somebody like me that doesn&#39;t have any skills you&#39;re starting me with basic things that I can actually do everybody starts with just one step I really appreciate you doing these some basic simple stuff that I can build on and I can practice and even though I have all this extra weight on me I can work on doing basics and building on it thank you so much",
    "I think you are absolutely right! This is sucha great beginner workout and people would be so smart to start here instead of diving right in to more challenging workouts when their bodies have not been conditioned for that yet. Love it. Keep up the good work!"
  ],
  "channelSubscriberCount": 573000,
  "channelVideoCount": 466
}