{
  "video_id": "4EaMJOo1jks",
  "title": "LET GO of Anxiety, Fear & Worries: A GUIDED MEDITATION ➤ Harmony, Inner Peace & Emotional Healing",
  "description": "A guided meditation: LET GO of anxiety, fear, and worries, and open up to Harmony, Inner Peace, and Healing. Does worrying drain your energy and take away your ability to be present and truly enjoy life? Do you want to stop the fear, stress, or anxiety that can build up from negative thinking? Imagine letting go of 50% of your worries and fears? How good would you feel? Imagine letting go of 80% of them? What would you appreciate the most about that kind of freedom? Allow yourself to LET GO in a safe and natural way - Heal and Transform energy that does not serve you anymore. Like a tree in autumn lets go of the leaves naturally, effortlessly, and inevitably...\n\n🌟 Full album with 5 tracks available on iTunes ► https://apple.co/2TIci0K\n\nThis guided meditation is created with Unconditional Love because I care about you. I really do. I don´t need to know you to care. You deserve all the good in life. \n\nMusic is tuned to 432Hz and contains 4hzTheta binaural beats. Listen with headphones if you want the benefit of the binaural beats. Go old school; no Bluetooth. Wires only. Keep your brain unfried, raw, and healthy. \n\nPOWER TIP: Listen daily for 28 days in a row for the best results. Repetition reinforces the healing. Experience says new neurological signals \"stick\" after 28 days of continuous reinforcement. \n\nIt is time to Love fully, Live Fully, and Shine Your Beautiful Light.\n\nMuch Love,\nKenneth :)\n\n\nCONNECT WITH ME HERE:\nINSTAGRAM ► https://www.instagram.com/kennethsoares.livingfully\nINSIGHT TIMER (MEDITATIONS OFFLINE) ►http://insig.ht/KennethSoares\n\n\n................................\n\nHOW TO DO GUIDED MEDITATION:\nhttp://www.powerthoughtsmeditationclub.com/how-to-do-guided-meditations/\n\n…………………….\n\nDOWNLOAD OUR SINGLES & ALBUMS HERE:\n\nITUNES ►http://apple.co/2lp23Rr\n\nAMAZON ► http://amzn.to/2kx0RcZ\n\nMP3 AUDIO SHOP ► https://powerthoughtsmeditationclub.dpdcart.com\n\nNEED MUSIC FOR YOUR PROJECTS? \nRoyalty-Free & Commercial Use Music Licenses \n► https://www.highermind-royaltyfreemusic.com/?ref=23/?ref=23\n\nBOUNDARY SETTING COURSE AVAILABLE NOW: \n✦ Set Conscious Boundaries: Stand Up For Yourself & Let Go Of People Pleasing For Good ✦\n20 lessons filled with theoretical and practical knowledge that will take your boundary-setting skills to the next level: https://kennethsoares.earth/courses/set-healthy-boundaries-let-go-of-people-pleasing/?ref=21\n\n...................\n\nWe are forever grateful to everyone who supports us just by tuning in to our channel, and for all of you who buy our meditations, solfeggios, and music! You make it POSSIBLE for us to continue our life purpose! From our hearts we Thank You!\n\n…………………….\n\nPOWERTHOUGHTS MEDITATION CLUB\n\nWe are very proud of our hard work and commitment to creating HIGH quality Guided Meditations, Affirmation audios, Hypnosis sessions, Solfeggios, and Relaxing Music. We put our Heart and Soul into every video we create with the intention to create something valuable for YOU, so that you can walk the path of life feeling much more positive, conscious and empowered. \n\nOur grand mission is to raise the energy vibration of our planet and to make this world a more Loving - Peaceful and Joyful place for ALL organic life. To help and inspire YOU and the other millions of people listening to our audios to awaken to that awesome POWER we have within us. Prepare to open up the gates and let the pure Lifeforce from YOUR HIGHER SELF and SOURCE ESSENCE to flow through you NOW. Enjoy your journey.\n\nFor Freedom, Love & Peace,\nKenneth & Alexander - PTMC\n\n………………………\n\n\n..............................\n\nENJOY OUR PLAYLISTS HERE:\n\nGUIDED MEDITATIONS\nhttp://bit.ly/1RRuZbN\n\nAFFIRMATIONS ➤ SUBCONSCIOUS PROGRAMMING\nhttp://bit.ly/1TLFam6\n\nSOLFEGGIO FREQUENCIES WITH MEDITATION MUSIC\nhttp://bit.ly/1QDNSif\n\nRELAXING AND SOOTHING MEDITATION MUSIC\nhttp://bit.ly/1W9gSQv\n\nSLEEP PROGRAMMING AND LUCID DREAMING\nhttp://bit.ly/1R77kRn\n\n......................",
  "channelTitle": "PowerThoughts Meditation Club",
  "channelDescription": "Welcome to PowerThoughts Meditation Club\n\nTHANK YOU. You´re NOW about to activate your greatness within you. Our powerful meditations are going to CHANGE YOUR LIFE. You will feel happier, stronger, peaceful and powerful. We humans are powerful creators of life. PowerThoughts meditations Awaken and Inspire people to manifest great things in their lives: inner peace, love, abundance, joy, optimism, freedom, wealth, confidence, inner strength, awakening, enlightenment and much more\n\nPowerThoughts mission and life purpose are to make this world a more Loving - Peaceful and Joyful place. To help and inspire YOU and the other millions of people listening to our meditations to awaken to that awesome POWER we have within us. Prepare to open up the gates and let the pure lifeforce from your higher mind/your soul/the universe flow through you NOW. Enjoy your journey. \n\n\nFor Your Freedom, Love and Joy\n\n- Kenneth & Alexander from PowerThoughts Meditation Club\n\n\nSUBSCRIBE AND SHARE :)",
  "tags": [
    "guided meditation fear",
    "guided meditation anxiety",
    "guided meditation worries",
    "anxiety meditation",
    "release fear",
    "let go of fear",
    "let go of anxiety",
    "harmony meditation",
    "inner peace meditation",
    "healing meditation",
    "guided meditation healing",
    "guided meditation inner peace",
    "guided meditation emotional healing",
    "anxiety guided meditation"
  ],
  "publishedAt": "2018-01-09T11:11:39Z",
  "duration": 1342,
  "durationFormatted": "22:22",
  "viewCount": 10845223,
  "likeCount": 138242,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4EaMJOo1jks/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4EaMJOo1jks/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4EaMJOo1jks/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4EaMJOo1jks/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4EaMJOo1jks/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4EaMJOo1jks\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Dear brothers and sisters, I am reading through the comments here and it feels like bathing in waves of Love and Joy! I had to say hello to a couple of tears :) I am so grateful for the opportunity to contribute in this way. I LOVE it!  Thank you for taking your time to share your experience and shining your beautiful energy here. You truly inspire me to give more, be more and continue to create these meditations for you and others ❤️🙏🏼 <br>In Loving Kindness, <br>Kenneth Soares",
    "All i needed was a hug someone to tell me its gonna be ok. Who knew that hugging myself would bring me to tears. Its hard to let go.",
    "My anxiety sometimes is so bad that I feel sick a whole week. I feel like I lost control of my self. This meditation helps me go on another day",
    "Am I the only one who cried when he started talking about the future you hugging you and thanking you. It really triggered an emotional response. So often we neglect ourselves when really we should take care of ourselves and love ourselves because we are deserving. I love everyone who reads this. We will get through this. We are strong, safe and all the good things in life. Take care of yourselves especially through this uncertain time period ❤️",
    "If you are reading this, which is pretty rare, I want to let You know you have been through the worse and made it up until now that should be enough evidence to show how truly Powerful you are. ❤"
  ],
  "channelSubscriberCount": 2060000,
  "channelVideoCount": 605
}