{
  "video_id": "4pLUleLdwY4",
  "title": "Meditation for Anxiety - Yoga With Adriene",
  "description": "15 Minute Meditation For Anxiety guides you through a simple at home meditation to provide relief from anxiety, stress, and energetic imbalance. Find a comfortable seat, tune into your breath, and soften. Return to this practice regularly for preventative care. Great for beginners!\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga",
    "meditation",
    "yoga with adriene",
    "15 min meditation",
    "yoga for stress relief",
    "yoga for depression",
    "yoga for nerves",
    "meditation for mental health",
    "mental health",
    "holistic health",
    "wellness",
    "spirituality",
    "breathing techniques",
    "hatha yoga",
    "healing yoga",
    "yoga therapy",
    "yoga for wellness",
    "health",
    "healthy",
    "yoga lifestyle",
    "yogi",
    "meditation for beginners"
  ],
  "publishedAt": "2017-05-14T08:00:01Z",
  "duration": 854,
  "durationFormatted": "14:14",
  "viewCount": 5815066,
  "likeCount": 86792,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4pLUleLdwY4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4pLUleLdwY4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4pLUleLdwY4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4pLUleLdwY4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4pLUleLdwY4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4pLUleLdwY4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Adriene thank you for this video as everyone of us go through this phase at a point in our lives...Yu are such a wonderful soul...Blessed to know someone like you...The world need people like you🙇🙇<br>I wish you all colours of happiness from dawn to dusk everyday...much love from India♥♥",
    "Anxiety happens when you think you have to figure out everything all at once. Breathe. You’re strong. You got this. Take it day by day.",
    "Hi reader: thank you for existing. Even though you are struggling right now, even though you may feel uncertainty, or even lost, remember that you&#39;ve still got you, your soul has got your back-- otherwise, why would it have encouraged you to come to this video? Even when it doesn&#39;t feel like it, you are on your side. Big hugs to you, my friend. Thank you for being alive and sticking around. &lt;3",
    "EXHALE 🧘‍♀ | March 23, 2024 | Taking some time to breathe - just breathe, is probably the biggest luxury we can give ourselves. Beautiful! 🙏",
    "To whoever is reading this, you are loved. You are blessed. Your dreams are manifesting as we speak. Time is on your side. Everything will work out in your favor. May you find more love, peace and prosperity. Keep shining your light in this world. We need you and we love you\rThanks for the post, we love you too and we support you ;-) 💙💙"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}