{
  "video_id": "4syPT8gMDDA",
  "title": "Guided Meditation for Pelvic Floor Relaxation | FemFusion Fitness",
  "description": "Relax and release pelvic tension with this short guided meditation. Perfect for anyone with pelvic pain or pelvic floor dysfunction; also ideal for ANYONE who carries stress in their pelvic region (hint: that's most of us). Use this is as often as DAILY for an easy way to unwind and connect with your core.\n\nWORK WITH ME:\n💖Do you have pelvic tension or pain? My 12-week Overcome program can help. Free trial: https://bit.ly/OPPWforfree\n💖Do you have prolapse? Get the first week of Lift for free: https://bit.ly/liftforfree\n\nADDITIONAL RESOURCES:\n💖I love my extra-large yoga mat! Check it out at http://bit.ly/femtribemat and get 10% off using code FEMTRIBE10 (I have PREMIUM LARGE YOGA MAT 7' X 5' X 8MM)\n💖My Website: https://www.vibrantpelvichealth.com/\n\n✅ SUBSCRIBE TO SUPPORT FREE WORKOUTS AND PELVIC WELLNESS ON YOUTUBE 🔔 Click on the bell so that you never miss a new video!\n\n❤ ❤ ❤\n\nMEDICAL DISCLAIMER: \n\nDr. Brianne Grogan, PT, DPT offers health and fitness information intended to assist you in improving your general health and well-being. These videos and written text are designed for entertainment and educational purposes only. Please consult your physician before beginning this or any other exercise program. \n\nAll forms of exercise pose some inherent risks, particularly exercise done independently without individualized supervision from a qualified fitness trainer or healthcare professional. Due to the nature of video instruction, you must take full responsibility for your safety and know your personal limits. *Stop if you experience faintness, dizziness, pain, or shortness of breath.*\n\nBy participating in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge FemFusion Wellness LLC / Dr. Brianne Grogan, PT, DPT from any and all claims or causes of action, known or unknown, arising out of FemFusion Wellness LLC / Dr. Brianne Grogan, PT, DPT’s negligence.\n\nDo not rely on the information presented as a substitute for professional medical advice, diagnosis, or treatment. If you have any concerns or questions about your health, consult with a physician or other healthcare professional. Do not disregard, avoid or delay obtaining medical or health-related advice because of something you may have read, heard, or viewed on this site or channel. The use of any information provided on this (or any associated) video or website is solely at your own risk.\n\nGeneral questions are welcome, but please do not contact us with details of your personal situation or medical concerns. We cannot comment on your individual circumstances by personal email, nor will we provide medical advice, opinion, diagnosis, treatment or medical services of any kind. Thank you for your understanding.\n\nFor more information on consulting with a Pelvic Physical Therapist for personal assessment and treatment, check this link if you live in the United States of America: https://ptl.womenshealthapta.org/. If you live outside the US, search for a physiotherapist who specializes in pelvic floor dysfunction and rehabilitation.  \n\n❤ ❤ ❤\n\nAdditional links and resources:\n\n❤ Don't miss my playlists! http://bit.ly/FemPlaylists\n❤ Facebook page: http://www.facebook.com/vibrantpelvichealth\n❤ Pinterest: http://www.pinterest.com/vibrantpelvichealth\n❤ Insta: @vibrantpelvichealth\n❤ My book, Lady Bits: https://amzn.to/3Bo588U\n\n❤ ❤ ❤\n\nFitting MORE MOVEMENT into your day not only increases energy, improves your mood, boosts strength, and tones your body, it has also been shown to prevent chronic illnesses such as heart disease and type 2 diabetes (to name just two common conditions). Movement breaks will help you fit MORE FITNESS into your day. Do a little bit a lot, and see how good you can feel!\n\nFor vibrant pelvic health: Eat clean. Move every day. Shine brighter!\n#pelvichealth #core #pelvicfloor",
  "channelTitle": "Dr. Bri's Vibrant Pelvic Health",
  "channelDescription": "I'm Dr. Bri! I'm a Doctor of Physical Therapy, making pelvic wellness fun, accessible, and available to EVERYONE. I offer follow-along workouts to educate and empower you: mind, body, spirit, and pelvic floor. 💕\n\nDISCLAIMER: This content is for informational purposes only. It is general and not intended to be medical advice, nor does using it create a physical therapist-patient relationship between you and Brianne Grogan. Before starting, consult your healthcare provider for a proper diagnosis and ensure this content is safe and appropriate for your medical and physical condition. Stop or modify immediately if you experience pain or increased pelvic symptoms. Brianne Grogan (FemFusion Wellness LLC) makes no representations about the accuracy or suitability of this content for you. By voluntarily using this content, you assume all risks for any resulting losses, injuries, or damages.\n",
  "tags": [
    "femfusion",
    "fitness",
    "guided meditation for pelvic floor",
    "pelvic floor relaxation",
    "femfusion fitness",
    "meditation pelvic floor",
    "pelvic pain",
    "womens health",
    "pelvic floor",
    "pelvic floor release",
    "pelvic muscle spasm",
    "pelvic floor spasm",
    "meditation for pelvic",
    "meditation for pelvic floor relaxation",
    "meditation for pelvic pain",
    "meditation for pelvic floor",
    "meditation for pelvic floor muscles",
    "meditation for pelvic health"
  ],
  "publishedAt": "2017-04-08T07:12:35Z",
  "duration": 814,
  "durationFormatted": "13:34",
  "viewCount": 562083,
  "likeCount": 6164,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4syPT8gMDDA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4syPT8gMDDA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4syPT8gMDDA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4syPT8gMDDA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4syPT8gMDDA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4syPT8gMDDA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "As a meditator, you understand the importance of the mind-body connection. Check out my Academy - <a href=\"https://www.briannegrogan.com/academy\">https://www.briannegrogan.com/academy</a> or if you want a taste of mind-body-pelvic health, try my free 10-day challenge - <a href=\"https://www.briannegrogan.com/challenge\">https://www.briannegrogan.com/challenge</a>",
    "I have just woken up after my first night of uninterrupted sleep. For the past 2 months I have suffered with pelvic floor pain- triggered by grieve ,emotional trauma and a hypotonic pelvic floor. I&#39;ve been so miserable and down. I have committed to this video and the pain has finally gone! With no help from a Pelvic specialist- thank you so much for putting this content out. The good you are doing for people is immense. Massive huge hug from me. 🙏🙏🙏❤",
    "Tears rolled down my cheeks at some moments with this exercise. I guess I have much emotional pain buried in my pelvic floor. I&#39;ll keep working on it. Thank you, your voice is angelical.",
    "This is amazing. I really feel the warmth and expansion in my pelvic floor. And I teared up at the end when you said, &quot;You&#39;re doing your best and it is absolutely enough. You&#39;re going to be okay.&quot; Wow. I needed that. &lt;3",
    "I cound&#39;t get my period for 3 weeks, I was really frustrated and upset, I tried many things, meditations, yoga exercising, listening to special music or pressing points on my body. But I think that your meditation along with yoga exercise helped the most, something inside of me which plugged me is gone and I finally have my period back! I cannot be happier! I also added more C vitamin and water into my diet, but I like to think that you really helped me. Thank you!"
  ],
  "channelSubscriberCount": 508000,
  "channelVideoCount": 832
}