{
  "video_id": "4TQsfBYCyKQ",
  "title": "Bedtime Yoga Stretch to Release Tension and Stress",
  "description": "Do this bedtime yoga stretch to release tension and stress from the body and mind. \n\nJoin this channel as a Member to get access to perks:\nhttps://www.youtube.com/channel/UCxYVPua6HC46HzgT8IIn3vg/join\n\nThis yoga class was created to sooth and relax the body and mind and help you sleep better throughout the night. Being super gentle, this is a great addition to your morning routine as well or anytime you feel stressed or anxious.\n\n#Yoga #BedtimeYoga #Stress\n\n & support.\n\n________________________________________\n\nFAVORITE ACTIVE WEAR: \n\nLiquido Active - Get 15% off with code: BIRDLIQUIDO https://liquidoactive.com/collections/new?p=S1EZXrrM_\n\nYoga Wheel: https://mbsy.co/LCGmf\n\nVisit My Amazon Store For All My Yoga Must Haves!:\n\n\nMusic: https://www.epidemicsound.com/referral/qnrd89/\n\nJoin Honey to SAVE money while shopping online: https://www.joinhoney.com/ref/45p0vps\n\nIMPORTANT LINKS: https://linktr.ee/yogawithbird\n\nNOTE: Some links may be affiliate links that Yoga With Bird earns a small percentage of however each affiliate product is something she genuinely loves and has used herself.\n\n________________________________________\n\nYOGA CHALLENGES:\n\n30 Day Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlybJmrSb19MiVWnve5slKTJ\n\n30 Day Restorative Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwr-X3VF2CrZdf7rDrWH1aB\n\n7 Day Yoga For Overall Health: https://www.youtube.com/playlist?list=PLCIrre1vyDlyTB8gu7I99XQkw9M85YdTk\n\n5 Day Morning Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlyjr87XsR6j4QGzyKKxwsTH\n\n5 Day Hip Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwAnZvLflZM-e5WWedHTBpo\n\n________________________________________\n\nABOUT THIS YOUTUBE YOGA CHANNEL\n\nFrancine Cipollone also known as her childhood nickname Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation. She created this YouTube Yoga Channel to offer a space where yoga is accessible to all. This channel is all about feeling good and reconnecting to self. Yoga is for every-BODY, Join the journey by Subscribing today: https://www.youtube.com/yogawithbird\n\nJoin Yoga With Bird's Email List: https://mailchi.mp/34e952e0ed28/yoga-with-bird-email-list\n\n________________________________________\n\nDISCLAIMER: \nPlease consult with a physician before beginning any exercise program. \nBy participating in this activity you acknowledge that this exercise is a physical discipline that requires a certain amount of mental concentration and physical strength and endurance and that you must be in good health to participate. \nYou agree to work according to your own limitations and take full responsibility for your own safety and well-being. \nBy participating in this activity you agree to listen to your body at all times and never do anything that causes pain. \nYou acknowledge that participation in this activity exposes you to a possible risk of personal injury. \nYou are fully aware of this risk and hereby release Yoga With Bird aka Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "bedtime yoga stretch to release tension and stress",
    "bedtime yoga",
    "bedtime yoga stretch",
    "bedtime yoga to relax",
    "bedtime yoga for stress",
    "bedtime yoga for tension",
    "relaxing bedtime yoga",
    "yoga for stress",
    "yoga to release tension",
    "yoga for tension relief",
    "relaxing yoga",
    "yoga to relax",
    "yoga before bed",
    "nighttime yoga",
    "yoga for sleep",
    "bedtime yoga for sleep",
    "relaxing yoga for sleep",
    "yoga to sleep better",
    "yoga with bird",
    "restorative yoga",
    "yoga",
    "yoga for anxiety"
  ],
  "publishedAt": "2021-05-21T00:37:52Z",
  "duration": 769,
  "durationFormatted": "12:49",
  "viewCount": 4880719,
  "likeCount": 126415,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/4TQsfBYCyKQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/4TQsfBYCyKQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/4TQsfBYCyKQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/4TQsfBYCyKQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/4TQsfBYCyKQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/4TQsfBYCyKQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I have been having really crippling anxiety these last few months and I was fully sobbing during this routine. There is something so cathartic and healing about just checking in with myself and giving myself space to just be. Thank you for this.",
    "Thank you. I started to cry when you said to connect with self and just observing the body and to be with self. I’m a very sensitive person and I feel emotions more so than others and it’s so overwhelming honestly all the time. And I recently lost a friend to chemotherapy and I feel broken and this has helped me relax, I feel like I can go to sleep tonight. Thank you.",
    "i have done this for the last couple of nights... and when i tell you i have never slept better i mean it. i have never slept so deeply and felt so good not only going to bed but also waking up. this is a game changer. thank you for giving us this❤",
    "Even if it wasn&#39;t the longest session, im proud that I still showed up for myself and made myself do yoga, thanks to you and your guidance ❤",
    "I just finished this and I have no clue why I feel like crying but I&#39;ve been busting my butt to workout this year to have a healthier life, hearing your words and doing this just helped me mentally and emotionally, thank you so much"
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}