{
  "video_id": "588-C4bEL28",
  "title": "BEASTMODE FULL BODY WORKOUT - Intense Strength Training | Day 4",
  "description": "Full body workout targeting the major muscle groups using compound lifts and sets of 4 throughout! Back, shoulders, chest and lower body using dumbbells and bodyweight for a demanding strength training workout that requires determination and focus! \n\nFor this full body workout, you will need a pair of dumbbells and your mat!\n\nOptional is a yoga block/ thick book / stepper for heel elevated squats and foot elevated lunges!\n\nThe dumbbells I am using for your reference are 15kg each and 9kg each!\n\nIf you have a variety of dumbbells, you can keep those nearby to go heavier or lighter as you work through the workout!\n\nThe timer will be on for a majority of the workout for 40 seconds of work and 20 seconds rest! \n\nRENEGADE ROWS X4\n\nHEEL ELEVATED SQUATS x4\n\nCHEST PRESS x4\n\nDEADSTOP LUNGES x4\n\nSHOULDER PRESS x4\n\nSTATIC LUNGES X4\n\nDEADSTOP PUSH UPS x4\n\nREAR STEP LUNGE (dumbbell opposite side) X4\n\nARMS CROSSED SIT UPS x4\n\nFinisher!\n\n30/30/30/30\n\n1/2 REP ELEVATED SQUATS!\nPUSH UP PULSES!\n1/2 REP ELEVATED SQUATS!\nPUSH UP PULSES!\n\nWhat a way to finish!! My entire body worked so hard! \n\nThose Renegade Rows at the beginning require so much effort from your entire body to control the dumbbells… it set the tone for the rest of the workout! \n\nCongratulations in advance for smashing this one!! \n\nLet’s go!!!!\n\nCx\n\nAlways ensure you warm up before any workout. Here’s my 5 Min Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n\nDon’t forget to Subscribe and turn on notifications so that you don’t miss any Workouts, Community Updates or Surprises: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nHere’s today’s optional add-on: https://youtu.be/5bgVXyP0IIM\n\nThe Complete Beastmode Series Playlist: https://www.youtube.com/playlist?list=PLhu1QCKrfgPU7VPqNkXyhKX9x9Nmfq437\n\nMy FREE Workout Programs\n\nEPIC Beginner: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\nEPIC I: https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\nEPIC II: https://www.youtube.com/playlist?list=PLhu1QCKrfgPVI4oP_bKz1NvbPgsRaE8AQ\nEPIC Heat: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUcupe9O1IKpC_GhHuHW96r\n\nJoin The Caroline Girvan Community\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Private Facebook Group: https://facebook.com/groups/carolinegirvan\n\nMy Amazon Stores\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\n▶ Business Enquiries Email: info@carolinegirvan.com\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "full body workout",
    "strength training",
    "intense workout",
    "caroline girvan",
    "beastmode",
    "beastmode series",
    "dumbbell workout at home",
    "muscle building",
    "bodybuilding",
    "resistance training",
    "lunges",
    "chest at home",
    "full body workout at home",
    "full body workout with dumbbells",
    "workout",
    "home workout",
    "full body",
    "natural bodybuilding",
    "strength workout",
    "strength training for women",
    "advanced workout",
    "dumbbell full body workout",
    "full body strength workout"
  ],
  "publishedAt": "2021-07-23T04:00:02Z",
  "duration": 2511,
  "durationFormatted": "41:51",
  "viewCount": 1265335,
  "likeCount": 21977,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/588-C4bEL28/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/588-C4bEL28/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/588-C4bEL28/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/588-C4bEL28/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/588-C4bEL28/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/588-C4bEL28\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Can we just acknowledge the fact the writing on the screen matches her outfits?  I think it is like that every time. It&#39;s the little details. The little ones that tell us you care.",
    "61 and am going heavy but keeping up. Your enthusiasm and desire to be as excellent as you can be is just fantastic. I feel I should be paying you something!",
    "To be successful in anything in life, they say stay in a community with like mindedness people. I am glad I found one here and we all strive with the Queen Caroline. I am just gonna smash this one, so help me God. 😀💪🏾🔥",
    "First timer - I loved the workout! Exactly what I was looking for - challenging - low key (no excessive cheerleading) and no hip hop in the background:). I am hooked.",
    "I was overwhelmed with some sort of bittersweet feeling and I started crying. It was such a genuine feeling. I used to hate lunges and think push up pulses are impossible. And I did them today and did them good. I am born and bred in an extremely patriarchal city. At a young age, I realized I had a passion for physical workout. I have no doubt that despite being so resilient I would have broke and given up if it weren&#39;t for so many writers who wrote amazing, detailed magical stories about impossible women, those movie makers, those social heroines, the impossible doers like Caroline. <br>Thank you so much, Caroline. Now that I have had the taste of it I will never settle for anything less.💪🔥💅💗"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}