{
  "video_id": "5GSeWdjyr1c",
  "title": "A Guided Meditation on the Body, Space, and Awareness with Yongey Mingyur Rinpoche",
  "description": "Learn how to use meditation to transform stressful situations and challenging emotions into support for awareness: https://tergar.org/beyond-mindfulness-webinar\n\n_____________\nIn this short guided meditation, Tibetan Buddhist meditation master Yongey Mingyur Rinpoche gives simple instructions for bringing awareness to the body, sensory experience, space, and finally to awareness itself. The main point of the practice is to fully embrace the present moment with mindfulness and awareness.  \n\n_____________\n🔗 Joy of Living Meditation Program:  Learn meditation under the skillful guidance of Yongey Mingyur Rinpoche at your own pace. \nhttps://joy.tergar.org/\n_____________\n\n🔗 Vajrayana Online: Study and practice of the Tibetan Buddhism with Mingyur Rinpoche. \nhttps://learning.tergar.org/\n_____________\n\n🔗Online events, retreats with Mingyur Rinpoche https://events.tergar.org/\n_____________\n\n🔗 About Tergar Path: https://tergar.org/programs/",
  "channelTitle": "Yongey Mingyur Rinpoche",
  "channelDescription": "Yongey Mingyur Rinpoche is a much-loved and accomplished Tibetan Buddhist meditation teacher. With a rare ability to present the ancient wisdom of Tibet in a fresh, engaging manner, Rinpoche's profound teachings and playful sense of humor have endeared him to students around the world. \n\nHis first book, The Joy of Living: Unlocking the Secret and Science of Happiness, debuted on the New York Times bestseller list and has been translated into over twenty languages.When not attending to the monasteries under his care in India and Nepal, Rinpoche spends time each year traveling and teaching worldwide.\n\n",
  "tags": [
    "Meditation",
    "mindfulness",
    "buddhism",
    "tibetan buddhism",
    "how to meditate",
    "mingyur rinpoche",
    "karmapa",
    "kagyu",
    "nyingma",
    "rinpoche",
    "lama"
  ],
  "publishedAt": "2011-11-12T22:57:27Z",
  "duration": 879,
  "durationFormatted": "14:39",
  "viewCount": 5773611,
  "likeCount": 100114,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/5GSeWdjyr1c/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/5GSeWdjyr1c/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/5GSeWdjyr1c/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/5GSeWdjyr1c/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/5GSeWdjyr1c/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/5GSeWdjyr1c\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Zen and meditation helped me walk away from the brink of suicide and this was one of the first videos I watched on my journey.",
    "10 years ago I had never meditated in my life..... I watched this video and felt something so profound and real. Something I’d never experienced. Since that day, I’ve meditated for atleast 15 minutes a day. Looking back on it, this one simple YouTube video was the tiny spark that went on to change who I am and my destiny completely, I can’t thank you enough for this video.",
    "I noticed how many people here had suicidal thoughts. I&#39;m one of them. My wife 34 past away from covid 20 March 2021 due to asthma and I survived it. I&#39;m battling without her and miss her so much. I want to meditate to stay in contact with her. She is my everything and wait for me when my time comes. I wish everyone a blessed life filled with peace and happiness.",
    "He talks to you like you’re a child. And I think it really works. Because the one that fears inside us is really a child who’s afraid of what he doesn’t understand clearly. You need to be calm to be clear. I wish you guys all the best.. we are survivors.",
    "I didnt want to open my eyes when he said to, i was in deep space, when i did my room truly seemed different. That was awesome!"
  ],
  "channelSubscriberCount": 690000,
  "channelVideoCount": 325
}