{
  "video_id": "5Ho04GadHWE",
  "title": "5 Minute Motivating Breathwork I Morning Routine (3 rounds)",
  "description": "Want to deepen your practice? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite with T-Shirts and more:\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nThis style of breathwork Session supports you in boosting your immune system, energy and your focus and determination in life. We aren´t all yogis living in caves, so we have our daily duties as human beings to do. And if you don´t like where you are at in life, that's okay. You can change. It comes from within, and begins every morning. It's a reminder for me as well that sometimes we put things off, forgetting that the future isn't guaranteed. We all have a reason that we are here, let's get out of bed, count our blessings and do what needs to be done. With love in our heart. \nMuch love,\nSandy \n\n\nRegular practice of Breathwork can bring real change to your life Including boosted immune system, lowered stress and inflammation, better focus, more energy and the list goes on. My guiding voice mixed with the rhythmic music really helps to go deeper into a state of relaxation and bliss. So if you want the full experience, wear headphones and be in a quiet comfortable place \n\nSafety/Disclaimer: \n\nAll information provided by this channel is only for educational and entertainment purposes.  Austin Sanders (Sandy) is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n\nMuch Love,\nSandy\n\n#motivation #breathwork #yoga\n00:00 Introduction\n00:35 Round 1\n01:55 Round 2\n03:14 Round 3",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "motivational video",
    "motivation",
    "inspirational video",
    "morning yoga",
    "breathing exercises",
    "wim hof",
    "guided breathwork",
    "immune system",
    "breathing exercise",
    "kundalini awakening",
    "open third eye",
    "boost immune system",
    "guided breathing exercises",
    "breathwork music",
    "dmt breathing 3 rounds",
    "wim hof method",
    "guided breathwork for anxiety",
    "morning routines",
    "manifestation meditation",
    "law of attraction",
    "yoga for men",
    "yoga",
    "kundalini",
    "dmt",
    "breathwork",
    "meditation"
  ],
  "publishedAt": "2022-07-03T13:00:15Z",
  "duration": 301,
  "durationFormatted": "5:01",
  "viewCount": 427345,
  "likeCount": 8565,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/5Ho04GadHWE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/5Ho04GadHWE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/5Ho04GadHWE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/5Ho04GadHWE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/5Ho04GadHWE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/5Ho04GadHWE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks!",
    "Everyone reading this know you are loved &lt;3",
    "I literally do this every morning. It’s just right for me. The length is perfect. The retentions work for me. It’s just part of my morning routine. Thank you so much Sandy.❤",
    "This guy is starting to grow on me",
    "This has completely changed my life- my immediate morning anxiety is GONE after doing this and my meditations following the breath work are extra powerful. Thank you!!"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}