{
  "video_id": "5itkfGLcb5E",
  "title": "Guided Meditation Before Sleep: Let Go of the Day",
  "description": "Scott Ste Marie is a Mindfulness Practitioner, Coach and Mentor. Through his lived experience with depression and anxiety he has seen what is truly possible in recovery, healing, and living authentically. If you feel at ease and comfortable with the videos on this channel and Scott's approach to emotional and mental well-being, the resources below may be helpful to you. \n\nSPEAK WITH SCOTT\nhttps://www.scottstemarie.com/coaching",
  "channelTitle": "Scott Ste Marie",
  "channelDescription": "I help men overcome self-doubt, silence their inner critic, and build self-compassion to live happier, more authentic lives. When you're ready, I promise you will experience a true life transformation, developing a true, loving connection with yourself. Book a call with me here: https://zcal.co/scottstemarie/transform\n----------\nScott Ste Marie is a Mental Health Keynote Speaker & Coach. Through his lived experience and completing his Masters of Neuroscience, he has seen what is truly possible in recovery, healing and living authentically. His history with depression and anxiety have allowed him to develop a strong sense of empathy and compassion with his audiences and those he works with personally. Music is his true obsession as he plays the guitar, drums and sings.\n",
  "tags": [
    "guided meditation",
    "before sleep",
    "guided visualization",
    "Meditation (Quotation Subject)",
    "Sleep (Quotation Subject)",
    "Before",
    "balance",
    "sleeping meditation",
    "sleep meditation",
    "can't sleep",
    "open",
    "chakras",
    "deep sleep meditation",
    "hypnosis",
    "meditation for sleep",
    "guided meditation sleep",
    "sleep hypnosis",
    "let go of the day",
    "letting go",
    "how to let go",
    "guided meditation before sleep",
    "before bed meditation",
    "can't fall asleep",
    "trouble sleeping",
    "jason stephenson",
    "depression to expression"
  ],
  "publishedAt": "2017-02-28T01:05:59Z",
  "duration": 744,
  "durationFormatted": "12:24",
  "viewCount": 4500786,
  "likeCount": 48902,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/5itkfGLcb5E/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/5itkfGLcb5E/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/5itkfGLcb5E/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/5itkfGLcb5E/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/5itkfGLcb5E/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/5itkfGLcb5E\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Sweet dreams friends. Here&#39;s my website if you feel a need for more resources: <a href=\"https://www.scottstemarie.com/\">https://www.scottstemarie.com</a>",
    "I cried when he said &quot;l just wanted to acknowledge you that you&#39;ve made it through today&quot;. No today wasn&#39;t that hard but I don&#39;t know, I just cried",
    "(night 2 of listening) just saw a comment that said &quot;That awkward moment when you just can&#39;t name 3 good things.&quot; And... that awkward moment when you just have to focus because even if it wasn&#39;t good, it wasn&#39;t bad.. you woke up. you breathed, you rose, you put your hair up and spoke, you ate and maybe you smiled. you lived and made it through the day, with or without happiness, with or without people, with or without help. you made it through the day breathing and living, and you&#39;re on that track. love the small things.",
    "Thank you. My anxiety has been bad lately. I needed this. If you are reading this, you are worth it and you are loved. Goodnight, sweet dreams everyone!",
    "I smiled and started to cry very softly when he said “you did the best you can do” because it was a hard day for me and I really did the best I can do. I hope you had an amazing day ❤️"
  ],
  "channelSubscriberCount": 390000,
  "channelVideoCount": 323
}