{
  "video_id": "5Ju3XvZ6S1Q",
  "title": "15 Min Yoga FULL BODY STRETCH & Deep Relaxation",
  "description": "This is a 15 minute yoga full body stretch.\nDoing this yin inspired yoga class will help to deeply stretch the entire body while releasing tension and promoting relaxation.\nYou can do this routine anytime of the day however it is a great addition to ones bedtime routine to help improve sleep.\nThis 15 min yoga stretch will also help to increase flexibility over time.\nRemember to listen to the body and never do anything that causes pain or uncertain discomfort.\n\n#Yoga #FullBodyStretch #WithMe\n\n & support.\n\n________________________________________\n\n\n\nNOTE: Some links may be affiliate links that Yoga With Bird earns a small percentage of however each affiliate product is something she genuinely loves and has used herself.\n\n________________________________________\n\nYOGA CHALLENGES:\n\n30 Day Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlybJmrSb19MiVWnve5slKTJ\n\n30 Day Restorative Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwr-X3VF2CrZdf7rDrWH1aB\n\n7 Day Yoga For Overall Health: https://www.youtube.com/playlist?list=PLCIrre1vyDlyTB8gu7I99XQkw9M85YdTk\n\n5 Day Morning Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlyjr87XsR6j4QGzyKKxwsTH\n\n5 Day Hip Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwAnZvLflZM-e5WWedHTBpo\n\n________________________________________\n\nABOUT THIS YOUTUBE YOGA CHANNEL\n\nFrancine Cipollone also known as her childhood nickname Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation. She created this YouTube Yoga Channel to offer a space where yoga is accessible to all. This channel is all about feeling good and reconnecting to self. Yoga is for every-BODY, Join the journey by Subscribing today: https://www.youtube.com/yogawithbird\n\nJoin Yoga With Bird's Email List: https://mailchi.mp/34e952e0ed28/yoga-with-bird-email-list\n\n________________________________________\n\nDISCLAIMER: \nPlease consult with a physician before beginning any exercise program. \nBy participating in this activity you acknowledge that this exercise is a physical discipline that requires a certain amount of mental concentration and physical strength and endurance and that you must be in good health to participate. \nYou agree to work according to your own limitations and take full responsibility for your own safety and well-being. \nBy participating in this activity you agree to listen to your body at all times and never do anything that causes pain. \nYou acknowledge that participation in this activity exposes you to a possible risk of personal injury. \nYou are fully aware of this risk and hereby release Yoga With Bird aka Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "15 minute yoga",
    "yoga full body stretch",
    "15 minute yoga full body stretch",
    "yoga",
    "yoga class",
    "15 min yoga",
    "15 min stretch",
    "15 minute stretch",
    "15 minute yoga stretch",
    "yin yoga",
    "deep yoga stretch",
    "deep stretch",
    "full body stretch",
    "deep full body stretch",
    "yoga stretch",
    "15 minute yoga full body",
    "full body yoga",
    "how to stretch the entire body",
    "yoga with bird"
  ],
  "publishedAt": "2021-04-03T12:00:02Z",
  "duration": 827,
  "durationFormatted": "13:47",
  "viewCount": 3075559,
  "likeCount": 68837,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/5Ju3XvZ6S1Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/5Ju3XvZ6S1Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/5Ju3XvZ6S1Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/5Ju3XvZ6S1Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/5Ju3XvZ6S1Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/5Ju3XvZ6S1Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "JOIN My 2nd Channel for all things lifestyle 👉<a href=\"https://www.youtube.com/channel/UC3_Ht5pCG7M1jKCnlwARhaQ\">https://www.youtube.com/channel/UC3_Ht5pCG7M1jKCnlwARhaQ</a>",
    "It&#39;s amazing how yoga can connect to your emotions. When in pigeon pose I started to cry. I&#39;m getting married tomorrow and my Dad can&#39;t be there because he passed away in January. This big surge of emotion took over me in that posture and I thought of him and my tears dropped onto the mat. Yoga can be very healing, thank you Bird.",
    "This felt so good. I’m only 20 but my muscles are horribly painful from being a full time early childcare worker as well as having just recovered from severe depression and sleep disorders that left me basically bedridden for years. The gentle reminders that it was ok to modify the poses so they didn’t heart made me feel so at peace and I’m hoping that this will become a daily ritual for me",
    "This is so peaceful and comfortable, I felt like didn’t want to end the session.",
    "Thank you for making this 15 minutes; it was much less intimidating than a longer video- for a beginner like me at least."
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}