{
  "video_id": "5vX2RxKsVJM",
  "title": "45 Min Full Body Cardio HIIT | ALL STANDING | Burn up to 600 Calories, No Repeat, No Equipment",
  "description": "Ready for another sweaty All Standing HIIT Session? It's a full body Cardio workout with lots of fun and intense exercises. Let's get sweaty! #fullbodyburn #allstanding #fun\n\n*The number of calories you burn will vary from person to person but this might serve as a guideline. \n\n❀Full Body Workout\n❀Time: 45 sec on/ 15 sec off\n\nWarm Up 00:00 - 03:12\nWorkout 03:12 - 43:06\nCool Down 43:06 - 46:33\n\n❀ Don’t forget to Subscribe and turn on notifications so that you don’t miss any Workouts, Community Updates or Surprises:\nhttps://www.youtube.com/channel/UC6TSBn2RAx036n04GaN6McA\n\n❀Join the Community:\nFitness Channel\nInstagram:  http://instagram.com/eleni.fit__\n\n❀ My Amazon Storefront: https://www.amazon.de/shop/elenifit\n❀ Music:  https://www.epidemicsound.com\n\nDISCLAIMER\nIf you are new to exercise, you should understand that there is the possibility of physical injury. Please notice that if you performing any exercise or program, you agree that you do so at your own risk. This channel offers health, fitness and nutritional information and is not intended to be a substitute for professional medical advice, diagnosis or treatment.",
  "channelTitle": "Eleni Fit",
  "channelDescription": "Welcome to my channel! My name is Eleni and I'm from Germany.\nI wanna make you feel strong, fit and confident with my real time, at home workouts.\nMy goal is to inspire everybody to get up and reach their goals with lots of positive vibes.\nI hope you enjoy all my videos and join me in this journey. \nLet's train and sweat together!\n\n♥ Subscribe to my YouTube Channel and never miss a video!\n♥ Instagram: @eleni.fit_\n",
  "tags": [
    "allstanding",
    "cardiohiit",
    "bodysculpt",
    "strengthandcardio",
    "burn600calories",
    "600calories",
    "45minutesworkout",
    "fatburningworkout",
    "caloriekiller",
    "fullbody",
    "intense",
    "HIIT",
    "fullbodyhiit",
    "extremesweaty",
    "hiit",
    "burncalories",
    "homeworkout",
    "workout",
    "calorie",
    "burner",
    "exercise",
    "summer",
    "summerbody",
    "noequipment",
    "norepeat",
    "funworkout",
    "supersweaty",
    "fun",
    "elenifit",
    "standinghiit",
    "Intensehiit"
  ],
  "publishedAt": "2022-04-14T02:00:03Z",
  "duration": 2794,
  "durationFormatted": "46:34",
  "viewCount": 800359,
  "likeCount": 15281,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/5vX2RxKsVJM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/5vX2RxKsVJM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/5vX2RxKsVJM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/5vX2RxKsVJM/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/5vX2RxKsVJM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks!",
    "I spent 357 calories!! Very powerful workout ❤<br>For the first time in all home workouts I did, my fitness tracker showed an anaerobic 1.1 stress level and recovery for 28 hours, that&#39;s so cool, thank you!",
    "OK let&#39;s keep our track for next 14 days...<br>Day 1✅️ 35min  sweating hell out of it ..... date (7.8.23)<br>Day 2✅️ 40 min gave up ... date  8.8.23 those six min more were just too much for my body<br>Day 3 ✅️ full workout. .....so proud of myself  getting stronger slowly 10.8.23<br>Day 4✅️ did great .... 👍 11.8.23<br>Day 5 ✅️ took break 12.8.23<br>Day 6 ✅️ did emis walking workout 13.8.23<br>Day 7 ✅️ did stretching in the morning <br>Day 8 ✅️ okays got my energy back from rest and completed it today with no break ... getting stronger but no diff in wgt as of now 14.8.23<br>Day 9✅️ did full workout .. getting stronger 💪 😌 16.08.23<br>Day 10 -15 that time so took rest <br>Day 16✅️  okay did another walking workout 22.08.23<br>Day 17 ✅️ back on with high energy 23.08.23<br>Day 18 ✅️ starting to see a little difference with abdomen part 24.08.23<br>Day 19 ✅️ having less breaks in between and doing morning stretching too 25.08.23",
    "3 weeks ago I was only able to finish half of the video and I was out of breath. After 3 weeks of regular workout, I came back. And I completed the entire video. If feels so good when you realize that you have become stronger!😎",
    "Thank you so much for these videos! I&#39;m a 46 yr old British man living in Japan. In June I decided to really commit to losing weight. I think I searched for &quot;all standing workouts&quot; on YouTube (not good at going up and down too much) and your programme came up. I&#39;ve been doing one of your workouts 3 or 4 times a week, weights twice a week, a 30min brisk walk most evenings, and have swapped pastries &amp; cookies for bananas &amp; yoghurts, and cut out rice from my dinner. I was 100.8kg when I began (my height is 190cm to give context) and yesterday I broke the 97kg barrier for the first time in years. Very satisfying!<br>The 45s/15s format for each exercise is perfect. No single exercise is too long, there is so much variety and I generally burn 500-600g each session. I also appreciate there being no talking. I mean no disrespect to the trainers who do speak while they teach, but it can be distracting for me. It&#39;s nice to just get on with it.<br>My goal is to get down to 95kg and then see where I can go from there.<br>Once again, thank you! Not sure if these videos were intended for men as well, but they certainly work for me."
  ],
  "channelSubscriberCount": 1870000,
  "channelVideoCount": 580
}