{
  "video_id": "5W7BYOTOuu8",
  "title": "Standing Pilates Cardio Workout | Burn Fat and Tone Muscles| 30 minutes",
  "description": "Join me for a 30 minute standing pilates cardio workout. This will raise your heart rate, burn fat, tone muscles and put a smile on your face as we move through low impact, high intensity and fun exercises to boost the metabolism and leave you feeling energised and raring to go. I'll include and warm up and a cool down too. A great session to get going in the morning, I recommend you do this at least three times a week to see and feel the difference in your body. \n\nDo check out my other high energy workouts here: \n\n30 Minute Standing Cardio Pilates + Abs https://youtu.be/HauHdwahJvM\n\n15 Minute Standing Pilates for Strong Legs https://youtu.be/gX23jrqY_nk\n\n14 Minute Standing Pilates and Barre Workout: https://youtu.be/PWbRI5PqV2I\n\nPlease click the Like button and Subscribe to the channel to help me make more films just for you. \n\nStay safe, stay well and enjoy every moment of this day,\nTake care, Rachel  x\n\n#girlwiththepilatesmat #cardioworkout #pilatesfullbodyworkout \n\nIf you enjoyed this video, feel free to buy me a coffee to show your support: https://ko-fi.com/thegirlwiththepilatesmat\n\nI am currently featured in the Stay in, Work out campaign with Sport England here:\nhttps://www.sportengland.org/jointhemovement#get_active_at_home\n\nIf you'd like to join my live online classes via Zoom, pop to my website for details;\nhttp://www.rachellawrencepilates.com\n\nWant to keep in touch? Come join me on my other social channels:\nhttps://facebook.com/RachelLawrencePilates\nhttp://www.instagram.com/thegirlwiththepilatesmat\nhttp://twitter.com/rachel_pilates\n\nDisclaimer: It is recommended that you consult your Doctor or Healthcare Professional before starting any exercise programme. If you experience any pain or discomfort during this workout you should stop immediately and if necessary seek medical attention. When participating in any exercise or exercise programme, you agree that you do so at your own risk and assume all risk of injury to yourself. By using this video you understand and agree that Rachel Lawrence- The Girl with the Pilates Mat- will not be held responsible or liable for any injury or loss you may suffer as a result of undertaking the workout.",
  "channelTitle": "The Girl With The Pilates Mat",
  "channelDescription": "Welcome to My Channel!\n\nI'm Rachel—a Certified Pilates Instructor with 25 years of Pilates practice and a background as a Professional Dancer. I'm passionate about ageing gracefully through Pilates and believe everyone deserves to feel good in mind and body, no matter their age or stage in life.\n\nOn this channel, you'll find Pilates and Dance-based fitness for all abilities and ages, from Beginners to Advanced Levels. Our focus is on nurturing a healthy mind, body, and spirit in a supportive, positive, and kind community.\n\nI also share health and wellbeing tips during livestream chats and classes, where my beloved rescue dog often makes an appearance! Originally from London, I now enjoy life in Brighton on the beautiful South Coast of England.\n\nSubscribe today and join our warm, welcoming community of wellbeing enthusiasts from around the world.\n\nMy book: The Little Book of Pilates is available now.\nTo Order UK: https://amzn.to/3WvZ074\nTo Order US/Worldwide: https://amzn.to/3XqD4LT\n",
  "tags": [
    "Standing Pilates Cardio Workout | Burn fat and tone muscles| 30 minutes",
    "30 minute standing pilates workout",
    "30 minute standing fat burning exercise",
    "30 minute standing cardio workout",
    "30 minute standing abs workout",
    "30 minute leg and glute workout",
    "30 minute standing dancers workout",
    "30 minute pilates fusion cardio",
    "30 minute strength cardio and pilates core",
    "30 minute standin pilates cardio burner",
    "cardio workout for over 40",
    "cardio pilates",
    "girl withthe pilates mat cardio"
  ],
  "publishedAt": "2021-10-22T10:01:56Z",
  "duration": 3277,
  "durationFormatted": "54:37",
  "viewCount": 50129,
  "likeCount": 2156,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/5W7BYOTOuu8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/5W7BYOTOuu8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/5W7BYOTOuu8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/5W7BYOTOuu8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/5W7BYOTOuu8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/5W7BYOTOuu8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I saved this session for the time I could follow with speed and breathing. Love getting back after 1 year and did the entire session.",
    "This is Jogay.  Thank you so very much!  Every time I do these I think it is my favorite, but I LOVED this one!!!❤. Thanks again for helping me and doing these videos!",
    "Hello lovely people!  I have a new adventure for you today, a 30 minute session to make you glow with wellbeing!! Hope you enjoy it as much as we did live! Thanks for watching and sending love and positivity to you all 💕",
    "2025 and this is now one of my favourites. You&#39;ve built such a treasure trove, Rachel!",
    "I really loved this one, Rachel.  I came into it feeling very sluggish, but emerged with great energy.  Thank you for all you do!  😎"
  ],
  "channelSubscriberCount": 302000,
  "channelVideoCount": 793
}