{
  "video_id": "60T1eRQzlGw",
  "title": "25 MIN FULL BODY WORKOUT || Energising Mat Pilates",
  "description": "This Full Body Pilates Workout is perfect for when you are short on time and will leave you feeling strong and energised! 😊\n\n🌸  Wearing Gymshark http://gym.sh/Shop-Nicole\n\n\n🤍 INSTAGRAM: @movewithnicole\n🤍 EMAIL: movewithnicole.yt@gmail.com\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole Pty Ltd will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 25 minutes full body",
    "pilates workout 25 minutes",
    "25 minutes pilates workout",
    "25 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates workout",
    "25 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "move with nicole",
    "mat pilates",
    "feel good pilates",
    "intermediate pilates",
    "beach workout"
  ],
  "publishedAt": "2021-08-23T09:55:02Z",
  "duration": 1621,
  "durationFormatted": "27:01",
  "viewCount": 1221937,
  "likeCount": 35492,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/60T1eRQzlGw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/60T1eRQzlGw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/60T1eRQzlGw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/60T1eRQzlGw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/60T1eRQzlGw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/60T1eRQzlGw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hope you are all left feeling strong and energised after this class! 💪🏽🥰",
    "I cuss you out like every 5 seconds but I’m grateful that I’m able to challenge myself like this and that you’re willing to provide the challenge. Thank you so much",
    "Today is my 100-days with Move with Nicole and I am so grateful. I can see the effect it has on my body. I had never been so enthusiastic about working out and do not want to miss a day without your channel. My congrats from Barcelona. Thanks Nicole!",
    "You are so good at what you&#39;re doing. I think your content is the best out of all the fitness youtubers. Great attitude, a well-thought and challenging class, good music, beautiful landscape. Perfection &lt;3.",
    "That’s the content that makes me realize internet and social medias can actually be a blessing from heaven! Thanks again. Biggest fan"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}