{
  "video_id": "66kfC7qEJTQ",
  "title": "30 minute Full Body Strength Workout | Strength Training for Seniors and Beginners",
  "description": "This is a strength training workout created for seniors and beginners who want to start lifting weights for an at home workout.  Each of the exercises is explained for seated or standing exercises.  We are into week 9 & 10 but you could also start with this program if you know the basics of strength training.  Each exercise is explained to ensure you do the exercises properly with good form.  By lifting weights, you'll become stronger, leaner and more fit.  Ideally, as the repetitions get easier over time, start to use a heavier weight to always see improvements.  \n\nPlease subscribe and write a comment!  I'd love to hear from you!  Feedback is always welcome!\n\nWishing you improved health!\nJules\n\n#strengthtraining #beginnerworkout #improvedhealth\n\nDisclaimer:  You should always consult your physician before starting any 'Improved Health' fitness program or any other fitness program.  This content is not medical advice and is intended for general education and demonstration purposes only.  The use of the information provided in this video is solely at your own risk.\n\nIf you like the picture in the background, you can purchase it here: https://amzn.to/2UGdHuu",
  "channelTitle": "Improved Health",
  "channelDescription": "Welcome to Improved Health!\nYour go-to channel for effective, low-impact workouts designed for 'every' body. You'll find three levels of workouts—Gentle, Beginner, and Intermediate—so you can find the level that suits you best. Once you know your level, head to the playlists to explore a variety of workouts, including cardio, strength, stretching, and all-in-one routines—with options for both talking and no-talking formats.\n\nAs a Recreation Therapist, Group Fitness Instructor, and Senior Fitness Instructor, my mission is to create fun, safe, and manageable workouts that help you feel your best—physically and mentally.\n\n💺 Love chair workouts?\nI have a second channel dedicated entirely to them! Check out new chair workouts every Thursday on:\n👉 youtube.com/@ImprovedHealthChairWorkouts\n(Older chair workouts will still be available here too!)\n\nThanks for being here—I hope you enjoy the workouts, and I wish you improved health!\nJules\n",
  "tags": [
    "strength training",
    "strength workout",
    "exercise",
    "build strength",
    "strength training for beginners",
    "strength for seniors",
    "senior exercise",
    "exercises for seniors",
    "exercise for seniors",
    "senior strength training",
    "chair exercises for seniors",
    "strength training workout for seniors",
    "strength training workout",
    "plus size workout",
    "workout for seniors",
    "build strength seniors",
    "improved health for seniors",
    "improved health",
    "beginner strength training"
  ],
  "publishedAt": "2021-10-13T11:15:01Z",
  "duration": 1942,
  "durationFormatted": "32:22",
  "viewCount": 159391,
  "likeCount": 2239,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/66kfC7qEJTQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/66kfC7qEJTQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/66kfC7qEJTQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/66kfC7qEJTQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/66kfC7qEJTQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/66kfC7qEJTQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’ve recently discovered your channel…EXCELLENT! I’m 68, and last year, I not only lost 110 pounds, but with a change in diet, my symptoms for bipolar and Parkinson’s went away, and I no longer take 11 medications, some I’d been on for 33 years, I had to use a wheelchair, then I “graduated” to a walker, then a cane, no I don’t need any of them. I wished I’d found your channel when I first started…the channels I found weren’t near as thorough or professional as yours. I’ve tried some other channels for “over 50’s” and one I really like her routines, but she talks CONSTANTLY which really distracts me, and another channel is way too easy. Yours hits the perfect “sweet spot” I really enjoy walking outside (I walk 3.5-5 miles a day) but I live in a part of the country where we can get cold (like -20 last February), don’t get much snow but have ice storms. So I’ll enjoy your walking workouts. Thanks a lot!",
    "I love that you are showing both options.  Also, your sound and visuals are always so well done.  It&#39;s obvious that you put a lot of care into your videos.",
    "This workout is the best.   I have doing it 3x per week and am getting stronger.   Thank you for no ads!!!",
    "I really enjoy dedicated strength with a stretch afterwards. I’d like to see more for the intermediate level dedicated to full body strength. Regardless I’ll be coming back to this workout weekly. Thank you,Jules.",
    "Jules, you have the best chair-exercise videos on YouTube! I retired July of 2020 at 70 years-old and both my knees need replaced. I have lost 50 lbs and must lose another 50 to get them!!! You have the sweetest spirit and I thank you so very much. You have given me such help and hope, Jules, and I will let you know how’s it’s going. 💪💛"
  ],
  "channelSubscriberCount": 391000,
  "channelVideoCount": 433
}