{
  "video_id": "6coSK5__cTE",
  "title": "20 Min Cardio Workout To Reduce Belly Fat And Get A Flat Stomach",
  "description": "Do you want to lose belly fat by doing cardio routines? Then this video is perfect for you!\n\nBurn belly fat by doing exercises that raise your heart level for a longer period of time. That will most likely help you trim down the belly fat than regular sit-ups or crunches.\n\nFollow along this 20-minute video workout and burn more fat than your regular tummy trim session!\n\nGood luck and  be sure to subscribe to our channel for more workout videos everyday Monday to Friday!\n\nAre you ready for one exciting cardio session? Let's get started!❤️💪",
  "channelTitle": "Roberta's Gym",
  "channelDescription": "I'm here to help you look and feel great, with effective body weight workouts and exercises.\n\nBurn calories and extra fat with simple workout routines you can easily do at home. No equipment or gym necessary.\n\nNew video workouts Monday to Friday and then Sunday as well.",
  "tags": [
    "20 minute ab workout",
    "20 minute abs exercise",
    "abs workout",
    "abs exercise",
    "cardio for abs",
    "cardio workout for abs",
    "cardio exercise for abs",
    "cardio workout to lose belly fat",
    "cardio workout to get a flat stomach",
    "cardio exercise to burn belly fat",
    "cardio exercise to get a flat stomach",
    "best cardio workout for flat belly",
    "best cardio workout to lose belly fat",
    "cardio exercsie at home to burn belly fat",
    "burn belly fat at home",
    "lose belly fat at home",
    "cardio home workout for abs"
  ],
  "publishedAt": "2019-02-25T05:45:49Z",
  "duration": 1246,
  "durationFormatted": "20:46",
  "viewCount": 8197558,
  "likeCount": 94795,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/6coSK5__cTE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/6coSK5__cTE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/6coSK5__cTE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/6coSK5__cTE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/6coSK5__cTE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/6coSK5__cTE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;ve been doing this workout and others from this channel for the past 2 weeks or so. Last week I was 229 lbs, this week I am down to 225.6 lbs!!!!!! I am motivated to continue my weight loss journey.<br>UPDATE: Wow, it&#39;s been a while since I updated on my weight loss, I&#39;ve also started on other videos from this channel, but now I am down to 221lbs!!! Over a month for a couple weeks, I was unable to work out due to a foot injury but I substituted that for a calorie deficit! I have now been working out again on and off again for the past two weeks which seems to be helping in preventing burn out. I&#39;ll try to update every so often!<br><br>UPDATE: LOL i forgot to update since elast year this is crazy but one year update you guys: I am now 190lbs, I worked out from last year May to August when I came home from College and will be doing the same thing again this summer!!! 🙃 I have lost a total of 40lbs<br><br>Update 3: Hii Guys, just another update to share my progress, I am now 185Lbs 😌<br><br>Update 4: been a while, I stopped using this video to exercise but coming back for winter break, I’m now 173LBS  (December 2024)🙃",
    "I am eating 1000 calories per day and doing this exercise 2 times a day in morning and in evening i am very happy to see the results thank you so much 😊 i was 52 kg now i am 47 (15 days)",
    "Please anyone like it everyday.. so I follow it as a reminder that I can do it😂❤",
    "I’ve been doing this everyday as well as intermittent fasting (16:8) and I’ve stopped snacking on sugary things. I’ve lost 5 pounds (2.5kg) in about 4 days. Loving the results",
    "When you have a small room and your parents can hear your jumping downstairs 😭"
  ],
  "channelSubscriberCount": 6510000,
  "channelVideoCount": 2319
}