{
  "video_id": "6fy9vFP03HQ",
  "title": "10 minute Lower Body Workout // Floor Exercises for Legs & Glutes",
  "description": "This pilates based mat workout will make your legs burn and shake (in the best way) while shaping and toning your lower half.  These moves are all performed on the mat and are challenging but achievable! Want more of a challenge? Add ankle weights! Please go at your own pace and take breaks if you need to. Always start slow, and this workout will get easier every time you do it. Don't give up!\nOoops! I realize this video is 14 minutes and not 10! I may have gotten carried away. Well, that's just more muscle shaping exercises for you!\n\nExercises will be performed in different body positions. Such as; supported on our elbows, side lying, and on our elbows and knees. If you are uncomfortable on your knees (last glute section) you can also perform these exercises in a standing position slightly hinged forward.\n\nWant more? Check out other 10 minute workouts to mix and match such as arms, cardio, abs and stretching. 10 minute workout playlist here: https://youtube.com/playlist?list=PLdAl5SsVkdofbaTvn5Nsd1gclYr2L4LXY\n\n\nProducts that I use and recommend can be found here:\nhttps://www.amazon.com/shop/seniorshapefitness\nas an Amazon associate/influencer I earn from qualifying purchases \n\nSeniorShape is on Facebook\nhttps://www.facebook.com/SeniorShapefitness/\n\n\n\n\n10 minute workout, 15 minute workout, lower body workout, butt workout, workout for legs, no equipment workout, mat workout, pilates workout, workout for seniors, workout for beginners, beginner leg workout, pilates exercises for seniors, senior shape, 10 min butt workout, leg toning exercises, exercises for slim thighs,",
  "channelTitle": "SeniorShape Fitness",
  "channelDescription": "Hello and welcome to SeniorShape with Lauren! I’m thrilled you have found my channel! I am an ACE (American Council on Exercise) certified fitness instructor. I also hold a specialization in senior fitness. \nIt is my passion to create fun, new exercises and routines that are never boring. \nMy videos are easy to follow and the exercises featured are specifically curated for beginners, and active older adults. The workouts are challenging and at a great pace that works well for anyone. \nPlease subscribe so you never miss a new workout.\n\nEquipment I use or recommend can be purchased on my Amazon store page www.amazon.com/shop/seniorshapefitness\n*as an Amazon associate/influencer I earn from qualifying purchases\n\nFor those who have graciously asked to donate so I can continue to provide free videos can contribute through \nVenmo: @SeniorShape\nI appreciate your support!\n\nThanks for working out with me!\nLauren\n\n",
  "tags": [
    "10 minute workout",
    "lower body workout",
    "butt workout",
    "workout for legs",
    "no equipment workout",
    "mat workout",
    "pilates workout",
    "workout for seniors",
    "workout for beginners",
    "beginner leg workout",
    "pilates exercises for seniors",
    "senior shape",
    "10 min butt workout",
    "leg toning exercises"
  ],
  "publishedAt": "2022-01-26T12:00:03Z",
  "duration": 841,
  "durationFormatted": "14:01",
  "viewCount": 154652,
  "likeCount": 3245,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/6fy9vFP03HQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/6fy9vFP03HQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/6fy9vFP03HQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/6fy9vFP03HQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/6fy9vFP03HQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/6fy9vFP03HQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I know this is targeted for seniors (according to the channel) but WOW!  I had to take a physical break from working out and i&#39;m slowly getting back into it. This channel is a treasure, love the 10 minute workouts, i can build and combine multiple workouts that help my body get back into shape. Thank you!",
    "I’m 35 and loveeeee this workout! Definitely the perfect challenge and getting that burn! I have used this video several times now because it burns so good!!!!",
    "I like adding a few 10 min workouts together - mixes it up and makes me feel great!  Many thanks, Lauren, for investing your time in us.",
    "Thanks!",
    "&quot;Every time you do this, we get you stronger!&quot; Love this motivation, Lauren!!"
  ],
  "channelSubscriberCount": 599000,
  "channelVideoCount": 290
}