{
  "video_id": "6hZIzMpHl-c",
  "title": "30 min Beginner Yoga - Full Body Yoga Stretch No Props Needed",
  "description": "A beginner yoga sequence to build strength and improve flexibility. No props needed!\n💎 PRODUCT LAUNCH 💎 AFFIRMATION CARDS + YOGA JOURNAL 👉 https://bit.ly/ywkshop\n❤️ NEW MOBILE APP ❤️ FREE TO DOWNLOAD📲 👉 http://bit.ly/ytmobileapp\n\nHi friends, this week I'm offering you a 30 minute practice perfect for beginners! Now just because a class is for beginners, doesn't mean it isn't challenging! We are going to work on building foundational strength, balance and flexibility. The great thing about this practice is that there are no props necessary and it's great for all experience levels.\n\nIf you're new to yoga, remember that the most important thing is to stay focused on your breath. Don't worry if you don't get all the poses correctly or if you need to take a break. Be patient with yourself, do what you can and remember to relax. This is a wonderful class to alleviate stress and anxiety.\n\n✅ SUBSCRIBE TO SUPPORT FREE YOGA ON THE INTERNET  http://bit.ly/ywkassandra\n🔔 Don’t forget to click on the bell to turn on post notifications!\n\nThanks for watching,\nKassandra\nWEB ➡️ http://www.yogawithkassandra.com\nINSTAGRAM ➡️ https://instagram.com/yoga_with_kassandra\n\n\n📱 MY MOBILE APP 📱 Stream or download more than 800+ classes, use the in-app calendar to track and schedule classes, new exclusive challenges, classes and programs added every month ❤️ FREE TO DOWNLOAD ❤️ http://bit.ly/ytmobileapp\n\n\nFREE YOGA CHALLENGES\n🌞 30 day Morning Yoga Challenge http://bit.ly/morning30days\n🌛 30 day Evening Yoga Challenge: http://bit.ly/bedtime30\n🧘 7 day Yoga & Meditation Challenge: http://bit.ly/ywk7day\n🤸 30 day Flexible Body, Flexible Mind Challenge: https://bit.ly/flexbodymind\n\n\nMY PUBLISHED BOOKS & PRODUCTS\n🌿 \"Year of Yoga\" (NEW Book+ Online Program): https://geni.us/yearofyoga\n🎴 \"I Radiate Joy\" Affirmation Card Deck: https://bit.ly/affirmationdeck\n✍️ \"My Yoga Journey\" Guided Yoga Journal: https://bit.ly/ywkyogajournal\n📕 \"Yin Yoga: Stretch the Mindful Way\" Book: http://geni.us/ywkbook\n🎁 \"My Yoga Journey\" GIFT SET journal, candle + book: https://geni.us/giftsetywk\n\n\n🛒 SHOP MY AMAZON FAVORITES 🛍️\nhttps://www.amazon.com/shop/yogawithkassandra\n\n\nSTUDY WITH ME\n🎓 30 hour Yin Yoga Teacher Training: https://bit.ly/yinyttkass\n🎓 10 hour Vinyasa Teaching Methodologies: https://bit.ly/yttvinyasa\n🕉️ 10 hour Yoga Philosophy Course: https://bit.ly/ywkyama\n⚡ 10 hour Tantra Wisdom Goddesses Course: https://bit.ly/wisdomgoddess\n\n\nYoga with Kassandra - Disclaimer\nPlease consult with your physician before beginning any exercise program. By participating in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Yoga with Kassandra from any and all claims or causes of action, known or unknown, arising out of Yoga with Kassandra’s negligence..#beginneryoga #30minyoga #yogawithkassandra",
  "channelTitle": "Yoga with Kassandra",
  "channelDescription": "Welcome to my channel - your #1 resource for free online Vinyasa & Yin Yoga. Here you'll find weekly yoga classes for all experience levels. Browse through 750+ yoga classes and tutorials right here on my channel. Please subscribe and hit the bell icon to be notified of new uploads. www.yogawithkassandra.com",
  "tags": [
    "yoga with kassandra",
    "30 min yoga",
    "flexibility yoga for beginners",
    "beginner yoga class",
    "30 minute yoga",
    "yoga class 30 min",
    "30 min beginner yoga",
    "yoga for beginners",
    "quad stretches",
    "no props yoga",
    "yoga for stress",
    "yoga for anxiety",
    "yoga",
    "beginners yoga",
    "easy yoga",
    "vinyasa yoga",
    "beginner yoga",
    "easy yoga routine",
    "yoga at home",
    "morning yoga",
    "yoga for flexibility",
    "full body yoga",
    "online yoga classes",
    "hatha yoga",
    "yoga for men",
    "hatha yoga for beginners",
    "slow flow yoga"
  ],
  "publishedAt": "2020-03-26T10:00:02Z",
  "duration": 1805,
  "durationFormatted": "30:05",
  "viewCount": 5199807,
  "likeCount": 77973,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/6hZIzMpHl-c/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/6hZIzMpHl-c/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/6hZIzMpHl-c/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/6hZIzMpHl-c/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/6hZIzMpHl-c/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/6hZIzMpHl-c\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’ve been doing yoga for 30 years.  You are the most in tuned teacher I’ve ever come across.  You have an absolute gift and emit the most gentle and accepting energy.  I’m so grateful for your classes.  Absolutely wonderful.  Thank you xoxo",
    "Can I just say how awesome this is? My daughter has PE as a class and she’s required to exercise for 30 minutes a day. I’ve decided to do it with her so I can lose weight and gain some more confidence. We had SO much fun doing this together. We giggled as things we couldn’t do and congratulated on things we could do. We are excited (well I am) to do it again tomorrow! After we get good at this, we will try another video!",
    "I’m not a beginner. I did yoga almost everyday for 2.5 years after finding this channel. 2023 brought me a break up, a job shift, and a whole dark-night-of-the-soul experience. I stopped doing yoga all together. It feels strange to come back to a beginner class but this also feels like exactly the place I need to start. Your message at the end reaffirmed this! Thank you for this class ❤",
    "I don&#39;t realize how much my body is tense and how much i hold my breath until you say, &quot;Relax your head and shoulders..take a deep breath in&quot; etc. Thanks! It really helps me when you tell us to relax and breathe!",
    "This video changed my life! I started 10 weeks ago…I only made it 16 minutes the fist time trying. Ten weeks later I can do this plus a 10 min energize practice in the morning and do another 30 minute evening practice before bed. I’m 52 years old and had rotator cuff and back surgery less than 2 years ago and never thought I gain any strength or flexibility back. You are patient and kind and an amazing instructor. You encouraged me to just keep trying. I’m far from anything beyond a beginner but I’m farther than I’d ever thought I’d be. Thank you so much! I encourage everyone to subscribe and follow. Work all the beginner practices until you find the style and routines you like. You won’t be sorry :)"
  ],
  "channelSubscriberCount": 2800000,
  "channelVideoCount": 917
}