{
  "video_id": "6NtCDYHp8eQ",
  "title": "5 minute HIIT Workout No Jumping | Beginner Low Impact Exercises",
  "description": "Short on time or just starting out with exercise? Get your body moving and burn fat with this 5 Minute HIIT Workout No Jumping. Here’s the format: 5 beginner low impact exercises in 30 second rounds with 20 seconds of rest. My mom shows how it’s done in a chair! It's about 600 steps, more or less depending on your pace.\n\nLet’s HIIT it!\n\n00:00 Introduction\n00:40 Warm Up & Workout\n05:09 Cooldown\n\nWant more HIIT workouts? \nHere’s a link to our 5-Minute HIIT Workout #1. Also, check out our full HIIT playlist! https://bit.ly/3MbznVl\n\nIf you like this video, please like and subscribe to our channel to receive more workouts. 💪🏋️‍♀️🏃‍♀️ Also, be sure to hit the bell 🔔 to be notified of new videos! This helps us help more friends around world. Thank you so much!\n\nyes2next celebrates fitness and joy at any age. It’s never too late to start exercising, creating, and doing. Say “yes” 2 your next steps to fitness and joy.\n\nIf you are new to our channel, we're happy you clicked on our video! We hope you enjoy it!  Please show your love💓 and support 🤝 and join the yes2next community by subscribing and pressing (🔔) to join the Notification Squad and stay updated with new uploads ✨ If you have any inquiries or requests, feel free to leave them in the comments below.\n\n🔴 Subscribe Here: https://www.youtube.com/@yes2next\n👍 Like the video (it helps a ton!)\n💬 Comment below to share your opinion!\n🔗 Share the video with anyone you think it might help :)\n\n\n📲 Stay Connected: \n📷 𝐈𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦: https://instagram.com/yes2next \n⚫️ 𝐓𝐢𝐤𝐓𝐨𝐤: https://tiktok.com/yes2next \n🔵 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤: https://facebook.com/yes2next \n🔵 𝐓𝐰𝐢𝐭𝐭𝐞𝐫: https://twitter.com/yes2next \n🔴 𝐏𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭: https://pinterest.com/yes2next\n🌐 𝗪𝐞𝐛𝐬𝐢𝐭𝐞: https://yes2next.com\n ✉ 𝐄𝐦𝐚𝐢𝐥: yes2next@gmail.com \n\nDisclaimer: This program is provided with your health and safety in mind, but every individual has their own limitations. It is crucial that you consult with your physician before beginning this or any other exercise program. This program is not a substitute for professional medical diagnosis, treatment or advice. By participating in this exercise program, you do so at your own risk. Please stop if you experience pain, dizziness, or shortness of breath.\n\n\n#beginnerworkout #lowimpactworkouts #hiitforbeginners",
  "channelTitle": "yes2next",
  "channelDescription": "yes2next is all about fitness and joy at any age, including seniors over 50. Say yes to your next adventures and reaching your full potential. I’m April, a personal trainer with senior fitness and functional training specialist certifications from the American Council on Exercise and The Biomechanics Method for Corrective Exercise. My 83-year-old mom and I are excited to share our passion for healthy living with our exercise videos for beginners and seniors, lifestyle tips, and fun. \n\nStay connected with us by subscribing and following us on:\n⭐️ Facebook: https://facebook.com/yes2next\n⭐️ Instagram: https://instagram.com/yes2next\n⭐️ Twitter: https://twitter.com/yes2next\n⭐️ Pinterest: https://pinterest.com/yes2next\n⭐️ Tiktok: https://tiktok.com/@yes2next\n\n👉 To keep in touch by email,  sign up at https://yes2next.com\n👉 Find yes2next gear at our store: https://yes2next.com/shop\n\n❤️ To donate, visit our Paypal page: https://bit.ly/y2ndonate Thank you!\n\nSee you soon! 🏃‍♀️🏋️‍♀️ 😊\n",
  "tags": [
    "beginner workout",
    "senior workout",
    "at home workout",
    "exercise routines",
    "chair workout",
    "senior chair exercises",
    "chair exercises for seniors",
    "exercises for seniors",
    "senior workouts",
    "5 minute HIIT Workout No Jumping",
    "beginner low impact exercises",
    "beginner low impact",
    "beginner low impact workout",
    "beginner low impact workout at home",
    "easy beginner low impact",
    "easy beginner low impact workout"
  ],
  "publishedAt": "2022-11-29T14:00:03Z",
  "duration": 353,
  "durationFormatted": "5:53",
  "viewCount": 45836,
  "likeCount": 1212,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/6NtCDYHp8eQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/6NtCDYHp8eQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/6NtCDYHp8eQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/6NtCDYHp8eQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/6NtCDYHp8eQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/6NtCDYHp8eQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I do like the short workouts as some days that is all I can do. But at least I&#39;m moving and keeping it going. Thank you ladies.",
    "Thank you both for these workouts.  I&#39;m a pre-diabetic &amp; carrying around 30-40 extra pounds.  I&#39;ve changed by eating habits an picked up indoor walking along to your videos.  In 7 weeks, I&#39;ve lost 15lb.  As someone who has never maintained an exercise routine in 56 years, I can honestly say, your workouts are just what I need.  I&#39;m able to challenge myself without injury and that&#39;s a big plus.",
    "I would like to thank you for your great workouts. I am retired and have lived a very inactive life. Your exercises allow me to be more active and to slowly build up a programme. I also love your cheerful and happy presentation.  Thank you so much❤",
    "Love your videos! Makes working in exercise time so easy. And your Mom is so adorable and funny.",
    "I&#39;m so blessed to have come across your exercise workouts, I&#39;m 78 years old with some knee and back issues but ever since I started doing your different work outs three months ago I have been feeling better and less stiff.  Your mom gives me inspiration, she has a great sense of humor. And love your kitty Mochi he is and  a beautiful kitty and playful as well. Also love the music background for the exercises. Thank you so much 😀💃👏👏❤"
  ],
  "channelSubscriberCount": 456000,
  "channelVideoCount": 322
}