{
  "video_id": "6p_yaNFSYao",
  "title": "Mindfulness Meditation - Guided 10 Minutes",
  "description": "Mindfulness has been shown to be very beneficial. (details below) Join our community/see our products: https://www.thehonestguys.co.uk/products\n\nIn this guided mindfulness meditation you can learn to be completely present in the moment, letting go of your thoughts and achieving calmness.\n\nThis MP3 audio available here:  https://www.thehonestguys.co.uk/digital-downloads/mindfulness-meditation-guided-10-minutes\n \n___________________________________\n\nTHE HONEST GUYS\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, meditation and sleep, without ever having to try.  In particular, we cater to anyone who is turned-off by the idea of \"meditation\", but still want to reap the massive health benefits, that meditation can bring. We offer this through high-quality audio productions, called 'guided visualisations'. These include sleep talk-downs, meditations, wonderful fantasy imagery and stories. \n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nIf you enjoy our work and would like to support the channel, please consider purchasing one of our high-quality products: https://www.thehonestguys.co.uk/products\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n____________________________________\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n\n\n\n#mindfulnessmeditation #mindfulness #instantrelaxation #guidedvisualisation #guidedmeditation #thehonestguys \n\n\n104",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "mindfulness meditation",
    "mindful guided",
    "meditation",
    "guided mindfulness meditation",
    "mindfullness",
    "relaxing",
    "relaxation music",
    "calm music",
    "relaxation",
    "guided relaxation",
    "self improvement",
    "insomnia cure",
    "peaceful",
    "tranquil",
    "male voice",
    "Yoga",
    "Mindfulness",
    "Sunset"
  ],
  "publishedAt": "2015-03-24T17:00:00Z",
  "duration": 588,
  "durationFormatted": "9:48",
  "viewCount": 14801267,
  "likeCount": 119515,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/6p_yaNFSYao/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/6p_yaNFSYao/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/6p_yaNFSYao/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/6p_yaNFSYao/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/6p_yaNFSYao/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/6p_yaNFSYao\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you so much... I&#39;m a 17 year old guy that goes to a school full of caring people but I still cannot help but feel judged all the time... I&#39;ve been really suffering and my mind has been on full throttle for too long, I always feel like everything is too much for me. I use youtube as a remedy. I watch my favorite youtubers and they make me laugh and smile more than I do with my friends in real life. No matter who i&#39;m with, i feel so... different, I feel so boring and it has destroyed my confidence in any thing I do. My family can&#39;t afford to get me a therapist or anything of the sort. These videos, though i just found them today, have helped me so much already. Thank you from the bottom, sides, middle, and top of my heart.",
    "the balloons are a really good method to distance yourself from your thoughts. I found it really helpful!",
    "I started reading the comments (which is usually a mistake on youtube videos) and just wanted to point out what lovely humans the people who have commented are :)",
    "“ they don’t control you, you have control over them” that’s the source of my hope",
    "These videos are helping me over come my addiction to alcohol. Any time I get a craving I listen to one of these and by the time it&#39;s over the craving is gone and I am calm and relaxed. This is so helpful! Thank you!"
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}