{
  "video_id": "6ScNxo7fhcg",
  "title": "QUICK 10 MINUTE SPIN CLASS: TABATA HIIT | INDOOR CYCLING WORKOUT",
  "description": "UNLOCK THE BEST YOUTUBE SPIN CLASSES: www.youtube.com/kirstenallen/join \n\nThis 10 minute spin class is a high intensity Tabata HIIT ! Make the seconds count with this quick cycling class!\n\nWORKOUT OUTFIT OF THE DAY: https://creatoriq.cc/3RSCAeB \n*As part of the lululemon creator network, I earn a commission on all purchases made.\n\nWorkout:\nWarm-Up: 2 minutes\nTabata: 12 x 20s Standing Sprint/10s Easy\nCool-Down: 2 minutes \n-----\nCONNECT ON INSTAGRAM: @dietitianillustrated https://www.instagram.com/dietitianillustrated/\n------\nBIG thank you to everyone who chooses to support this channel through my Lululemon affiliate link and Meal Plan purchases! You are all AMAZING!\n\n* PURCHASE YOUR OWN BODY COMPOSITION & WEIGHT LOSS MEAL PLAN ($20 CAD): https://dietitianillustrated.com/nutritionservices/meal-plans/\n------\nDOWNLOAD YOUR FREE 8-WEEK SPIN PROGRAM FOR BEGINNERS HERE: \nhttps://dietitianillustrated.com/kirsten-allen-8-week-spin-program-2/\n*All thumbnails in this document are clickable links!\n\nThis program is intended to guide you through my ever-growing library of spin classes so that you can gradually build your strength, speed, and endurance on the bike! \n\nStarting with two indoor cycling workouts weekly, and progressing to three by the end of the eight weeks, this program will give you the stamina and confidence to tackle the more advanced and longer duration classes you never thought possible! \n------ \nOther Helpful Videos: \nSPIN BIKE BUYER'S GUIDE: https://youtu.be/gb-kMUtQu0I\nPROPER SPIN BIKE SET UP: https://youtu.be/EQuzN-2wmyE\n------\nAre you a YouTube Creator looking for royalty-free music? Click here:\nhttps://www.epidemicsound.com/referral/j2y3n0/\n* This is a referral link *\n------\nDISCLAIMER:\nKirsten Allen and Dietitian Illustrated strongly recommend that you consult with your physician before beginning any exercise program. You should be in good physical condition and be able to participate in the exercise.\n\nYou should understand that when participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Kirsten Allen and Dietitian Illustrated from any and all claims or causes of action, known or unknown, arising out of Kirsten Allen's and Dietitian Illustrated's negligence. \n\nHappy Sweating!\nKirsten Allen",
  "channelTitle": "Kirsten Allen",
  "channelDescription": "Cardio • Fitness • Nutrition • Meditation • Stretches\n\nAbout Me:\nMy name is Kirsten, I'm a Registered Dietitian, Professional Home Economist, Music Producer, Spin Instructor, & Lifelong Runner with a Bachelors degree in Kinesiology. Health and fitness is my profession & passion! I create All Things Digital Wellness to uplift, motivate, and inspire!\n\nColossians 3:23\n",
  "tags": [
    "spin class",
    "indoor cycling workout",
    "beginners spin class",
    "spin class for beginners",
    "indoor cycling",
    "cardio workout",
    "HIIT workout",
    "home workout",
    "cycling",
    "bike workout",
    "spinning",
    "stationary bike workout",
    "exercise bike workout",
    "spin workout",
    "home cardio",
    "10 min spin class",
    "10 minute spin class",
    "10 minute cycling workout",
    "10 minute bike workout",
    "spin class 10 minutes",
    "10 minute HIIT workout",
    "10 minute spin workout",
    "10 minute stationary bike",
    "rhythm spin",
    "rhythm cycling"
  ],
  "publishedAt": "2020-08-22T23:02:32Z",
  "duration": 615,
  "durationFormatted": "10:15",
  "viewCount": 259880,
  "likeCount": 4599,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/6ScNxo7fhcg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/6ScNxo7fhcg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/6ScNxo7fhcg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/6ScNxo7fhcg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/6ScNxo7fhcg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/6ScNxo7fhcg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "NEW! Fully Seated Version: <a href=\"https://www.youtube.com/watch?v=VOLZJOfE_rQ\">https://youtu.be/VOLZJOfE_rQ?si=okN4we6tt905ACUx</a>",
    "The  first 10 minutes  of the beginning of my change 🥰 wish me luck 30 days challenge 🤯🤯🤯🤯🤯",
    "We tackled assembling the bike as a family project. <a href=\"https://www.youtube.com/post/Ugkxzg0clhbtRf2gGxPkVETFKJJKGqdsorQu\">https://www.youtube.com/post/Ugkxzg0clhbtRf2gGxPkVETFKJJKGqdsorQu</a>  The package is heavy, but I have 2 teen boys that were able to move it. The written instructions were great- we didn&#39;t need to watch the videos, but it was good knowing that the option was there if we needed it. After we were able to get it set up, the boys each rode 3 miles and I rode 8 and the bike stayed quiet. The display is easy to reset, and you can put it on whichever setting you are using (time, distance, calories, etc). I will say that my butt is a little sore from the seat, but that could be because I haven&#39;t rode in a while. While it is comfortable for me, it was not comfortable with the seat position for my friend (could not move the seat back far enough and he slightly looked like a kid riding a tricycle that he had outgrown). He also said that the seat hurt his manly parts. We are going to look for a different seat that will be compatible with this bike for him.I did purchase the Wahoo Cadence sensor and strapped it to the crank of one of the pedals. This will sync with my Apple Watch, iPhone and will import data in to my Health app. Wahoo does have other sensors available other than cadence. I can also keep either my phone or my iPad on the display and they both feel pretty secure.",
    "This is a great 10 minute workout, I am 72 years old and recently got a Keiser bike at home and this is a welcome break from my office work 1 of 2 time a day, thanks for this video!",
    "This is officially going to be my new warmup routine before all my lifts. Great way to get the blood pumping! I did this followed by tabata resistance training this morning and it was a perfect pairing."
  ],
  "channelSubscriberCount": 42600,
  "channelVideoCount": 1185
}