{
  "video_id": "75pA0MaLvy0",
  "title": "Full Body Stretching Exercises - Stretching For Beginners!",
  "description": "This 15 Minute Full Body Stretching Exercises is perfect for beginners or anyone wanting a great full body stretching workout! This stretching for beginners workout focuses on breathing, flexibility exercises and movement to help with joint mobility, posture and more. Created by a physical therapist, this stretching workout is gentle enough to do every day!\n\n⭐️ Join my online UNLIMITED community and membership with hundreds of home workouts, recipes, workout plans, women's health information, beginner programs, podcasts and more to support you in your body!  ➡️ http://www.jessicavalant.com/unlimited\n\n🎧 Find my podcast Meet Your Body anywhere you listen to podcasts! Or listen here http://www.jessicavalant.com/podcast\n\n💜 A week of free workouts and resources to your inbox: http://bit.ly/2EMBhsJ\n\n💥 Find the Jessica Valant app here!\nApple IOS - https://tinyurl.com/mry5ya8r\nGoogle - https://tinyurl.com/yh3ty5fp\n\n🎧 Podcast - https://meetyourbody.buzzsprout.com\n💪🏽 Four Week Beginner Workout Program: https://payhip.com/b/d3ARC\n🎥 Subscribe to my YouTube channel: http://bit.ly/2E3rNbs\n🙌🏻 Instagram: https://www.instagram.com/jessicasvalant\n🤸‍♀️ Shop my favorites and discount codes: https://jessicavalant.com/favorites-2\n\n⭐️ Join my UNLIMITED program to feel strong, safe and secure in your body in all seasons of life! Get immediate access to over 400 home workout videos, monthly workout plans, women's health info, free app, recipe library, perimenopausal and postmenopausal support and the most supportive online community available! Join here 👉🏼 http://www.jessicavalant.com/unlimited.\n\n\n🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀\nJessica Valant and Jessica Valant Pilates, LLC, recommend you consult with a physician before starting any new exercise program. The information given here is not meant to treat or diagnose any medical condition. Please stop if you feel any pain or dizziness. You understand that physical activity can pose a risk and by watching this channel and these videos you assume all risk and release Jessica Valant and Jessica Valant Pilates, LLC, from all liability.",
  "channelTitle": "Jessica Valant",
  "channelDescription": "I’m Jessica, a licensed physical therapist, Pilates teacher and women's health expert with over 25 years of experience. I believe movement should be empowering, encouraging and fun! On my channel you’ll find workouts for everyone, regardless of skill level or experience. I also talk through various injuries and conditions, including my own experience with women’s health issues such as prolapse and hysterectomy. I want you to remember you are strong, you are powerful and you deserve to move your body and feel good while you do it. \n\nYou can find more of my tips and full length workout programs at http://www.jessicavalant.com.\n\n You can also find me and behind the scenes action on Instagram @jessicasvalant.\n\n🙌🏽 Do you like our free content? Consider donating to Jessica Valant Pilates to help support all our free resources: https://tinyurl.com/mvt56pfv\n",
  "tags": [
    "flexibility exercises",
    "flexibility workout",
    "full body stretching exercises",
    "full body stretch",
    "full body pilates workout",
    "15 minute pilates workout",
    "blogilates",
    "Sydney cummings",
    "stretching for flexibility",
    "stretching for beginners",
    "stretching for back pain relief",
    "beginner stretching exercises",
    "beginner stretches",
    "beginner stretches for flexibility"
  ],
  "publishedAt": "2022-07-18T11:30:02Z",
  "duration": 917,
  "durationFormatted": "15:17",
  "viewCount": 1499953,
  "likeCount": 29362,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/75pA0MaLvy0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/75pA0MaLvy0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/75pA0MaLvy0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/75pA0MaLvy0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/75pA0MaLvy0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/75pA0MaLvy0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "💪🏽 Want my full length workouts, daily routines, women&#39;s health info and more? Get a full home workout library, monthly fitness plans, recipes, free app and more  <a href=\"http://www.jessicavalant.com/unlimited\">http://www.jessicavalant.com/unlimited</a>",
    "my body and mind has been through a lot... i cried once i finished this. i am so proud of myself for being able to do this and showing up for myself. thankyou for the gentle movements and words, i really appreciate this video",
    "Thank you. I’m trying to get my flexibility back for 2024! This was perfect to get going in the right direction! 🎉",
    "I love that this routine is frustration free, I’m a somewhat retired ballerina and I really get frustrated with routines where I feel like I’m not capable of gaining my flexibility back, you make it really inviting and caring thank you than you ❣️",
    "Promise to be regular here from now onwards. I turned 34 today. I was used to do yoga 10 years ago left in chaos of life. But now I will put my health first no matter what. <br>Wish me luck. ❤"
  ],
  "channelSubscriberCount": 914000,
  "channelVideoCount": 510
}