{
  "video_id": "7_Gmj7awnWY",
  "title": "15-minute POST-WORKOUT STRETCH for Injury Prevention & Flexibility",
  "description": "Let's RELAX! After a tough workout, you deserve a refreshing post-workout stretch. Join me for 15 minutes as we work through several full-body stretches to increase your flexibility and decompress. Our stretch session will help to relieve tight muscles in your back, hips, upper body, and legs, and WOW it feels awesome to release those tight muscles! Stretching is a great way to prevent injuries and relieve low back aches so be sure to add this stretch often to your training regimen. \n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.\n\n#stretching  #postworkout  #flexibility",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2023-06-23T10:24:35Z",
  "duration": 932,
  "durationFormatted": "15:32",
  "viewCount": 3311885,
  "likeCount": 77980,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/7_Gmj7awnWY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/7_Gmj7awnWY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/7_Gmj7awnWY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/7_Gmj7awnWY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/7_Gmj7awnWY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/7_Gmj7awnWY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "i&#39;m a 55 year old male and post a heavy shoulders and triceps workout i tried these stretches for the first time, 10 minutes after doing this i started to tremble all over and had to lay down for 30 minutes. when i got off my bed i felt great and 3 weeks later am noticing that both my flexibility and breathing are improving. thank you for helping to improve my life",
    "I just looove your pug lying in the background on his own couch, with a picture and even a cushion of him &lt;333 :D made my day! &lt;3",
    "I loved how the pug was sleeping in the back!!! My pug came up next to me and started snoozing too. This stretch felt sooooo good. Thank you!!!!❤❤❤❤",
    "So glad you added the longer stretch at the end! So important. Thank you.",
    "I have found my new trainer!  I am 52 year old, menopausal woman.  I want to build muscle with heavy weights but in safe non-impact way.  Kaleigh, your workouts are fantastic!  Thank you💪😀"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}