{
  "video_id": "7Ep5mKuRmAA",
  "title": "Belly breathing exercise: Calming the body and mind",
  "description": "Living with a chronic disease can often result in extra stress and anxiety, especially for children. In partnership with Riley Children’s Foundation and Riley Hospital for Children, Indiana University School of Medicine clinicians and researchers are pleased to present a video resource to support patients coping with stress. By following the steps presented in the video, viewers will learn how to complete a belly breathing exercise that can be done anywhere at any time. Belly breathing is a great way to calm the body and mind.",
  "channelTitle": "Indiana University School of Medicine",
  "channelDescription": "Indiana University School of Medicine is committed to preparing healers and transforming health.",
  "tags": [],
  "publishedAt": "2023-01-31T20:50:13Z",
  "duration": 525,
  "durationFormatted": "8:45",
  "viewCount": 977165,
  "likeCount": 9336,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/7Ep5mKuRmAA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/7Ep5mKuRmAA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/7Ep5mKuRmAA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/7Ep5mKuRmAA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/7Ep5mKuRmAA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/7Ep5mKuRmAA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Honestly, I am very happy this video doesn&#39;t have ads.",
    "Thank u for including that adorable little face, it may sound funny but there was additional comfort from that. 😌",
    "I was stressed, I could feel muscles in my face twitching. <br>This slow paced video made me want to do something else but I persevered because that was exactly what I needed, I had to slow down, be quiet for 10 minutes and just breathe. It&#39;s so simple, yet during the day I didn&#39;t realize I was just losing it. <br>I&#39;m still not 100% but I&#39;m for sure better than I was before the video, thank you for this!",
    "I honestly wanna cry with how well this helped, it’s currently 3 am and I was randomly having a sudden burst of anxiety and having an attack. Some push-ups did help a bit but this helped way more",
    "I posted a comment on here a few months ago, but then I wussed out and deleted it, so I&#39;ll say it again.  As an alcoholic, this video is incredible for reducing the anxiety that I feel.  I just finished rehab (not cured, but doing better),  and I showed this to my roommate during those first, terrifying, agonizing 48 hours.  It calmed them down until they could have more medicine.  I love how there is no annoying, overly-sweet voice in this video.  Just a calm, normal-sounding voice."
  ],
  "channelSubscriberCount": 6050,
  "channelVideoCount": 615
}