{
  "video_id": "7GFgFl1_eiw",
  "title": "Do THIS to Burn MORE Belly Fat on an Elliptical",
  "description": "Elliptical belly fat reduction is a sought-after goal for many fitness enthusiasts. Ellipticals, often referred to as cross trainers, are versatile machines that offer a dynamic workout for individuals at various fitness levels. \n\nEngaging in a specialized elliptical workout can target those stubborn fat areas, especially around the abdomen. The beauty of using a cross trainer lies in its ability to provide a low-impact, full-body exercise that can be adjusted to meet individual needs. \n\nBut just how can one maximize calorie burn and target belly fat more efficiently on this equipment? This video provides insight without diving deep into the nitty-gritty of the science. \n\nWhether you're a seasoned gym-goer or someone just starting their fitness journey, our guide will offer valuable tips to help you make the most of your elliptical sessions. Dive in and discover the secrets to melting that belly fat away!\n---------------------------\nRecommended equipment - https://fitnessdy.com/equipment/\n---------------------------------------------------------------------------------------------------------------------------\n\nPro tip: Book a personalized consultation with the engine behind Fitnessdy, certified Cardio and Fitness Trainer, Ioana. We can do talk through email, build a personalized workout plan, and more. https://ioanacozma.setmore.com/\n\n---------------------------------------------------------------------------------------------------------------------------\n\nResources\n\n\nhttps://pubmed.ncbi.nlm.nih.gov/29127602/ - the meta-analysis on the effect of high-intensity interval training on total, abdominal, and visceral fat mass \n\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4504736/ - a 1% incline may increase your caloric burn by 12%\n\n\nhttps://www.mdapp.co/elliptical-calorie-calculator-488/ - to burn 500 calories on the elliptical at low intensity, you would need 85.5 minutes\n\n\n----------------------------------------\nTimestamps\nIntro 00:00\n1. Do HIIT 00:31\n2. Increase the incline 01:45\n3. Vary your workouts 02:39\n4. Add weights 03:22\n5. Engage your abs 04:17\n6. Ramp up the speed 05:00\n7. Spend more time on it 06:07\nWhat do you think? 06:52",
  "channelTitle": "Fitnessdy",
  "channelDescription": "Welcome to our fitness channel!\n\nOur goal is to help you reach your fitness goals, whether you're just starting out or you've been working out for years. We'll provide tips and advice on everything from weight loss to strength training, and we'll also offer workout routines that you can do at home with no equipment required. So whatever your fitness level, we hope to help you achieve the results you're looking for. \n\n\nThis channel is run by:\n\n* Victor: Fitness enthusiast, the brain behind YouTube algorithms and video editor supremus\n\n*Ioana: Licensed cardio & fitness trainer, devourer of chocolate,  and Fitnessdy geeking outer\n\nWelcome aboard! \n\nPro tip: Book a personalized consultation with the engine behind Fitnessdy, certified Cardio and Fitness Trainer, Ioana. We can do a 1-on-1 video call, talk through email, or build a personalized workout plan. https://ioanacozma.setmore.com/\n\n\n",
  "tags": [
    "elliptical",
    "elliptical workout",
    "elliptical trainer",
    "elliptical machine",
    "elliptical results",
    "elliptical transformation",
    "elliptical results before and after",
    "elliptical belly fat",
    "belly fat",
    "how to lose belly fat",
    "elliptical workouts to lose belly fat",
    "burn belly fat",
    "cross trainer belly fat",
    "cross trainer",
    "fat loss",
    "lose belly fat",
    "burn belly fat on elliptical",
    "belly fat loss",
    "how to burn belly fat",
    "how to get rid of belly fat",
    "how to lose belly fat fast",
    "belly fat workout"
  ],
  "publishedAt": "2023-10-06T15:00:06Z",
  "duration": 425,
  "durationFormatted": "7:05",
  "viewCount": 72989,
  "likeCount": 875,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/7GFgFl1_eiw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/7GFgFl1_eiw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/7GFgFl1_eiw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/7GFgFl1_eiw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/7GFgFl1_eiw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/7GFgFl1_eiw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I have done the HIIT with great success. This is an excellent, no non-sense video. I am a 70-year-old male, recovering from a shoulder injury. The elliptical trainer along with the saltwater pool at my gym has been a God send.",
    "I know it gets a bad rap, but I’m always on the elliptical. It’s great cardio that is very forgiving on the joints. I burn 525-620 calories in 45 minutes to an hour on interval intensity mode. It surely tones my hammies, my bum and it burns man boobs flat and beautiful. 3-5 hours, 4 days a week. Honestly, I’ve found the most important aspect of working out is getting at least 7 hours of good sleep. Now that I’m on the wrong side of 30, I am absolutely not even close to 100% if I’m sleep-deprived when working out on consecutive days. If you want to maximize your performance and return, sleep recovery is most essential.",
    "I love the elliptical machine workout. It gives whole body workout. Can burn double the calories. But in this gym is not soooo nice. It&#39;s very shaky.",
    "Oh my goodness you answered all my questions thanks 😊 I did like &amp; subscribed ❤",
    "but if i&#39;m burning on the elliptical 450 cals for 32 min with with a heart between 80-90% and avg heart rate of 82%, with 5 sets of intervals 7 days a week , i&#39;d say i&#39;m pretty good as it is?"
  ],
  "channelSubscriberCount": 91200,
  "channelVideoCount": 270
}