{
  "video_id": "7GkMHPe_OXw",
  "title": "20 Min FULL BODY Workout For BEGINNERS (No Equipment)",
  "description": "A total body workout you can do at home with zero equipment specifically for beginners! Work all the major muscles of your upper body, lower body and core with this fat-burning, follow-along workout. Beginner exercises at beginner intervals with advanced options also demonstrated.\n\n============================\nLINK TO JARED’S THICK WORKOUT MAT:  https://urlgeni.us/amzn/drjaredexercisemat\n============================\n\nFact #1: Workouts don’t have to be very long to be effective. \nFact #2: They also don’t require gym memberships or lots of home equipment.\n\nIn fact with just your body weight, a few simple exercises, and about 20 minutes a day, you can get in a great total body workout!\n\nIf getting in shape, losing weight, or becoming stronger is one of your goals, this awesome workout will help to get you there.\n\nIt’s only 20 minutes long; we’ll be using 30-second intervals for all the exercises with a few strategic rest breaks interspersed as well.\n\nI’ll do each exercise right along with you and call out some simple cues so you know you’re doing them correctly.\n\nFinally I’ll also demonstrate some more-advanced variations on each of the exercises so you can decide how hard you want to push on each one.\n\nIf you do enjoy the workout, I’d love to hear about it! Leave me a COMMENT and a THUMBS UP and let me know how else I can help you in the future.\n\n\n⭐️ 0THER GREAT WORKOUT VIDEOS YOU MIGHT ENJOY:\n✅ 10 MIN BEGINNER CORE WORKOUT: https://youtu.be/b_TTLmmQmXU\n✅ CARDIO STRENGTH WORKOUT: https://youtu.be/O5mHSiQRUnw\n✅ LOW-INTENSITY CARDIO WORKOUT: https://youtu.be/n2FYfqLCvSc",
  "channelTitle": "Tone and Tighten",
  "channelDescription": "Hi - I'm Jared! I am a doctor of physical therapy who specializes in rehabilitating orthopedic (back, neck, shoulder, knee, etc) and postpartum (diastasis recti) conditions. I love being fit, healthy, strong, and active, and hope to help you accomplish your fitness goals. On this channel you'll learn best treatments for common injuries through exercising and stretching, and how to become a fitter, healthier version of yourself. Please consider subscribing!\n\nDISCLAIMER: The content on this channel is NOT medical advice and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Use of this content is at your sole risk.\n",
  "tags": [
    "beginner workout",
    "beginner workout at home",
    "beginner workout for women",
    "beginner workout for men",
    "beginner workout routine",
    "total body workout",
    "total body workout at home",
    "workout for beginners",
    "workout for weight loss",
    "beginner workout no equipment",
    "no equipment workout",
    "no equipment beginner workout",
    "jared beckstrand",
    "tone and tighten",
    "home workout"
  ],
  "publishedAt": "2022-01-06T07:00:01Z",
  "duration": 1309,
  "durationFormatted": "21:49",
  "viewCount": 483412,
  "likeCount": 10256,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/7GkMHPe_OXw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/7GkMHPe_OXw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/7GkMHPe_OXw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/7GkMHPe_OXw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/7GkMHPe_OXw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/7GkMHPe_OXw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks so much for joining me on this one! Did you enjoy the workout? Would you like to see more of these videos from Tone and Tighten? Leave me your thoughts in a comment below! If you&#39;re interested in more home workouts like this one, check out this playlist: <a href=\"https://www.youtube.com/playlist?list=PLT4Yite3Tx5kW0J_iNJX40iIwi4ljkfXt\">https://youtube.com/playlist?list=PLT4Yite3Tx5kW0J_iNJX40iIwi4ljkfXt</a> Thanks again for watching! 🙏🏼🙏🏼🙏🏼",
    "One of your best workouts.  When I started working out, I couldn&#39;t even do all the exercises.  4 months later, I use it for a warmup before running.  My 50+ year body is transforming.  Muscles are toned.  I think I am now lighter than when I finished college in 1994.  Thank you so much!",
    "Man Ive hit a rough patch in my life, I&#39;ve been looking for a way out of my mental prison of negative thoughts, unfortunate personal circumstances and was just looking for hope without complicating things AND I FOUND YOUR VIDEO! Day 1 only but I KNOW I WILL CONTINUE!!!!!!! Thanks million for the encouragement! Kindly",
    "Hey. Been doing this for around 7 weeks now and wow, its really transitioned me from being a mid 20s sloth who could not dream of working out, to doing this 3 times a week and found a new passion. I keep trying to improve each day and feel amazing. Genuinely thank you and to anyone who is starting, DON&#39;T GIVE UP. Do this at least 2 times a week if you can and remember to let your body recover and things will work out. You got this and make sure to do at your own pace. Honestly thank you so much!",
    "Exercise strengthens your heart and improves your circulation. The increased blood flow raises the oxygen levels in your body. This helps lower your risk of heart diseases such as high cholesterol, coronary artery disease, and heart attack."
  ],
  "channelSubscriberCount": 2750000,
  "channelVideoCount": 641
}