{
  "video_id": "7Ps6w1TpI0U",
  "title": "30 MIN PILATES | At-Home Full Body Workout (No Equipment)",
  "description": "I hope you enjoy this 30-Minute Full Body Pilates Workout, designed to tone and sculpt the entire body. This at-home and no-equipment workout is perfect for our current situation of needing to stay at home. Hope you are well and staying safe. xx\n\n🌸 Wearing Dharma Bums Active \n10% Discount Code: DBN20\n\n\n♡ INSTAGRAM: @movewithnicole\n♡ EMAIL: movewithnicole.yt@gmail.com\n\n\n\n\n♫ Music:\nAurora by Nomyn https://soundcloud.com/nomyn Creative Commons — Attribution 3.0 Unported — CC BY 3.0\n\nHope by ROFEU https://youtu.be/ffo924Cap68\n\nWhere Are We Going by Tokyo Music Walker https://soundcloud.com/user-356546060 Creative Commons — Attribution 3.0 Unported — CC BY 3.0\n\nOyasumi by Smith The Mister https://smiththemister.bandcamp.com\n\nUnderground Stars by Loxbeats https://spoti.fi/34tPBBO Creative Commons — Attribution 3.0 Unported — CC BY 3.0\n\n\n\n\n\n\n\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you are performing them at your own risk. Nicole Kastoun will not be responsible or liable for any injury or harm you sustain as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 30 minutes full body",
    "pilates workout 30 minutes",
    "30 minutes pilates workout",
    "30 minute pilates",
    "pilates class",
    "nicole kastoun",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "30 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout"
  ],
  "publishedAt": "2020-04-02T11:52:35Z",
  "duration": 1749,
  "durationFormatted": "29:09",
  "viewCount": 1450036,
  "likeCount": 40892,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/7Ps6w1TpI0U/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/7Ps6w1TpI0U/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/7Ps6w1TpI0U/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/7Ps6w1TpI0U/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/7Ps6w1TpI0U/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/7Ps6w1TpI0U\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Love this part when you say &quot;hope your body feels nice and warm and ready for the workout&quot; and I just like what?the workout hasn&#39;t started yet????!!!!!! ahahaa)))))",
    "Your 30-40 minute pilates sessions have become an integral part of my morning routine and an important part of my physical and mental health. Really enjoy starting my day in this wonderful way. Thank you for doing this.",
    "I am LOVING your Pilates classes. I am 50 years old and yes, I like my body to look good. But more importantly , I want to remain STRONG! I want to ward off osteoporosis! I want to maintain a healthy pelvic floor. When I roll out my mat and start your lessons… I feel like a strong powerful woman! Some of the moves take me back to my younger years when I was taking ballet… which I loved and miss. I love the flow of breath as we move through the posses. You are amazing… and Pilates will forever be the way I take care of myself. 🙏 😊",
    "Hope you enjoy this 30 Minute Pilates Workout! 😊 Try it out and let me know how you go! xx",
    "Dear Nicole, I just wanna thank you for all of these free videos. The impact they are making is huge. It&#39;s been only a few months since I found you, but I can&#39;t imagine starting my day without your 30 minute workouts. ❤❤❤"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}