{
  "video_id": "8TDcGYmEgyM",
  "title": "GUIDED SLEEP MEDITATION TALKDOWN - Insomnia - Relaxation",
  "description": "Drift off to sleep with this blissfully calm talk-down. (details below) Join our community/see our products: https://www.thehonestguys.co.uk/products\n\nFeatures very high quality ocean wave sounds - you can almost taste the sea air!\n\nMP3 audio available here: https://www.thehonestguys.co.uk/digital-downloads/guided-sleep-insomnia-relaxation1\n\n___________________________________\n\nTHE HONEST GUYS\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, meditation and sleep, without ever having to try.  In particular, we cater to anyone who is turned-off by the idea of \"meditation\", but still want to reap the massive health benefits, that meditation can bring. We offer this through high-quality audio productions, called 'guided visualisations'. These include sleep talk-downs, meditations, wonderful fantasy imagery and stories. \n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nIf you enjoy our work and would like to support the channel, please consider purchasing one of our high-quality products: https://www.thehonestguys.co.uk/products\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n____________________________________\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n\n\n\n\n#sleeptalkdown #fallasleepfast #listenbeforesleep  #guidedsleepmeditation #guidedmeditation #thehonestguys \n\n012",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "guided",
    "sleep",
    "talk",
    "down",
    "meditation",
    "wave",
    "sounds",
    "ocean",
    "insomnia",
    "relaxation",
    "music",
    "calming",
    "relaxing",
    "guided meditation",
    "ocean wave sounds",
    "relaxing music",
    "sleep sounds",
    "relaxation music",
    "sleep meditation",
    "guided sleep"
  ],
  "publishedAt": "2012-08-13T19:01:46Z",
  "duration": 1772,
  "durationFormatted": "29:32",
  "viewCount": 13225023,
  "likeCount": 48096,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/8TDcGYmEgyM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/8TDcGYmEgyM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/8TDcGYmEgyM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/8TDcGYmEgyM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/8TDcGYmEgyM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/8TDcGYmEgyM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks for all the great comments. The MP3 track is now a available here: <a href=\"https://www.thehonestguys.co.uk/digital-downloads/guided-sleep-insomnia-relaxation1\">https://www.thehonestguys.co.uk/digital-downloads/guided-sleep-insomnia-relaxation1</a>",
    "It has been 6 years and counting since I found this video and it is still BY FAR the most effective sleep aid I’ve tried. So much gratitude for the creators. (Stop scrolling, get comfy, and start the video over! Let it take you away.)",
    "I have anxiety and get racing thoughts at night badly. I have never found a relaxing video that worked for me. Till I tried this one. And amazing fell asleep like a baby. Woke up in the am and was so refreshed. Thank u so much!",
    "To the person who is reading this, I wish you a calm, successful, and healthy life forever 💕",
    "You are saving me from myself. I have suffered with sleeplessness and debilitating anxiety for my entire life. I wish I could hug you but I&#39;ll have to settle for thanking you. So....thank you."
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}