{
  "video_id": "8TuRYV71Rgo",
  "title": "10 Minute Yoga Stress and Anxiety",
  "description": "This is a gentle 10 minute yoga for stress and anxiety relief. The stretches in this yoga class are focusing on the hips to help release tension within the lower body. Focusing on the hips and lower back will help to let go of physical and emotional stress as we hold a lot of our stagnant emotion within our hips. The supine twist pose however will also get into the chest helping you to create the space needed for optimal oxygen intake helping to combat anxious feelings. Being super calm and restorative, this class can be done anytime of the day but i think it makes a great bedtime yoga routine.\n\n#Yoga #10MinuteYoga #Stress\n\n & support.\n\n________________________________________\n\nFAVORITE ACTIVE WEAR: \n\nLiquido Active - Get 15% off with code: BIRDLIQUIDO https://liquidoactive.com/collections/new?p=S1EZXrrM_\n\nYoga Wheel: https://mbsy.co/LCGmf\n\nVisit My Amazon Store For All My Yoga Must Haves!:\n\n\nMusic: https://www.epidemicsound.com/referral/qnrd89/\n\nJoin Honey to SAVE money while shopping online: https://www.joinhoney.com/ref/45p0vps\n\nIMPORTANT LINKS: https://linktr.ee/yogawithbird\n\nNOTE: Some links may be affiliate links that Yoga With Bird earns a small percentage of however each affiliate product is something she genuinely loves and has used herself.\n\n________________________________________\n\nYOGA CHALLENGES:\n\n30 Day Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlybJmrSb19MiVWnve5slKTJ\n\n30 Day Restorative Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwr-X3VF2CrZdf7rDrWH1aB\n\n7 Day Yoga For Overall Health: https://www.youtube.com/playlist?list=PLCIrre1vyDlyTB8gu7I99XQkw9M85YdTk\n\n5 Day Morning Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlyjr87XsR6j4QGzyKKxwsTH\n\n5 Day Hip Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwAnZvLflZM-e5WWedHTBpo\n\n________________________________________\n\nABOUT THIS YOUTUBE YOGA CHANNEL\n\nFrancine Cipollone also known as her childhood nickname Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation. She created this YouTube Yoga Channel to offer a space where yoga is accessible to all. This channel is all about feeling good and reconnecting to self. Yoga is for every-BODY, Join the journey by Subscribing today: https://www.youtube.com/yogawithbird\n\nJoin Yoga With Bird's Email List: https://mailchi.mp/34e952e0ed28/yoga-with-bird-email-list\n\n________________________________________\n\nDISCLAIMER: \nPlease consult with a physician before beginning any exercise program. \nBy participating in this activity you acknowledge that this exercise is a physical discipline that requires a certain amount of mental concentration and physical strength and endurance and that you must be in good health to participate. \nYou agree to work according to your own limitations and take full responsibility for your own safety and well-being. \nBy participating in this activity you agree to listen to your body at all times and never do anything that causes pain. \nYou acknowledge that participation in this activity exposes you to a possible risk of personal injury. \nYou are fully aware of this risk and hereby release Yoga With Bird aka Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "10 minute yoga",
    "10 min yoga",
    "10 minute yoga for stress and anxiety",
    "10 minute yoga for stress",
    "10 minute yoga for anxiety",
    "yoga for stress",
    "yoga for anxiety",
    "yoga for stress and anxiety",
    "yoga for anxiety relief",
    "yoga for stress relief",
    "bedtime yoga",
    "bedtime yoga for stress",
    "bedtime yoga for anxiety",
    "yoga",
    "yoga class",
    "yoga with bird"
  ],
  "publishedAt": "2021-07-29T14:37:38Z",
  "duration": 704,
  "durationFormatted": "11:44",
  "viewCount": 1882943,
  "likeCount": 46599,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/8TuRYV71Rgo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/8TuRYV71Rgo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/8TuRYV71Rgo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/8TuRYV71Rgo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/8TuRYV71Rgo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/8TuRYV71Rgo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Like my outfit? It’s Eco friendly 😍<br>Be sure to use code BIRDLIQUIDO for 15% off your cute fits at: <a href=\"https://liquidoactive.com/collections/new?p=S1EZXrrM_\">https://liquidoactive.com/collections/new?p=S1EZXrrM_</a>",
    "When you said “ show yourself some gratitude for showing up on the mat” I literally cried like I never gave myself credit for that. I was just doing it. Thank you very much",
    "I literally can’t believe it. I have my first uni exam in two days and I’ve been crying all day cause I’m anxious, this yoga helped me so much that I cried out of relief. Thank you!",
    "I have an operation tomorrow. Ive already had 2 panic attacks today, left 3 of my classes and left school early....my SEN mentor and mt mum suggested yoga....thank you for this.<br><br><br><br>Just came back to this post after the successful surgery, you helped me calm down so much! Thank you.",
    "I just completed 70 minutes of various yoga exercises. I am officially addicted oml. It is so calming and I love love love it"
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}