{
  "video_id": "8W_D2pPbYtI",
  "title": "30MIN full body pilates workout // no equipment",
  "description": "Hope you have fun doing this workout! \nLove u all\nLidi\n\n⇩MORE OF ME⇩\nTikTok | http://bit.ly/3jKm4Bo\nInstagram | http://bit.ly/3jLe4A4\nYoutube | http://bit.ly/3vvvCCP\nEmail | hi@lidiavmera.com",
  "channelTitle": "Lidia Mera",
  "channelDescription": "what a journey it is to understanding how to feel our best, so hey, lets do it together ♡ sharing my life as a 23 year-old living in London & my at-home workouts with you as a certified Pilates instructor (L3 pilates mat instructor) \nhope you stick around 🤍\nly all millions \n",
  "tags": [],
  "publishedAt": "2023-07-30T10:00:08Z",
  "duration": 1910,
  "durationFormatted": "31:50",
  "viewCount": 743782,
  "likeCount": 17434,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/8W_D2pPbYtI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/8W_D2pPbYtI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/8W_D2pPbYtI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/8W_D2pPbYtI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/8W_D2pPbYtI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/8W_D2pPbYtI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Been doing Pilates all days for 1 month on this channel. I&#39;m healing my ED and trying to adopt a healthy lifestyle, after feeling my body so week for so many years I&#39;m finally feeling happy and peaceful w/ these exercises. At first I wasn&#39;t sure if I was going to keep the routine because it was very difficult and I couldn&#39;t finish almost anything, but now it is very relaxing and my strength keeps improving so much.",
    "I am a competitive soccer player and when I tell you my abs are looking so amazing, I am not kidding! I love your workouts so much. Along with good eating habits, weights, training, and recovery. I can literally feel and see myself getting stronger every day. I am using your workouts to prepare my self for in person Pilates!!<br><br>To all the girls that are afraid of diversifying your workout schedule, don’t be afraid! You won’t get bulky doing weights! Once you incorporate Lidia’s workouts with different forms of exercise, you will definitely achieve your goals!",
    "i don’t often attempt lidia’s longer workouts but when i do, the time goes by so quickly that you don’t even realise you have finished. thank you lidia for this amazing workout. i was sweating afterwards but loved it nonetheless!",
    "I haven’t worked out for a good while, almost an year due to some health problems and also school🙃 but I want to share that after feeling powerless and unmotivated, I succeeded in doing one workout per day for seven days straight. I am so proud of myself for not giving up. I thank God for this opportunity and also thank you Lidia for introducing me again to the joyfulness of moving my body. Honestly time passed so fast, I didn’t feel like it’s exhausting or stressful. I really enjoy the breaks because it gives me a moment to breath. Before taking some time off from working out I used to watch videos where the fitness instructor was really idk excited, loud or stirred and I guess that didn’t work out for me because I was just feeling a kind of pressure, but in this light way of moving my body, I feel like I can do more because it is so peaceful.",
    "I’ve been doing your workouts daily for about 3 weeks now and I can definitely say there’s been incredible results!! I feel so much stronger and more energetic, my endurance has definitely improved, my stomach and thighs have shrank noticeably. Thank you so much I adore your videos keep doing what you’re doing 💪💪"
  ],
  "channelSubscriberCount": 1670000,
  "channelVideoCount": 286
}