{
  "video_id": "97-OBhNR-Es",
  "title": "Gentle Pilates Workout with Guided Breathing | At Home | No equipment | 20 Mins",
  "description": "Enjoy this 20 minute full body Pilates workout you can do at home, no equipment needed and no impact on the body. We focus on building strength and tone whilst the guided breathing fills the body with oxygen encouraging relaxation as well as enhancing the benefits of the exercises. It'll  leave you feeling both relaxed, de-stressed and ready for whatever you will be doing next in your day.\n\nPlease click the Like button, leave me a comment below and Subscribe to the channel to help me make more films just for you. \n\nStay safe, stay well and enjoy every moment of this day,\nTake care, Rachel  x\n#girlwiththepilatesmat #pilatesinstructor #pilatesworkout \n\nIf you enjoyed this video, feel free to buy me a coffee to show your support: \nhttps://ko-fi.com/thegirlwiththepilatesmat\n\nI am currently featured in the Stay in, Work out campaign with Sport England here:\nhttps://www.sportengland.org/jointhemovement#get_active_at_home\n\nIf you'd like to join my live online classes via Zoom, pop to my website for details;\nhttp://www.rachellawrencepilates.com\n\nWant to keep in touch? Come join me on my other social channels:\nhttps://facebook.com/RachelLawrencePilates\nhttp://www.instagram.com/thegirlwiththepilatesmat\nhttp://twitter.com/rachel_pilates\n\nThis video was filmed on the Blackmagic Pocket Cinema Camera - A compact sized movie camera\nhttps://www.blackmagicdesign.com/au/products/blackmagicpocketcinemacamera\n\nDisclaimer: It is recommended that you consult your Doctor or Healthcare Professional before starting any exercise programme. If you experience any pain or discomfort during this workout you should stop immediately and if necessary seek medical attention. When participating in any exercise or exercise programme, you agree that you do so at your own risk and assume all risk of injury to yourself. By using this video you understand and agree that Rachel Lawrence- The Girl with the Pilates Mat- will not be held responsible or liable for any injury or loss you may suffer as a result of undertaking the workout.",
  "channelTitle": "The Girl With The Pilates Mat",
  "channelDescription": "Welcome to My Channel!\n\nI'm Rachel, Certified Pilates Instructor with 25 years of Pilates practice and a background as a Professional Dancer. I'm passionate about ageing gracefully through Pilates and believe everyone deserves to feel good in mind and body, no matter their age or stage in life.\n\nOn this channel, you'll find Pilates and Dance-based fitness for all abilities and ages, from Beginners to Advanced Levels. Our focus is on nurturing a healthy mind, body, and spirit in a supportive, positive, and kind community.\n\nI also share health and wellbeing tips during livestream chats and classes, where my beloved rescue dog often makes an appearance! Originally from London, I now enjoy life in Brighton on the beautiful South Coast of England.\n\nSubscribe today and join our warm, welcoming community of wellbeing enthusiasts from around the world.\n\nMy book: The Little Book of Pilates is available now.\nTo Order UK: https://amzn.to/3WvZ074\nTo Order US/Worldwide: https://amzn.to/3XqD4LT\n",
  "tags": [
    "girl with the pilates mat",
    "gentle pilates for beginners",
    "gentle pilates 20 mins",
    "gentle pilates with guided breathing 20 mins",
    "pilates for everyone",
    "pilates instructor",
    "pilates 20 mins",
    "pilates gentle full body class",
    "20 minute pilates for everyone",
    "morning pilates",
    "pilates for stress",
    "pilates for anxiety",
    "gentle workout for beginners",
    "pilates for beginners",
    "exercise for women over 50",
    "exercise for midlife women",
    "exercise for menopause",
    "calm and gentle pilates",
    "calm pilates"
  ],
  "publishedAt": "2021-05-24T04:31:01Z",
  "duration": 1175,
  "durationFormatted": "19:35",
  "viewCount": 13062,
  "likeCount": 974,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/97-OBhNR-Es/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/97-OBhNR-Es/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/97-OBhNR-Es/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/97-OBhNR-Es/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/97-OBhNR-Es/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/97-OBhNR-Es\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "A smooth work out with lovely guided breath work.",
    "Lovely start to the week! Saving the standing barre workout, an all-time favorite, for Monday! This was perfect - going to add an equipment workout for strength now. I live these playlists! Thanks so much, hope you’re having a lovely birthday weekend!🎂🎉🥳🤩",
    "Wonderful first thing in the morning.  Myrna",
    "Love the guided breath + full body pilates combo + 20 min combo, more please❣️",
    "I Love you, Rachel. I live in Ft Lauderdale Florida. You are part of my daily routine. I do a lot of weight training classes and then need a good stretch or a relaxing workout with you. Some of my favorites are ballet barre and band classes. I would love if you did more band classes and more ballet barre. They are so effective!"
  ],
  "channelSubscriberCount": 302000,
  "channelVideoCount": 793
}