{
  "video_id": "9fp9OQZvXRM",
  "title": "40 Min Daily Yoga Flow | Every Day Full Body Yoga For All Levels",
  "description": "👉 Join my Flexibility Program to master challenging poses - https://www.charliefollows.com/flexibility-program\n\nWelcome to your 40 min daily yoga flow. This class is great for all levels and focuses on the essential postures to build strength and improve your mobility.\n\nThis full body sequence includes options to suit all levels and is intended to give you a well rounded practice that you can come back to every day.\n\nThe sequence includes a steady vinyasa flow with hip openers, backbends, standing balances and side planks. It's designed to help you feel like you've given your body everything it needs to have a great day. \n\nI hope you enjoy this daily yoga flow. \n\nCharlie x\n\n✨ Online Courses: https://www.charliefollows.com/programs\n💌 Newsletter community: https://www.charliefollows.com/newsletter \n🙋‍♀️ Socials: TikTok @charlieefollows Insta: ch3rlieflow\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2023-07-09T12:50:18Z",
  "duration": 2628,
  "durationFormatted": "43:48",
  "viewCount": 1170367,
  "likeCount": 22218,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9fp9OQZvXRM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9fp9OQZvXRM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9fp9OQZvXRM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9fp9OQZvXRM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/9fp9OQZvXRM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9fp9OQZvXRM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Happy Sunday friends I hope you enjoy the self massage in this class, let me know how it goes?",
    "This is true yoga, not power yoga, not throwing yourself around on the mat to keep up with the instructor. Yoga is meditation, which I think it often lost with online videos. Charlie always emphasizes breathing throughout. I feel like a changed person when I come off the mat. Thank you, Charlie.",
    "I giggled when you faded away at the end. Thanks Charlie 😊",
    "It seems you put a lot of thinking in these classes you’ve for us.Thank you for such comforting yoga class. I’m grateful for this❤",
    "I&#39;ve been doing yoga (almost) everyday since the beginning of 2024. your channel is one of my go-to&#39;s. I love these full body yoga for all levels videos! challenging yet still very doable for a beginner like me. thank you for making these videos!"
  ],
  "channelSubscriberCount": 991000,
  "channelVideoCount": 1004
}