{
  "video_id": "9fr6geQtd88",
  "title": "20 Minute Guided Meditation for Manifesting Your Desired Reality",
  "description": "This is an Original 20 minute manifesting guided meditation recorded by us.  May you wake up feeling grateful for this new day and the endless possibilities it holds.  May you be open to receiving all the positive energy, abundance, and blessings that the universe has in store for you.  May your thoughts, words, and actions be aligned with your highest good and the good of all beings. It's our wish for you to trust in the universe's guidance and know that everything is unfolding perfectly for you.  Remember that you are loved and supported, and everything you need is already within you.  Let's make today amazing and manifest your desired reality!\n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "20 minute meditation",
    "meditation 20 minutes",
    "guided meditation 20 minutes",
    "manifesting meditation",
    "guided meditation manifesting",
    "manifestation",
    "desired reality",
    "shifting",
    "shifting reality"
  ],
  "publishedAt": "2023-04-26T09:00:05Z",
  "duration": 1194,
  "durationFormatted": "19:54",
  "viewCount": 965329,
  "likeCount": 15666,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9fr6geQtd88/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9fr6geQtd88/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9fr6geQtd88/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9fr6geQtd88/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/9fr6geQtd88/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9fr6geQtd88\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I didn&#39;t take it seriously at first and started laughing (Im not use to doing meditation) and this meditation became so heavenly it made me cry. I actually started to envision my future husband and kids literally at the corridor. Then I experienced chills and goosebumps (never had that before). Amazing ❤",
    "Imagining myself as the most loving and self-actualized person I can be is so much better than imagining myself being rich or famous. This was so refreshing to my heart and is motivating me to meditate more. Thanks!",
    "We are the masters of our own fate. Write your story",
    "I work from home and have been feeling a bit depressed from a lack of human interaction and fulfillment. This meditation took me to a regular day of me coming home from an honest days work and being greeted by my wife and kids. So simple yet so powerful for my soul. It showed me that those are the moments I am truly grateful for and desire. A fulfilling job to be proud of and a loving family to come home to. Thank you god for putting this video in my path today and thank you to the creator of this video. Will definitely be tuning in more often.",
    "My reading today suggested concentrating on solutions not problems. I truly believe that us how we step up to a higher version of ourself and help those around us do the same,<br>May Love light and happiness fill your day!"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}