{
  "video_id": "9hVq72ZZLng",
  "title": "DAY 2 of Beginner EPIC | No Equipment Upper Body Workout",
  "description": "Day 2 in the EPIC Beginners Series for those of you wanting to progress to the full EPIC Program! For 30 minutes, we will be pushing, controlling, lowering, holding and pulsing our way through many challenging movements. \n\nA perfect workout involving the staple movements to master in order to progress to more advanced versions. \n\nThis is an EPIC beginner upper body workout using your own bodyweight as resistance to build your strength and co-ordination! We will be targeting the arms, shoulders, back and core!\n\nThis is a no equipment workout however, you will need a sturdy chair and a mat.\n\nRemember to work at your own pace! You can go slower, you can even go faster if you feel like it.. just maintain form and alignment!\n\nThe timer will be on for 45 seconds of work and 15 seconds rest to get ready for the next exercise.\n\nEvery 3rd exercise is a Cobra Push Up as this is so great for that mind muscle connection to triceps, practise for pushing up bodyweight as resistance and lowering with control! \n\nPlease ensure you warm up for at least 5 minutes prior to beginning. (See link below for my new warm up routine)\n\nUpper body here we come!\n\nCx\n\n▶ Ready to progress to my full EPIC program: https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\n▶ My 5 Minute Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n▶ Download your FREE EPIC Program Guide: https://carolinegirvan.com\n▶ Equipment I use in my workouts from Amazon: https://amazon.co.uk/shop/carolinegirvan\n▶ My US Amazon Page: https://amazon.com/shop/carolinegirvan\n\n▶ Subscribe to my YouTube Channel and never miss a workout: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Facebook: https://facebook.com/carolinegirvanfitness\n▶ Twitter: https://twitter.com/carolinegirvan\n\n▶ Business Enquires Email: info@carolinegirvan.com\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "upper body workout",
    "no equipment upper body workout",
    "upper body",
    "epic program",
    "caroline girvan epic",
    "caroline girvan",
    "triceps",
    "arms",
    "shoulders",
    "back",
    "core",
    "workout",
    "epic",
    "beginner",
    "beginner workout",
    "beginner upper body workout",
    "upper body workout at home",
    "at home upper body workout",
    "arm workout",
    "bodyweight",
    "no equipment",
    "chest workout",
    "shoulder workout",
    "no equipment workout",
    "abs",
    "abs workout"
  ],
  "publishedAt": "2020-09-22T07:30:00Z",
  "duration": 2040,
  "durationFormatted": "34:00",
  "viewCount": 2091535,
  "likeCount": 30400,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9hVq72ZZLng/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9hVq72ZZLng/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9hVq72ZZLng/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9hVq72ZZLng/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/9hVq72ZZLng/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9hVq72ZZLng\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I notice that the day one workout has more than twice as many views as the day two workout. Congratulations to my fellow day 2 survivors!",
    "Push up lower to on knee rise<br>Tap shoulder on plank  <br>Cobra pushup<br>Tricep dips on chair <br>Pushup lower to knees <br>Cobra pushup<br>Plank hips up and down<br>Inch worm<br>Cobra pushup <br>Side plank hold <br>Side plank hold other side <br>Cobra pushup <br>Downward to to pike <br>Lat pull down <br>Cobra pushup<br>Pike hold <br>Plank up and down <br>Cobra pushup<br>Row to plank <br>Plank lean<br>Cobra pushup<br>Reverse snow angels<br>Rear fly<br>Cobra pushup<br>Superman<br>Gorilla pushup <br>Cobra pushup<br>Side plank to side plank<br>Scapula pushups<br>Cobra pushup",
    "I think I need pre-begginers class 😀",
    "Whenever I&#39;ve taken a break from strength training I always come back to this series. When I first started training with Caroline&#39;s videos I was doing push ups against the wall, nearly everything on my knees and still my arms were too exhausted to do more than ten minutes of this workout. <br>But 4 years later, I&#39;m doing tricep pushups on my toes, and I did this whole workout with no modifications whatsoever! Thank you Caroline! And thanks to this community for always leaving encouraging comments 💪😘",
    "66 year old here. Did this work out. But I had to pause frequently as I was literally collapsing. But as soon as I recovered after a few seconds I continued. I am determined. I will not give up. I know I can do this. Thank you Caroline. Your friendliness has really helped."
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}