{
  "video_id": "9K9lTOQ8uEM",
  "title": "10 Calisthenics Exercises That Build The MOST Muscle!",
  "description": "Choose the right calisthenics exercises and you will build muscle mass with them. Pick the wrong ones and all you’ll get is a conditioning effect at best and not much muscle growth for your hard work. In this video, I’m going to show you the best muscle building calisthenics exercises for getting a bigger chest, arms, shoulders, legs and back.\n\n60% off all AX programs - http://athleanx.com/x/256-workouts\nSubscribe to this channel here - http://bit.ly/2b0coMW\n\nThe best part about bodyweight exercises is that they can be performed without needing any equipment at all, or at most, a single pullup bar. They are also quite scalable. Given the fact that your body is what serves as the resistance, you can almost always find a way to offload some of the weight by changing the position of your body in space.\n\nWe start this list of the best calisthenic exercises with something called the human pullover. This is definitely a hard exercise but it is one that is amazing at building up the size of the lats. Think about pulling down with your arms in order to lift your body off the ground rather than curling your body up by contracting your abs. The overload created here is felt instantly, making this one of the better calisthenic back workout inclusions.\n\nNext we move onto the Chinup. This is a great bodyweight biceps exercise. Sure, it hits the lats as well, but the supinated position of the forearm helps to put the bicep muscles in the crosshairs and get you building bigger arms quickly. Maintain enough distance of the body away from the bar throughout the movement in order to keep the focus on the biceps rather than the lats.\n\nNext we have the handstand pushup. There is perhaps no better shoulder builder than this when it comes to bodyweight exercise options. The wall is a good way to offload some of the weight and assist you in gradually building up your strength to be able to handle your entire body. This calisthenics exercise will hit your front, middle and rear delts and should be included in your shoulder workouts.\n\nNext we have the hanging leg raise. The abs are muscles too, and they respond just like any other to overload and resistance. In this case, the resistance comes in the form of your legs. Be sure to curl your pelvis up and not just lift the legs if you want this to target the abs rather than the hip flexors.\n\nThe pushup is one of the absolute classic calisthenic movements out there. While I’ve gone on record in the past of saying that far too often people choose the easiest version of the exercise and just build up the number of reps that they can perform on it, I think there is a better way. Especially when the goal is to build as much muscle as possible, you need to choose a variation that is more challenging and capable of driving overload on the chest.\n\nThe pullup is of course the kind of all bodyweight back exercises. Don’t forget to include this in the calisthenic exercises you are doing in your training split. This will hit your entire back, including your lower back for stabilization. Nothing like having to lift the weight of your entire body up to the bar, and the pull-up will reward you for the effort.\n\nDips are another one of those classic exercises with just bodyweight. You can even add some additional weight around your waist if you are looking for the extra challenge. The key to building a bigger chest and shoulders with this movement is to safely lower yourself down to about 90 degrees, pause briefly and then power back up with the muscles rather than momentum. \n\nNo athlean-x video is complete without addressing the need for a corrective exercise. In this case, my favorite of all time is the facepull. Many people don’t realize that you can actually perform a face pull with your own bodyweight in an doorway. Watch how it’s done and start building up the strength of the rotator cuff, rhomboids and rear delts with calisthenics. \n\nThe legs will get hit hard with the combination of a glute ham raise and the levitation squat. The first will work the posterior chain while the second will hit the quads and anterior chain muscles. The latter has the advantage of being a single leg exercise that has some distinct benefits over the pistol squat. Either way, these can be tough but they fit the bill for creating the overload necessary to drive muscle growth.\n\nFor more bodyweight workouts and exercises with just bodyweight, be sure to head to athleanx.com via the link below to check out our bodyweight workout program. This calisthenics workout called XERO will help you build ripped, athletic muscle in just 6 weeks without needing any equipment at all.\n\nFor more calisthenic workouts and calisthenic exercise videos, be sure to remember to subscribe to our youtube channel via the link below and turn on your notifications so you never miss a new video when it’s published.",
  "channelTitle": "ATHLEAN-X™",
  "channelDescription": "Welcome to ATHLEAN-X™ on YouTube!  This is where you can find all the latest FREE workouts, nutrition and training advice to get you on your way to a healthy, leaner,  more muscular, athletic body by training like an athlete.\n\nLearn from the physical therapist and strength coach Jeff Cavaliere, exactly what he does with his professional athlete and celebrity clients.  Put the science back in strength to build muscle, keep your muscles and joints healthy and to improve your overall athleticism.  \n\nSubscribe for free weekly workouts.\n\nIf you want to look like an athlete...you've got to train like an athlete!  Now you can with the ATHLEAN-X™ workouts here on YouTube!\n\nSend Pro Athlete / Celebrity Training Requests to:  mediarelations@athleanx.com\n\nRules of Conduct: This channel is for those looking to learn. Period. No racism/hate speech. No inciting/spreading drama. No advertising or self-promotion of any kind.",
  "tags": [
    "calisthenics",
    "calisthenic",
    "calisthenics exercises",
    "calisthenic exercise",
    "calisthenic exercises",
    "calisthenics exercises for muscle",
    "how to build muscle with calisthenics",
    "calisthenic workout",
    "calisthenics workout routine",
    "calisthenics exercise program",
    "calisthenics exercise routine",
    "calisthenics movement",
    "calisthenics movements",
    "bodyweight exercises",
    "exercises with bodyweight",
    "bodyweight only workout",
    "bodyweight only exercises",
    "athleanx",
    "athlean x",
    "jeff cavaliere",
    "athlean xero"
  ],
  "publishedAt": "2021-09-27T17:25:28Z",
  "duration": 541,
  "durationFormatted": "9:01",
  "viewCount": 3580639,
  "likeCount": 142168,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9K9lTOQ8uEM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9K9lTOQ8uEM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9K9lTOQ8uEM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9K9lTOQ8uEM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/9K9lTOQ8uEM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9K9lTOQ8uEM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "The pushup is one of the most standard calisthenics exercises there is, but it can be too basic for most. If you find yourself doing 100 reps a day of this basic move, then I am BEGGING you to stop. Find out why in this video here =&gt; <a href=\"https://www.youtube.com/watch?v=-T64FLsJnAU\">https://youtu.be/-T64FLsJnAU</a>",
    "Calisthenics is the GOAT",
    "1. Human pullover (not ab driven, lat driven) <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=68\">1:08</a><br>2. Chin Up (don&#39;t get too close to the bar to keep the focus on the biceps and less on the lats <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=114\">1:54</a><br>3. Handstand pushup (shoulder building) <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=154\">2:34</a><br>4. Glute Ham Raise (allow glutes to drive the hamstrings) <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=214\">3:34</a><br>5. Push-ups (last 2-inch extension matters, do a challenging version of the pushup) <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=261\">4:21</a><br>6. Hanging Leg Raise <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=301\">5:01</a><br>7. DIP (chest, shoulder, and tricep builder) <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=334\">5:34</a><br>8. Pull-Ups <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=372\">6:12</a><br>9. Doorway Face Pull  <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=416\">6:56</a><br>10. Levitation Squat <a href=\"https://www.youtube.com/watch?v=9K9lTOQ8uEM&amp;t=459\">7:39</a><br><br>Thank you Caitlynn P for the list.",
    "1. Human pullover (not ab driven, lat driven)\r<br>2. Chin Up (don&#39;t get too close to the bar to keep the focus on the biceps and less on the lats\r<br>3. Hand stand pushup (shoulder building)\r<br>4. Glute Ham Raise (allow glutes to drive the hamstrings)\r<br>5. Push ups (last 2 inch extension matters, do a challenging version of the pushup)\r<br>6. Hanging Leg Raise \r<br>7. DIP (chest, shoulder, and tricep builder)\r<br>8. Pull Ups\r<br>9. Doorway Face Pull \r<br>10. Levitation Squat",
    "I love that he acknowledges the fun we have about face pulls"
  ],
  "channelSubscriberCount": 14000000,
  "channelVideoCount": 1580
}