{
  "video_id": "9kraLB-Nxjs",
  "title": "25 minute Weight Loss Workout | HIIT for Seniors, Beginners",
  "description": "Hi there 👋\nWelcome Back To Another Video\n\"25 minute Weight Loss Workout in a Chair | HIIT for Seniors, Beginners\"\n\nThis 25-minute Weight Loss Workout is a HIIT for seniors and beginners that will burn fat, improve your cardiovascular system, and build stamina. This at home work features 4 sets of 2 exercises, each done in 20 second, 30 second, and 40 second intervals. My mom rocks it in a chair and I do standing exercises at an intermediate level. It's about 2000 steps, more or less depending on your pace.\n\nHIIT workouts (high intensity interval training) can be done at any age. HIIT burns more calories than steady state exercise during and after exercising.  A study of sedentary women compared 20 minutes of HIIT with 40 minutes of steady-state exercise. The HIIT subjects were the only ones who lost fat-primarily belly fat. Yay!\n\nThis workout is for all levels -- you can exercise in a chair or exercise at an intermediate level standing.\n\n00:00 Introduction\n00:54 Warm Up\n03:09 Exercise Set 1\n09:28 Exercise Set 2\n14:21 Exercise Set 3\n19:50 Exercise Set 4\n24:31 Cooldown\n\n🌐 Want to try our other HIIT workouts? Click here: https://bit.ly/3MbznVl\n\nyes2next celebrates fitness and joy at any age. It's never too late to start exercising, creating, and doing. Let's say \"yes\" to our next adventures in fitness and life.\n\nIf you are new to our channel, we're happy you clicked on our video! We hope you enjoy it!  Please show your love💓 and support 🤝 by joining the yes2next community by subscribing and pressing (🔔) to join the Notification Squad and stay updated with new uploads✨ If you have any inquiries or requests, feel free to leave them in the comments below.\n\n🔴 Subscribe to our channel here (it's free!) https://www.youtube.com/@yes2next\n👍 Like the video (it helps a ton!)\n💬 Comment below to share your opinion!\n🔗 Share the video with anyone you think it might help :)\n\n📲 Stay Connected:\n📷 𝐈𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦: https://instagram.com/yes2next\n⚫️ 𝐓𝐢𝐤𝐓𝐨𝐤: https://tiktok.com/yes2next\n🔵 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤: https://facebook.com/yes2next\n🔵 𝐓𝐰𝐢𝐭𝐭𝐞𝐫: https://twitter.com/yes2next\n🔴 𝐏𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭: https://pinterest.com/yes2next\n🌐 𝗪𝐞𝐛𝐬𝐢𝐭𝐞: https://yes2next.com/\n✉ 𝐄𝐦𝐚𝐢𝐥: yes2next@gmail.com\n\n𝐃𝐢𝐬𝐜𝐥𝐚𝐢𝐦𝐞𝐫: https://yes2next/disclaimer\n\n----------------------------------------------------------------------------------\n\n🎬 SUGGESTED VIDEOS\nDon't forget to watch 📽 our other videos. We invite you to check them out:\n\n▶️ 15 Minute HIIT Walking Workout\n✅ https://www.youtube.com/watch?v=0Fo1T9WQuLg\n\n▶️ 7 Easy Exercises for Seniors || Strength Workout For Beginners\n✅ https://youtu.be/GASDpy_DuMg\n\n▶️ 30 Minute Strength Training for Seniors And Beginners\n✅ https://youtu.be/jQ6XPcX-Dfw\n\n\n#hiitforbeginners #seniorexercise #chairworkouts",
  "channelTitle": "yes2next",
  "channelDescription": "yes2next is all about fitness and joy at any age, including seniors over 50. Say yes to your next adventures and reaching your full potential. I’m April, a personal trainer with senior fitness and functional training specialist certifications from the American Council on Exercise and The Biomechanics Method for Corrective Exercise. My 83-year-old mom and I are excited to share our passion for healthy living with our exercise videos for beginners and seniors, lifestyle tips, and fun. \n\nStay connected with us by subscribing and following us on:\n⭐️ Facebook: https://facebook.com/yes2next\n⭐️ Instagram: https://instagram.com/yes2next\n⭐️ Twitter: https://twitter.com/yes2next\n⭐️ Pinterest: https://pinterest.com/yes2next\n⭐️ Tiktok: https://tiktok.com/@yes2next\n\n👉 To keep in touch by email,  sign up at https://yes2next.com\n👉 Find yes2next gear at our store: https://yes2next.com/shop\n\n❤️ To donate, visit our Paypal page: https://bit.ly/y2ndonate Thank you!\n\nSee you soon! 🏃‍♀️🏋️‍♀️ 😊\n",
  "tags": [
    "25 minute weight loss workout",
    "beginner workout at home",
    "beginner workout routine",
    "burn fat",
    "chair workout",
    "exercise",
    "hiit for seniors",
    "lose weight",
    "lower blood sugar",
    "senior exercises at home",
    "senior fitness",
    "senior shape",
    "senior workout",
    "silver sneakers",
    "weight loss workout",
    "yes 2 next",
    "yes to next",
    "yes to next exercise",
    "yes to next exercises",
    "yes2next",
    "yes2next hiit workout",
    "yestonext"
  ],
  "publishedAt": "2023-06-20T13:00:06Z",
  "duration": 1649,
  "durationFormatted": "27:29",
  "viewCount": 157790,
  "likeCount": 3303,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9kraLB-Nxjs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9kraLB-Nxjs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9kraLB-Nxjs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9kraLB-Nxjs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/9kraLB-Nxjs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9kraLB-Nxjs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Whew, this was a good one! Your mom had me laughing so hard I had to look away and close my eyes so I wouldn&#39;t get confused and follow her in the 2nd round. I totally get it with the brain confusion/workout. You deserve your hot dog for that one, for sure. Love this one April. I was able to keep up with you, finally, on the higher intense version. It only took me 6 months of working out to be able to go to higher intensity (LOL). Thank you so much for continuing these workouts, it has helped me greatly.",
    "The workout was great. The harmonious banter between mother and daughter made it even better. Thank you. ❤",
    "Oh my I loved that one ! Finding your videos is THE BEST thing I have done in years! I am so unfit and inflexible I couldn’t do a whole one of your videos at first , but after doing one or two a day I can now ! I started off with the stretching and warmup ones and worked my way up as well as walking everyday . I honestly can’t thank you enough !!!<br>❤️❤️❤️❤️",
    "I do your routines every day, but I rarely leave a comment. My sister in Guatemala follows you too and is happy doing your exercises. The ambiance you create is cozy and fun. I feel like you two were long time friends. Thank you so much!",
    "As a physical therapist, I just want to say, you are great for sharing this! ❤"
  ],
  "channelSubscriberCount": 456000,
  "channelVideoCount": 322
}