{
  "video_id": "9MazN_6wdqI",
  "title": "Yoga To Reduce Stress | 30 Min Slow Flow - Relaxing Stretches + Savasana",
  "description": "This gentle and relaxing full body yoga class will take you through mindful movement meant to support your physical + mental healthy by reducing stress. You will be encouraged to move with your breath while staying aware of your bodily sensations. This class is for all levels.\n\nWe begin with a gentle flow of child's pose to cobra with a side body and lower back stretch, locust pose to open the shoulders and a seated toe stretch. The sequence continues with downward dog, rag-doll, seated neck stretches, head to knee pose, seated wide legged forward fold, reclined twist and savasana.\n\nI hope you enjoy the class! Let me know in the comments how it leaves you feeling. Be sure to download the Jess Yoga app for more exclusive practices. See you on the mat 😊\n\nMuch love x\nJess\n\n\n📲🧘🏽‍♀️ MOBILE APP \nPractice with me ad-free & gain access to exclusive yoga classes + programs. \nPlay videos on your desktop, TV, phone, or tablet.\n\nJESS YOGA available worldwide on iOS & Android. \nFREE 7-DAY TRIAL:\nhttps://jessyogaapp.web.app/\n\n🦋 DONATIONS \nDonations to this channel allows me to keep creating new content + keeps yoga free & accessible to all.  \nIf you'd like to donate you can click the link below:\nhttps://bit.ly/31WdAZE\nThank you for your support!\n\n❤️ FAVORITES \nYoga Mat:\nLiforme (Use the code 'JESSYOGA' for 10% off)\nhttp://bit.ly/2uH0xNf​​​​​\n\nEco-Friendly Activewear:\nStudio Kolektif Organic Yogawear (Use code 'JESSICARICHBURG' for 15% off)\nhttps://bit.ly/2WDxXtr\n\nIndigo Luna Organic Yoga & Lifestyle Clothing:\n(Link for 10% off at checkout)\nhttps://indigoluna.store/?ref=JESSYOGA\n\nJournal:\nWeekly Reset Planner + Artist of Life Workbook from Lavendaire\nhttps://shop.lavendaire.com/JESSICA10 (Use code 'JESSICA10' for 10% off)\n\n🙏 CONNECT\nBlog: https://jessicarichburgyoga.com​​​​​\nInstagram: https://instagram.com/Jessicarichburg​\nFacebook: https://www.facebook.com/jessicarichburgyoga/\n💌 Sign up for my newsletter:\nhttps://jessicarichburgyoga.com/newsletter/\n\nMUSIC\nhttps://www.epidemicsound.com/referral/1dey13\n\n- \n\nDISCLAIMER\nThe information and practices on this website are not meant to diagnose, treat or cure any illness and and should not be used as a substitute for professional medical care. As with any exercise program, you take the risk of personal injury when you practice yoga. Please be mindful and listen to your body. By voluntarily participating in these practices, you acknowledge this risk and release Jessica Richburg from any liability. You are responsible for your own body's well being. Please consult with your physician prior to beginning exercise.",
  "channelTitle": "Jess Yoga",
  "channelDescription": "Welcome to the channel! \n\nI'm Jessica, a 500-hr certified yoga instructor with a passion for health, wellness and sharing mindful movement. I'm here to support you on your yoga journey and give you the tools to live a more balanced and mindful life, both on and off the mat. \n\nOn this channel you will find a variety of classes with different styles, lengths and levels, along with the occasional vlog or sit-down chat.\n\nIf you enjoy practicing with me and want more exclusive yoga classes, meditations + courses then check out my app, Jess Yoga - available worldwide for iOS and Android (link below). \n\nThank you for practicing with me, and I’ll see you on the mat! \n\nFor business inquiries/collaborations please email richburg.jessica@gmail.com. ",
  "tags": [
    "Yoga",
    "Stretch",
    "Home yoga"
  ],
  "publishedAt": "2023-01-21T13:00:08Z",
  "duration": 1755,
  "durationFormatted": "29:15",
  "viewCount": 3097091,
  "likeCount": 70256,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9MazN_6wdqI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9MazN_6wdqI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9MazN_6wdqI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9MazN_6wdqI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/9MazN_6wdqI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9MazN_6wdqI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Today was a really bad day and I cried for the first 5 minutes of practice, but with every breath it got easier and easier.  now I&#39;m calm, thank you very much",
    "During Savasana my dog dropped his ball directly on my forehead. I couldn&#39;t help but smile.. animals are SO pure. :)",
    "This is my very first time trying out yoga. I went in blind with no research about yoga and found myself crying all throughout the savasana. I didn&#39;t even know that yoga could do that and that I had all these tears locked up inside of me. I couldn&#39;t stop crying even after I had packed up all of my stuff. Thank you so much for guiding me in releasing all of the built up stress that I&#39;ve placed upon myself.",
    "Wow, I didn&#39;t realized that 30 mins has passed and I felt relaxed.",
    "Thanks!"
  ],
  "channelSubscriberCount": 837000,
  "channelVideoCount": 141
}