{
  "video_id": "9psH-BsJ_IM",
  "title": "Beginner Zone 2 Cardio Workout - BODYWEIGHT/NO EQUIPMENT | 20 Minutes",
  "description": "Looking to build your cardio base, strengthen your heart, and burn fat? Try this 20-minute Zone 2 Cardio Bodyweight workout designed by Sunny Trainer, James King III. Keep your body moving and your heart rate in Zone 2 by completing this workout a few times a week.\n\n00:00 Warm Up: Start the workout with a warm-up to prepare your body for the exercises to come.\n\n2:23 Arm Swings\nSwing your arms back and forth to loosen up your shoulders.\n\n2:49 Hip Circles \nCircle your hips in one direction, then switch to the other direction.\n\nWorkout : The main workout consists of 6 exercises that you will repeat 3 times. Each exercise lasts 30 seconds, and you'll have a 10-second break between each exercise.\n\n3:27 Double Punch to Kickback \nStart with your feet shoulder-width apart and fists up by your chin. Punch out with both fists, then kick one leg back while punching with the opposite fist. Alternate sides with each rep.\n\n3:50 High March \nMarch in place while lifting your knees as high as you can. Swing your arms to help with momentum.\n\n4:26 Hands to Knees \nStand with your feet shoulder-width apart and hands behind your head. Lean forward and touch your hands to your knees, then stand back up straight.\n\n4:57 Punch Step Jack \nStart with your feet together and fists up by your chin. Step out to the side with one foot while punching with the opposite fist. Bring your foot back to center and repeat on the other side.\n\n5:28 Overhead Reach with Lateral Step-backs \nStand with your feet shoulder-width apart and arms overhead. Step back with one foot while lowering your arms to shoulder height. Step back to center and repeat on the other side.\n\n6:04 Pivot Punch \nStart with your feet shoulder-width apart and fists up by your chin. Pivot on one foot while punching with the opposite fist. Pivot back to center and repeat on the other side.\n\n20:53 Cool Down: After the workout, take some time to cool down and stretch out your muscles.\n\n21:23 Chest Stretch with Forward Fold\nStand with your feet hip-width apart and clasp your hands behind your back. Bend forward at the waist while lifting your hands up behind you to stretch your chest.\n\n22:05 Standing Calf Stretch \nStep one foot back and press your heel into the ground while\n\nSubscribe to get free workouts, challenges, fitness community, latest in-home fitness equipment and more! \n\nStay connected with your fitness and download SunnyFit App below:\nApple - App Store : https://apple.co/3JixdjS\nAndroid - Play Store: https://bit.ly/android-sunnyfit\n\n--------------------------------------------\n\nRECOMMENDED WORKOUT PLAYLIST: \n▶️ New Workouts: https://bit.ly/yt-new-workouts-playlist\n▶️ No Equipment Workouts: https://bit.ly/SHF-No-Equipment-Workouts\n\n\nFREE RESOURCES\n💡 Free Workouts: https://sunnyhealthfitness.com/pages/workouts\n💡 Articles: https://sunnyhealthfitness.com/blogs/index\n\nFOLLOW US ON SOCIAL\n👍 Website: https://sunnyhealthfitness.com\n👍 Facebook: sunnyhealthandfitness\n👍 Instagram and Tiktok: @sunnyhealthfitness\n#sunnyhealthfitness #bodyweight #bodyweightworkout #cardio #cardioworkout #zone2 #beginnerworkout",
  "channelTitle": "Sunny Health & Fitness",
  "channelDescription": "Fit for Everyone | At Sunny Health & Fitness, we believe a quality workout experience and healthy lifestyle should be within reach of anyone who wants it. Our mission is to make fitness accessible to everyone, including you!\n\nSunny Health & Fitness is dedicated to helping you reach your goals. We have provided the equipment to everyday households for over a decade and now we are branching out to provide videos on technique, assistance, and customized workouts for each category in our line of premier fitness equipment. \n\nSubscribe to our channel to discover the latest in home fitness, weekly exercises, and product troubleshooting guides. Visit our website to discover articles and workouts and take a trip to our social media for daily updates on all things health and fitness.\n\nPlease send up an email with any questions or troubleshooting needs. Use the link below.",
  "tags": [
    "beginner zone 2 cardio workout",
    "Sunny Health And Fitness",
    "beginner workout",
    "cardio workout",
    "no equipment workout",
    "full body workout",
    "bodyweight workout",
    "low impact workout",
    "low impact cardio",
    "no equipment",
    "cardio workout for beginners",
    "full body workout at home",
    "cardio workout at home",
    "hiit cardio",
    "bodyweight workout beginner",
    "low impact cardio workout",
    "low impact cardio workout for beginners",
    "no equipment workout beginner",
    "zone 2",
    "zone2workout",
    "zone 2 workout"
  ],
  "publishedAt": "2023-04-28T21:30:01Z",
  "duration": 1426,
  "durationFormatted": "23:46",
  "viewCount": 170853,
  "likeCount": 3878,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/9psH-BsJ_IM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/9psH-BsJ_IM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/9psH-BsJ_IM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/9psH-BsJ_IM/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/9psH-BsJ_IM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "More zone 2 cardio workouts please! Thanks",
    "Thank you coach for this!<br>I was struggling with Major anxiety when I started this. There have been a lot of other changes I have brought into my life but every time I do this workout, I feel the boost of positivity! <br>Grateful for this &amp; the way you keep making conversations throughout the video. No matter how many times I watch &amp; practice it, it makes me feel good each time ❤",
    "NO CUZ WE NEED MORE OF THIS DESPERATELY. Tell me why I look this up on YouTube and hardly anybody is doing it. This is the most important type of fitness especially people who are new to fitness need to have",
    "I loved your message about not having to do all or nothing and being able to do a cardio workout that I could feel great doing the whole time rather than feeling like I was going to keel over. Thanks for the great workout and for your positivity.",
    "First timer!  Easy to follow and make me feel confident that I can do it to the end.  My doctor asked me to do zone 2 exercise 200min a week.  I’d like to see more zone 2 exercise if possible😊"
  ],
  "channelSubscriberCount": 165000,
  "channelVideoCount": 2007
}