{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.9
    },
    {
      "level": "Intermediate",
      "score": 0.3
    }
  ],
  "techniqueDifficultyConfidence": 0.9,
  "techniqueDifficultyExplanation": "The workout includes basic body movements such as arm swings, high marches, and simple punches, which are categorized as beginner-level because they require minimal coordination and balance. Some movements like pivot punches and the combination double punch to kickback may require slightly more coordination, sliding them into the lower range of intermediate difficulty for those entirely new to any movement pattern, but generally, the exercises are simple enough for beginners.",
  "effortDifficulty": [
    {
      "level": "Light",
      "score": 0.8
    },
    {
      "level": "Moderate",
      "score": 0.5
    }
  ],
  "effortDifficultyConfidence": 0.85,
  "effortDifficultyExplanation": "The workout is structured as a low-impact, bodyweight session with 6 exercises repeated 3 times, each lasting 30 seconds, separated by short rest breaks. Although the duration slightly exceeds 20 minutes, the term 'Zone 2 cardio' suggests moderate intensity, supported by user comments appreciating its accessibility and ease. There's evidence that this is accessible to beginners, with some challenge offered through repetition and consistency, boosting it to moderate effort for deconditioned individuals.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.9
    },
    {
      "level": "Intermediate",
      "score": 0.5
    }
  ],
  "requiredFitnessLevelConfidence": 0.88,
  "requiredFitnessLevelExplanation": "The technique difficulty is primarily beginner, and the effort involved in performing a low-impact cardio workout with 30-second intervals and brief rests makes it suitable for beginner levels, confirmed by user comments praising its accessibility and positivity. The slight elevation in effort from doing the workout repeatedly borders the intermediate threshold, hence intermediate is also included mainly for those at the higher end of beginner fitness or just starting to progress."
}