{
  "video_id": "_2CFlN4U5vM",
  "title": "45-minute NO REPEAT Full Body Strength Training",
  "description": "OOOOHHHEEEE! 🔥 This workout! I think I should have named it body on fire! This no repeat structure makes this 45 minutes fly by, no time to get bored! Plus, with the 3 rounds for upper body, lower body, and abs there is no major muscle group that doesn't get an amazing workout! This stregnth workout will help you build a strong, solid body! Get ready to sweat, shake, and end this training knowing that you got an aweosme workout! \n\n45 MINUTE FULL BODY STRENGTH WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 45lbs / 4.5-20.4kg. Select a moderetly heavy weight for today's workout! \n- EXERCISE MAT\n\nOPTIONAL EQUIPMENT\n- BOOTY BAND OR MINI RESISTANCE BAND\n\nSTRUCTURE\nNO REPEAT STRUCTURE - YOU'VE GOT ONLY 1 CHANCE AT EACH EXERCISE SO MAKE IT COUNT!\n21 TOTAL EXERCISES\nUPPER BODY, LOWER BODY, AND ABS ROUND\nUPPER & LOWER BODY ROUNDS\nWORK: 60 SECONDS REST: 20 SECONDS\nABS ROUND\nWORK: 40 SECONDS REST: 10 SECONDS\nREST BETWEEN ROUNDS: 60 SECONDS\n\nEXERCISE LIST\nUPPER BODY ROUND\n- L-RAISE\n- NARROW SHOULDER PRESS\n- ARNOLD PRESS\n- TRICEP OVERHEAD EXTENSIONS\n- BICEP CURLS\n- HAMMER. CURLS\n- ROTATING ROW\n- KNEELING WIDE ROW\n- PRONE SWIMMERS\n- REVERSE GRIP CHEST PRESS\n- CHEST FLYES\nLOWER BODY ROUND\n- ROMANIAN DEADLIFT\n- CALF RAISES\n- SUMO SQUAT\n- CURTSY LUNGE\n- SINGLE LEG RDL - ONE SIDE\n- SINGLE LEG RDL - SWITCH SIDES\n- SUMO DEADLIFT\n- GLUTE BRIDGE\n- ABDUCTION\n- DONKEY KICKS TO KICKBACKS - ONE SIDE\n- DONKEY KICKS TO KICKBACKS - SWITCH SIDES\n- SQUAT\nABS ROUND\n- BUTTERFLY CRUNCH\n- STRAIGHT LEG CROSS BODY CRUNCH- ONE SIDE\n- STRAIGHT LEG CROSS BODY CRUNCH- SWITCH SIDES\n- PLANK SIDE BEND\n- DEAD BUG\n- HEEL TAPS\n- REVERSE CRUNCH\n- CRUNCH PULSE\n\n\nI am so glad you joined me for this workout! It's always better to workout with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2023-08-10T08:59:56Z",
  "duration": 2663,
  "durationFormatted": "44:23",
  "viewCount": 184486,
  "likeCount": 4243,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/_2CFlN4U5vM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/_2CFlN4U5vM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/_2CFlN4U5vM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/_2CFlN4U5vM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/_2CFlN4U5vM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/_2CFlN4U5vM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is my FAVORITE format by far. More like this, please!",
    "I can&#39;t believe I found you now! These are one of the very few strength training workouts for women by a woman! Love them. Please do a knee friendly strength training workout soon.",
    "Cannot speak highly enough of this workout I was sort of “meh” at the thought of a 45 minute. But once I started, it was so fun and flew by so fast. Very thorough, whole body workout. Loved it!!!",
    "This was perfect in length and pacing. I prefer “less is more” workouts like this to concentrate on form and quality of reps. Thanks for a great workout!",
    "GREAT WORKOUT!!!  Please make more 40-45 No Repeat strength videos :)"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}