{
  "video_id": "__BcrGEl70Y",
  "title": "40 Minute Total Body Strength Workout with Core Burnout",
  "description": "Find out more detail about this Strength Circuit Workout @ https://gofb.info/StrengthCircuit\n\nExclusive workout videos, challenges & site features @ https://gofb.info/FBPlus \nAt-home Workout Programs @ https://gofb.info/Programs \n\nExclusive 2 Week Workout Challenges @ https://gofb.info/PlusChallenges \nAdvanced search tool for over 600+ free workout videos @ https://gofb.info/WorkoutVideos \nThe most supportive fitness Community on the web @ https://gofb.info/FBCommunity \nMeal Plans written by Registered Dietitians @ https://gofb.info/FBMealPlans \nHealthy Living articles and recipes @ https://gofb.info/HealthyLiving\n\nFitness Blender Gift Cards @ https://gofb.info/GiftCards \nWe use PowerBlock adjustable dumbbells @ https://gofb.info/PowerBlock\n\nFitness Blender’s Workout Programs and subscription platform, FB Plus, make it possible to keep our individual workout videos and website free. We were founded with, and remain committed to, the goal of making health and fitness attainable, affordable, and approachable. We hope you enjoy our content and consider subscribing to our YouTube channel and registering on our website, which is free and open to all @ https://www.fitnessblender.com/ \n\nKeep up with us on Facebook @ https://gofb.info/Facebook Instagram @ https://gofb.info/Instagram Twitter @ https://gofb.info/Twitter Pinterest @ https://gofb.info/Pinterest\n\nNote: All information provided by Fitness Blender is of a general nature and is furnished for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold Fitness Blender harmless from any and all losses, liabilities, injuries, or damages resulting from any and all claims.",
  "channelTitle": "FitnessBlender",
  "channelDescription": "We offer at-home workout videos created by certified personal trainers and doctors of physical therapy. In our videos, you’ll see us sweat, laugh, lose count, and modify exercises based on what our bodies are telling us—we have fun with our workouts, and we want you to enjoy yourself, too! No matter your fitness level, if you need help with consistency, motivation, or achieving specific fitness goals, we’re here for you.\n• Explore our library of workout videos, from strength training and HIIT to yoga\n• Reach your goals with smart and effective workout programs\n• Use the customizable workout calendar and personalized stats to track your progress\n• Eat better with healthy recipes and meal plans built by registered dietitians\n• Reduce stress with mental wellness resources from licensed psychologists\n• Interact with our community of like-minded exercisers for support and motivation\nJoin for free or access exclusive content with an FB Plus Pass or Subscription: https://gofb.info/Membership\n",
  "tags": [
    "fitness blender",
    "fitness",
    "blender",
    "total body strength",
    "lifting workout",
    "strength training",
    "strength workout",
    "dumbbell workout",
    "total body workout",
    "home workout",
    "home training",
    "strength cardio"
  ],
  "publishedAt": "2021-09-27T12:04:46Z",
  "duration": 2401,
  "durationFormatted": "40:01",
  "viewCount": 232486,
  "likeCount": 3937,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/__BcrGEl70Y/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/__BcrGEl70Y/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/__BcrGEl70Y/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/__BcrGEl70Y/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/__BcrGEl70Y/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/__BcrGEl70Y\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Love Tasha! I&#39;ve been doing Fitness Blender workouts for 5+ years and Tasha is an awesome addition! Loved this one! And now, some lunch :)",
    "I have been using FB for 6 years and Tasha is their absolute best trainer. I&#39;m so glad she joined and providing these excellent videos. She is just in a league of her own.",
    "This was the first workout from Tasha that I did and I love her! Love her little jokes and comments throughout the workout.. lightens the mood!",
    "Oh wow this lady is the full package! She can do modifications without missing a beat in explaining them and staying with the timer. While still sounding enthused. Where did this team find her!? I&#39;m definitely going to be doing this one for sure. I hope she will have more full body strength workouts coming. Hell I&#39;ll be satisfied with whatever she adds. Great addition team!",
    "This was my first workout with Tasha-love her! Her low key demeanor is my style. I like that she gives a heads up for the next move. She kept my heart rate up the whole time. Great addition to FB!"
  ],
  "channelSubscriberCount": 6590000,
  "channelVideoCount": 1605
}