{
  "video_id": "_iGWdUTifIQ",
  "title": "Guided Meditation for Inner Peace and Calm | Mindful Movement",
  "description": "This is a guided meditation to help you calm the sense of being overwhelmed and find peace from within.  You will be guided through a relaxation to help you get curious about what you are feeling.  This meditation will help you nurture yourself with unconditional love and compassion.   \n\nMeditation written and read by Sara Raymond\nMusic: Ambient - The Ambient by Kevin MacLeod\n\nSara's Book\nYou Are Not Broken: A compassionate guide to uncovering inner wisdom and transforming your life with hypnotherapy\nhttps://amzn.to/3CUdABJ\n\nDo not listen while driving. Meditation and mindful movement are powerful tools to support you. This is not a substitute for medical care. Consult a doctor or trusted health professional if needed.\n---------------------------------------------\n1:1 Sessions\nPERSONALIZED HYPNOTHERAPY & TRANSFORMATIONAL COACHING\nhttps://www.themindfulmovement.com/sara\n\n#mindfulness  #meditation #personaldevelopment",
  "channelTitle": "The Mindful Movement",
  "channelDescription": "Welcome!  Here at the Mindful Movement, we are an oasis where you can come to tap into your inner calm, develop a positive mindset and heal from the stress that’s blocking your fulfillment. We offer guided meditation, visualizations, and hypnosis as well as Yoga, Pilates and a variety of mindful movement practices to help you live mindfully, move well and feel great!\n\nWe would love to continue working with you personally if you are interested.  We offer self-paced, online courses, group coaching, and 1:1 services.  You can learn more at our website:  Themindfulmovement.com \n\nAdditionally, check out Sara's new book, You Are Not Broken: https://amzn.to/4g6Omyh\n\nThe Mindful Movement is happy to provide these meditations, podcasts, and videos free of charge. If you wish to make a donation, please know that whatever you offer will be received with much gratitude. http://themindfulmovement.com/donations/\n\nOur second channel: @theMindfulMovementinMotion\n\nMuch love!\nSara and Les\n",
  "tags": [
    "Guided meditation for inner peace and calm",
    "inner peace",
    "morning meditation",
    "mindfulness meditation",
    "Meditation",
    "meditation for anxiety",
    "meditation for depression",
    "hypnosis",
    "anxiety reduction",
    "15 minute meditation",
    "relaxation",
    "stress reduction",
    "loving kindness",
    "recovery meditation",
    "evening meditation",
    "mindfulness",
    "Sara Raymond",
    "The Mindful Movement",
    "letting go of negativity",
    "unlock your full potential",
    "bedtime meditation",
    "open your heart",
    "guided meditation",
    "meditation for ocd"
  ],
  "publishedAt": "2016-11-21T16:21:39Z",
  "duration": 1025,
  "durationFormatted": "17:05",
  "viewCount": 4045289,
  "likeCount": 42891,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/_iGWdUTifIQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/_iGWdUTifIQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/_iGWdUTifIQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/_iGWdUTifIQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/_iGWdUTifIQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/_iGWdUTifIQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I wrote this book for you. To give you a detailed snapshot of how hypnotherapy can help you release many of your dream-life blocks like guilt, shame, trauma symptoms, anxiety, self-doubt, or fear-related silence. <a href=\"https://amzn.to/4g6Omyh\">https://amzn.to/4g6Omyh</a>",
    "Whoever is reading this, I wish you to be happy, fulfilled and loved ❤",
    "Father God, I pray You Bless each and every person reading this and hold their hearts minds and souls!! 🙏🏼❤️✝️🍃",
    "With every breath, the old moment is lost; a new moment arrives. <a href=\"http://manifestation.guide/\">manifestation.guide</a> We exhale and we let go of the old moment. It is lost to us. In doing so, we let go of the person we used to be. We inhale and breathe in the moment that is becoming. In doing so, we welcome the person we are becoming. We repeat the process. This is meditation. This is renewal. This is life.",
    "My mind, spirit and body feels so lifted I haven&#39;t felt this great in a long time 😊 ✌🏼"
  ],
  "channelSubscriberCount": 936000,
  "channelVideoCount": 586
}