{
  "video_id": "_nZ07OVtSmQ",
  "title": "Chair Cardio for Fat Loss: Seated No Impact Fitness Class",
  "description": "Burn calories and boost your metabolism with this Chair Cardio for Fat Loss: Seated No Impact Fitness Class! // Caroline Jordan // For more info: http://www.carolinejordanfitness.com/ \n\nDid you know that you can get a great calorie-burning chair workout sitting down? It’s true! Chair Cardio Workout routines are the latest health trend. You can work out at home and get amazing physical results all from the comfort of your seat. Ready to try it for yourself? Sit and get fit with this heart-pumping no-impact chair workout video for total fitness results.\n\nChair workouts are perfect if you have an injury, disability, limited mobility, or are just looking for a little exercise variety. Getting fit from a chair is low impact and appropriate for all ages.\n\nGet ready to jack, pinch, twist, and kick your way to a stronger self in this Chair Cardio for fat loss workout. Using moves designed to improve your posture, core strength, cardiovascular fitness and functional flexibility, this no-impact video offers an effective way to exercise sitting down. In just 20 minutes, you will challenge your heart, shape defined muscles, burn fat, boost your metabolism, and get a satisfying workout. This routine will move your body, work your muscles, and help you feel incredible.\n\nThis chair cardio for fat loss workout video is guaranteed to exercise your entire body and leave you feeling amazing. Ready to get sweaty? Grab a sturdy chair, press play on the video below, and join me!\n\n\n SUBSCRIBE TO CAROLINE’S YOUTUBE CHANNEL NOW\n👇👇👇👇\nhttps://bit.ly/3zIHqnS\n\n✨✨✨ CONNECT WITH CAROLINE ON SOCIAL MEDIA ✨✨✨ \nCaroline Jordan Blog: https://carolinejordanfitness.com/blog/\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: https://www.instagram.com/carolinejordanfitness/ \nTwitter: https://twitter.com/carolinefitness\nPinterest: https://www.pinterest.ph/carolinejordanfitness/ \nLinkedin: https://www.linkedin.com/in/carolinejordanfitness\n \n\n💪 TRAINING AND PROGRAMS 💻\nHURT FOOT FITNESS EXCLUSIVE COACHING PROGRAM: https://www.hurtfootfitness.com\nWORKOUT VIDEO LIBRARY: https://www.hurtfootfitness.com/workout-video-library\nHURT FOOT DIET GUIDE: https://www.hurtfootfitness.com/healingdiet \nSTRONG BODY PROGRAM: https://www.hurtfootfitness.com/strongbody\n\n🚀 HELP ME TO MAINTAIN AND GROW THIS CHANNEL 👍\nDONATE: https://www.paypal.me/CarolineJordanUS\n\n#C​arolineJordan #ChairCardio #FatLoss\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless Caroline Jordan Fitness its officers, employees, and contractors for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Caroline Jordan Fitness makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.\n\nRelated Searches:\nchair workout get fit in 20 minutes\nseated workout for weight loss\nseated cardio workout\ncaroline jordan chair cardio\n\n\nChair Cardio for Fat Loss: Seated No Impact Fitness Class\nTimestamps:\n00:00 Introduction\n00:37 Chair Cardio Workout Explained\n02:21 Apple Watch Setup\n02:42 Warm-Up: Shoulder Rolls\n03:25 Warm-Up: Arm Jumping Jacks\n04:09 Warm-Up: Side Body Reach\n04:51 Seated March\n06:15 Torso Twist\n06:53 Seated March\n07:25 Punch and Kick\n08:31 Seated March\n08:44 Jump Rope\n09:30 Seated March\n09:42 Cross Knee Crunch\n10:23 Seated March\n10:34 Boxing: Side to Side Punches\n11:38 Seated March\n11:44 Chair Jumping Jacks\n12:38 Seated March\n13:02 Side Body Reach and Stretch\n13:50 Seated March\n14:00 Side Body Reach and Stretch\n14:13 Seated March\n14:42 Seated Row with Heel Dig\n15:28 Seated March\n15:33 Boxing: Uppercut\n16:17 Seated March\n16:21 Chair Jumping Jacks and Chair Running\n17:26 Side Body Reach and Stretch\n17:54 Seated Row with Heel Dig\n18:19 Boxing: Side to Side Punches\n18:36 Chair Jumping Jacks\n18:50 Torso Twist\n19:13 Cool Down: Seated March\n19:25 Final Thoughts and Apple Watch Results\n21:28 Cool Down: Shoulder Rolls and Deep Breaths\n22:16 Closing",
  "channelTitle": "Caroline Jordan",
  "channelDescription": "Hello! I'm Caroline Jordan, a Certified Health and Fitness Coach here to help you heal, grow, and kick butt in life.  If you are looking for more energy, less stress, and a healthier mindset, you have come to the right place. I specialize in helping people find safe, effective ways to exercise. I am here to teach you how to use MOVEMENT AS MEDICINE for mental and physical well being. My mission is to help you develop a positive relationship to self and exercise that adds to the quality of your life. I can teach you how to drop the extremes, create lasting lifestyle change, and feel good in your skin. Through my Youtube channel you will learn how to challenge yourself in a healthy way and explore your full potential. Let’s get your mind, body, and spirit in great shape so you can love your life. \n\nBusiness Inquiries : Carolinejordan@gushcloud.com \nWebsite: http://www.carolinejordanfitness.com\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: @carolinejordanfitness",
  "tags": [
    "chair cardio for fat loss",
    "caroline jordan",
    "caroline jordan fitness",
    "chair workout",
    "seated workout",
    "chair exercises",
    "seated exercises",
    "caroline jordan chair cardio",
    "chair workouts",
    "chair workouts for beginners",
    "chair cardio",
    "chair workout for belly fat",
    "chair exercises for seniors",
    "seated workout for weight loss",
    "chair cardio exercises",
    "burn belly fat",
    "seated exercise",
    "seated cardio workout",
    "chair aerobics",
    "low impact workout",
    "chair exercise",
    "fat loss",
    "beginner workout"
  ],
  "publishedAt": "2019-11-25T14:00:08Z",
  "duration": 1443,
  "durationFormatted": "24:03",
  "viewCount": 1173315,
  "likeCount": 31664,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/_nZ07OVtSmQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/_nZ07OVtSmQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/_nZ07OVtSmQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/_nZ07OVtSmQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/_nZ07OVtSmQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/_nZ07OVtSmQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hi I’m 16 and 330 lb. In the Past two weeks I when from 343 to 331 just by eating less and walking a bit more. Now I’m 329 and my weight won’t seem to go down so I’m adding in cardio and hoping for the best. I could only do about 10-15 mins of this workout and burned almost 200 cals it was so good. I was crying because I was embarrassed that I’m 16 and this is the best I can do. But I know if I stick to it I could do some of your other workouts! For some reason I don’t sweat a lot even though my heart rate was at 130. Tips for my weightloss journey to 130lbs would be greatly appreciated. So many people tell me I can’t do it and that I need surgery, but I’m going to prove them wrong 200lb later! Thank you so much you motivate me 😊<br><br>Edit: I’m now 315lb (I almost gave up in May and gained some weight but then I changed myself and lost it plus more.)<br><br>Edit: I’m 299lbs. Since end of April I lost like 41lbs haha!<br><br>Edit 2: I’m 293 now I just want to thank everyone who has been so kind. 50lb down!<br><br>Edit 3: 288!☺️ and I turned 17 yay!",
    "i am 21. i have been basically sedentary for 3 years due to mental illness. so much so that my joints and back hurt similarly to my 75 y/o grandmother. this is my first step to taking back my life and honestly i was crying throughout due to how positive and uplifting this video was and made me feel. i honestly have hope for the first time in a long time.",
    "This wasn&#39;t just a chair workout, this was therapy.",
    "My plantar fasciitis is keeping me from my regular walks. I think I&#39;ll try this."
  ],
  "channelSubscriberCount": 669000,
  "channelVideoCount": 1095
}