{
  "video_id": "a-y3ZQV_iyo",
  "title": "Seated Cardio and Strength Workout With Dumbbells - 30 MIN No Impact Full Body Workout (INTENSE!)",
  "description": "Seated Cardio and Strength Workout With Dumbbells - 30 minute no impact total body workout or full body workout // Caroline Jordan // For more info about chair cardio workout, and strength workout with dumbbells exercises, and workout at home, head on to 👉 https://carolinejordanfitness.com\n\n🚀 HELP ME TO MAINTAIN AND GROW THIS CHANNEL 👍\nDONATE: Paypal: https://www.paypal.me/CarolineJordanUS \nVENMO: https://venmo.com/carolinejordanfitness\nPATREON: https://www.patreon.com/carolinejordanfitness \n\nIf you liked this video, please support the channel by hitting \"LIKE\" and the \"SUBSCRIBE\" button https://www.youtube.com/CarolineJordan?sub_confirmation=1. Your support helps fuel future content and a more powerful impact in the health of the planet\n\nAs always, please check with your doctor or physical therapist before starting this or any exercise routine. Honor your body and move mindfully. Remember to back off if something hurts, and skip any parts you feel you need to keep it safe.\n\nPositive Feel Good Fitness,\n-Caroline Jordan\n\n👇 SUBSCRIBE TO CAROLINE’S YOUTUBE CHANNEL NOW 👇\n https://www.youtube.com/CarolineJordan?sub_confirmation=1\n\n★☆★ CONNECT WITH CAROLINE ON SOCIAL MEDIA ★☆★\nYouTube: https://www.youtube.com/CarolineJordan?sub_confirmation=1\nCaroline Jordan Blog: https://carolinejordanfitness.com/blog/\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: https://www.instagram.com/carolinejordanfitness/\nTwitter:  https://twitter.com/carolinefitness\nLinkedin: https://www.linkedin.com/in/caroline-jordan-7531315b/\n\n💪 TRAINING AND PROGRAMS 💻\nHURT FOOT FITNESS EXCLUSIVE COACHING PROGRAM: https://www.hurtfootfitness.com\nWORKOUT VIDEO LIBRARY: https://www.hurtfootfitness.com/workout-video-library\nHURT FOOT DIET GUIDE: https://www.hurtfootfitness.com/healingdiet  \nSTRONG BODY PROGRAM: https://www.hurtfootfitness.com/strongbody\nDIABETES WEIGHT LOSS PROGRAM:  https://hurtfootfitness.com/diabetes-exercises-for-weight-loss-workout-program\nSCIATIC NERVE PAIN RELIEF PROGRAM: https://get-pain-relief-now.teachable.com/p/sciatic-nerve-pain-relief \n\n📖 E-BOOKS 📱\nHURT FOOT E-book: https://gumroad.com/l/HurtFootFitness \nHigh Hamstring Tendonitis E-book: https://gumroad.com/l/highhamstringtendonitis \n\n#C​arolineJordan #chairworkout #fullbodyworkout #cardioworkout  #totalbodyworkout #strengthworkout #dumbbells\n\nSeated Cardio and Strength Workout With Dumbbells - 30 MIN No Impact Full Body Workout (INTENSE!)\nhttps://youtu.be/a-y3ZQV_iyo\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless Caroline Jordan Fitness its officers, employees, and contractors for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Caroline Jordan Fitness makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk\n\n\n\nRelated Searches:\nseated total body cardio and strength workout\nseated moves that work your whole body\ntotal body workout with dumbbells\nworkout exercises at home for beginners\nbest fitness coach in the world\nno impact full body workout",
  "channelTitle": "Caroline Jordan",
  "channelDescription": "Hello! I'm Caroline Jordan, a Certified Health and Fitness Coach here to help you heal, grow, and kick butt in life.  If you are looking for more energy, less stress, and a healthier mindset, you have come to the right place. I specialize in helping people find safe, effective ways to exercise. I am here to teach you how to use MOVEMENT AS MEDICINE for mental and physical well being. My mission is to help you develop a positive relationship to self and exercise that adds to the quality of your life. I can teach you how to drop the extremes, create lasting lifestyle change, and feel good in your skin. Through my Youtube channel you will learn how to challenge yourself in a healthy way and explore your full potential. Let’s get your mind, body, and spirit in great shape so you can love your life. \n\nBusiness Inquiries : Carolinejordan@gushcloud.com \nWebsite: http://www.carolinejordanfitness.com\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: @carolinejordanfitness",
  "tags": [
    "Seated Cardio and Strength Workout With Dumbbells",
    "30 MIN No Impact Full Body Workout",
    "best workout from home",
    "best fitness coach in the world",
    "workout exercises at home for beginners",
    "tips and tricks for working out",
    "best fitness coach online",
    "best lifestyle coach online",
    "caroline jordan fitness",
    "caroline jordan",
    "seated total body cardio and strength workout",
    "seated moves that work your whole body",
    "total body workout with dumbbells",
    "no impact full body workout"
  ],
  "publishedAt": "2020-08-03T13:00:01Z",
  "duration": 1997,
  "durationFormatted": "33:17",
  "viewCount": 372689,
  "likeCount": 7765,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/a-y3ZQV_iyo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/a-y3ZQV_iyo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/a-y3ZQV_iyo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/a-y3ZQV_iyo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/a-y3ZQV_iyo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/a-y3ZQV_iyo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Get the best bang for your buck when you combine cardio and strength training in this seated 30 minute workout. This fitness video goes out by request for a Caroline Jordan Fitness Patreon Member. To become a Patreon and help this channel create MORE content for you, please visit: <a href=\"https://www.patreon.com/carolinejordanfitness\">https://www.patreon.com/carolinejordanfitness</a>  or donate at Paypal: <a href=\"https://www.paypal.me/CarolineJordanUS\">https://www.paypal.me/CarolineJordanUS</a> <br>Venmo : @carolinejordanfitness",
    "I am 76 and have been using utube for the last 2 months to do chair aerobics and chair yoga.  I have always been an advocate for exercise but my arthritis and sciatica have limited my routines. I always use my big screen TV because it is like you are in the room with me, but I can&#39;t  like or comment so I decided to take time and go on my laptop and comment on some of my most liked workouts.  I happened upon yours about a month ago and when I need a power workout your my gal!!!!!<br>I especially enjoy the cardio and strength workout with dumbbells!!!!!  Your  energy and positive attitude keep me going even when I might be getting tired.  Thanks, Caroline and keep up the great work",
    "This workout is NO JOKE, thank you Caroline! With my knee injury and inability to walk outside, these chair routines are a God&#39;s send!",
    "I recently fractured my ankle and was desperately looking for a workout to get me through the next month or so.  I first found your Pilates with a foot injury and LOVED IT.  Then found your chair cardio.  I. Am. So. Happy.  You are incredible.  I love your energy, you make me smile the entire time I am working out, your form reminders are perfect timing and all your encouragement means the world to me.  Thank you.",
    "<a href=\"https://www.youtube.com/watch?v=a-y3ZQV_iyo&amp;t=995\">16:35</a> &quot;Make sure those dumbbells are not by your feet.&quot; The reason I am here. Had a foot problem, started practicing walking barefoot, added dumbbells to my routine. Yep, I slammed my toe into the dumbbells one day. New foot problem. Not giving up my exercise, so glad you are here!"
  ],
  "channelSubscriberCount": 669000,
  "channelVideoCount": 1095
}