{
  "video_id": "A09dUG0vZmg",
  "title": "15 MIN FULL BODY PILATES WORKOUT | RA PILATES (at home, no equipment, mat pilates)",
  "description": "Hi everyone! \n\nGrab your mat and give this new 15 Min Full Body Pilates workout a try at home, at the gym, or on the go. This workout is Intermediate level, so feel free to pause and take breaks when needed, or repeat if you want an extra burn! No equipment needed, just a Pilates mat or soft surface. \n\nIf you like this workout and want to follow along with more guided Pilates classes like this, you can try out the RA Pilates app for free at rapilates.com! The app has Pilates workout challenges, progress tracking tools, recipe books, motivational group chat, and so much more to help support you and keep you motivated on your fitness + wellness journey! \n\nNeed a little extra support? Try RA Pilates 1:1 Personalized Training - receive all the benefits of the app, plus a fully customized plan tailored to your unique needs, designed to match your fitness level and target your goals, with ongoing personalized coaching and accountability through private chat with our expert team. Sign up today at rapilates.com!\n\nxx",
  "channelTitle": "Rachel Andrews",
  "channelDescription": "Hi! I’m Rachel, founder of RA Pilates. My goal is to help you make daily movement a habit through effective at-home Pilates workouts that give you real, sustainable results. Whether you’re just starting out or looking to take your fitness to the next level, RA Pilates is designed to help you build consistency, improve strength, and feel confident in your body. \n\nOn this channel, I share some of my long-form Pilates workouts designed to help you tone your body and support you on your wellness journey. For a deeper, more personalized experience, I created the RA Pilates app to offer structured, guided Pilates programs, personalized 1:1 training, progress tracking tools, nutrition, community, and more. The RA Pilates app is built to fit seamlessly into your daily life and guide you every step of the way.\n\nTry the app free today at www.rapilates.com \nRA Pilates | Guided Pilates Workouts \n",
  "tags": [
    "pilates",
    "home workout",
    "at home",
    "workout",
    "mat pilates",
    "full body",
    "low impact",
    "legs",
    "glutes",
    "arms",
    "core",
    "abs"
  ],
  "publishedAt": "2024-10-19T22:40:03Z",
  "duration": 892,
  "durationFormatted": "14:52",
  "viewCount": 49500,
  "likeCount": 865,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/A09dUG0vZmg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/A09dUG0vZmg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/A09dUG0vZmg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/A09dUG0vZmg/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/A09dUG0vZmg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "You make it so easy, my arms were dying 😭",
    "I noticed how out of shape I am 😅I was shaking everywhere. I will continue doing these work outs for a month straight. 2025! Let’s go. 4 months until summer",
    "This was so good but i took so many breaks. Today was so hard for some reason. I had no motivation and no strength.",
    "Hi Rachel! I just wanted to say how much I’ve been enjoying your workouts! They really feel like true Pilates, not just another basic ab workout that’s labeled as Pilates. I love the attention to detail and the full-body focus.<br><br>I have a question: Do you think doing the workout once a day, 4-5 times a week (with a calorie deficit and nutrition in check), would be effective for seeing results? Or would it be better to do it multiple times a day for better progress? I’d love to hear your thoughts! 😊",
    "omg this was so good!🔥"
  ],
  "channelSubscriberCount": 22300,
  "channelVideoCount": 305
}