{
  "video_id": "a4bQBXj0a0Y",
  "title": "10 Minute Guided Breathwork For Stress & Anxiety I Feel Calm and Focused",
  "description": "Discover the power of full, deep breathing with our 10 minute guided breathwork session, specially created to reduce stress and enhance focus. This technique, dirga pranayama, not only teaches you how to take full breaths for relaxation and mental clarity but also aids in improving lung capacity, making it beneficial for asthmatics and anyone looking to optimize their breathing technique. Ideal for beginners and experienced practitioners, this calming exercise is your gateway to mindfulness and a healthier, more focused mind.\n\nWant longer videos? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite & Newsletter\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBy engaging in longer and more intense sessions, breathers may access a deeper and more immersive state of self-discovery. This experience can lead to a greater level of insight, the emergence of new and enlightening thoughts, heightened awareness of one's emotional state, and improved clarity. If you are interested in diving further into your own being, longer sessions are available on my Patreon channel. https://www.patreon.com/breathewithsandy\n\nI personally make all aspects of creating this content, including the music, guided voice, and video editing. It brings me pleasure to create content that can benefit you, and my hope is that it can help you improve your life in various ways, such as fostering self-love and kindness, reducing stress and anxiety, decreasing inflammation, and increasing energy. Whatever improvements it may bring, I encourage you to take a moment to appreciate yourself for investing time in your personal growth\n\nSafety Disclaimer\nAll information provided by this channel is only for educational and entertainment purposes.  Breathe With Sandy LLC is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n#stressrelief #breathwork #anxietyrelief",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "stress relief",
    "breathing exercises",
    "morning meditation",
    "meditation for beginners",
    "relieve stress",
    "mindfulness meditation",
    "guided meditation",
    "anxiety relief breathing",
    "meditation for stress relief",
    "anxity relief breathing",
    "how to meditate for beginners",
    "how to relax",
    "stress relief music",
    "meditation for anxiety",
    "meditation techniques",
    "pranayama exercise",
    "stress relief meditation",
    "anxiety relief meditation"
  ],
  "publishedAt": "2024-03-25T16:00:07Z",
  "duration": 952,
  "durationFormatted": "15:52",
  "viewCount": 111063,
  "likeCount": 3217,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/a4bQBXj0a0Y/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/a4bQBXj0a0Y/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/a4bQBXj0a0Y/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/a4bQBXj0a0Y/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/a4bQBXj0a0Y/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/a4bQBXj0a0Y\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "My friend....MY FRIEND! You came through❣ I spoke with your spirit today, making a request for another type of breathwork. Seeing how this so magically appeared today, I&#39;m sure it&#39;s on the upcoming list. I&#39;m so excited and as always, grateful. I&#39;m gonna do this before bed when my tummy isn&#39;t full of kale and potatoes😅 Love you man, you made my inner child happy again. You&#39;re gonna be an awesome dad, congratulations 🎉 (I&#39;m sure you already are doing great❣)",
    "Hey man . I have sever ptsd and am prone to crazy panic attacks that put me in the hospital . Currently feeling one come but lately I throw this on and just focus on the now and you’ve honestly really helped my quality of life through a video which is crazy . Thanks man",
    "I have an essay thats due in two days which ive procastinated and left to the last minute because of my adhd :( My anxiety levels have been quite high these past few days and ive had this constant knot feeling in my stomach as well as this sensation of my throat closing up and finding it hard to breathe as a result. I decided to look up an emotional release meditation video as i was on the verge of tears and had been bottling up a lot of heavy emotions and knew it was time for a good emotional release session and letting go ritual. i stumbled across your guided breathwork for emotional release just now and decided to give it a go. Ive heard about the power of breathwork and have always found it fascinating but i just never really delved into it. I tried the emotional release video and this one and I am literally lost for words. I feel amazing. I feel recharged, rejunivated and full of positive energy. I feel lighter and i feel like i can actually breathe. The knot in my stomach has gone and I actually feel almost high which i didnt even think was possible!!!! like my head and my brain just feels so much ligher and i have so much more mental clarity now.  I burst into tears towards the end of the emotional release video and realised i had been holding onto a lot of stress and tension. Thankyou🤍I feel very connected to this channel and feel like the universe guided me here. Divine timing never fails to amaze me:) The plan was to do some work on the essay after a meditation video but its made me feel kinda sleepy, it is quite late anyway so i think im going to call it a night and get some mental rest and crack on it tomorrow. Thankyou again💞 Keep doing what you are doing, much love - kim🤍",
    "Just here for the Aaalllllllllrrriiight ! Jokes this is amazing. Thanks Sandy",
    "So happy I found your channel"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}