{
  "video_id": "AB3Y-4a3ZrU",
  "title": "30-Minute Yoga For Beginners | Start Yoga Here...",
  "description": "In this 30-minute session for beginners, we will work with breath and other foundational elements to set you up for a sustainable and beneficial practice you enjoy! Set to a good pace, we will focus on form and function to increase flexibility, build strength, and regulate the nervous system. Repeat this session with consistency and watch your breath and body transform. \n\nYoga is for everyone! The hardest part is showing up. \n\n\nThis class is perfect for all beginners or anyone wanting to move more slowly and mindfully. \n\n\nYou will move through breath work, poses for the spine, shoulders, and core, as well as standing poses such as warrior two, and more.\n\n\nThank you for allowing me to guide you through practice. Let me know how it goes for you in the comment section below!\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for beginners",
    "beginners yoga",
    "beginners yoga flow",
    "beginners yoga with adriene",
    "beginners yoga workout",
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "morning yoga",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne"
  ],
  "publishedAt": "2022-04-04T05:00:02Z",
  "duration": 2185,
  "durationFormatted": "36:25",
  "viewCount": 3222495,
  "likeCount": 45214,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/AB3Y-4a3ZrU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/AB3Y-4a3ZrU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/AB3Y-4a3ZrU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/AB3Y-4a3ZrU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/AB3Y-4a3ZrU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/AB3Y-4a3ZrU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I haven&#39;t practiced in a hot minute. I&#39;ve been needing this medicine, though I was worried about coming back to the mat. I wrote in my journal &quot;it&#39;s easier to distract myself than try and practice gratitude and be with my mind and body this way&quot;. It&#39;s easier before coming on the mat. Funny thing  is, when I got to the mat and followed this practice, it was easier to practice the gratitude and being present. Thank you, Adriene. As always, you&#39;re wonderful and you have me coming back.",
    "Took yoga classes at an expensive gym for 17 years with an instructor that trained under Baron Baptiste.  For the past two years, I have switched to a home practice, and that is how I found Adriene.  My practice is now very internal, no mirrors, no comparing myself to others, no yoga instructor complimenting only those that excel.  Love going slowly, mindfully, and constantly paying attention to how my body feels in the moment.  Love going back to a beginners practice and finding something new in the basics.  Would not be without a home practice at this point, that is how important and beneficial it has been to me—it also feels like therapy.  Thank you Adriene!",
    "Love the longer classes ❤️",
    "This is one of the most positive channel on YouTube...whenever you feel low or depressed or anxious just come and read the comments in any of Adriene&#39;s videos...you will feel elated...such a big family I have...only love and gratitude in heart  for you Adriene ❤",
    "I&#39;m the Vice President of the Kent State Figure Skating Team- we use your videos every week to practice yoga off-ice! Thanks for making these great videos! Love the content &lt;3"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}