{
  "video_id": "ACjyM2Mq-TQ",
  "title": "Guided Daily Breathwork Routine To Help Smile And Feel Joy I 3 Rounds",
  "description": "Want to deepen your practice? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite with T-Shirts and more:\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBIG thanks to this weeks Patreon supporters:\nMarc\nJulian\nKris\nNickolaus\nJan\nJake \nPaula\nKimberly\nEugenia \nDa fa\nChris\nZiad\nChris\nIdan\nJun\nLily\nKatie\nJack\nEzmeralda \nTerry\nBrent\n\nBy engaging in longer and more intense sessions, breathers may access a deeper and more immersive state of self-discovery. This experience can lead to a greater level of insight, the emergence of new and enlightening thoughts, heightened awareness of one's emotional state, and improved clarity. If you are interested in diving further into your own being, longer sessions are available on my Patreon channel.\n\nI personally make all aspects of creating this content, including the music, guided voice, and video editing. It brings me pleasure to create content that can benefit you, and my hope is that it can help you improve your life in various ways, such as fostering self-love and kindness, reducing stress and anxiety, decreasing inflammation, and increasing energy. Whatever improvements it may bring, I encourage you to take a moment to appreciate yourself for investing time in your personal growth.\n\nIncorporating regular Breathwork practice into your life can yield tangible benefits such as an improved immune system, reduced stress and inflammation, enhanced focus, increased energy, and more. My guidance and the rhythmic music can facilitate a deeper state of relaxation and bliss. For the full experience, it is recommended to wear headphones and find a quiet, comfortable environment.\n\nSafety Disclaimer\nAll information provided by this channel is only for educational and entertainment purposes.  Sandy is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n\n#breathwork  #wimhof   #pranayama \n00:00 Introduction\n01:07 Round 1\n06:23 Round 2\n11:54 Round 3\n18:00 Meditation",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "breathwork meditation",
    "guided breathwork meditation",
    "positivity meditation",
    "pranayama breathing",
    "yoga breathing exercises",
    "pranayama respiration",
    "guided wim hof breathing",
    "wim hof breathing",
    "wim hof breathing technique",
    "guided breathwork",
    "breathwork music",
    "anxiety relief music",
    "stress relief meditation",
    "happy breathing exercises",
    "energy breathwork",
    "energizing breathing exercises",
    "feel happy",
    "yoga breathe and flow",
    "boost immune system",
    "breathing",
    "breathwork"
  ],
  "publishedAt": "2023-06-19T15:00:06Z",
  "duration": 1254,
  "durationFormatted": "20:54",
  "viewCount": 140671,
  "likeCount": 3561,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ACjyM2Mq-TQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ACjyM2Mq-TQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ACjyM2Mq-TQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ACjyM2Mq-TQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ACjyM2Mq-TQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ACjyM2Mq-TQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I follow your practices every morning. I’m a person in recovery from being a homeless heroin addict to a homeowner, a Father a Husband and a Friend. Life presents challenges and opportunities to grow everyday. Although I fall short everyday, I start mine with your practices because it lets me know my Breath and Smile are always there for me, so I can never be alone, even in my darkest hour. Peace.",
    "I had a hypoxic birth and did not learn to breathe properly during my formative years. A doctor once told my mother that I breathe like a stressed out manager (and I was ten or so). I am so glad I stumbled upon your channel as you thought me that everyone can on her or his own volition do something to improve breathing and subsequently radiate positivity (and shed stuck trauma). Thank you, Sandy!",
    "In July last year I started breathing with Wim Hof every morning. A few months ago my friend recommended me your videos but I didn&#39;t check them out right away. I finally did it at the beginning of March and from that moment I&#39;ve stayed with you. Your breathing videos are a treasure... music, sounds, words, breathing techniques. I have a few favorites for morning breathing but this video is a masterpiece. I love watching what happens to my body when I finally turn off my mind. Thank you for what you do! Peace!",
    "Remember to breath and remember to laugh - it goes with me for the rest of the day. Thank you❤",
    "Love this class and the water is so pleasant! Thank you Sandy😊❤"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}