{
  "video_id": "aO1boUJhjvk",
  "title": "DAY 7 Back to Basics - 15 MIN FULL BODY STRETCH For Rest Day, Improve Mobility & Flexibility",
  "description": "Day 7 / 14-Day BACK TO BASICS CHALLENGE - Recover on your rest day with this 15 min Full Body Stretch. Take it slow for your body and mind so you're feeling fresh and recharged - ready for another new week of workouts! Enjoy every second of it Team!\n\n♡ SPECIAL YOUTUBE CHALLENGE OFFER: Sign Up for a 1 Month Free Trial for my GROW WITH ANNA APP: https://growwithanna.com/pages/youtube ♡ \n\n▸ Focus: Recovery & Mobility\n▸ Time: 15 Min\n▸ Equipment: No Equipment\n▸ Workout: 50 sec on, 10 sec off to change to the next stretch ♡ \n\nPlease remember that we are all different and that you can make this your own workout ♡ Take a longer break when you need to.\n\n♡ Sign up to the Team Grow Newsletter: https://manage.kmail-lists.com/subscriptions/subscribe?a=VLsDDa&g=WikyFT\n\n♡ Join the OFFICIAL TEAM GROW Community Group: https://www.facebook.com/groups/teamgrowsupport/\n\n \n\n♡ My @KorodrogerieDe  DISCOUNT CODE: GROW\n\n♡ My fitness watch:  @withings  \n\n♡ My Amazon Storefront: https://www.amazon.de/shop/growingannanas \n\n♡ The Gear I Use:\nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n♡ SUBSCRIBE: http://bit.ly/2QLvpXn\n♡ Instagram: http://bit.ly/2ZSdHFR\n♡ Facebook: http://bit.ly/2SVkgpE\n\n♡ My Music: Get Fix You by Coldplay and over 1M + mainstream tracks here https://go.lickd.co/Music License ID: nlYnJJa8YyB\nGet Let Me Down Slowly by Alec Benjamin and over 1M + mainstream tracks here https://go.lickd.co/Music License ID: be5VggXyB48\nhttps://www.epidemicsound.com/referral/gw5avz\n\n#growingannanas #growwithanna #homeworkouts #hiitworkout\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [],
  "publishedAt": "2023-09-10T01:00:11Z",
  "duration": 961,
  "durationFormatted": "16:01",
  "viewCount": 2726960,
  "likeCount": 41803,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/aO1boUJhjvk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/aO1boUJhjvk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/aO1boUJhjvk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/aO1boUJhjvk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/aO1boUJhjvk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/aO1boUJhjvk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Team, we’ve made it half way DAY 7 of 14 💪🏼 Give your body this stretch to recover and get ready for new workouts coming next week woohoo <a href=\"http://www.youtube.com/results?search_query=%23teamgrow\">#teamgrow</a> ❤❤❤",
    "I’m a 44 year old 6’1” 277lbs. male. I started stretching first thing every morning  about 3 weeks ago. I’ve used other videos until I found this one. I appreciate that there’s no dialog to tire of. I like the transition beeps, along with the image of what’s next and the time to get into position. I find it adequately challenging. I feel refreshed and ready for the day. Excellent video highly recommend!",
    "This is my absolute favorite stretch routine on the whole planet. After doing it I feel refreshed and my body is relieved.",
    "Slow rest days are just as important as the workouts. That’s when our muscles grow 💪🏼",
    "The auditory cues are a blessing. Tells me when i change stretches but also leave me enough time to look at what is next and see how she does it. The song choice is pop but calm ans perfect ans not too loud."
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}