{
  "video_id": "aufQbNxmBMg",
  "title": "30 MINUTE INTERMEDIATE CALISTHENICS WORKOUT at Home | Follow Along",
  "description": "This 30 minute intermediate calisthenics workout is a follow along you can do at home! In this bodyweight strength and mobility routine you'll work your entire body with a variety of exercises designed to challenge your strength and flexibility.\n\nLevel up your bodyweight training with this fully body workout that includes pistol squats, press up progressions, and more! I will guide you through the Calisthenics exercises, providing modifications to suit your fitness level, and technique tips making it suitable for beginners and intermediates. \n\nMEMBERS AREA/TPT STUDIO https://www.tompetotraining.com/members-area\nSUBSCRIBE @TomPetoTraining \n\nGET KITTED OUT\nUSA Thick Ab Mat https://amzn.to/3CDBvkk\nUK Thick Ab Mat https://amzn.to/3uE6wkA\n\nE-BOOK TRAINING PLANS https://www.tompetotraining.com/store\n\nINSTAGRAM https://www.instagram.com/tompetotraining/\n\nTimestamps\n00:00 Intro\n00:37 Calisthenics Routine\n\nDisclaimer\nTo join in these exercises, you must be in good physical health. If you’ve been told for any health or medical reason that you should not take part in physical activity/sport, then you should not take part in this workout. When participating in any physical exercise, there is a possibility of physical injury. If you engage in these exercises, you agree that you do so at your own risk and assume all risk of injury to yourself. \n\n#calisthenics #calisthenicsworkout \n\n*Affiliate links are included within this video description.",
  "channelTitle": "Tom Peto Training",
  "channelDescription": "Bringing 14+ years personal training experience to your home with follow along workouts to build a strong, athletic physique. \n\nNew videos weekly: Calisthenics / Dumbbell / Barbell / Kettlebell & more\n\nSUBSCRIBE to join with me on your home gym journey building amazing physiques and become part of the home gym community.\n\nBecome part of the TPT Virtual Studio for extra exclusive content & programs (Linked Below)\n",
  "tags": [
    "intermediate calisthenics",
    "30min",
    "follow along",
    "calisthenics workout",
    "home workout",
    "bodyweight",
    "strength and mobility",
    "routine",
    "bodyweight strength workout",
    "calisthenics",
    "calisenics",
    "calithenics",
    "calisthenics for beginners",
    "calisthenics routine",
    "bodyweight strength routine",
    "Calisthenics exercises",
    "suitable for beginners",
    "intermediate",
    "intermediate calisthenics skills",
    "intermediate calisthenics workout at home",
    "intermediate calisthenics workout",
    "intermediate calisthenics routine"
  ],
  "publishedAt": "2023-02-15T09:40:20Z",
  "duration": 1894,
  "durationFormatted": "31:34",
  "viewCount": 183548,
  "likeCount": 3793,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/aufQbNxmBMg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/aufQbNxmBMg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/aufQbNxmBMg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/aufQbNxmBMg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/aufQbNxmBMg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/aufQbNxmBMg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Doing your workouts for almost a year now and can clearly see the results. Been doing it in Guadalajara, Puerto Vallarta and CDMX, Mexico and Cologne, Munich and Berlin in Germany and in Malta and Paris, France. It truly travels the globe with me! Thanku for your great work!",
    "49 yr old. I do tai chi regularly, and I started doing other types of excercies recently again, because it is getting more and more important for me to keep muscle mass in this age, so I googled for some home workout plan. I wanted sg that doesn&#39;t require weights, because I started doing excercies with smaller, for-home-use dumbbells too and I was looking for a plan for the days when I don&#39;t use dumbbells and a plan that would work the deeper muscles better.<br>Your channel was among the first 10 hits, I clicked on you first. I have just finished this routine. <br>In my opinion I gained enough experience to form a judgment and I found your program just appropriate for my goals.  Thx!",
    "Woman, 43, Sweden here. Just starting with calisthenics and I love it!",
    "Spent 8 years in the United States Marine Corps. Got out and haven’t worked out since. Finally decided to get off my lazy ass and from behind my desk job and start doing some proper calisthenics. Gotta say, this is some PROPER Marine Corps stuff here. Thanks brother!",
    "First time I tried it just now. Out of breath. It is a solid workout. I feel strong yet challenged in every set. Big cheers from Sweden!"
  ],
  "channelSubscriberCount": 133000,
  "channelVideoCount": 401
}