{
  "video_id": "ausxoXBrmWs",
  "title": "10 Minute Guided Meditation for Focus",
  "description": "In this 10 min guided meditation, you'll use mindfulness and the focus on the breath to help increase your concentration and clairty for work, school, and general productivity. In 10 minutes, practice your attention to help clear the mind of distraction and gain laser like focus. This guided meditation is without music, and is voice only. \n\nhttps://declutterthemind.com",
  "channelTitle": "Declutter The Mind",
  "channelDescription": "Declutter The Mind is for the beginner, novice, and experienced meditator. \n\nIt’s where people who want to clear, declutter and understand their minds come.\n\nIf you want to understand the mind, sit down and observe it. My goal is to help you observe it (much more easily and effectively) with guided meditations for mindfulness, anxiety, stress, focus, sleep deprivation, insomnia, depression and more.\n\nThis channel hopes to help you meditate without the “woo woo” or any religious undertones. I want meditation to be viewed as and used as a practical tool for anyone.\n\nI understand and want to show that meditation is not a magic pill, it’s a practice. \n\nThe benefits of introspection, meditation, philosophy, and self-reflection come with regular practice and it requires time, patience and consistency.\n\nAll of the guided meditation sessions are unique, and made by a 14+ year practitioner of mindfulness meditation. So enjoy! Be sure to leave a like/comment and subscribe.",
  "tags": [
    "meditation",
    "mindful meditation",
    "mindfulness meditation",
    "guided meditation",
    "guided meditation for focus",
    "guided meditation for focus and concentration",
    "guided meditation for focus and productivity",
    "guided meditation for focus and clarity",
    "guided meditation for work focus",
    "guided meditation for focus on breathing",
    "mindfulness meditation for focus",
    "10 minute meditation for focus",
    "10 minute guided meditation for focus"
  ],
  "publishedAt": "2019-02-16T04:11:20Z",
  "duration": 641,
  "durationFormatted": "10:41",
  "viewCount": 1614267,
  "likeCount": 50433,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ausxoXBrmWs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ausxoXBrmWs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ausxoXBrmWs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ausxoXBrmWs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ausxoXBrmWs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ausxoXBrmWs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thanks for taking the time to sit. If you liked the practice, we have much more on the channel so please subscribe. We also have guided meditation courses on the channel for members, including a 10-day Focus Course. Join here: <a href=\"https://www.youtube.com/channel/UC2ZvMgbK5X8j-nCY5CR06xw/join\">https://www.youtube.com/channel/UC2ZvMgbK5X8j-nCY5CR06xw/join</a>",
    "I love this session because the speaker understands the exact attention span of the user. The moment my mind wanders, the speaker tells that it’s normal but bring it back to the breathing. Love the understanding and the synchronisation with the audiences’ mind. Thankyou.",
    "When he says, &quot;release all focus&quot;, and I haven&#39;t been focusing, so I start focusing 👍",
    "I felt so guilty every time I was called out because every single time my mind was wandering. Then he told me not to judge those thoughts because judging is thinking. Well goddamn.",
    "They ask me to leave a comment, I leave a comment. They absolutely deserve every thing needed to support their channel. They are good people. PERIOD."
  ],
  "channelSubscriberCount": 158000,
  "channelVideoCount": 504
}