{
  "video_id": "b1H3xO3x_Js",
  "title": "Full Body Flow  |  20-Minute Yoga Practice",
  "description": "Set an intention and get ready to get the juices flowing in this fun and supportive 19 minute Full Body Yoga Flow.\n\nGive every area of the body some love while cultivating heat to build total body strength and increase mobility.\n\nSynchronize the breath with movement and flow with energy and ease to create a moving meditation. Welcome a feeling of vitality and balance back into your inner world.\n\nLet me know how this practice goes for you in the comment section down below!\n\nNamaste.\n\nFor more videos like this, try this Yoga Flows playlist:\nhttps://www.youtube.com/playlist?list=PLui6Eyny-UzzyYOtKfMfLl0h94mjsUKv9\n\n\n#yogawithadriene   #freeyoga   #fwfg\n  \n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "free yoga videos",
    "yoga at home",
    "morning yoga",
    "home yoga practice",
    "30 days of yoga",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga",
    "full body yoga",
    "20 minute yoga",
    "20 minute yoga practice"
  ],
  "publishedAt": "2019-11-24T06:00:03Z",
  "duration": 1158,
  "durationFormatted": "19:18",
  "viewCount": 15456085,
  "likeCount": 138115,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/b1H3xO3x_Js/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/b1H3xO3x_Js/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/b1H3xO3x_Js/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/b1H3xO3x_Js/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/b1H3xO3x_Js/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/b1H3xO3x_Js\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Appreciate where you are.<br>Today.<br>Follow this inner voice and I do believe you will learn to appreciate all of your relationships with more sincerity and love.",
    "Omg I almost did it you guys. I started in January and am obese and struggle a lot, a lot of modifications. I almost managed this one without dropping the knee during those 3 legged dogs. Soooo close. I can feel myself getting stronger!",
    "I just spent the best 20 minutes of my life. I have been doing YWA every day since last July. I am 76 and loving my progress. Thank you A. I wake up and say to myself Yes YWA!",
    "Adriene, I just wanted to say thanks so much for never putting ads in the middle for people like me who don’t have YouTube premium. It keeps the quality of your videos high and doesn’t break the focus of all of us who are practicing. 💗💗",
    "I love that whenever Adriene says to whisper “I am strong”, she does it too. Makes me feel like we’re in it together and she’s not “above” us or anything! &lt;3"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}