{
  "video_id": "Ba3qZjzPonI",
  "title": "Low impact, high intensity intermediate home cardio workout",
  "description": "https://teambodyproject.com\n\nFor more workouts like this, come and join us. New workouts weekly - over 300 workouts and multiple plans with the Body Project team. \n\nTurbo 20's is a challenging and fun 30 minute cardio workout. Low impact makes it great for the joints - but the workout is still challenging.",
  "channelTitle": "Body Project",
  "channelDescription": "High energy, motivating workouts to do from home. \n\nWe created Team Body Project to share our passion for exercise and excellent movement with others who want to feel good about their body and experience great health.\n\nhttps://teambodyproject.com\n\nOur holistic exercise programme includes HIIT cardio, resistance training, pilates and yoga.",
  "tags": [
    "body project",
    "team body project",
    "low impact",
    "cardio",
    "daniel bartlett",
    "home exercise",
    "lose weight",
    "burn fat",
    "home workout",
    "exercise from home"
  ],
  "publishedAt": "2020-03-10T22:14:02Z",
  "duration": 1898,
  "durationFormatted": "31:38",
  "viewCount": 9668173,
  "likeCount": 75038,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Ba3qZjzPonI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Ba3qZjzPonI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Ba3qZjzPonI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Ba3qZjzPonI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Ba3qZjzPonI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Ba3qZjzPonI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Can we please take a moment and appreciate the fact that this man excercises and talks non stop and secondly he&#39;s an amazing trainer? He doesn&#39;t just point out how easy this workout is. He mentions we should pause whenever we need it and he keeps encouraging! Amazing person! So positive! Stay safe man!",
    "I’m starting my weight loss journey, probably for the 1,000 time. It took me 3 days to get through whole video. I felt so encouraged throughout the whole video. When I finished my 30 mins I got so emotional because I made it! I started looking at other videos and it is truly my speed for my life style. Thanks for all the encouragement and for keeping it real!",
    "Tonight I was a bit depressed about having pcos and not being able to lose weight,I was about to go get some fast food and emotionally eat but I decided to exercise instead I don&#39;t regret my decision,thank you for being that motivation I cried with the end song and I feel great now.",
    "He&#39;s tired and breathes hard, other instructors will be like &quot;Wow my heart has stopped beating and my muscles are torn but I LOOOOVE IT&quot;.  I love how realistic the instructor is.",
    "real people, real emotions and limitations, god this is nice when your instructor gets tired too. <br>These type of exercises is what we need in these times, self isolation is time for self development"
  ],
  "channelSubscriberCount": 2420000,
  "channelVideoCount": 65
}