{
  "video_id": "BdTzZuwGEOw",
  "title": "20 Min Yoga Flow for Beginners",
  "description": "This is a 20 min yoga sequence that's best for people who are new to yoga. It's a flow sequence, but slowly than your traditional vinyasa. \n\nIf you love this and want it on your device for when you travel or don't have internet, it's available for download for less than the cost of a latte. More here: http://www.yogabycandace.com/dvds\n\nFor more, visit: \nwebsite: http://www.yogabycandace.com\ninstagram: http://www.instagram.com/yogabycandace\nfacebook: http://www.facebook.com/yogabycandace\ntwitter: http://www.twitter.com/yogabycandace\nyoga forum: http://www.forum.yogabycandace.com",
  "channelTitle": "Candace Cabrera ",
  "channelDescription": "Candace is the best-selling author of Namaslay®, available at Barnes and Noble and on Amazon. She is an international yoga instructor, celebrity personal trainer and the writer behind the popular yoga lifestyle blog http://www.yogabycandace.com. She owns a personal training and yoga studio in Ridgefield, CT called Intention Factor: www.intentionfactor.com. She leads international wellness retreats all over the world, and brings the community together with her online Posture, Glute, Fitness and Cycle Workout Programming. Her YT vids range from 15 min to 60 min, and cover a wide variety of themes.  Some of the content you find here is available for purchase at https://Gumroad.com/yogabycandace.\n\n\nJoin comprehensive online programming: https://intentionfactor.com/memberships-online-classes\nJoin a retreat or become a personal training client: https://intentionfactor.com/personal-training-yoga-ridgefield-ct\n",
  "tags": [
    "yoga",
    "asana",
    "yoga class",
    "yogabycandace",
    "yoga video",
    "yoga for beginners",
    "20 minute yoga",
    "20 minute yoga for beginners",
    "vinyasa for beginners",
    "exercise",
    "weight loss",
    "fitness",
    "health",
    "free yoga class",
    "full yoga",
    "full yoga class",
    "yoga by candace",
    "power yoga",
    "power yoga for beginners",
    "beginner yoga",
    "yoga for beginning students"
  ],
  "publishedAt": "2014-06-06T22:10:29Z",
  "duration": 1207,
  "durationFormatted": "20:07",
  "viewCount": 872028,
  "likeCount": 8398,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/BdTzZuwGEOw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/BdTzZuwGEOw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/BdTzZuwGEOw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/BdTzZuwGEOw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/BdTzZuwGEOw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/BdTzZuwGEOw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Every time I do yoga for the first time in a long time, tears start welling up in my eyes. It makes me speculate about how little time I give to myself and that makes me sad. Thanks for sharing.",
    "When people say mean things to or about you, it’s not about you. It’s almost always about them and their insecurities. Sometimes we want to take things a little personally, because it means that we’re important. But truth be told, people are mostly thinking about themselves. And they don’t care about us as much as we’d like to think they do. For me, this was the best realization. People don’t remember what you wore or said nearly as much as you think about it. Let’s stop obsessing and taking ourselves so seriously.",
    "thank you so much, i am 16(male) and have been having sleeping problems and this has helped me get to sleep faster",
    "this was the video I chose for my very first practice. I felt so amazing afterwards I&#39;ve done yoga every morning since. This video is perfect for those who have never stepped on a mat. Thank you Candace! &lt;3",
    "My wife and I have been doing yoga for about 2 weeks now. Just following whatever 20 minute video we can after the kids go to bed. This is the first video we both actually like!<br>We&#39;ll definitely be back for more of this one :)"
  ],
  "channelSubscriberCount": 303000,
  "channelVideoCount": 722
}