{
  "video_id": "BfP_ub8MHbc",
  "title": "5 Minute Full Body Yoga | QUICK & EASY",
  "description": "Hey, ya'll! Today's video is a 5 MINUTE FULL BODY YOGA practice. This is a short & fairly simple practice that you can do DAILY, whenever you have a few minutes to spare.  Be sure to listen to your body & modify as needed. Come out of any postures that don't feel right & take rests if you need to. Let me know what you think of this video in the comments.  Check out the links below for Black Yogi Nico Marie merch & my DJ channel. Don't forget to LIKE, SHARE, & SUBSCRIBE! Thank you for watching! PEACE & LOVE!\n-\nSHOP THE MERCH!\nhttps://blackyoginicomarie.myshopify.com/\n-\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCXaGUPPCzPj0_BSR9kHSqxg/join\n-\nFollow me!\nIG: https://www.instagram.com/yogawithnico/\nFB: https://www.facebook.com/yogawithnico/\nTwitter: https://twitter.com/yogawithnico\nTikTok: https://www.tiktok.com/@djnicomarie\n-\nDisclosure: The links below are affiliate links. This means that, at zero cost to you, I will earn an affiliate commission if you click through the link and finalize a purchase:\n\nYoga blocks: https://amzn.to/3hy0fBz \nMy yoga mat I use now: https://amzn.to/3jindho\nTripod for my iPhone: https://amzn.to/3h6gC6R\nLighting (no longer on Amazon, but here’s one just like it):\nhttps://amzn.to/3hd7ZYf\nWireless Mic (UPDATED): https://amzn.to/3QjKcGN\n-\n💛💛DONATE💛💛\n\nPlease don’t feel pressure to donate & only do so if you choose. Your donations  contribute to me being compensated for the work I do on YouTube, which helps to keep this channel alive & well. \n\nCash App/Venmo at $djnicomarie/@djnicomarie. Thank you for your generosity!\n-\nMusic:\nMer-Ka-Ba - Jesse Gallagher\n-\nLike, share, subscribe. Let me know what other kinds of videos you'd like to see. Peace. Love. Namaste \n✌🏽💛\n-\nDISCLAIMER: \n\nAs with all physical activity, yoga included, it is important to listen to your body at all times and never exceed the sensation of just a light stretch. If you feel pain or extreme discomfort, do not do the yoga pose, movement, or stretch and come to something that is accessible & comfortable for you. Always consult your doctor about any physical activity.\n\nBlack Yogi Nico Marie/Yoga with Nico recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program, including yoga. When online, it is up to the individual to assess whether they are ready for the class that they have chosen. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself. Black Yogi Nico Marie/Yoga with Nico assumes no responsibility for injuries suffered while practicing these techniques. The techniques and suggestions presented in this website are not intended to substitute for proper medical advice.\n\nPlease meditate when you can safely relax (not while driving or operating heavy machinery). General meditation practices are not a replacement for, or a form of therapy. They are not intended to cure, treat, or diagnose medical conditions. Meditation can, however, be a component of an overall treatment plan, when monitored by a healthcare professional.\n\nAll opinions in this video are my own and not sponsored by any company. It is for educational and informational purposes only. If you choose to purchase the products reviewed, you are doing so at your own risk.  Use your own judgment and due diligence before implementing any idea, suggestion, or recommendation from Black Yogi Nico Marie/Yoga with Nico.\n\n#yoga #yogaeveryday #yogaforbeginners #beginneryoga #blackyoutubers #blackyoutube #blackyoutuber #blackyoga   #blackyogainstructor #blackwomen #blackyogi #blackyogis #yogawithnico\n\nBlack yoga yogi vinyasa black woman teacher instructor exercise yoga self care self love",
  "channelTitle": "Black Yogi Nico Marie",
  "channelDescription": "Hey ya'll! Thank you for taking the time to check out my channel.  My core mission is to create a space for my community to receive the health & healing benefits of yoga!  Video content mostly consists of a variety of yoga practices ranging from Vinyasa to Yin.  I hope you enjoy my channel & don't forget to hit the SUBSCRIBE button which helps me out a great deal.  I look forward to creating more content for you! PEACE & LOVE. ",
  "tags": [],
  "publishedAt": "2023-07-24T14:00:07Z",
  "duration": 389,
  "durationFormatted": "6:29",
  "viewCount": 33733,
  "likeCount": 1820,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/BfP_ub8MHbc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/BfP_ub8MHbc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/BfP_ub8MHbc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/BfP_ub8MHbc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/BfP_ub8MHbc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/BfP_ub8MHbc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Ive been going through very hard times mourning the loss of my mother and its been hard for me to want to do self care again- this gave me motivation for the first time in weeks ❤ thank you very much",
    "yess quick little yoga session before bed",
    "This was absolutely perfect. I was running behind schedule but , didn’t want to miss yoga this morning ! Thank you 🙏🏽",
    "Very busy fun day this was  just what I needed.",
    "Thank you for such clear instructions! I can do your class with just listening!"
  ],
  "channelSubscriberCount": 198000,
  "channelVideoCount": 994
}