{
  "video_id": "bfwIZA3FN70",
  "title": "Lower Back Pain Relief Exercises for Pregnancy - Physio Guided Home Routine",
  "description": "Physiotherapist guided lower back pain relief exercises for all stages of pregnancy. Relieve back muscle tightness and discomfort with these pregnancy exercises for your lower and middle back. Physio Michelle from https://www.pelvicexercises.com.au guides you through this gentle home exercise routine with no equipment required. \n\nPlease note that these exercises are not appropriate for pregnant women with lower back disc injury.\n\nThis lower back home exercise routine for pregnancy consists of a series of gently lower and middle back spinal mobility exercises.This routine is performed kneeling on all fours and in side lying. The exercises are appropriate for all stages of pregnancy including the last trimester as they do not involve lying on the back, a position which should be avoided for pregnancy exercises from 16 weeks onwards. All the included exercises provide gentle movement for the muscles and joints of the middle and lower back.\n\nThe stretching and mobility exercises in this video include:\n- Pelvic tilts\n- Reaching thoracic rotation\n- Kneeling side lower back stretches\n- Kneeling lower back and buttock stretches\n- Kneeling lunge stretches\n- Side lying lower and middle back rotation stretches\n\nTranscribe video: http://www.youtube.com/timedtext_video?ref=share&v=bfwIZA3FN70\n\nAmerican College of Obstetrics and Gynecology Exercise Guidelines\n\nWomen with the following conditions or pregnancy complications should not exercise during pregnancy:\n- Certain types of heart and lung diseases\n- Cervical insufficiency \n- Being pregnant with twins or triplets (or more) with risk factors for preterm labor\n- Placenta previa after 26 weeks of pregnancy\n- Preterm labor or ruptured membranes (your water has broken) during this pregnancy regular physical activity\n- Preeclampsia or pregnancy-induced high blood pressure\n- Severe anemia\n\nWhat are warning signs to stop exercise during pregnancy?\nWatch for the following warning signs when you exercise. If you have any of them, stop and call your obstetrician:\n\n- Bleeding from the vagina\n- Feeling dizzy or faint\n- Shortness of breath before starting exercise\n- Chest pain\n- Headache\n- Muscle weakness\n- Calf pain or swelling\n- Regular, painful contractions of the uterus\n- Fluid gushing or leaking from the vagina\n\nReference:\nhttps://www.acog.org/patients/FAQs/Exercise-During-Pregnancy\n\nMusic by Aiden Kenway: https://www.youtube.com/channel/UCEeJ... \n–––––––––––––––––––––––––––––– \nDisclaimer The information provided in this video is intended as general information and not a substitute for individual medical advice regarding your medical condition. To the extent permitted by law, neither Healthy Fit Solutions Pty Ltd, as trustee for the P & M Kenway Family Trust (“we”), nor any of our officers, employees, agents or related bodies corporate will be liable in any way (including for negligence) for any loss, damage, costs or expenses suffered by you or claims made against you through your use of, or in connection with, this video or information supplied or offered to be supplied on this video. Although we use our best efforts to provide accurate information and other materials on this video, the video is provided “as-is”. To the extent permitted by law, all warranties, conditions and representations provided about or by this video are excluded. \n\nLights by Sappheiros https://soundcloud.com/sappheirosmusic Creative Commons — Attribution 3.0 Unported — CC BY 3.0 Free Download / Stream: https://bit.ly/LightsSappheiros",
  "channelTitle": "Michelle Kenway",
  "channelDescription": "Welcome to Michelle Kenway's Physiotherapy and Safe Exercise Channel! As a highly experienced physiotherapist, I specialize in pelvic floor health and helping you achieve your health and wellness goals. By subscribing and clicking the notifications bell, you'll receive a new video every week filled with valuable exercises and information to improve your wellbeing.\n\nMy channel is perfect for beginners, individuals recovering from injuries or illnesses, and those challenged by chronic health problems such as neck and back pain, and poor core control. You'll also find a wealth of Pelvic Floor Physiotherapy exercises and information videos to help with pelvic floor strengthening, prolapse management, pelvic pain, bowel problems, and constipation.\n\nVisit https://www.pelvicexercises.com.au for even more resources, including pelvic exercise videos, safe exercise books, and videos to download. Join me on your health, fitness, and recovery journey!\n",
  "tags": [
    "lower back pain pregnancy",
    "pregnancy exercises",
    "lower back pain stretches",
    "pregnancy back pain relief",
    "back pain pregnancy",
    "pain pregnancy",
    "upper back pain pregnancy",
    "physical therapy",
    "physiotherapy",
    "pregnancy",
    "antenatal exercises",
    "back exercises",
    "back stretches"
  ],
  "publishedAt": "2020-03-07T02:00:34Z",
  "duration": 527,
  "durationFormatted": "8:47",
  "viewCount": 259649,
  "likeCount": 3248,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/bfwIZA3FN70/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/bfwIZA3FN70/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/bfwIZA3FN70/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/bfwIZA3FN70/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/bfwIZA3FN70/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/bfwIZA3FN70\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I am in month 7 and for the last 2 weeks my back bones and muscles ache so bad. I cant even walk most of the time. I hope this will help.<br>Edit; this worked like magic. I did the exercises and slept. The next day my pain went away slowly and now I did it again. I feel sooo good. I have no pain or discomfort at all. I will keep doing these until birth. Thanks !!!",
    "Dear Michelle, thank you for this excersize. I&#39;m in my 3rd trimester and my back started killing me. Everyone told me that back pain is &quot;normal&quot; for this pregnancy phase, but I found this video, and I was practicing these excersizes twice a day, in combination with a lot of walking and it did a real magic for me. Thank you once again. Greetings from Croatia!",
    "My lower back has been killing me for more than 2 weeks now. I feel so much better after doing this.",
    "I’m four months in and growin fast my back pain was gettin bad! Did this and I haven’t felt so good since I started gettin big! 🧘‍♀️😌",
    "Oh my word! I feel like “where has this video been all my life, let alone during pregnancy!” Such an awesome stretch... Oh my goodness I feel so relaxed and calm and in control of my body (as in not a victim to pain) ... I could cry of relief! Thank you so much for this video ♥️♥️♥️"
  ],
  "channelSubscriberCount": 911000,
  "channelVideoCount": 306
}