{
  "video_id": "bIE0byxi6rk",
  "title": "*NEW* Insane 20 Minute Elliptical Workout - HIIT Workout",
  "description": "Dr. Kevin from abundantyou.com gives you another follow-along NEW insane 20 minute HIIT workout using an elliptical. This elliptical workout will push your to your MAXIMUM.  #EllipticalWorkout #HIITWorkout #Elliptical\n\nAn elliptical workout machine with handles is one of the few cardio machines that can provide you with both an upper- and lower-body workout. The key to maximizing the upper-body benefits is to distribute your weight and resistance evenly by pumping your arms just as fast as you’re moving your legs.\n\nThe elliptical is known for putting less stress on your joints. Studies show that it can significantly reduce weight bearing compared to running, jogging, and similar workouts. This means its the perfect choice to continue training your body without the wear and tear that comes with high-impact exercises. I love working out on an elliptical machine!\n\nMost people use an elliptical to get their steady-state cardio workouts in. I however, recommend it for more high-intensity interval training like this workout I provided! This will maximize the fat burning effects in a shorter amount of time.\n\nPlease feel free to increase your elliptical resistance or incline, to target specific leg muscles and make your HIIT workout more challenging. The higher the pitch the more butt activation you will get. I recommend increasing the pitch as the rounds move forward. \n\nRemember, HIIT workouts and elliptical workout machines are amazing for you fitness and health! However, they should not be overused and be the only exercises you do. You need different muscle activation, progressive load changes, and variations with all your workout routines.  #EllipticalWorkout #Elliptical #HIITWorkout\n\nI recommend to perform a 10-30 minute HIIT workout 2-3 times a week, with 24 hour rest in between HIIT workouts, in addition to other variety of fitness activities like weight-training.  \n\nThis NEW elliptical workout video is 20  minutes of sprint training, going as hard as you can for 8 rounds of 30 seconds, spaced with 90 seconds of low intensity. It's important to catch your breath FULLY before each round so you can really push it to the max!\n\n-- LINKS --\n📕  Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕\n►https://www.abundantyou.com/7-hiit-secrets-ebook/\nYou'll learn how to make your HIIT workout more effective towards weight loss and avoid the common mistakes people when doing HIIT workouts!\n\nTo learn more visit:\nhttps://www.abundantyouchiro.com/ - Holistic Wellness Center Columbus, Ohio\nhttps://abundantyou.com/ - Natural Health Made Easy Blog\nhttps://askdrkevin.com/ - Ask Dr. Kevin a question!\n\n\nWe start the ALL elliptical workouts with a 5 minute warm-up and finish with a 3 minute cool-down. Please make sure you do both to reduce risk or injury!",
  "channelTitle": "AbundantYou with Dr Kevin",
  "channelDescription": "Abundant You is a natural health website dedicated to all aspect of health and wellness as it relates to you! Helping people accomplish higher overall health and better well-being.\n\nOur YouTube channel is a great shortcut to stay connected with us and help others online! The Abundant You team will upload new natural health made easy videos, natural  articles, workouts and of course delicious recipes!\n\nPlease subscribe and share our channel!  Let's make a positive impact in the natural health & wellness community! \n\nFeel free to leave constructive comments or ask questions! We appreciate you, thanks for watching. You can learn more about our natural health made easy website by visiting https://www.abundantyou.com/\n\nP.S. Do you live around Columbus Ohio? Or know someone that does? We have a natural holistic wellness center you can visit and get personal 1 on 1 help to reach your specific health goals. You can learn more about our clinic at https://abundantyouchiro.com/",
  "tags": [
    "Elliptical workout",
    "Elliptical Trainer",
    "HIIT Workout",
    "fat loss",
    "interval training",
    "20 minute workout",
    "20 min elliptical workout",
    "hiit elliptical workout",
    "elliptical workout weight loss"
  ],
  "publishedAt": "2020-01-24T17:00:10Z",
  "duration": 1416,
  "durationFormatted": "23:36",
  "viewCount": 439864,
  "likeCount": 6753,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/bIE0byxi6rk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/bIE0byxi6rk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/bIE0byxi6rk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/bIE0byxi6rk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/bIE0byxi6rk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/bIE0byxi6rk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "✅ Don&#39;t forget to hit the LIKE button and SUBSCRIBE 👍\r<br>📕 Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕 ►<a href=\"https://www.abundantyou.com/7-hiit-secrets-ebook/\">https://www.abundantyou.com/7-hiit-secrets-ebook/</a>",
    "I love your workouts!!! With this, eating nutritiously and make all efforts to get good sleep, I have lost 30 lbs in 4 months :)",
    "I don&#39;t usually post ever. <br>But I want to thank you Sir!<br>This workout has changed my life, I was 326lbs a year ago. I started eating better as a lost 25lbs. Then about 6 months ago started the 15 min cardio, this 2 months ago I moved to 20 min.  I&#39;m down from 3oolbs to 260! <br>Thank you Dr for doing what you do. Wish me luck on the 30 min hit, I will start next week!",
    "Hey thank you for helping me workout 3 times a week. I spend my morning with you every other day.  I feel a lot better because of it. Now if I would just cut my carbs more, I&#39;d probably be able to loose a little more weight. I was 215 a month ago and now I am right around 200. I need to make it down to 180-175. <br>Thank you again.",
    "Thank you for posting this workout ! I got sensational results: I have been doing it during quarantine for 2 months now and I have lost 10 kgs. Of course my diet is clean but this workout definitely made a huge difference. Thank you!🙏🏻"
  ],
  "channelSubscriberCount": 58900,
  "channelVideoCount": 45
}