{
  "video_id": "bMzqgA8c6nQ",
  "title": "20 Minute Chakra Balance & Cleansing Guided Meditation",
  "description": "This meditation guides you through each chakra point to release stagnant energy and restore balance.  By dedicating a mere 20 minutes to this practice, you invest in your holistic well-being, promoting physical, emotional, and spiritual equilibrium.  Allow the soothing guidance to cleanse and align your chakras, rejuvenating your energy centers and leaving you with a profound sense of clarity.  Embrace this opportunity to reconnect with your inner self, revitalizing your spirit and promoting a harmonious balance in your daily life.  This is an Original 20 minute guided  meditation recorded by us.  \n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "20 minute meditation",
    "20 minute guided meditation",
    "20 minute chakra balance",
    "guided meditation 20 minutes",
    "chakra",
    "chakra balance",
    "chakra cleansing",
    "chakra healing",
    "chakra energy",
    "guided meditation chakra",
    "guided meditation chakra balance",
    "guided meditaiton chakra balancing cleansing"
  ],
  "publishedAt": "2024-01-17T10:00:28Z",
  "duration": 1210,
  "durationFormatted": "20:10",
  "viewCount": 305979,
  "likeCount": 6294,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/bMzqgA8c6nQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/bMzqgA8c6nQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/bMzqgA8c6nQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/bMzqgA8c6nQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/bMzqgA8c6nQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/bMzqgA8c6nQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Love this peaceful calming meditation. Your voice is so special and I’ve been listening to you for many years and do not know your name. I hear other voices are some of them but yours to me is the calmest. Thank you, blessings.❤️❤️❤️",
    "All you’re meditations are sooooo Devine.. they help still the mind and bring peace instantly. I have such gratitude for the way you’re helping world right now. Thank you 🌿🙏🏼",
    "I’m so grateful meditation exists and it’s something we can do",
    "I can’t believe how well this was put together. You truly mastered the art of storytelling!",
    "I love Chakra meditations! They always remind me to go back to the basics 🙏🏽😌🌈"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}