{
  "video_id": "BPK9WNtpBgk",
  "title": "Yoga To Feel Your Best  |  22-Minute Home Yoga",
  "description": "Hop on the mat for this 22-minute yoga session designed to help you feel good! Stretch your body, tap into conscious breath, and get your endorphins kicking!\n\nNo perfect scenario or prerequisite is necessary for this session. Meet yourself wherever you are and embrace it!\n\nLooking and feeling our best sometimes requires checking in on our thoughts about how we see ourselves and how we work with our bodies. Experiment with these poses and find what works for you so that you can step into the rest of your day embodying your best self.\n\nLet us know how you are feeling and where you are practicing today in the comment section down below!\n\nNamaste.\n\n#yogawithadriene   #freeyoga   #fwfg\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "free yoga videos",
    "yoga at home",
    "morning yoga",
    "home yoga practice",
    "30 days of yoga",
    "yoga for weight loss",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga"
  ],
  "publishedAt": "2019-04-21T05:00:00Z",
  "duration": 1379,
  "durationFormatted": "22:59",
  "viewCount": 10698663,
  "likeCount": 156935,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/BPK9WNtpBgk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/BPK9WNtpBgk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/BPK9WNtpBgk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/BPK9WNtpBgk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/BPK9WNtpBgk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/BPK9WNtpBgk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Today&#39;s session highlights the magic of yoga and how you can step on your mat feeling one way, and leave feeling… different. <br>Yoga connects you to your magic.",
    "It’s crazy to think that she posts these videos for FREE for us, bless this woman 😩😩❤️❤️",
    "I’ll state the obvious: we are all in love with this lady.",
    "Hi Adriene! This is my first comment on any YouTube video ever, but I wanted to share that today I’m celebrating 1000 DAYS of yoga with you! ☺️<br><br>On March 26th, 2020, I decided to complete your 20-minute bedtime yoga sequence to calm myself down. While all of my commitments, employment, and mental stability fell apart, I convinced myself that if I could accomplish just one thing each day—like getting on the yoga mat—then I would be okay.<br><br>I’m more than okay now. I’m f*<b>**</b> great. I haven’t missed a day with you since, and I don’t intend on missing any in the future. Thank you for accompanying me every morning and guiding me on this beautiful journey.",
    "This must be the only channel where almost  every comment left by viewers is positive. What a great group of people! Glad to be here.❤"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}