{
  "video_id": "bQSgG9wuc8Y",
  "title": "40-minute NO REPEAT Full Body Strength Training with Dumbbells",
  "description": "Build a strong body with this fun and effective no-repeat strength workout! This workout is packed with compound and isolation exercises with a focus on building strength and definition! We will work through 7 rounds each round consisting of 4 exercises to target all of the major muscle groups! You will only need dumbbells and an exercise mat for this workout!\n\nSign up for Bike & Bells Thrive here! https://kaleighcohen.com/bikeandbellsthrive/\n\n40-MINUTE FULL BODY NO-REPEAT WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 30lbs / 4.5- 13.6kg When selecting a weight for this workout, you want to lift moderately heavy!\n- EXERCISE MAT\n\nSTRUCTURE\n7 ROUNDS\n4 EXERCISES PER ROUND\nWORK: 60 SECONDS REST: 20 SECONDS\nREST BETWEEN ROUNDS: 30 SECONDS\n\nEXERCISE LIST\n- UNILATERAL KICKSTAND SQUAT\n- SWITCH SIDES\n- GOBLET SQUAT\n- SUMO SQUAT HOLD \n- KICKSTAND ROMANIAN DEADLIFT\n- SWITCH SIDES\n- SUMO ROMANIAN DEADLIFT\n- CALF RAISES\n- ARMS UP ROW\n- SCAPULAR RETRACTORS\n- UNILATERAL HOLD AND CURL\n- SWITCH SIDES\n- CHEST PRESS SLOW LOWER\n- KNEELING CHEST FLYS\n- SNOW ANGEL\n- TRICEP OVERHEAD EXTENSION\n- REAR LUNGE TO HAMMER CURL AND PRESS\n- SWITCH SIDES\n- GLUTE BRIDGE TO PULLOVER\n- RENEGADE ROW\n- ALTERNATING SNATCH\n- KNEELING FRONT RAISE\n- UNILATERAL DEAD BUG WITH DUMBBELL\n- SWITCH SIDES\n- HIPS UP REVERSE GRIP CHEST PRESS\n- KETTLEBELL SWINGS\n- CRUNCH CLAPS\n- FEET DOWN TWIST\n\nI am so glad you joined me for this workout! It's always better to workout with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2024-01-02T09:59:58Z",
  "duration": 2616,
  "durationFormatted": "43:36",
  "viewCount": 239583,
  "likeCount": 4816,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/bQSgG9wuc8Y/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/bQSgG9wuc8Y/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/bQSgG9wuc8Y/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/bQSgG9wuc8Y/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/bQSgG9wuc8Y/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/bQSgG9wuc8Y\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This was a fun one! Loved seeing both Stella and Nacho🎉 my dog slept through it, too 😂😂",
    "I LOVE this workout! Thank you for making a 40-minute, no-repeat, sweat-it-out routine. You keep it fun and entertaining with your quirky style and smart coaching. Happy New Year! Please keep doing more!",
    "What a great workout! My husband and I have recently started training 3-4 times a week with your videos and we&#39;re loving them 😍 We appreciate the work you put in to crafting these routines, along with your sense of humour and of course your super chilled dogs. Thank you so much 💗💗💗",
    "I am 3 months post partum and I have been trying to find motivation to get back into exercising for a mountain of reasons... I bought an exercise bike and THEN found your videos and I just want you to know your work outs are a TOTAL GAME CHANGER. You have such a joyful, funny, can-do attitude and it is contagious and it makes people WANT to come back. I didn&#39;t even bother looking for any other videos because you are IT. I can&#39;t tell you what a difference it has made to find your channel! Loved this Day 2 work out and I can&#39;t wait to come back for more tomorrow! Thank you, Kaleigh!!!",
    "I’ve only recently found your channel and the workouts are great, not too complicated and definitely helping me get back in shape after being out of action for over a year. Love the stretching ones too."
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}