{
  "video_id": "brjAjq4zEIE",
  "title": "15-Minute Morning Yoga Full Body Stretch | रोज़ सुबह के लिए 15 मिनट का योग @satvicyoga",
  "description": "Subscribe to our new YouTube Channel made specifically for Yoga 🧘🏽‍♀️ - https://www.youtube.com/@satvicyoga \n\n🙋🏻‍♀️ Take the first step towards better health. Join our next Yoga Workshop: https://bit.ly/3XSpT8F\n\n15-Minute Morning Yoga Full Body Stretch | रोज़ सुबह के लिए 15 मिनट का योग\n\n👉 Follow us on Instagram - https://www.instagram.com/satvic.yoga/\n\n#dailyyoga​ #yogaforbeginners​  #freeyogavideos​ \n\n- - - - - - - - - -\n\n❤️  Subscribe to the Satvic Movement Channel to support free health education: https://www.youtube.com/SatvicMovement?sub_confirmation=1\n​\n\n- - - - - - - - - -\n\nLet's connect!\n🙋🏻‍♂️ Attend our next Ultimate Health Challenge. Visit https://bit.ly/41QdwLr\n📗 Order our Satvic Food Books. Visit https://bit.ly/3FvRo1F\n📸  Instagram: http://instagram.com/satvicmovement​\n\n- - - - - - - - - -\n\nWatch More Videos: \n▶︎ Detox Video - https://youtu.be/bu1AOCnfto4​\n▶︎ Satvic Food Video - https://youtu.be/b-n5H-jpSLc​\n▶︎ Healing Effects of Sunlight - https://youtu.be/pqK-OMChLFU​\n\n\n- - - - - - - - - - \n\nDisclaimer: Satvic Movement recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise program, there is the possibility of physical injury. If you engage in this exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities and assume all risk of injury to yourself.",
  "channelTitle": "Satvic Movement",
  "channelDescription": "Satvic Movement is a community-driven health revolution to help you reach the peak of your physical, mental, and spiritual well-being.\n\nThe Satvic lifestyle is rooted in principles of simple food, early waking, yoga, loving relationships, service attitude and living in harmony with nature.\n\nThe knowledge shared is based on timeless ancient principles and is communicated in modern, practical and easy-to-understand terms. \n\nIt is shared through our online workshops (ranging from 3 to 21 days), books and videos.\n\nSo far, over 5 lakh people have attended our workshops, 100,000 Satvic books have been sold, and our videos have amassed over 1 billion views.\n\nFounded in 2017, today, Satvic Movement has exploded into a thriving community of thousands of people across India, becoming one of the largest health revolutions in the nation.\n\nSatvic Movement's mission is to create a world where people can effortlessly live a healthy and joyful life, in harmony with each other, and with Mother Nature.",
  "tags": [
    "yoga hindi",
    "yoga beginners",
    "yoga satvic movement",
    "15 minute yoga for weight loss",
    "15 minute yoga stretch",
    "15 minute yoga workout"
  ],
  "publishedAt": "2021-05-23T12:16:19Z",
  "duration": 938,
  "durationFormatted": "15:38",
  "viewCount": 6599696,
  "likeCount": 128114,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/brjAjq4zEIE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/brjAjq4zEIE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/brjAjq4zEIE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/brjAjq4zEIE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/brjAjq4zEIE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/brjAjq4zEIE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Combination of most crucial aasans wrapped up in 15 minutes. Super helpful, thank you!",
    "Started this as a 30 days challenge and it was tough at the beginning but getting better results as I&#39;m progressing, it is worth doing yoga for 15 minutes daily.",
    "Wow my body gets refreshed in just 15 min . Thanku these asanas are so powerful. Highly grateful to uh🙏🏻",
    "This has become my daily routine , following and recommending this to everyone, Thank You Satvic Team!",
    "15 mins Disappears like 15sec, <br>Easy to follow, properly guided each step. <br>Body Sweat like never before. <br>Thank you!"
  ],
  "channelSubscriberCount": 7540000,
  "channelVideoCount": 384
}