{
  "video_id": "bxUB6WNcSEU",
  "title": "10 MIN LOVE HANDLES AND LOWER BELLY FAT WORKOUT Standing Only | No Equipment!",
  "description": "Do you want to get rid of your love handles and belly fat? Then this standing workout is for you! The BEST approach to lose love handles and belly fat is with a workout that trains your obliques, lower belly, glutes, outer thighs and combine it with cardio! That's exactly what we are doing in this standing only workout!\n\nDid you do this workout? Comment below!\n\nI recommend you do to this short workout daily for 2 weeks to see amazing results! \n\nThis workout is also great during pregnancy and postpartum.\n\nFollow me on instagram!\nhttps://www.instagram.com/fit.with.sally\n\nJoin my fitness program BUILD & BURN:\nhttps://train.fit-with-sally.com/products/build-burn-fitness-program\n\nGet my Meal Plan & Recipe Guide:\nhttps://train.fit-with-sally.com/products/meal-plan-recipe-guide\n\n00:00 Intro\n00:31 Side Crunch\n01:54 Squat Side Bend\n02:34 Push-Away\n03:15 Side Leg Raise\n04:36 Skiers + Floor Touch\n05:17 Side Punch\n05:58 Curtsy Lunge To Crunch\n07:19 Squat To Toe Touch\n07:58 Reach Over\n09:17 Squat To Side Crunch\n\nThe songs in this video are from Epidemic Sound:\nSong 1: Sleeping in my Head from Siine feat. Frank Moody\nSong 2: Name Tag from Nivicious feat. AdamAlexander\nSong 3: If your're looking for trouble from Basixx feat. TASH\nSong 4: Let's Stay Up All Night from Basixx feat. Frigga\n\nDISCLAIMER:  The information in this video is not intended to take the place of medical advice from your healthcare provider.  Viewers are strongly advised to consult with their doctor or other healthcare provider before undertaking any exercise or exercise program demonstrated in this video. Any application of the recommendations provided in this video is at the viewer's discretion and sole risk.",
  "channelTitle": "Fit With Sally",
  "channelDescription": "Subscribe to get strong, fit, and confident with my at home workouts!\n\nHi, I am Sally, certified fitness instructor and a mom of 2! My passion is to help other women feel strong, confident, and healthy so you can flourish in everyday life. \nSubscribe to join the tribe!\n",
  "tags": [
    "love handles and belly fat workout standing only",
    "loev handles and belly fat workout standing only",
    "love hadnles adn belly fat workout stadning only",
    "love handles workout",
    "love handles workout for women",
    "lower belly",
    "lower belly fat workout",
    "belly fat workout",
    "standing love handles workout",
    "standing belly fat workout",
    "get rid of love handles",
    "get rid of belly fat",
    "love handles and belly fat",
    "love handles & belly fat",
    "get rid of lower belly and love handles",
    "fitness for belly"
  ],
  "publishedAt": "2022-04-05T18:28:43Z",
  "duration": 616,
  "durationFormatted": "10:16",
  "viewCount": 7039051,
  "likeCount": 137497,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/bxUB6WNcSEU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/bxUB6WNcSEU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/bxUB6WNcSEU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/bxUB6WNcSEU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/bxUB6WNcSEU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/bxUB6WNcSEU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "You guys are LOVING this workout and seeing amazing results! SO, I decided to create a new version of the LOVE HANDLES WORKOUT that is 15 MINUTES long (instead of 10 minutes). Same movements but a few more! If you are ready for the next step, here it is: <a href=\"https://www.youtube.com/watch?v=Udcvhi4m0pQ\">https://www.youtube.com/watch?v=Udcvhi4m0pQ</a>",
    "Just an update for everyone, I started doing this 2 weeks ago and I&#39;ve lost atleast 2 inches off my waist, with a visibly flatter belly than before! (no diet whatsoever)<br>Keep going guys, it&#39;s a really effective workout.",
    "Did this for 4months almost every day and lost most of my stubborn belly fat plus love handles ..moving in to the 15 min standup ..really enjoy doing it",
    "Did this workout for 2 weeks straight and definitely see great results! No changes on the scale but I feel a difference in my stomach and back area. I see definition and feel so much slimmer!! Definitely doing this everyday",
    "I did this workout every day for the last 14 days and lost 2 inches around my tummy. I did not change my eating habits and did not lose weight - so the inches off definitely came from the workout. I want to try some of Sally&#39;s other workouts too. Excited to see measurable results so quickly. Thank you, Sally!"
  ],
  "channelSubscriberCount": 275000,
  "channelVideoCount": 141
}