{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.4
    },
    {
      "level": "Intermediate",
      "score": 0.6
    },
    {
      "level": "Advanced",
      "score": 0.2
    }
  ],
  "techniqueDifficultyConfidence": 0.75,
  "techniqueDifficultyExplanation": "The workout includes a mix of simple and slightly complex movements, suitable for a range of ability levels. Exercises like run on the spot and squat pulses are beginner-friendly. However, movements like walkouts with press up, lateral plank walk with push up, and bear crawls involve a bit more coordination and core stability, thus raising the overall technique difficulty to an intermediate level. There are no extreme coordination or skill requirements, so advanced and expert levels are less applicable.",
  "effortDifficulty": [
    {
      "level": "Moderate",
      "score": 0.4
    },
    {
      "level": "Challenging",
      "score": 0.6
    },
    {
      "level": "Extreme",
      "score": 0.2
    }
  ],
  "effortDifficultyConfidence": 0.8,
  "effortDifficultyExplanation": "The workout is set up in a HIIT format with 20 exercises performed for 40 seconds each, followed by 20 seconds of rest, totaling over 20 minutes. This indicates a moderate to challenging energy expenditure, especially due to compound exercises like burpees and lunge jumps. Comments about burning fat and feeling a good challenge further support a higher effort level, suggesting it's demanding, though not extremely difficult for physically fit individuals.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.2
    },
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.3
    }
  ],
  "requiredFitnessLevelConfidence": 0.85,
  "requiredFitnessLevelExplanation": "The required fitness level predominantly aligns with intermediate, as the technique requires some coordination and stability, while effort demands are considerable due to the workout's duration and intensity. The format allows for modifications, and the encouraging comments indicate accessibility for improving fitness likely makes it suitable for advanced beginners as well. Advanced is included due to the continuous HIIT demand and potential intensity of some exercises like burpee variations."
}