{
  "video_id": "C9hMaqQFKXk",
  "title": "Inner Balance | 432Hz + 111Hz Healing Calm & Inner Peace | Release All Blockages Meditation & Sleep",
  "description": "The natural frequency of 432Hz, also called the“Earth frequency”, is the frequency everything in our Universe resonates with. This specially composed music for meditation and/or sleep in the healing frequency of 432 Hz is here for you to lovingly help you to let go of all blockages, reset your mind, body and soul and find back to inner balance and deep inner peace.\n\nYou can buy & download the original full length track here:\nhttps://innerlotusmusic.com/a/s/wtqgqv\n\nVisit the Inner Lotus Music Store:\nhttps://innerlotusmusic.com/\n\n\nStream the single edit on: \n\nSpotify: https://open.spotify.com/album/1sbiGdXC71zHd7D7A2293f\nAmazon Music: https://amazon.com/music/player/tracks/B0D2J86K8J\nOther streaming platforms: https://linktr.ee/innerlotusmusic\n\n\nIf you enjoy my music and would like to support me, you are welcome to subscribe to my channel 🤗 \nhttps://www.youtube.com/@innerlotusmusic?sub_confirmation=1 \nHit the ((🔔)) to turn on notifications and receive the latest Inner Lotus Music!   \n\n\nThe natural frequency of 432Hz, also called the“Earth frequency”, is the frequency everything in our Universe resonates with. Music tuned to 432 Hz is proven to be relaxing for body and mind and very often also perceived as being more harmonic and pleasant than the “standard” 440 Hz, which is the frequency that most of the modern day music we listen to is tuned at. \n\nMusic tuned to 432 Hz is often perceived as being softer and more pleasant. It is said to provide greater clarity and is easier on the ears. In short, 432 Hz music can fill the mind with a sense of deep peace and well-being, while releasing emotional blockages that hinder us from letting go and experiencing full inner and outer harmony.  \n\nThe frequency of 111Hz, also known as “divine frequency” is said to be a “holy” frequency, allowing deepest states of meditation and connecting to higher spheres of consciousness. According to scientific reports, MRI scans have shown that - when listening to 111 Hz - our brain reduces prefrontal cortex activity and slows down the so-called “language center”, inducing a phase at exactly 111 Hz. This reaction results in a divine level of meditation. A state of trance that is said to allow connection with the universe, or a spiritual guide.\n\n\nIf you enjoy this video, you might also resonate with the following 432Hz music:\n\n432Hz + 111Hz Energetic Cleanse & Spiritual Healing Frequency | Flute, Bowls & Rain Meditation Music\nhttps://youtu.be/Eaq9vskuvWI\n\nKundalini Awakening | 111Hz + 432Hz Rising of the Goddess Within | Yoga, Energy & Meditation Music\nhttps://youtu.be/xHJHje069UQ\n\nHealing Calm & Deep Inner Peace | Release All Blockages | 432 Hz Spiritual Meditation & Sleep Music\nhttps://youtu.be/dKdeOdxl0UQ\n\nAnd if you would like to discover more music written in the natural Earth frequency of 432Hz, you can find it in this playlist:\nhttps://youtube.com/playlist?list=PLXwfGygOmeUXtiuasFbNoSNUJOt9ibMvy\n\n\nFor this meditation and/or sleep music, all instruments have been specifically and carefully tuned to 432 Hz and 111Hz. Therefore, the music in this video is an original 432Hz + 111Hz composition and has not been artificially tuned to these frequencies after completion. I am convinced that composing music in the original frequency will lead to better results when it comes to deploying the positive energy and benefits of these particular natural frequencies. \n\nFeel free to listen to this meditation and/or sleep music with headphones at a moderate level or - if you prefer - just let it flow through open space. As long as it is positive for your body and soul, it will be positive for you. \n\nLove and gratitude 🧡🙏🏼 \nPierre\n\n\n\n\n\n\nNote: Do not listen to music emphasizing particular frequencies if you suffer from epilepsy! If you have any concerns or other health issues you are uncertain of, please check with your medical practitioner prior to listening. Please do not listen to the music on this channel whilst driving or operating machinery of any kind! Although this music can help you to relax, meditate and sleep, it is not taking the place of professional medical and/or therapeutic advice and/or treatment. \n\nMusic composed and produced by Pierre Ynad \nTitle: Inner Balance\nCopyright ⓒ 2023 Inner Lotus Music™. All rights reserved. \n\nSome elements of this video were legally purchased from Adobe Stock and Storyblocks and re-edited in our unique artistic style. The reuse, event in parts, of any video, image and/or music from this channel is strictly prohibited!\n\nWe are currently not licensing our music for commercial and/or non-commercial use.\n\n \n\n#innerlotusmusic #solfeggiohealingmusic #innerlotussleepmusic",
  "channelTitle": "Inner Lotus Music",
  "channelDescription": "Namasté wonderful Soul 🌟 \n\nI am Pierre and I compose music in natural, Chakra, Solfeggio and Angel Number frequencies. If you want to know more, you can find all related info in the video descriptions. May my music help you to find calm and inner peace, healing and sleep, and to meditate: beautifully! 😊\nLove and gratitude 💜🙏🏼\nPierre \n\n\n\nAll music on this channel is composed and produced by Pierre Ynad. Copyright ⓒ 2020-2025 Inner Lotus Music™. All rights reserved. The reuse, event in parts, of any video, image and/or music from this channel is strictly prohibited !\n\nI am currently not licensing my music for commercial and/or non-commercial use.\n\nDo not listen to music emphasizing particular frequencies if you suffer from epilepsy! Do not listen to the music on this channel whilst driving or operating machinery of any kind! Although this music can help you to relax, meditate and sleep, it is not taking the place of professional medical and/or therapeutic advice and/or treatment. \n",
  "tags": [],
  "publishedAt": "2023-08-27T20:00:06Z",
  "duration": 12813,
  "durationFormatted": "3:33:33",
  "viewCount": 29089047,
  "likeCount": 187290,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/C9hMaqQFKXk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/C9hMaqQFKXk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/C9hMaqQFKXk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/C9hMaqQFKXk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/C9hMaqQFKXk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/C9hMaqQFKXk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you so much for being here! 🫶<br><br>Buy &amp; download the full length track here:<br><a href=\"https://innerlotusmusic.com/a/s/wtqgqv\">https://innerlotusmusic.com/a/s/wtqgqv</a><br><br>Stream the single edit on:<br>Spotify: <a href=\"https://open.spotify.com/album/1sbiGdXC71zHd7D7A2293f\">https://open.spotify.com/album/1sbiGdXC71zHd7D7A2293f</a><br>Amazon Music: <a href=\"https://amazon.com/music/player/tracks/B0D2J86K8J\">https://amazon.com/music/player/tracks/B0D2J86K8J</a><br>Other streaming platforms: <a href=\"https://linktr.ee/innerlotusmusic\">https://linktr.ee/innerlotusmusic</a><br><br>If you enjoy this video, you might also resonate with the following music:<br><br>432Hz + 111Hz Energetic Cleanse &amp; Spiritual Healing Frequency | Flute, Bowls &amp; Rain Meditation Music<br><a href=\"https://www.youtube.com/watch?v=Eaq9vskuvWI\">https://youtu.be/Eaq9vskuvWI</a><br><br>Kundalini Awakening | 111Hz + 432Hz Rising of the Goddess Within | Yoga, Energy &amp; Meditation Music<br><a href=\"https://www.youtube.com/watch?v=xHJHje069UQ\">https://youtu.be/xHJHje069UQ</a><br><br>Healing Calm &amp; Deep Inner Peace | Release All Blockages | 432 Hz Spiritual Meditation &amp; Sleep Music<br><a href=\"https://www.youtube.com/watch?v=dKdeOdxl0UQ\">https://youtu.be/dKdeOdxl0UQ</a><br><br>If you would like to discover more music written in the natural Earth frequency of 432Hz, you can find it in this playlist:<br><a href=\"https://www.youtube.com/playlist?list=PLXwfGygOmeUXtiuasFbNoSNUJOt9ibMvy\">https://youtube.com/playlist?list=PLXwfGygOmeUXtiuasFbNoSNUJOt9ibMvy</a><br><br>And if you like what I do, subscribe ((🔔)) give it a 👍🏼 and leave a comment 💌 to let me know your impression 😊 Love and gratitude 🙏🏼 Pierre",
    "I know my comment is easily lost here, but if you&#39;re reading this, it&#39;s no coincidence. Be sure, gain strength! Even if you are going through something very difficult in your life. Believe that everything will work out! This is just a phase, hang on! I know we don&#39;t know each other, but I believe in you! Rest assured that God is always on your side!",
    "I had a heart attack a week ago so I had to quit smoking cigarettes smoking weed and drinking and then I ran across this video a day ago the meditation helps so much clears my mind whenever I want to smoke or drink I turn this on and I meditate and it&#39;s like my urges to drink and smoke just ease away",
    "To anybody reading this, I pray that whatever is hurting you or whatever you are constantly stressing about gets better. May the dark thoughts, the overthinking, and the doubt exit your mind may clarity replace confusion. may peace and calmness fill your life.",
    "I wish everyone who clicked on this video the most love, peace and abundance. You’re so much closer than you realize. I love you♥"
  ],
  "channelSubscriberCount": 1150000,
  "channelVideoCount": 538
}