{
  "video_id": "c9wKsfqVfdE",
  "title": "Enter a Deep Sleep while Connecting to your Higher Self (Guided Meditation)",
  "description": "This one-hour deep sleep guided meditation is designed to offer a profound journey allowing you to release the stresses of the day and embrace a serene connection with your higher self.  As the soothing voice gently guides you, you'll embark on a transformative exploration of your inner world.  This meditation aims to create a sacred space for introspection, promoting a sense of inner peace and rejuvenation.  By immersing yourself in this profound sleep meditation, you open the door to self-discovery, inviting the wisdom of your higher self to guide you through a restful night's sleep, fostering a deeper connection with your innermost essence.  Embrace this opportunity to embark on a journey of inner alignment and renewal, as you gracefully surrender to the restorative power of sleep and higher self connection.\nThis is an Original guided meditation recorded by us.  \n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "sleep",
    "sleep meditation",
    "meditation sleep",
    "sleep guided meditation",
    "guided meditation sleep",
    "1 hour meditation",
    "1 hour sleep meditation",
    "guided meditation 1 hour",
    "higher self",
    "higher self sleep mediation",
    "guided meditation higher self",
    "deep sleep",
    "deep sleep meditation",
    "deep sleep guided meditation",
    "guided meditation deep sleep"
  ],
  "publishedAt": "2024-02-01T02:00:10Z",
  "duration": 3587,
  "durationFormatted": "59:47",
  "viewCount": 1637027,
  "likeCount": 16547,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/c9wKsfqVfdE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/c9wKsfqVfdE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/c9wKsfqVfdE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/c9wKsfqVfdE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/c9wKsfqVfdE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/c9wKsfqVfdE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I don&#39;t have time today to do this. So please remind me tomorrow and the day after and that day after… so i can do this every day. I love you all. You are doing great in life ❤️",
    "Peaceful thoughts everyone. We can make our dreams come true in 2024",
    "I used to have so much doubt, but I&#39;m starting to think the people who find these videos and go through these practices are on a higher journey. I feel like something has awoken in me throughout my journey, but this practice felt like truly aligning myself with my purpose. Thank you",
    "I fell asleep to this last night after feeling overwhelmed and mind racing but woke up feeling amazing, positive, and reset ❤ thank you! 🙏🏽",
    "I&#39;ve been listening to your meditations since I got sober last summer. I was staying in a homelesss shelter working my way back up to having my own things. I always feel so hopeful and motivated yet at peace listening to you. This meditation I listen to every night i love it so much. The other one i consistently listen to is Release and Let Go. Thank you so much. I appreciate you."
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}