{
  "video_id": "camy0PIKxwU",
  "title": "20 Min Gentle Yoga Routine | Beginner Friendly Full Body Stretch",
  "description": "👉 Join my Flexibility Program to master challenging poses - https://www.charliefollows.com/flexibility-program\n\nWelcome to your gentle yoga routine which offers a combination of full body stretches. This beginner friendly 20 minute practice is slow and steady to help you release tension and feel your best.\n\nThis practice offers a gentle series of postures that are great for beginners or anyone who feels like they need a nurturing practice that is not too challenging.\n\nI hope you enjoy this gentle yoga flow. \n\nCharlie x\n\nLinks:\nOnline Programs: https://www.charliefollows.com/programs\nNewsletter: https://www.charliefollows.com/newsletter\n\nSocial Media:\nInstagram: https://www.instagram.com/charlieafollows?igsh=MWdxMjE0ZHR1bzlydg%3D%3D&utm_source=qr\nFacebook: https://www.facebook.com/charliefollowsyoga\nTikTok: https://www.tiktok.com/@charlieefollows?_t=8jbfibQBEiO&_r=1\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2024-07-14T13:00:38Z",
  "duration": 1190,
  "durationFormatted": "19:50",
  "viewCount": 946085,
  "likeCount": 15689,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/camy0PIKxwU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/camy0PIKxwU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/camy0PIKxwU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/camy0PIKxwU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/camy0PIKxwU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/camy0PIKxwU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Welcome friends I hope that this practice leaves you feeling rested and restored ❤️ enjoy the view x",
    "This practice was awesome. I loved it. No music, no speaking, no spiritual quotes, just enjoyment. 🌷",
    "Thank you, I love your no-nonsense yoga session. No music, no silly spiritual talk, just a relaxing full body yoga routine I can do in the mornings ❤🧘🏻‍♀️",
    "This was perfection. The silence, the time spent in savasana so as not to rush the restorative side of stretching, and the lack of unnecessary talking, just pure instruction ❤ The difference I felt in my spine between the first crosslegged position to the last was incredible. Thank you so much.",
    "I&#39;m recovering from flu, this was a perfect first session back.  Thanks."
  ],
  "channelSubscriberCount": 991000,
  "channelVideoCount": 1004
}