{
  "video_id": "cL05g13YSIE",
  "title": "EPIC HIGH INTENSITY - 30 Min Total Body HIIT, No Equipment | EPIC III Day 5",
  "description": "HIIT here we go!! \n\nDay 5 of 50 and it’s time to challenge our bodies in a different way! High intensity, bodyweight only and 30 minutes! We’ve got this!! High intensity interval training to get you very sweaty, your heart rate up and leave you feeling so alive and happy! \n\nThe timer will be on for 30 seconds of work with 15 seconds rest inbetween! Each exercise will be performed for 2 sets! If it is single side work such as a lunge, this may be performed for 2 sets all on same side, then next 2 sets all on opposite side! It will all appear clearly on the screen so don’t worry! \n\nThere is a staple exercise in today’s sweaty session! This pair will appear every 4 sets and 8 times in total!! So you can count as you go so you know once you hit 8th set, it’s cool down after!!!\n\nYou will simply need your mat, a towel and a bottle of water nearby! \n\nI also use a fan but I’m still dripping after! \n\nHAND TO FLOOR BURPEES\nHAND TO FLOOR BURPEES\nCHEST TO FLOOR BURPEES\nCHEST TO FLOOR BURPEES\n\nSTAPLE!\n1/2 REP BURPEES!\n\nSQUAT JUMPS\nSQUAT JUMPS\nSUMO HAND TOUCH SQUATS\nSUMO HAND TOUCH SQUATS\n\nSTAPLE!\n1/2 REP BURPEES!\n\nPUSH UPS W/ ARM REACH (one side)\nSWITCH SIDE!\nPUSH UP BURPEES\nPUSH UP BURPEES\n\nSTAPLE!\n1/2 REP BURPEES!\n\nLUNGE TO LEAN HAND TAP\nSAME SIDE!\nSWITCH SIDE!\nSAME SIDE!\n\nSTAPLE!\n1/2 REP BURPEES!\n\nSPRAWL\nSPRAWL\nWALK OUT TO TRICEP PUSH UP\nWALK OUT TO TRICEP PUSH UP\n\nSTAPLE!\n1/2 REP BURPEES!\n\nCROSS BODY MOUNTAIN CLIMBERS\nCROSS BODY MOUNTAIN CLIMBERS\nKNEE TUCK TO EXTEND\nKNEE TUCK TO EXTEND\nSTAPLE!\n1/2 REP BURPEES!\n\nALTERNATING LUNGE JUMPS\nALTERNATING LUNGE JUMPS\nSHOULDER TAPS\nSHOULDER TAPS\n\nSTAPLE!\n1/2 REP BURPEES!\n\nSQUAT TO LOW KNEE TUCK (one side)\nSAME SIDE!\nSWITCH SIDE!\nSAME SIDE!\n\nSTAPLE!\n1/2 REP BURPEES!\n\n30 minutes of pure fun and fast pace! Fast pace that is YOUR fast pace! All of the exercises are straight forward but it’s the pace that is challenging and it should challenge you!! \n\nYou will finish that last 1/2 burpee giving it your all!!\n\nThis will be week 1 complete!!! Congratulations in advance to you!! \n\nCx\n\nIf you prefer a no jumping high intensity session, below is a link with no jumping alternatives! It is also 30 minutes duration! \n\nNOTORIOUS No Repeat Full Body HIIT Workout / No Equipment + No Jumping Options: https://youtu.be/z3h_3UOBAVU\n\nAlways ensure you warm up before any workout. Here’s my NEW EPIC 5 Min Warm Up Routine: https://youtu.be/JOoIsy8SX4c\n\nDon’t forget to Subscribe and turn on notifications so that you don’t miss any Workouts, Community Updates or Surprises: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nHere’s today’s optional add-on: https://youtu.be/_4TXcvnx32E\n\nEPIC III Playlist: https://www.youtube.com/playlist?list=PLhu1QCKrfgPXAMz4TJv5Ub4IFvdXjuFXy\n\nEPIC Beginner Series: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\n\nMy Cardio Workouts: https://www.youtube.com/playlist?list=PLhu1QCKrfgPVj9hpw_O3t1LoUcqUWpJio\n\nMy Ab Workouts: https://www.youtube.com/playlist?list=PLhu1QCKrfgPX_3_Fir25lT1zjLvmjifl7\n\nJoin The Caroline Girvan Community\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Private Facebook Group: https://facebook.com/groups/carolinegirvan\n\nMy Amazon Stores\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\n▶ Business Enquiries Email: info@carolinegirvan.com\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "hiit",
    "high intensity",
    "total body hiit",
    "epic 3",
    "epic program",
    "caroline girvan hiit",
    "caroline girvan",
    "epic",
    "epic iii",
    "hiit workout",
    "full body",
    "full body workout at home",
    "no equipment workout",
    "bodyweight hiit",
    "full body workout",
    "hiit cardio",
    "30 minute hiit",
    "intense hiit",
    "workout",
    "high intensity interval training",
    "30 min hiit workout",
    "hiit workout at home"
  ],
  "publishedAt": "2021-09-12T04:00:20Z",
  "duration": 2143,
  "durationFormatted": "35:43",
  "viewCount": 801763,
  "likeCount": 18003,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/cL05g13YSIE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/cL05g13YSIE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/cL05g13YSIE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/cL05g13YSIE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/cL05g13YSIE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/cL05g13YSIE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Caroline ...Ok so I am absolutely not writing this to show off, but I am 74 and I am writing it to encourage those of you much younger than I - folks in their 50&#39;s and 60&#39;s and yes 70&#39;s - to push through these workouts. This morning I previewed this and thought &quot;No way&quot;, but guess what? I completed it. Yes it took me an hour with longer rests and some modifications on the burpees. A 74 year old body can just do so much, but I feel incredible as I write this and encouraged and I would never have thought when I began Epic I and followed with the other Epics (although I have worked out for about 30 years) that I would have become so strong and had such beautiful definition in  my rather old body. So, keep the faith and push through. Thank you Caroline. I look forward to your workouts every day.",
    "I have a confession to make: during EPIC 1 and 2 i&#39;ve havent done the sunday HIIT often. I did the ones the where low impact and with weights. I did not have confidence in me that i could do it. I was seeing you going so fast and i knew i just could not keep up. Today&#39;s intro was a blessing, hearing you say that it did not have to be perfect and that we have to build up to a certain pace. So today i did the wokout... changed a few things (jumping lunge to no jumping lunge) and i am really proud of myself. Done the extra abs and the 20 mins strech. Thank you Caroline.",
    "This week was so tough yet so much fun! This is the perfect way to end week one ! <br>I and everyone in this community must be able to realise how much planning,  mental efforts as well as hard work is put into every single video.. So for those of you who are doing the workouts but have not subscribed yet, pleaase do it right now!!! Our Caroline deserves 100M!!",
    "Caroline woke up on this day and chose violence🤣 What. A. Ripper.<br>I thoroughly enjoyed this and am super proud to report that I only paused the video once around 35% in. After that, it was like my body remembered how to differentiate between feeling like I&#39;m dying and actual death - which was super helpful going forward. I will admit, I find two sets in a HIIT workout challenging because my boy is absolutely convinced that I won&#39;t survive a second round most of the time, even though it  does consistently do so. So from a mental fortitude aspect, I feel like I&#39;ve come quite far.<br>Thanks for all your hard work, Caroline &lt;3<br>I largely feel like I&#39;m doing these workouts alone because this programme was live just over a year ago, but the comments posted by those who participated and your constant presence throughout the workout help me keep going.<br>Much love and appreciation from South Africa &lt;3<br>Stay safe and strong everyone!",
    "When staple exercise is a burpee, you know legs are gonna be squishy after this one...<br>Can&#39;t wait to complete this workout...<br>Have a great workout and a great day everyone"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}