{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.5
    },
    {
      "level": "Intermediate",
      "score": 0.7
    }
  ],
  "techniqueDifficultyConfidence": 0.65,
  "techniqueDifficultyExplanation": "The exercises listed, such as burpees, push-ups with arm reach, and squat jumps, are generally straightforward movements, especially for a HIIT workout. The description mentions that the exercises are 'straight forward' but also implies some complexity due to the inclusion of variations like push-ups with arm reach and cross-body mountain climbers. These require slightly more coordination than basic movements, suggesting a blend of beginner and intermediate technique levels.",
  "effortDifficulty": [
    {
      "level": "Challenging",
      "score": 0.75
    },
    {
      "level": "Extreme",
      "score": 0.4
    }
  ],
  "effortDifficultyConfidence": 0.75,
  "effortDifficultyExplanation": "The workout features high-intensity interval training with 30 seconds of work and 15 seconds of rest, described as 'very sweaty,' which indicates significant physical demand. Comments and description emphasize high energy expenditure and minimal rest, featuring burpee variations and lunge jumps that require substantial effort, pushing the effort level to challenging for most, with elements of extreme due to sustained intensity over 35 minutes.",
  "requiredFitnessLevel": [
    {
      "level": "Intermediate",
      "score": 0.65
    },
    {
      "level": "Advanced",
      "score": 0.55
    },
    {
      "level": "Elite",
      "score": 0.25
    }
  ],
  "requiredFitnessLevelConfidence": 0.7,
  "requiredFitnessLevelExplanation": "The combination of movement demands and high intensity sets a baseline required fitness level of intermediate due to the complex sequences and intensity. Advanced fitness levels are also required given the duration and persistent intensity of the HIIT format, as noted by the description and user experiences. Although it could be approachable for elite users, the workout's design to challenge across these various levels suggests spanning intermediate through advanced primarily, with a minor possibility for elite fitness participants to find it engaging."
}