{
  "video_id": "Cl7E5GoFv6k",
  "title": "Full Body Workout for Seniors, Beginners | Build Muscle with Dumbbells",
  "description": "This workout includes exercises for seniors and beginners to build muscle in your legs, arms, back, shoulders, and core. \n\nUse weights to challenge your muscles if you're up for it. We use dumbbells from 2 pounds to 10 pounds in this workout. You can also use water bottles or cans. Or start without weights to get used to the moves before adding weights.\n\nTo learn how to choose the right weight for a specific exercise, check out our video on How to Pick the Right Weight: https://youtu.be/oqPFfyW9AXY\n\nYou'll do two sets of 8 exercises, each 10 reps.\n\n00:00 Introduction\n01:15 Warm Up\n05:11 Strength Workout\n✅ Mini Squat\n✅ Reverse Steps\n✅ Farmers Carry\n✅ Shoulder Press\n✅ Tricep Extension\n✅ Bicep Curl\n✅ Pulldowns\n25:30 Cooldown\n\nAs we age, we lose 3 to 8 percent of muscle every decade. Strength training is important to combat this loss.\n\nyes2next celebrates fitness and joy at any age. It’s never too late to start exercising, creating, and doing. Say “yes” 2 your next steps to fitness and joy.\n\nIf you are new to our channel, we're happy you clicked on our video! We hope you enjoy it!  Please show your love💓 and support 🤝 and join the yes2next community by subscribing and pressing (🔔) to join the Notification Squad and stay updated with new uploads ✨ If you have any inquiries or requests, feel free to leave them in the comments below.\n\n🔴 Subscribe Here: https://www.youtube.com/@yes2next\n👍 Like the video (it helps a ton!)\n💬 Comment below to share your opinion!\n🔗 Share the video with anyone you think it might help :)\n\n\n📲 Stay Connected: \n📷 𝐈𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦: https://instagram.com/yes2next \n⚫️ 𝐓𝐢𝐤𝐓𝐨𝐤: https://tiktok.com/yes2next \n🔵 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤: https://facebook.com/yes2next \n🔵 𝐓𝐰𝐢𝐭𝐭𝐞𝐫: https://twitter.com/yes2next \n🔴 𝐏𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭: https://pinterest.com/yes2next\n🌐 𝗪𝐞𝐛𝐬𝐢𝐭𝐞: https://yes2next.com\n ✉ 𝐄𝐦𝐚𝐢𝐥: yes2next@gmail.com \n\nDisclaimer: This program is provided with your health and safety in mind, but every individual has their own limitations. It is crucial that you consult with your physician before beginning this or any other exercise program. This program is not a substitute for professional medical diagnosis, treatment or advice. By participating in this exercise program, you do so at your own risk. Please stop if you experience pain, dizziness, or shortness of breath.\n\n\n#weightworkoutforseniors #exerciseforbeginnersathome #beginnerstrengthtrainingforweightloss",
  "channelTitle": "yes2next",
  "channelDescription": "yes2next is all about fitness and joy at any age, including seniors over 50. Say yes to your next adventures and reaching your full potential. I’m April, a personal trainer with senior fitness and functional training specialist certifications from the American Council on Exercise and The Biomechanics Method for Corrective Exercise. My 83-year-old mom and I are excited to share our passion for healthy living with our exercise videos for beginners and seniors, lifestyle tips, and fun. \n\nStay connected with us by subscribing and following us on:\n⭐️ Facebook: https://facebook.com/yes2next\n⭐️ Instagram: https://instagram.com/yes2next\n⭐️ Twitter: https://twitter.com/yes2next\n⭐️ Pinterest: https://pinterest.com/yes2next\n⭐️ Tiktok: https://tiktok.com/@yes2next\n\n👉 To keep in touch by email,  sign up at https://yes2next.com\n👉 Find yes2next gear at our store: https://yes2next.com/shop\n\n❤️ To donate, visit our Paypal page: https://bit.ly/y2ndonate Thank you!\n\nSee you soon! 🏃‍♀️🏋️‍♀️ 😊\n",
  "tags": [
    "beginner workout",
    "senior workout",
    "at home workout",
    "exercise routines",
    "beginner strength training",
    "full body workout",
    "workout for beginners",
    "home workout",
    "strength workout"
  ],
  "publishedAt": "2022-05-24T13:00:11Z",
  "duration": 1702,
  "durationFormatted": "28:22",
  "viewCount": 875548,
  "likeCount": 17958,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Cl7E5GoFv6k/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Cl7E5GoFv6k/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Cl7E5GoFv6k/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Cl7E5GoFv6k/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Cl7E5GoFv6k/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Cl7E5GoFv6k\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "April, this has to be the only video with daughter and elder mom, we love it! ♥️",
    "I&#39;m not a senior citizen but these are my favorite videos for my sensitive joints and connective tissue--I love your mama!",
    "Ohh, how lovely, I will send this to my mum.  Thank you for thinking about our elders.",
    "April, as a senior citizen, I so appreciated the concern, attention, and respect you demonstrate to you mom in your workouts. You are a very kind and considerate daughter and person. God bless you and your mom.",
    "As always thank you! Love your energy and appreciate you both for being here! See you tomorrow! ❤❤❤❤"
  ],
  "channelSubscriberCount": 457000,
  "channelVideoCount": 324
}