{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.3
    },
    {
      "level": "Intermediate",
      "score": 0.6
    },
    {
      "level": "Advanced",
      "score": 0.1
    }
  ],
  "techniqueDifficultyConfidence": 0.75,
  "techniqueDifficultyExplanation": "The workout involves basic strength training movements with dumbbells paired with isometric holds. These are generally accessible movements with modifications provided, suitable for varying fitness levels. Intermediate technique difficulty is indicated by references to isometric holds and the encouragement to use heavier weights, which require some coordination and body awareness. The workout provides modifications, highlighted in the description, which supports a Beginner level classification as well. The Advanced score is lower since the focus is not on highly technical lifts. Overall, the exercises are described as suitable for 'all levels', suggesting some complexity appropriate for Intermediate users with modifications supporting Beginners.",
  "effortDifficulty": [
    {
      "level": "Moderate",
      "score": 0.5
    },
    {
      "level": "Challenging",
      "score": 0.5
    }
  ],
  "effortDifficultyConfidence": 0.8,
  "effortDifficultyExplanation": "The workout duration of 31:20 suggests a moderate level of physical demand, especially for those with low-to-average fitness levels. The description mentions using heavier weights than usual, which can increase physical demand to a Challenging level. The inclusion of isometric holds further increases energy expenditure, indicating a Challenging effort level especially for deconditioned users. Comments about the workout being safe and challenging reinforce this classification. Thus, both moderate and challenging levels are relevant, depending on the individual's chosen weights and fitness level.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.3
    },
    {
      "level": "Intermediate",
      "score": 0.8
    },
    {
      "level": "Advanced",
      "score": 0.2
    }
  ],
  "requiredFitnessLevelConfidence": 0.85,
  "requiredFitnessLevelExplanation": "The combination of Intermediate technique and Challenging effort suggests a primary fitness level requirement of Intermediate. The provision of modifications allows Beginners to adjust the workout to a suitable level, supported by modifications and community feedback from users who are gaining strength. However, the focus on isometric holds and heavier weights slightly elevates the difficulty, giving a mild inclusion of Advanced. The video's suitability for 'all levels' indicates adaptability, making Intermediate a strong fit while still being accessible to Beginners with adjustments."
}