{
  "video_id": "CSJm2ThlAOc",
  "title": "5-minute TABATA ENCORE cycling workout",
  "description": "This is the perfect workout finisher!!! Take 5 minutes to complete your workout with 1 round of tabata! Tabatas have a fun, high-energy structure that will leave you feeling awesome! We will have a short warm up and then a cool down to finish! We will be working between sprints and heavy climb speed increases to maximize our time! \n\nNew to tabatas?! A tabata is a form of high intensity interval training. The work timer is set for 20 seconds and rest for 10 seconds. To maximize a tabata, it is important to give it your 100% during the work portion. There are a total of 8 work/rest bouts. \n\nA huge thank you to Peter and Black Diamond Session for writing and performing Go Go Go Tabata for our awesome butt-kicking community! \nSupport Peter Spero & Black Diamond Sessions here! \nBand: Black Diamond Sessions\nWebsite: https://blackdiamondsessions.com/\nFacebook: https://www.facebook.com/blackdiamondsessions\n\nIMPORTANT! The RPMs noted throughout the ride are just a range! Make sure to ride where you feel comfortable! That may be above or below the range indicated. \n\nWe're hosting a trip to ICELAND in JUNE 2024! Reserve your spot here! 👉 https://www.trovatrip.com/trip/europe/iceland/iceland-with-kaleigh-cohen-jun-2024\nCheck out what's included and the itinerary above! 👆\nSpots are limited | ONLY 15 SPOTS AVAILABLE! The first 10 people to sign up get an early bird rate and SAVE $100! Payment plan options are available! \n\nSign up for our FREE 8-week workout program, SWEET SUMMER SWEAT!\nJoin here! https://kaleighcohen.com/sweetsummersweat/\n\nI may have gotten a little carried away with that takeout order, but my oh my, IT WAS FUN!!! This ride definitely brings speed and boosts energy!!! This TEAM SPRINT ride will increase your cardio endurance and leave you feeling ALIVE!!!! \n\nNeed a longer WARM-UP?  https://youtu.be/tOjKOmtPcqs\n\nMY LINKS:\nLooking for indoor cycling shoes?- https://ride.shimano.com/KCF15\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/3pnMYSK\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nSpotify playlist- https://open.spotify.com/playlist/2I2VRags7WLkQ4hT90dcWz?si=e175902931f147c6\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\nADD IT:\nDESSERT!- https://youtu.be/eumN5TrtnzI\n\nRESISTANCE for my classes\nYou always want to feel something under your feet, this will ensure you are doing the work, prevent you from bouncing in the saddle, and protect your knees!\n6 - Working your way up that hill | Moderately Light \n7 - Mid-hill already, you can definitely feel this! | Medium\n8 -  This is where heavy really starts to kick in | Moderately Heavy\n9 - We are really starting to climb now! This is a challenging resistance! | Heavy\n10 - Top of your hill! You should be able to keep a smooth pedal stroke. | VERY Heavy\nWatch this for more detail: https://youtu.be/8DbpBXGAB8Q\n\nMODIFICATIONS for seated options\n2nd position jogs and moves: Stay seated and increase speed a bit, really focus on the pull-up to activate the quadriceps.\n3rd position climbs and moves: Stay in the saddle and increase resistance a smidge, really focus on the push-down and pull-up of the pedal stroke to activate the glutes, hamstrings, and quadriceps maximizing power with the heavy resistance.\n\nCHAPTERS:\n0:00 - 3:23 WARM UP | My World by Warcub\n3:24 - 5:45 SPRINTS | \n\nSome of the links listed above are affiliate links, such as Amazon, and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for the harm, damage, or injury as a result of any information provided.\n\n\nMB01SH0U391Y1WU",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [],
  "publishedAt": "2023-06-28T09:00:17Z",
  "duration": 380,
  "durationFormatted": "6:20",
  "viewCount": 147620,
  "likeCount": 4373,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/CSJm2ThlAOc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/CSJm2ThlAOc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/CSJm2ThlAOc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/CSJm2ThlAOc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/CSJm2ThlAOc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/CSJm2ThlAOc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I couldn’t get myself behind a 30 minute cycle this morning but a 20 minute ride + this Tabata was the perfect solution! Thanks Kaleigh for motivating me to do more.",
    "I started 95kgs, now I’m 90 as nightly I’ve been following along her cycling videos ❤️ I can feel the difference everyday 🥰🥰🥰",
    "I did it!  5 extra minutes is a perfect add on!! Thanks for adding this option!!!❤",
    "After that climb ride, my legs said no, no, no!  But my mind said go, go, go!!!  Did it :)",
    "Every time I do this, I gain a better appreciation for how perfect this song is for tabata, right to the beats before the next interval signaling the end of the recovery!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}