{
  "video_id": "D9tLtmBlodg",
  "title": "Extremely Powerful Guided Meditation to Manifest Your Dreams and Desires.",
  "description": "Create the life you wish to have and surrender your creation to the Infinite Intelligence.  Allow space for relaxation and ease while the universe takes care of it for you. EXTREMELY POWERFUL CREATION TOOL.\n\n#meditation #guidedmeditation #meditate\n\nDownload or Stream any Rising Higher Meditation content to any device,  iTunes, Spotify, or Amazon MP3:  Search \"Rising Higher Meditation.\"\niTunes: https://apple.co/2LkwXav\nSpotify: https://spoti.fi/2SedTvj\nAmazon MP3: https://amzn.to/2LnqU59\nApple: https://apple.co/2LkwXav\nand many more~ search Rising Higher Meditation.\n\nIf you enjoyed the beautiful music in the track, we have an instrumental-only version of it here:\nhttps://bit.ly/3lD54K5\n\nINSTAGRAM: http://www.instagram.com/risinghigherjessshepherd\n\nEsta pista también está disponible en español:\nhttps://youtu.be/Caks2CNdJ8Q\n\nWEBSITE: http://www.jessshepherd.com\n\nSupport the channel ~ see our wonderful merchandise range here: https://bit.ly/3lmPKj9\n\nA guided meditation to help you get clear on what you wish to create and show you how to completely release your manifestation to the Source Of All That Is, so that it may be created in a way that is perfect for you.  This is an extremely powerful exercise which can be repeated for every individual dream and desire.  \nIt is incredible to watch the synchronicities and events that transpire when this meditation is used.\n\nGet into a comfortable position, close your eyes, relax, and breathe deeply.\n\nMany blessings and much love from Jess\nMusic by Rising Higher Meditation\nImage created by Jess Shepherd \n\nWritten, spoken and produced by Jess Shepherd\nAbout The Speaker:\nJess Shepherd is an amazing Energy Therapist from the Gold Coast, Australia. She is a true blessing to this world and we know you will be able to FEEL her positive energy through these recordings. If you want to learn more from Jess or get in touch, please visit www.jessshepherd.com\nemail us connectandcre8@gmail.com\n\n*** How Can Guided Meditation help you? ***\nGuided meditations are designed to bring you into a still and peaceful space, a relaxed but aware state where you are in sync with all that you want to attract into your life.\n\n***PLEASE do not listen to these tracks while operating machinery or driving. They are best used with headphones, and sitting or lying in a comfortable, quiet place where you will not be disturbed.\n\n***This work is not intended to substitute for professional medical or counseling advice. If you suffer from a physical or mental illness, please always seek professional help.\n\nWe love creating guided meditations, affirmations and music so please subscribe and share if you enjoy them.  \n\nIf you are new to meditation, we recommend you listen to a Relaxation or Beginners meditation first to get into a relaxed meditative state. \n\nGuided Mindfulness Meditation for Beginners - https://goo.gl/Eahjv8\nGuided Meditation for Full Body Relaxation - https://goo.gl/9zLUsz\nGuided Meditation for Relaxation - https://goo.gl/25vWP3\n\nSome other great guided affirmations, meditations and inspirational speeches:\n\nGuided Meditation for Manifestation - Visualise the NEW YOU: \nhttps://goo.gl/j827rL\n\nVisualise and Manifest Anything!:  https://goo.gl/UU34PM\n\nGuided Meditation Align with the Frequency of Wellness:  https://goo.gl/h91eCL\n\nHow to get HAPPY Now! (Guided affirmation):  https://goo.gl/g5VXBn\n\nGuided Meditation for Purpose and Potential:  https://goo.gl/zvNA98\n\nGuided Meditation for Detaching from Thinking (Assisting Relief from Anxiety, Depression and Worry): https://goo.gl/qzR5uk\n\nFlow (Guided Meditation for Letting Go): https://goo.gl/QKdzTx\n\nFeel Your Inner Being; https://goo.gl/Wp2Qt5\n\nPlease subscribe to the channel.  Your support is greatly appreciated.\n\nMANIFESTATION, CREATE, POSITIVE AFFIRMATIONS, CHANGE YOUR PROGRAMMING, \"I AM\", I AM AFFIRMATIONS, AFFIRMATIONS, LOVE, WELLNESS, GRATITUDE, UNIVERSAL GUIDANCE, DIVINE, REPROGRAMMING, UNLIMITED CONSCIOUSNESS, GOD, PEACE, INNER STRENGTH, WEALTH, PROSPERITY, ABUNDANCE, MONEY,  MANIFESTATION, LAW OF ATTRACTION, CHANGE SUBCONSCIOUS AFFIRMATIONS, INSOMNIA,SLEEP MUSIC, SLEEP EASY, RELAXING MUSIC FOR SLEEP, AFFIRMATION FOR SUBCONSCIOUS POSITIVE PROGRAMMING, HEALING, LAW OF ATTRACTION, FOCUS, INTEND, MEDITATION, GUIDED MEDITATION, POSITIVE ENERGY, RAISING VIBRATION, RAISING FREQUENCY,  MEDITATION, TRUST, INFINITE INTELLIGENCE, GUIDANCE, SUPPORT, LAW OF ATTRACTION, FRIENDLY UNIVERSE, FLOW, PRESENCE, BLESSED, ENERGY, ATTRACTING ABUNDANCE.",
  "channelTitle": "Rising Higher Meditation ®",
  "channelDescription": "You can uplift and upgrade your life by adjusting your beliefs, thoughts, and feelings. I am committed to your beautiful expansion by providing quality reprogramming and meditative content that assists you in transforming your life experience into one filled with joy, peace, abundance, and bliss on all levels. Affirmations, cognitive reprogramming, and guided meditation work to help you align with the peace and genius that already resides within you. Here you will find your center, hear your intuition and manifest greatness.\nCome on this exciting journey with me as you discover how connected, powerful, and harmonious you really are.\n\nSubscribe for new uploads every week, all available on music platforms worldwide.  \n\n#guidedmeditation #positiveaffirmations #bestmeditations #sleepaffirmations  #risinghighermeditation  #iamaffirmations \n#jessshepherd\n\nWith love from my heart to yours.\nJess Shepherd\n",
  "tags": [
    "Guided meditation",
    "meditation",
    "Alignment",
    "Healing music",
    "Healing",
    "Law of Attraction",
    "Meditation for beginners",
    "Meditation for Anxiety or Depression",
    "Mindfulness",
    "chakras",
    "Positive Affirmations",
    "Mind Reprogramming",
    "Energy Healing",
    "Affirmations",
    "Change thinking",
    "Program Your Mind",
    "Affirmations for Abundance",
    "Abundance",
    "Manifest Your Dreams",
    "Manifestation",
    "Meditation for Manifestation",
    "Surrender",
    "Powerful Meditation",
    "Attract your dreams",
    "create your reality",
    "Joe Dispenza Meditation"
  ],
  "publishedAt": "2019-07-15T20:00:00Z",
  "duration": 2647,
  "durationFormatted": "44:07",
  "viewCount": 3787637,
  "likeCount": 51442,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/D9tLtmBlodg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/D9tLtmBlodg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/D9tLtmBlodg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/D9tLtmBlodg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/D9tLtmBlodg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/D9tLtmBlodg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Download or Stream more guided meditations here:<br>iTunes: <a href=\"https://apple.co/2LkwXav\">https://apple.co/2LkwXav</a><br>Spotify: <a href=\"https://spoti.fi/2SedTvj\">https://spoti.fi/2SedTvj</a><br>Amazon MP3: <a href=\"https://amzn.to/2LnqU59\">https://amzn.to/2LnqU59</a><br>Apple: <a href=\"https://apple.co/2LkwXav\">https://apple.co/2LkwXav</a><br>and many more~ search Rising Higher Meditation.",
    "You guys. I started doing this a couple of weeks ago. The thing I was visualizing was a specific role on TV I had recently auditioned for. I booked that job. This is the first big job Ive ever booked. I’m shooting at Warner Brothers in a couple of weeks. This is so real.",
    "I am not sure if anyone will read this comment, but if you are: I want to send you all the world&#39;s positive vibes! 🤗",
    "Beautiful, you. Yes you, reading this, you are beautiful, you are love.",
    "if you’re down here looking for confirmation, yes it really works. i used this a few times and it worked for all of them :)"
  ],
  "channelSubscriberCount": 988000,
  "channelVideoCount": 528
}