{
  "video_id": "dAqQqmaI9vY",
  "title": "30 Min Daily Yoga Routine for Beginners (Follow Along)",
  "description": "30 Minute Daily Yoga Routine for Beginners (Follow Along) \n\nBuy Mamaearth's Ubtan Face Wash - https://bit.ly/3etuDvu\n(Apply discount coupon FITTUBER21 to get 21% off)\nBuy from Amazon - https://amzn.to/3o5AecH\n\nThis is a 30 mins beginner daily yoga routine that you can do at home. With this unpredictability surrounding the world in the pandemic, this video is focused on channelising our energy in learning the divine practice of Yoga. If you are a complete beginner to yoga or someone with basic experience, then this video will properly introduce you to the heavenly world of asanas and pranayama making your body healthy and mind calm. One more thing this video is not just to watch but to follow along. So come on. Let's do it together.\n\n0:40​ - Before getting started with this Yoga Routine, do this.\n01:12​ - Yoga Warm up. These have been referred to as Sukshama Vyayama in the Yogic scriptures\n05:14​ - Suryanamaskar.The sun salutation. A powerful yogic practice involving 12 asanas.\n06:53​ - Six most important asanas to beat the problems of our busy modern lifestyle\n07:05 - Pawanmuktasana. The gas release pose. Best to beat acidity and gas issues.\n07:47​ - Markatasana. The monkey pose. This is especially for the back and the issues related to the spine.\n08:41 - Naukaasana. The Boat pose. This is to reduce the belly ponch and tone the abdominal muscles.\n09:20 - Sarvangasana - The Shoulder stand. It is helpful for almost every body part.\n10:25 - Badhkonasana - The butterfly pose for PCOD and prostate.\n11:16 - Mandukasana - The frog pose is the best for diabetes.\n​12:20 - Yogic pranayama or the breathing exercises.\n12:40​ - Aum chanting. Thrice. Aum chanting creates subtle vibrations within the body that makes the body ready for pranayama.\n13:27​ - Bhastrika pranayama or yogic deep breathing. This is a simple yet effective way to boost the immunity. It energises the body and calms the mind.\n14:47​ - Kapalbhati or rapid exhalation. Among the most powerful Yogic pranayama. It pushes the excessive air trapped in the digestive tract. \n19:03​ - Agnisaar. The benefits of agnisaar kriya increase manifold when it's done just after Kapalbhati. It is known to strengthen the digestive system.\n20:03 - Jalandhar Bandh. Miraculously beneficial for getting over addictions of the body as well as the mind.\n21:26 - Shithali breath. The cooling breath. For all body heat issues. Must in summers.\n22:35​ - Anulom Vilom pranayama or Alternate Nostril Breathing. Anulom vilom instantly calms the mind. It has the capability to put in a trance state. You feel mediative.\n26:43​ - Bhramari Pranayama or Bee breath. This is the best breathing exercise for brain. Stress, anxiety, depression, insomnia, anger issues, weak concentration power,  you name it, Bharamari has the power to cure any issues related to the brain. It even stimulates the pineal and pituitary glands.\n28:03​ - Rubbing the hands together before concluding. It activates the acupressure points.\n28:27​ - Last but not the least. Shavasana, to cool down the body.\n\nFOODS & PRODUCTS RELATED TO THE VIDEO (Not Sponsored)📦\nYoga Mat (Cotton) - https://amzn.to/2J4Uedk​\nYoga Mat (Regular) - https://amzn.to/2xecwWO\nYoga Mat (Jute Handwoven) - https://amzn.to/30Ze0jp\nYoga Mat (Jute Handwoven) - https://amzn.to/312ZhnL\n\n✅  SUPPORT MY WORK and get exclusive perks \nhttps://www.youtube.com/channel/UCYC6Vcczj8v-Y5OgpEJTFBw/join\n\nINSTAGRAM :  Follow me on Instagram\nhttps://www.instagram.com/fittuber\n\nRECOMMENDED VIDEOS 📹\n15 Min Daily Yoga Routine for Beginners (Follow Along)\nhttps://youtu.be/s2NQhpFGIOg\nThe Only Diet Plan That Ayurveda Recommends (Men & Women)\nhttps://youtu.be/6ZUFT0CwU1w\n\nBEST PRODUCTS FROM UPDATED WORST TO BEST 2020 SERIES (Not Sponsored)\nShampoo (option 1) - https://amzn.to/2IdTmor\nShampoo (option 2)- https://amzn.to/2U7ZhwV\nShampoo (option 3) - https://amzn.to/3h1mDB6\nToothpaste (option 1) - https://amzn.to/3jrcNbu\nFace wash (option 1) - https://amzn.to/2J6vLW6\nFace wash (option 2) - https://amzn.to/2J5JRH6\nFace wash (option 3) - https://amzn.to/2J5QKs7\nHair oil (option 1) - https://amzn.to/2YU6zqh\nHair oil (option 2) - https://amzn.to/33uYhZI\nHair oil (option 3) - https://amzn.to/33tj938\nMoisturiser (option 1) - https://amzn.to/3n4cdCL\nMoisturiser (option 2) - https://amzn.to/38r46fE\nMoisturiser (option 3) - https://amzn.to/2U7Y0Z4\nGhee (option 1) - https://amzn.to/3eplzUS\nGhee (option 2) - https://amzn.to/38cDTzG\nGhee (option 3) - https://amzn.to/34pRT7R\n\n29:57 - Segment Partner - Mamaearth's Ubtan Face Wash\n\nDISCLAIMER: Whatever I have spoken in this video is my honest opinion. I am not with or against any brand. I judge a product on the basis of its merit. None of the brands/products mentioned are sponsored unless explicitly mentioned. Neither the sponsored brand nor any other brand/organization for that matter has any control over views shared on this channel. \n\nMusic Credits : YouTube Audio Library \n\nI wish you good health.\nFit Tuber",
  "channelTitle": "Fit Tuber",
  "channelDescription": "Welcome to Fit Tuber! I am a fitness enthusiast from India. Fitness doesn't necessarily mean making bulky muscles. To me, it is to stay healthy and feel good about our bodies. I am not the fittest person,  but I try to stay on track and constantly learn new things on the way.\n\nOn this channel, you can expect lesser known health tips, popular product reviews, quick healthy recipes, workout tips, motivational videos, workout videos and more!\n\nI upload new video every alternate Friday at 7 PM(IST) . SUBSCRIBE and HIT THE BELL icon to get notified whenever I upload a new video.\n\nThank you for visiting.\n\nI wish you good health.\nFit Tuber\n\nP.S. -  Please note that hellofittuber@gmail.com is the only official email id of Fit Tuber. All other email ids should be treated as scam. Thank you!",
  "tags": [
    "yoga for beginners",
    "yoga for weight loss",
    "daily yoga for flexibility",
    "daily yoga stretches",
    "daily yoga for fitness",
    "daily yoga practice",
    "beginners yoga",
    "beginners yoga for flexibility",
    "beginners yoga stretch",
    "yoga follow along for beginners",
    "yoga follow along 30 min",
    "yoga follow along advanced",
    "how to do yoga for beginners",
    "easy yoga routine",
    "kapalbhati pranayama",
    "anulom vilom how to do",
    "yoga breathing exercises",
    "fit tuber yoga routine",
    "fit tuber yoga",
    "fit tuber yoga 30 min"
  ],
  "publishedAt": "2021-04-02T13:30:12Z",
  "duration": 1859,
  "durationFormatted": "30:59",
  "viewCount": 11315218,
  "likeCount": 221649,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/dAqQqmaI9vY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/dAqQqmaI9vY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/dAqQqmaI9vY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/dAqQqmaI9vY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/dAqQqmaI9vY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/dAqQqmaI9vY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "&quot;The body benefits from movement and the mind benefits from stillness&quot;. Are we ready for <a href=\"http://www.youtube.com/results?search_query=%2321daysyogachallenge\">#21daysyogachallenge</a>?",
    "No ads in 30 mins video.a huge applause goes to u.",
    "Things i learned from your video <br>1. Drinking water after getting up<br>2.oil pulling<br>3.daily seasme oil massage<br>4.daily surya namaskar<br>5.tratak while going to sleep<br>6.seasme oil feet massage on feet while going to sleep<br>AND MOST IMPORTANT <br>-checking ingridients list of products <br><br>Thanks vivek for changing my life ,  may you live a 100 years happy life , and may you get evertyhing you want   <br> 😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘",
    "Day 16 switched to 30 mins now. Experiencing immense benefits such as mental peace , more interest in studies and physical strength.",
    "FIT TUBER IS MAKING THIS GENERATION MOVE TO AYURVEDA FROM MODERN SCIENCE....<br>THANK YOU, YOU ARE DOING A GREAT JOB  ...!!"
  ],
  "channelSubscriberCount": 8050000,
  "channelVideoCount": 407
}