{
  "video_id": "DBhadQTCBeo",
  "title": "Sleep Meditation Guided 20 Minute",
  "description": "Let this Original 20 minute guided meditation for sleep, recorded by us to put you into a deeply relaxing state so that you can drift away for the night.  This meditation will induce sleep by scanning each of your body parts, allowing them to let go of any tension, while becoming very relaxed, allowing gravity to do it's thing.  Have a good night :)  Enjoy!\n\nSpoken Voice: Original Commentary recorded by us.\nBackground Music: Exclusively owned and produced by us (Great Meditation).\nBackground Image: is an original derivative unique to this channel, Transformed from Licensed images where attributions are not required.",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "meditation sleep",
    "meditation before sleep",
    "meditation guided sleep",
    "meditation sleep 20 minutes",
    "sleep meditation",
    "sleep guided meditation",
    "sleep meditation guided",
    "sleep meditation 20 minutes",
    "guided meditation",
    "meditation guided",
    "guided meditation sleep",
    "guided sleep meditaiton",
    "guided meditation 20 minutes",
    "guided meditation sleep 20 minutes",
    "20 minute meditation",
    "20 minute meditation sleep",
    "20 minute meditation guided",
    "20 minute guided meditaiton",
    "meditation",
    "sleep"
  ],
  "publishedAt": "2021-05-07T02:00:01Z",
  "duration": 1202,
  "durationFormatted": "20:02",
  "viewCount": 1280214,
  "likeCount": 8231,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/DBhadQTCBeo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/DBhadQTCBeo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/DBhadQTCBeo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/DBhadQTCBeo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/DBhadQTCBeo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/DBhadQTCBeo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Finally, a 20 minute video. I hate 3 or 8 hour videos, what&#39;s the point if I fall asleep in 15 minutes anyways?",
    "I’ve been having the worst mental health lately and these videos always calm me down after so much crying!! I appreciate all your effort you put into these videos!!🤞🏼",
    "Absolutely love this, listen to it every night. I still have no clue what happens at the end as I am always asleep before then 😂",
    "I listen to this every night as I get so anxious about school in the night but this exact meditation just helps me thank you so much!",
    "I love the 20 minute meditations! I get super paranoid during the night and I fell asleep while this video was still playing!"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}