{
  "video_id": "dCjt9eptadI",
  "title": "30 Minutes Workout - Virtual Scenery - Treadmill / Exercise Machine (Cotswolds UK) 1080/60fps",
  "description": "Treadmill? Exercise bike? Cross trainer? Rowing machine? Flying carpet? Beat the boredom with a virtual tour around the picturesque Hobbit Shires of Gloucester and the Cotswolds, while you work out for a full 30 minutes.  SEE NOTES BELOW REGARDING SPEED...\nThe music was made by me and I acknowledge not to everyone's tastes, so do feel free to mute and use your own music :o)\n(Best enjoyed at full 1080p @ 60 frames per second)\n\nSPEED NOTES:  I've had some feedback comments regarding the speed of the video not being \"realistic\" and not accurately representing running or walking. Before publishing, I experimented creating the video at various jogging or cycling speeds, but found with the slower speeds, the visuals got tedious very quickly.  \n\nIn the end I settled for real-time driving speed which provides sufficient changes of scenery to keep the visuals interesting, bearing in mind most people will be using this video as a distraction from the tedium of exercise anyway. The faster speed also allows you to see much more of the area than you would do at slower speeds.  :o)",
  "channelTitle": "Rickvanman - Variety Channel",
  "channelDescription": "Variety channel covering anything and everything, from van life, V-logging, carnivore diet, astrophotography, touring & camping, self-build motorhomes, forest walks,  allotment gardening, plus lots of other things.\n\nI’m just a guy who enjoys making YouTube videos for a hobby and generally likes to point a camera at whatever I’m interested in at the time. \n\nI'm also the Voiceover guy from The Honest Guys meditation channel: http://www.youtube.com/user/TheHonestGuys\n\nAll questions (including what mic am I using) answered here: http://rickvanman.co.uk/faq.html\n\n.",
  "tags": [
    "virtual scenery",
    "treadmill",
    "exercise bike",
    "cycling",
    "scenery",
    "exercise",
    "virtual",
    "30 minutes",
    "workout",
    "guided workout",
    "cotswolds",
    "countryside",
    "uk",
    "tour",
    "touring",
    "armchair",
    "Treadmill scenery",
    "exercise bike scenery",
    "cross trainer scenery",
    "exercise machine scenery",
    "chedworth",
    "bibury",
    "arlington row",
    "Bike",
    "Exercise Machine",
    "jogging",
    "running",
    "fitness",
    "virtual workout",
    "scenery for exercise bike",
    "scenery for treadmill",
    "treadmill virtual scenery",
    "1080 60fps"
  ],
  "publishedAt": "2016-06-28T10:18:01Z",
  "duration": 1883,
  "durationFormatted": "31:23",
  "viewCount": 4065681,
  "likeCount": 32842,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/dCjt9eptadI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/dCjt9eptadI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/dCjt9eptadI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/dCjt9eptadI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/dCjt9eptadI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/dCjt9eptadI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Turned 70 last year and decided I needed more exercise so invested in an exercise bike and now enjoy travelling the world on it.Thank you.",
    "My workout this morning. This  80 year old doesn&#39;t feel so hemmed in due to the current virus situation, with videos like this. Thanks.",
    "On the 15th passing anniversary of my lovely British husband, I am on my treadmill sharing this run through the Cotswolds with his spirit since we never experienced it, together.  I miss him like the sun...Miss you, Philip...",
    "Fighting off depression by trying to just get out of bed - this had the perfect amount of trees and beautiful countryside to make getting on my stationary bike actually worthwhile.  Thank you SO MUCH for this.  It&#39;s going to be a delightful habit... and I&#39;m going to make it one by blogging about it.  :)   At first the speed felt a little hectic but then I made an effort to just enjoy it for what it was, and it turned out to be quite nice.  Thank you again - now my brain is woken up enough to start studying for the day!  :)",
    "I love this! I&#39;m a 70 year old grandma and during my younger days, running has helped me a lot. In 2007, I joined the Annual Army 10 Miler Run in Washinton DC where I used to work. I was 58 years old. I finished the run in 2 hours 44 minutes. Now at my age, I only hit my treadmill with your video to keep me healthy. Awesome!! Thanks a lot!"
  ],
  "channelSubscriberCount": 148000,
  "channelVideoCount": 1005
}