{
  "video_id": "dCtwWNTnOq4",
  "title": "10 min Upper Body Workout With Dumbbells (Arms, Back, Chest) Slimming & Fat Burn!",
  "description": "10 min Upper Body Workout With Dumbbells Arms, Back, Chest to lose weight & Fat Burn for women over 50 and suitable for beginners and seniors workouts. Exercises for back fat, chest toning and arms giving a perfect quick 10 minute upper body workout and if you repeat this sequence 3 times, you will have done what I would do in the gym! xx\n\nCLICK HERE FOR MORE 30 MINUTE INDOOR WALKING WORKOUTS\n\n 💪 30 Minute GET FIT Indoor Walking Workout For Women Over 50!\nhttps://youtu.be/kp67VFhbpsQ\n\n💪 30 Minute FAT BURNING Walking Workout | Get Fit LOSE WEIGHT Low Impact!\nhttps://youtu.be/g8Bc1TA6pbM\n\n30 MINUTE FULL BODY WORKOUT FOR BEGINNERS\nhttps://youtube.com/playlist?list=PL32YrxpjeHf7SXev122PUWL2584BVmY-C\n\nCLICK HERE FOR MORE NATURAL HEALTH REMEDIES\n\n🍵 Drink This First Thing In The Morning For Amazing Results!\nhttps://youtu.be/2kxbTcDBHSo\n\n🥦 Look Younger By Eating This food Every Day! How To Make Broccoli Sprouts | Fabulous50s\nhttps://youtu.be/58RNgePLavM\n\n🍏 Apple Cider Vinegar Drink Recipe For Weight Loss!\nhttps://youtu.be/OCjJkWEpwBw\n\nHEALTH AND NUTRITION OVER 50\nhttps://youtube.com/playlist?list=PL32YrxpjeHf4TEbd-MXix714yMxNV3y5W\n\nCLICK HERE FOR MORE MAKEUP TIPS AND TRICKS\n\n💄5 MAKEUP MISTAKES On Mature Skin Over 50 | Fabulous50s!\nhttps://youtu.be/SNh9Qg33DsI\n\n👀 5 Biggest Makeup Mistakes On Mature Eyes Tutorial Over 50 | Fabulous50s\nhttps://youtu.be/IHfA15Emme4\n\nMAKEUP TIPS AND TRICKS FOR WOMEN OVER 50\nhttps://youtube.com/playlist?list=PL32YrxpjeHf6d76h4e4ivRPCk5PLcKT1r\n\n🔴 LIVE YOUNGER LONGER AND SUBSCRIBE: https://www.youtube.com/c/fabulous50s/?sub_confirmation=1\n\n💪 5 Minute Toned Arm Workout To Get Rid Of Batwings | No Weights!\n https://www.youtube.com/watch?v=wCdEJMWlfuY&t=3s&ab_channel=fabulous50s\n\n🚶♀️ 30 Minute 5000 STEPS Indoor Walking Workout For Women Over 50! https://www.youtube.com/watch?v=DhwJaDkgFkk&ab_channel=fabulous50s\n\n🧘♀️ 5 Minute Ab Workout For Women Over 50 | Reduce Belly Fat Fast | Fabulous50s: https://www.youtube.com/watch?v=sSbVUcxvQpo&t=15s&ab_channel=fabulous50s\n\nWelcome to fabulous50s! Here you will find content that relates to how to look younger, mature skincare, anti aging, wrinkles, how to dress over 50, style, fitness, health and beauty over 50. All the videos here have you, a mature Woman in mind and if you have any questions or video suggestions for mature Women, please feel free to leave your comment below.\n\n🔷 JOIN THE 14 DAY CHALLENGE:https://www.youtube.com/watch?v=8sUFKRzP9Uc&ab_channel=fabulous50s\n\n▶️ SHARE THIS VIDEO WITH SOMEONE YOU CARE ABOUT:\nhttps://youtu.be/J_wFN1yF3Dw\n\n**Disclaimer: Information provided in this video is of a general nature only and is for entertainment/educational purposes. We strongly recommend that you consult with your physician before beginning any exercise program. Performing any of these exercises is done so at your own risk.***\n\nLETS CONNECT👋 \n \nFabulous50s INSTAGRAM: \nhttps://www.instagram.com/fabulous.50s/ \nFabulous50s PRIVATE FACEBOOK GROUP: \nhttps://www.facebook.com/groups/29024... \nFabulous50s FACEBOOK: \nhttps://www.facebook.com/fabulous50ss/ \n————————————————————\nFabulous50s WEBSITE: \nhttps://fabulous50s.co \n\nTHANK YOU FOR WATCHING, COMMENTING, SUBSCRIBING & LIKING. \n\nI source all my music from Epidemic Sound. If you love a song from their selection and would like me to include in a workout, please let me know :)\n\n https://www.epidemicsound.com/referral/w2id0e/\n\nPlease tune in for new videos every week!\nEMAIL ALL ENQUIRIES TO: \npr@fabulous50s.com \n————————————————————\nMAIL: \nPo Box 12239 Clunes, NSW 2480 Australia 2480 \n●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●\n#fabulous50s #UpperBodyWorkout #10minuteWorkout",
  "channelTitle": "fabulous50s",
  "channelDescription": "Hi, I'm Schellea (Shelly), the founder and CEO of Fabulous50s. At 58, I live in Australia, and it brings me immense joy to help women over 50 feel confident, vibrant, and empowered. My passion is to inspire them to embrace who they are and look forward with excitement to the future.\"\n\nWith 40 years of experience as a small business entrepreneur, my journey has encompassed a wide range of fields, including creative design, health, fitness, fashion, and beauty. I am a certified fitness instructor and Neuroathletics coach, specializing in exercise and brain health for older adults. My focus is on helping women maintain vitality, creativity, longevity, and mental sharpness as they age.\n\nI am also a certified life and business coach, meditation and mindset coach, personal stylist, and color consultant. My mission is to help women over 50 thrive in every aspect of their lives, empowering them to live with confidence, purpose, and joy.\n\nI'm here to guide and support you on your journey. xx\n",
  "tags": [
    "fabulous50s",
    "Schellea Fowler",
    "home workout",
    "upper body",
    "upper body workout",
    "back workout",
    "dumbbell workout",
    "upper body dumbbell workout",
    "toned arms",
    "arm workout",
    "back fat",
    "lose weight",
    "chest workout",
    "upper body workout at home",
    "upper body workout with dumbbells",
    "back fat workout for women with weights",
    "chest workout for beginners",
    "fabulous 50s workouts",
    "fabulous50s arms",
    "fabulous50s exercises arms",
    "fabulous50s arms without weights"
  ],
  "publishedAt": "2021-12-20T08:39:14Z",
  "duration": 650,
  "durationFormatted": "10:50",
  "viewCount": 1160906,
  "likeCount": 18051,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/dCtwWNTnOq4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/dCtwWNTnOq4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/dCtwWNTnOq4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/dCtwWNTnOq4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/dCtwWNTnOq4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/dCtwWNTnOq4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I turned 60 this year. Sadly, I have... let myself go. I am 50lbs  overweight, and my blood pressure is through the roof. I have been sedentary for the last year. I want to retake my life back. I don&#39;t like living this way. I hardly recognize myself in the mirror. I&#39;m going to do this. I believe your videos can help. Thank you.",
    "I do one of your workouts daily. It has been a great way to start my day and I find your warmth and personality make it so enjoyable. I would never have thought I could enjoy a workout, but here I am at 57 years old, getting fit and losing weight. 60 lbs down in 9 months, and maybe a little more to come. Thank you!",
    "Great workout thank you. I am 73 and just getting started after many years of sitting in an office and not much exercise.",
    "Your upper body work out really helps with my scoliosis",
    "I can not thankyou enough for these videos. I have been overweight most of my life, trying all sorts of food changes with no great success. While I have never loved exercise I have tried many different forms over the years but because it never shifted any weight I would give up as I also have had a lot of muscles and joint pain from a range of issues. Most of these issues, of course, stem from not loving myself but it has taken awhile to realise that. Anyway all of this is why I am so grateful for you and your videos, they are so filled with love and positivity, having different durations and body options means I can choose ones that fit how my body is feeling each day and really, for the first time in my life I actually get that post exercise buzz that people speak about. You are warm and kind and uplifting and have helped me find some joy in moving my body. Merry Christmas and much love 💜🙏"
  ],
  "channelSubscriberCount": 1980000,
  "channelVideoCount": 722
}