{
  "video_id": "ddnvghXHlIA",
  "title": "15 Min No Jumping Workout To Lose Weight At Home",
  "description": "Yes, you can still lose weight and burn fat fast at home even if you knee pain, knee problems, joint issues and other conditions that might interfere with your ability to exercise.\n\nIn today's video workout I have included the best body-weight exercises that are intensive for your muscles but don't require any jumping or excessive effort for your knees and legs. It's a effective low impact workout program to get lean.\n\nTogether, this 15 minute exercise routine will help you and your body burn calories and lose weight, because your body will start melting its fat deposits to provide energy for your muscles!\n\nAnd keep in mind that you need to perform this workout everyday regularly if you want to see results!\n\nGood luck and be sure to subscribe to the channel to receive new video workouts regularly everyday Monday to Friday!\n\nLeave me a comment below and tell me how you feel after completing this training. Share it with your friends if you find it helpful!💪❤️",
  "channelTitle": "Roberta's Gym",
  "channelDescription": "I'm here to help you look and feel great, with effective body weight workouts and exercises.\n\nBurn calories and extra fat with simple workout routines you can easily do at home. No equipment or gym necessary.\n\nNew video workouts Monday to Friday and then Sunday as well.",
  "tags": [
    "no jumping workout",
    "no jumping exercises",
    "weight loss workout no jumping",
    "weight loss exercises no jumping",
    "home workout no jumping",
    "low impact workout",
    "low impact exercises",
    "home low impact weight loss workout",
    "low impact legs",
    "weight loss workout",
    "easy weight loss workout",
    "simple weight loss workout",
    "easy weight loss exercises",
    "simple weight loss exercises",
    "no jumping no running workout",
    "workout for knee problem",
    "workout without jumping",
    "roberta's gym"
  ],
  "publishedAt": "2019-01-16T11:46:12Z",
  "duration": 945,
  "durationFormatted": "15:45",
  "viewCount": 2784689,
  "likeCount": 34226,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ddnvghXHlIA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ddnvghXHlIA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ddnvghXHlIA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ddnvghXHlIA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ddnvghXHlIA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ddnvghXHlIA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "It feels so good when it says &#39; You have successfully completed the workout&#39; and &#39; good job&#39;",
    "I lost almost 10 kg with this exercise,  walking 1hour 30 minutes a day and proper diet within 93 days ... Today is 93rd day ..thank you  Robertaa❤",
    "I love these &#39;no jumping&#39; exercises because I live in an apartment and my neighbors would probably hate me if I had to jump. Also, great workouts for heavier people like myself.",
    "Is it just me or does anyone get embarrassed when you exercise and your parents or siblings walk in",
    "The counting during the plank is the longest 15 in my life omg😣<br>But I enjoyed the work out! I’m doing it before bed because the exercise helps me to sleep better. Really loved it! Also, after following this channel for a few years tonight was the first time I actually attempted the super mans! It was a bit tricky to get it at first but now I can do it! Thanks!😋💜"
  ],
  "channelSubscriberCount": 6510000,
  "channelVideoCount": 2319
}