{
  "video_id": "Dh-lF2BEnRw",
  "title": "LAZY GIRL COUCH WORKOUT... Do this workout while watching TV!",
  "description": "✨Please visit my store and if you purchase anything please shop here ( https://shoppinest.com/ )\n\nNetflix and chill but make it fitness! Do this gentle, lazy girl workout all from your couch while you watch your favorite shows! its only 10 mins long, so this short low impact workout is perfect to do when you start a new episode. this is also a great gentle morning wake up workout!\n\nMy Worldwide babes 🌎  Shop my mojito amino & energy here: https://womens.best/Shop-Vicky\nEveryone in the USA 🇺🇸  Shop my Womens Best Collab supplements in GNC: https://womens.best/Vicky-GNC\n\nWORKOUT WITH ME ON MY APP: https://urlgeni.us/DailyThrivebyVickyJustiz\n\n♡ MY PERSONAL IG with travel, style, and more: https://www.instagram.com/vickyjustiz/ \n♡ FITNESS IG with workout clips and fit tips: https://www.instagram.com/vickyjustizfitness\n♡ TIKTOK: https://www.tiktok.com/@vickyjustiz\n\nJOIN OUR GIRLS-ONLY FACEBOOK GROUP: https://www.facebook.com/groups/vickyjustiz \n\n♡ Johnny's Channel / Travel Vlogs: https://www.youtube.com/johnnyurra\n\n♡ Shop my current faves on Amazon! https://www.amazon.com/shop/vickyjustiz\n\n♡ My blog: https://www.vickyjustiz.co/Blog\n\n♡♡♡♡♡♡♡♡♡♡♡♡♡♡\n\n♡ Partnership Inquiries: Hello@Vickyjustiz.com\nIMPORTANT DISCLAIMER: Vicky Justiz is a NASM Certified Personal Trainer. She strongly recommends that you consult with your physician before beginning any exercise program. You should be in good physical condition and be able to participate in the exercise. Vicky Justiz is not a licensed medical care provider and represents that she has no expertise in diagnosing, examining, or treating medical conditions of any kind, or in determining the effect of any specific exercise on a medical condition. Some titles and descriptions may include certain SEO keywords that may be perceived as misleading or may be perceived as a guaranteed result. Results vary from person to person and a video title / description should not be taken as an absolute truth.",
  "channelTitle": "Vicky Justiz",
  "channelDescription": "MY WORKOUT APP ➡️ https://www.dailythrive.app \n\nHey Friends!! Welcome to my channel. Here you will find all my home workouts, fitness advice, recipes and nutrition tips. All my knowledge comes from 8+ years of experience and all my studies (qualifications: NASM-CPT). I am passionate about empowering you to move your body in the way that feels right for you, right from home. About inspiring you to put yourself first, getting to know yourself, and in that process, falling in love with yourself too.\n\nYou are not just a subscriber to me, but part of a beautiful, international community of women that will motivate each other and push each other to be the best possible versions of themselves. \n\nInsta: @VickyJustiz & @VickyJustizFitness\nTiktok: @VickyJustiz\n\nFor more personal videos and vlogs, check out my vlog channel! 💛\n\nVicky is a sponsored Women's Best Athlete\n\nBRIGHT4U",
  "tags": [
    "vicky justiz",
    "home workout",
    "exercises",
    "Home Gym",
    "fitness",
    "workout",
    "how to",
    "lose weight",
    "gain muscle",
    "home workouts",
    "follow along workout",
    "mad fit",
    "chloe ting",
    "pamela rf",
    "madfit",
    "personal trainer",
    "workout from home",
    "workout at home",
    "home exercise",
    "exercise at home",
    "workout anywhere",
    "lazy girl",
    "gentle workout",
    "low impact workout",
    "low impact",
    "short workout"
  ],
  "publishedAt": "2022-03-31T15:00:07Z",
  "duration": 759,
  "durationFormatted": "12:39",
  "viewCount": 293970,
  "likeCount": 10101,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Dh-lF2BEnRw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Dh-lF2BEnRw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Dh-lF2BEnRw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Dh-lF2BEnRw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Dh-lF2BEnRw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Dh-lF2BEnRw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m 112 kg girl . LIKE my comment so I keep coming to this video.",
    "Can I just say that it helps so much to see a real reaction to exercising even for a fit person. Sometimes it’s hard to want to keep working out when your instructor is so energetic and unfazed by the exercise. So to see that it’s even hard or uncomfortable for you helps us that struggles. It just make me feel less alone I guess. Idk. Thank you for making videos that let us know hey it’s easier than you think and you can do it too",
    "while i’m not overweight, i am out of shape, and this workout has helped me get moving even with severe depression. i can’t get out of bed most days for more than an hour so just using my muscles in any way makes me feel really good. thank you for this :)",
    "I haven’t moved my body in nearly a year, gained a lot of weight and I’m in really bad shape. This workout was just what I needed! Doing something IS really better than doing nothing. So thank you for getting me moving.",
    "This got me up and going for doing things today. Just enough blood flowing to make me want to be productive I saved this and will definitely use again"
  ],
  "channelSubscriberCount": 2000000,
  "channelVideoCount": 640
}