{
  "video_id": "djLCTwi3PmU",
  "title": "20 Min Morning Yoga Flow | Every Day Full Body Yoga For All Levels",
  "description": "👉 Join my Flexibility Program to master challenging poses - https://www.charliefollows.com/flexibility-program\n\nWelcome to your 20 min morning yoga flow. This class is great for all levels and focuses on helping you start your day in a mindful way with a full body sequence of poses to stretch, strengthen and centre. \n\nToday's class includes a steady vinyasa flow with hip openers, backbends and standing balances. It's designed to help you feel like you've given your body everything it needs to have a great day. I also include lots of options for the more difficult positions so that you can make the practice your own.  \n\nI hope you enjoy this morning yoga flow. \n\nCharlie x\n\n✨ Online Courses: https://www.charliefollows.com/programs\n💌 Newsletter community: https://www.charliefollows.com/newsletter \n🙋‍♀️ Socials: TikTok @charlieefollows \nInsta: https://www.instagram.com/charlieafollows?igsh=MWdxMjE0ZHR1bzlydg%3D%3D&utm_source=qr\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2023-08-24T13:07:30Z",
  "duration": 1323,
  "durationFormatted": "22:03",
  "viewCount": 2786996,
  "likeCount": 62675,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/djLCTwi3PmU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/djLCTwi3PmU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/djLCTwi3PmU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/djLCTwi3PmU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/djLCTwi3PmU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/djLCTwi3PmU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hello friends I hope that you enjoy practicing in the woods with me ❤",
    "The fact that you do it in nature makes your videos 10 times better",
    "doing yoga in the forest seems like the most calming thing ever 💚",
    "I feel the urge to cry because I just finished this and it was way AMAZING. Haven&#39;t done any physical exercise for four years since the pandemic... I think I let go a lot of things with just this one class",
    "Thank you for reminding me that my body is my first choice and first voice. Yoga in natural surroundings really surmounts the beauty of my inner self."
  ],
  "channelSubscriberCount": 991000,
  "channelVideoCount": 1004
}