{
  "video_id": "dN5fWO9m1AY",
  "title": "45 MIN FULL BODY WORKOUT || At-Home Pilates 🤍 Day 7: Move With Me Series",
  "description": "Hope you enjoy this 45 Minute Full Body Pilates Workout. Remember to always listen to your body and most importantly, have fun! 😊\n\n\n🤍 INSTAGRAM: @movewithnicole\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 45 minutes full body",
    "pilates workout 45 minutes",
    "45 minutes pilates workout",
    "45 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates workout",
    "45 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "move with nicole",
    "pilates",
    "mat pilates",
    "feel good pilates",
    "intermediate pilates"
  ],
  "publishedAt": "2021-07-07T09:52:55Z",
  "duration": 2885,
  "durationFormatted": "48:05",
  "viewCount": 1917095,
  "likeCount": 41260,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/dN5fWO9m1AY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/dN5fWO9m1AY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/dN5fWO9m1AY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/dN5fWO9m1AY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/dN5fWO9m1AY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/dN5fWO9m1AY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Nicole, since I started doing pilates with you, I find peace in my day to day life. I suffer from depression and anxiety but the moment I press play I forget everything. The workouts are perfect, the way you explain the movements and the respiration relaxes me to another level. Thank you so much for bringing peace and some sweat to my everyday life. Dani from France !",
    "been weightlifting and doing cardio for the last 5 months and decided to give this a go, and was very much humbled by all the muscles i’ve been missing out on and not enough joint flexibility 😭 need to do pilates more often",
    "Congratulations on making it to the final day my beautiful Move With Me family!! 🎉😍 Thank you so much for joining me for this series and I hope you are all feeling amazing! Sending you all lots of love. ❤😘",
    "As a non-native speaker, I´ve gotta say THANK YOU for making it so easy, fluent and descriptive. It says a lot about your kindness and your aim to share your knowledge. &lt;3",
    "After the first 10 minutes i remember thinking to myself, “i can’t do this.”<br><br>I did it. I am powerful.<br><br>Thank you for all that you do!"
  ],
  "channelSubscriberCount": 4470000,
  "channelVideoCount": 229
}