{
  "video_id": "DQBCdbV2Enc",
  "title": "Virtual Running Videos For Treadmill With Music | Virtual Run Mountain",
  "description": "Want to lose weight, perform better and live longer?\nI'm a family physician sharing science-backed insights inside my free weekly newsletter: Join here 👉 https://dradrian.carrd.co\nVirtual Running Videos For Treadmill With Music | Virtual Run Mountain\n\nThis virtual running video was filmed on a run in the Mount Cook National Park in the South Island of New Zealand. Due to audio problems I have added music. I hope you enjoy it. Thanks for watching!\n\nGear I use and recommend:\nGPS Running Watch: https://geni.us/ZKUMIf\nAction Camera: https://geni.us/LlehXxK\nRunning Shoes: https://geni.us/kilcLA\n\nWelcome to the Virtual Running Videos Channel! On this channel you'll find treadmill running videos, indoor running videos, indoor running, virtual running videos, New Zealand scenery, and virtual run videos. I started this channel out of gratitude for the beautiful place I live and a desire to share that with people. You can experience running and with a virtual run in the beautiful outdoors from the convenience of your home. I hope you enjoy! Please leave a comment, I read every one.\n\nImportant Disclaimer: This content is strictly the opinion of myself and is for educational and informational purposes only. It is not intended to provide medical advice or to take the place of medical advice or treatment from a personal physician or health professional. Consult your doctor or qualified health professional regarding specific health questions and before beginning any nutrition, supplement, exercise or lifestyle program. Neither myself nor the publisher of this content takes responsibility for possible health consequences of any person or persons reading or following the information in this educational content. Please take care when exercising. Neither myself nor the publisher of this content take any responsibility for any accident, injury or any health problems which occur while watching this video. As with all exercise programs, when using our videos, you need to use common sense.  Check with your doctor before beginning any fitness program. By performing any fitness exercises, you are performing them at your own risk.  This channel will not be responsible or liable for any injury or harm you sustain as a result of our fitness program, videos, or information contained. Thanks for your understanding.\n\nLinks may be affiliate links from which I receive a small commission, but where the price is the same for you. Affiliate links are a way I help offset maintenance and running costs of video production.",
  "channelTitle": "Virtual Running Videos",
  "channelDescription": "Join for perks like early video access:\nhttps://www.youtube.com/channel/UCY95zbGK0vlAZ8Gk8OZqa1g/join\n\nOn Virtual Running Videos you'll find virtual running videos, virtual exercise running videos, indoor running, New Zealand scenery. I started this channel out of gratitude for the beautiful place I live and a desire to share that with people. Here you can find the perfect video for your indoor cycling or running workout. You can experience running and cycling in the beautiful outdoors from the convenience of your home. I hope you enjoy these treadmill running videos, indoor running videos, indoor running, virtual running videos, indoor cycling videos, treadmill tv, virtual running videos for treadmill, virtual scenery cycling, virtual running videos for treadmill, new zealand. #963393",
  "tags": [
    "treadmill running videos",
    "virtual running videos",
    "virtual scenery",
    "virtual run",
    "virtual running",
    "videos watch while running treadmill",
    "trail running videos treadmill",
    "videos to watch while running on treadmill",
    "treadmill running scenery videos",
    "scenery for treadmill",
    "virtual running videos for treadmill",
    "virtual exercise videos",
    "with music",
    "virtual running videos for treadmill with music",
    "jogging",
    "virtual run mountains",
    "virtual mountain trail run",
    "50 minutes",
    "treadmill workout"
  ],
  "publishedAt": "2020-10-04T09:48:29Z",
  "duration": 3020,
  "durationFormatted": "50:20",
  "viewCount": 1525703,
  "likeCount": 19066,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/DQBCdbV2Enc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/DQBCdbV2Enc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/DQBCdbV2Enc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/DQBCdbV2Enc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/DQBCdbV2Enc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/DQBCdbV2Enc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I don&#39;t want much, I just want the person reading this to be healthy, happy, and loved. Wishing you a good day my friend",
    "I lost one of my legs after surgery and can no longer go up my favorite mountain. Thank you for taking me back again.",
    "Peddling my mini bicycle, enjoying the music &amp; scenery. A 72yrs old trying to keep fit during the lockdown, lovely &amp; well done.",
    "What a wonderful run! Don&#39;t have a treadmil, so I managed with running in place in my living room and I had a blast! Every time there was a puddle, or a bridge, or a woodden  path or a rock on the way I would raise my knees a bit more. Thank you for this! It&#39;s such a lovely landscape with the river, the mountains, the snow, the rabbits, the wind blowing through the bushes and that big bird in the middle of the way!😄 Those bridges had a 20 person limit, but you just carried thousands with you ❤️",
    "I’m glad I found this! 23 year old former athlete 😢 I was diagnosed with Dysautonomia and orthostatic intolerance- went downhill very suddenly. I’ve been bed ridden for 3 months because my HR goes crazy high. I’ve missed working out and going out for walks soooo badly and I just walked in place to your video ❤️🙏 Doing what I can, thank you!"
  ],
  "channelSubscriberCount": 88500,
  "channelVideoCount": 153
}