{
  "video_id": "dXrkP_z2wG4",
  "title": "MEET YOUR SPIRIT GUIDES (Guided Meditation) 528Hz",
  "description": "Meet Your Spirit Guide, guided meditation is designed to help you to get into an appreciative, relaxed state so that you can easily interact with the non-physical who is guiding you, supporting and loving you.  \n\n#meditation #guidedmeditation #meditate\n\nDownload or Stream this meditation to any device, worldwide:\niTunes: https://goo.gl/qUEqbK\nSpotify: https://goo.gl/xfWfE4\nAmazonMP3: https://goo.gl/KvJhDg\nApple Music: https://goo.gl/qUEqbK\nand many more~ search Rising Higher Meditation.\n\nIf you enjoyed the beautiful music in the track we have an instrumental only version of it here: https://www.youtube.com/watch?v=tTAZwW9_JRc\n\nINSTAGRAM: http://www.instagram.com/risinghigherjessshepherd\n\nEsta pista también está disponible en español:\nhttps://youtu.be/wTbPzHa-5l4\n\nWEBSITE: http://www.jessshepherd.com\n\nSupport the channel ~ see our wonderful merchandise range here: https://bit.ly/3lmPKj9\n\nPrepare your space so that you will not be interrupted.   Get into a comfortable position, preferably sitting.  Allow yourself to relax deeply and be guided into a beautiful garden, where you will meet and communicate with your spirit guide.\n\nMusic by ©Rising Higher Meditation\n\nWritten and spoken by Jess Shepherd\nAbout The Speaker:\nJess Shepherd is an amazing Energy Therapist from the Gold Coast, Australia. She is a true blessing to this world and we know you will be able to FEEL her positive energy through these recordings. If you want to learn more from Jess or get in touch, please visit www.jessshepherd.com\nor email us connectandcre8@gmail.com\n\n*** How Can Guided Meditation help you? ***\nGuided meditations are designed to bring you into a still and peaceful space, a relaxed but aware state where you are in sync with all that you want to attract into your life.\n\n***This work is not intended to substitute for professional medical or counseling advice. If you suffer from a physical or mental illness, please always seek professional help.\n\n***PLEASE do not listen to these tracks while operating machinery or driving. They are best used with headphones, lying in a comfortable, quiet place where you will not be disturbed.\n\nWe love creating guided meditations so please subscribe and share if you enjoy them.  With love and appreciation,\nFrom Jess and the team at Rising Higher Meditation.\n\nGUIDED MEDITATION, MEDITATE, MEET YOUR SPIRIT GUIDES, YOUR SOUL, SOURCE, INNER BEING, GUIDES, HELPERS, ANGELS, FAIRIES OF THE UNIVERSE, ASSISTANCE FROM THE OTHER SIDE, UNIVERSAL WISDOM, ALLOWING RECEPTION, LISTENING, SEEING, SENSING, PARTICIPATING IN THE UNFOLDING OF FELT GUIDANCE.",
  "channelTitle": "Rising Higher Meditation ®",
  "channelDescription": "You can uplift and upgrade your life by adjusting your beliefs, thoughts, and feelings. I am committed to your beautiful expansion by providing quality reprogramming and meditative content that assists you in transforming your life experience into one filled with joy, peace, abundance, and bliss on all levels. Affirmations, cognitive reprogramming, and guided meditation work to help you align with the peace and genius that already resides within you. Here you will find your center, hear your intuition and manifest greatness.\nCome on this exciting journey with me as you discover how connected, powerful, and harmonious you really are.\n\nSubscribe for new uploads every week, all available on music platforms worldwide.  \n\n#guidedmeditation #positiveaffirmations #bestmeditations #sleepaffirmations  #risinghighermeditation  #iamaffirmations \n#jessshepherd\n\nWith love from my heart to yours.\nJess Shepherd\n",
  "tags": [
    "Guided meditation",
    "meditation",
    "meditation music",
    "Alignment",
    "Abraham - Hicks",
    "Eckhart Tolle",
    "insight",
    "awareness",
    "Sleep music",
    "Relaxing music",
    "chill out music",
    "Yoga",
    "Zen",
    "Healing music",
    "Healing",
    "guided meditation for alignment",
    "releasing resistance",
    "allowing",
    "intention",
    "Law of Attraction",
    "Law of Allowing",
    "Meditation for Kids",
    "Meditation for beginners",
    "Mindfulness",
    "Balance",
    "chakras",
    "spirit guides",
    "angels",
    "universal guides",
    "communicate with your guidance",
    "talk to angels"
  ],
  "publishedAt": "2017-12-25T20:00:02Z",
  "duration": 1463,
  "durationFormatted": "24:23",
  "viewCount": 5068171,
  "likeCount": 167512,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/dXrkP_z2wG4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/dXrkP_z2wG4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/dXrkP_z2wG4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/dXrkP_z2wG4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/dXrkP_z2wG4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/dXrkP_z2wG4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [],
  "channelSubscriberCount": 988000,
  "channelVideoCount": 528
}