{
  "video_id": "dzU1pqZ0qI4",
  "title": "35 MIN CARDIO PILATES || At-Home Full Body Workout",
  "description": "Break a sweat with this new 35 Minute Cardio Pilates Workout. I am using a set of 1kg weights but you can still enjoy the class without them.😊 \n\nThis Full Body Workout will combine Pilates principles/movements with athletic cardio flows to increase your heart rate for a fun and sweaty session! \n\n🌸  Wearing Gymshark http://gym.sh/Shop-Nicole\n\n\n🤍 INSTAGRAM: @movewithnicole\n🤍 EMAIL: movewithnicole.yt@gmail.com\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 35 minutes full body",
    "pilates workout 35 minutes",
    "35 minutes pilates workout",
    "35 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "35 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "cardio pilates",
    "35 min cardio pilates",
    "move with nicole",
    "pilates nicole",
    "cardio"
  ],
  "publishedAt": "2021-05-24T10:07:08Z",
  "duration": 2232,
  "durationFormatted": "37:12",
  "viewCount": 608575,
  "likeCount": 19468,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/dzU1pqZ0qI4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/dzU1pqZ0qI4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/dzU1pqZ0qI4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/dzU1pqZ0qI4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/dzU1pqZ0qI4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/dzU1pqZ0qI4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Sister, from one instructor to another, I gotta&#39; say: You are SUCH A PRO. Your commitment to your students is undeniable: your cues are empathetic and approachable, and the fact that you voice over the class AFTER filming shows true dedication to being an instructor. All those Insta-stars should take note: this is what being a fitness professional looks like. Thank you so much for leading by example, and for crafting such professional classes. And for kicking my butt, every time!!",
    "Hope you enjoy this new Cardio Pilates class! I&#39;m using a set of 1kg weights for a few series of exercises but you can absolutely enjoy the workout without them. Have a wonderful week ahead and sending you lots of love. 💗",
    "did a lot of your workouts, but this one is definitely one of my favorite ones!! I&#39;m no pro at pilates by far, but as a casual pilates enjoyer, I think this routine offers the perfect balance between energizing heart rate raising and some serious work for your leg and ab muscles &lt;3",
    "So great that the cardio exercises didn’t require a lot of jumping (I modified the jacks into side leg lifts)! I love being able to get some cardio into indoor workouts!",
    "Nicole, you have become my favorite trainer. I am 64 and while I love exercise, there are body parts that easily injure. Your classes allow me to tone my entire body, without incurring pain. I never tire of your videos. Thank you for your inspiration!"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}