{
  "video_id": "e1emQDNYb9w",
  "title": "Stationary Bike Workout 🚴 6 Min Cardio Exercise ||",
  "description": "Exercise bike workout in VR headset will improve your physical and mental condition, thanks to sunny stationary bike scenery videos.  \n\n→ https://youtu.be/e1emQDNYb9w←   \n\n\nIn this 6-minute workout, you will crush your legs with just an exercise bike. The Tabata protocol, developed by Dr. Izumi Tabata consists of alternating short periods of intense exercise with short periods of rest for a period of 4 minutes.  This bike workout start with 2 minutes basic warm-up.\n\n\nSubscribe Our Channel:  \n\n➨  https://www.youtube.com/channel/UCmI0gvUMl5FJGIVU5zBZ5TQ?sub_confirmation=1\n\nFollow me on Social Media:\n\n➨ Facebook: https://www.facebook.com/Fitness-in-VR-1838239922922523/\n➨ Instagram: https://www.instagram.com/peter_luksza/?hl=en\n➨ Twitter: https://twitter.com/peterluksza\n\nStationary bike workout is crucial to keep people in shape, improve fitness strengths.  Indoor bike workout at home, or fitness classes if it suits you, has an impact on your wellbeing.  Bicycle workout at home on stationary bike is one of the most popular cardio exercise, where you are using indoor spinning workouts in your workout routine.  Stationary bike benefits over treadmill is lower impact on exerciser’s joints, so is recommended for people who complains on sore joints. Fitness trainer will recommend using variety of cardio machines in workout routine to avoid over train some specific muscles during cardio exercises and to avoid boredom. \nYour opinion is crucial for us, and every signal is important, so please answer to the questions below as a comment to the video.\n\n- Is Cycling Workout good for you?\n- What are Cycling Workouts?\n- Are Cycling Workouts Classes good workout?\n- What does Indoor Cycling Workout?\n\nWe appreciate your input.\n\n\n\n\n▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾\n\n➨ Website:   https://indoorcycling360.video/\n\n▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾▾\n\nCycling workout on a stationary bike is a part of the indoor cycling workouts program of VR cycling.  Indoor cycling program present reality in 360. 360-degree video present VR cycling workout. VR cycling improving the experience of indoor cycling.  Indoor cycling program is developed on a stationary bike workout. Videos 360 improving experience of an indoor cycling training video. Fitness workout as a part of physical fitness. VR 360 improving the experience of cycling workout.  Cycling training video improving the experience of exercise bike user. Cycling with VR video improving experience of cycling workout. 360 video improving experience of exercise during spin class. Cycling VR improving the experience of exercise during cycling workout.  Indoor cycling workouts are a part of developed VR workout.  Workout motivation boost experience of indoor cycling workout.  Exercise bike exercise with videos 360.  Indoor cycling 25 minutes great way to burn fat.  Bike workout as the more efficient exercise in loses weight program.  Fat burning workout as a part of cycling workout. How to lose weight?  10-20-30 workout as a part of losing weight and burn fat fast program. Indoor Cycling as exercise. Indoor Cycling Workouts for beginners. Indoor Cycling Workouts for runners.  Indoor Cycling Workouts for lose weight.  Indoor Cycling Workouts for fat burning.  Indoor Cycling Workouts for burning fat.  Indoor Cycling Workouts for endurance.  Indoor Cycling Workouts to improve running.  Indoor Cycling Workouts free on YouTube.  Indoor Cycling Training app.  Indoor Cycling Workouts benefits.  Indoor Cycling Workouts benefits for lose weight.  Indoor Cycling Workouts benefits for fat burning.  Indoor Cycling Workouts benefits for burning fat.  Cycling workout machine.  Cycling after a workout.  How long should a cycling workout be? Cycling workout bodybuilders.  Cycling workout cardio.  Cycling Workout number of calories burned.  Carb cycling workout days.  Cycling exercise workout.  Cycling workout for abs.  \n\n\n\n\nFiVR - Fitness in VR Official Youtube Channel.\n\nThe purpose of this channel is to provide YouTuber’s with training videos to entertain them during cardio exercises. \n\nThe experience I do have, during a cardio workout on an indoor bike, wasn’t good, as I always got bored after just a few minutes. I constantly checked the progress, and I got this feeling I will not be able to complete my workout, drives me crazy. Everything has changed when I rendered my first movie. I focused on the exercise rather than on the progress. By wearing VR goggles I was cut from the surrounding world, and my consciousness was moved into the virtual reality. I was able to exercise for much longer, up to 60 min. Finally, I decided to share my experience with YouTube.\n\n#FitnessInVR #ExerciseBike #CardioExercise",
  "channelTitle": "FiVR - Fitness in VR",
  "channelDescription": "Indoor Cycling is in majority of videos we provide, but you will find cross trainer and virtual rowing workouts on @Fitnessinvrfivr channel. Videos are build to help you lose weight and get fit fast.\n\nThe experience I do have, during a cardio workout on an indoor bike wasn’t good, as I always got bored after just a few minutes. I constantly checked the progress, and I got this feeling I will not be able to complete my workout, drives me crazy. Everything has changed, when I rendered my first movie. I focused on the exercise rather then on the progress. By wearing VR goggles I was cut from the surrounding world, and my consciousness was moved into the virtual reality. I was able to exercise for much longer, up to 60 min. Finally, I decided to share my experience and 360 VR Video with YouTube.\n\nThanks for watching\nPeter\n\n#FitnessInVR #IndoorCycling #VR",
  "tags": [
    "fat burning indoor cycling workout",
    "Exercise",
    "fitness",
    "workout",
    "stationary bike",
    "exercise equipment",
    "workout routine",
    "gym equipment",
    "spin bike",
    "recumbent bike",
    "gym workout",
    "home gym equipment",
    "recumbent exercise bike",
    "fitness equipment",
    "exercise machine",
    "best exercise bike",
    "indoor exercise bike",
    "bike workout",
    "best home exercise bike",
    "physical workout",
    "fat burning",
    "lose weight",
    "weight loss",
    "exercise bike workout",
    "cycling workout",
    "stationary bike workouts",
    "cycling indoor"
  ],
  "publishedAt": "2019-03-23T09:13:42Z",
  "duration": 375,
  "durationFormatted": "6:15",
  "viewCount": 7913,
  "likeCount": 141,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/e1emQDNYb9w/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/e1emQDNYb9w/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/e1emQDNYb9w/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/e1emQDNYb9w/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/e1emQDNYb9w/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/e1emQDNYb9w\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "kept me entertained for a bit and good job",
    "Probably fully watch this later , good job",
    "quite innovative . thanks for this",
    "rocking it &amp; good video",
    "love the quality . nice job"
  ],
  "channelSubscriberCount": 3720,
  "channelVideoCount": 159
}