{
  "video_id": "eGZ_3MbXAnM",
  "title": "20-Minute Treadmill Workout for Weight Loss - [Quick & Effective HIIT🔥]",
  "description": "Welcome to Abundant You with Dr. Kevin! Get ready to torch calories and elevate your fitness with this intense 20-minute treadmill workout for weight loss. \n\nIn this session, we'll be pushing ourselves through 8 rounds of high-intensity intervals, each lasting 30 seconds, followed by 90 seconds of rest. \n\nCombined with a dynamic 5-minute warm-up and a soothing 5-minute cool down, this routine is designed to maximize fat burn, improve cardiovascular endurance, and leave you feeling energized!\n\n🏃‍♂️ Warm-Up (5 Minutes):\nGet your body ready for the intensity ahead with a comprehensive warm-up routine. We'll focus on increasing blood flow, loosening up your muscles, and preparing your cardiovascular system for the challenges ahead.\n\n🔥 HIIT Workout (20 Minutes):\n8 Rounds:\n\n30 seconds of MAX EFFORT sprinting or running\n90 seconds of active rest (walking or slow jogging)\nThe high-intensity intervals will push your limits, boost your metabolism, and help you break through fitness plateaus. Adjust the treadmill speed according to your fitness level, ensuring that you're challenging yourself while maintaining proper form.\n\n🧘‍♀️ Cool Down (5 Minutes):\nEase your body into recovery mode with a calming cool-down. We'll focus on stretching and controlled breathing to help reduce muscle soreness, enhance flexibility, and promote relaxation.\n\nRemember, safety first! Listen to your body, stay hydrated, and modify the workout as needed. Whether you're a seasoned athlete or just starting your fitness journey, this workout is adaptable to all fitness levels.\n\n👍 Don't forget to LIKE, SHARE, and SUBSCRIBE for more challenging workouts and fitness tips!\n\nReady to crush it? Hit play, lace up those sneakers, and let's get sweating together! 💪\n\n#HIITWorkout #TreadmillWorkout #FitnessJourney #HIIT #CardioWorkout #FitLife #WorkoutMotivation #SubscribeNow #FitFam",
  "channelTitle": "AbundantYou with Dr Kevin",
  "channelDescription": "Abundant You is a natural health website dedicated to all aspect of health and wellness as it relates to you! Helping people accomplish higher overall health and better well-being.\n\nOur YouTube channel is a great shortcut to stay connected with us and help others online! The Abundant You team will upload new natural health made easy videos, natural  articles, workouts and of course delicious recipes!\n\nPlease subscribe and share our channel!  Let's make a positive impact in the natural health & wellness community! \n\nFeel free to leave constructive comments or ask questions! We appreciate you, thanks for watching. You can learn more about our natural health made easy website by visiting https://www.abundantyou.com/\n\nP.S. Do you live around Columbus Ohio? Or know someone that does? We have a natural holistic wellness center you can visit and get personal 1 on 1 help to reach your specific health goals. You can learn more about our clinic at https://abundantyouchiro.com/",
  "tags": [],
  "publishedAt": "2023-11-30T17:09:11Z",
  "duration": 1401,
  "durationFormatted": "23:21",
  "viewCount": 171969,
  "likeCount": 2906,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/eGZ_3MbXAnM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/eGZ_3MbXAnM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/eGZ_3MbXAnM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/eGZ_3MbXAnM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/eGZ_3MbXAnM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/eGZ_3MbXAnM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "✅ Don&#39;t forget to hit the LIKE button and SUBSCRIBE 👍\r<br>📕 Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕 ►<a href=\"https://www.abundantyou.com/7-hiit-secrets-ebook/\">https://www.abundantyou.com/7-hiit-secrets-ebook/</a>",
    "Keep the videos coming, bro. Your 30 minute HIIT and 40 minute HIIT videos from 5 years ago are a staple. Thank you for what you do.",
    "The treadmill hiit videos are the TRUTH. I am so happy to see this new one.",
    "Hey there’s a new video. Your previous HIIT videos have actually been a lot of help keeping pace during my workouts.",
    "Did this ad 11pm at my gym, feels amazing. Thankyou. Will be doing this again Tuesday then Thursday"
  ],
  "channelSubscriberCount": 58900,
  "channelVideoCount": 45
}