{
  "video_id": "ehW0K56xTZ0",
  "title": "HIIT WORKOUT | A effective workout to see change | Option #2 | Improved Health 💖",
  "description": "This HIIT workout is a low impact, fast walking workout continuing on from Series 3.  Today is a tougher workout for those who feel ready for the challenge.  We are doing longer intervals which you ALL can manage, depending on how fast you go during the fast interval.  Cater the pace of your fast walk or jog according to what you can do.  We will start with a 10 minute warm-up then walk or jog as fast as we can for two full minutes.  We will then slow the pace down for one full minute.  To make this workout your own, please pace yourself.  If you find the two minutes is too challenging, then find a pace you CAN manage for the full two minutes.  It might mean slowing your pace down a little bit and that is TOTALLY okay.  Instead of jogging, you might need to walk.  Over time, your pace will pick up.  You can see in this video at times I am going faster than other times because I simply got tired and needed to slow my pace down.   I picked it up again when I could.  That is the wonderful thing about this workout.  You can make it your own and everybody will see positive changes.\n\nIdeally, try to do interval training twice a week, strength training twice a week and on the other days choose whatever cardio you enjoy.  I'll be putting out two optional interval workouts so you can choose which one you want to do each week.  \n\nIf you enjoyed the workout, please subscribe and write a comment!  I'd love to hear from you!\n\nWishing you improved health!\nJules\n\n#intervaltraining #walkingworkout #walkathome\n\nDisclaimer:  You should always consult your physician before starting any 'Improved Health' fitness program or any other fitness program.  This content is not medical advice and is intended for general education and demonstration purposes only.  The use of the information provided in this video is solely at your own risk.\n\n00:00 Intro\n00:07 Warm-up\n10:00 Intervals\n28:00 Cool-down\n33:00 Stretching",
  "channelTitle": "Improved Health",
  "channelDescription": "Welcome to Improved Health!\nYour go-to channel for effective, low-impact workouts designed for 'every' body. You'll find three levels of workouts—Gentle, Beginner, and Intermediate—so you can find the level that suits you best. Once you know your level, head to the playlists to explore a variety of workouts, including cardio, strength, stretching, and all-in-one routines—with options for both talking and no-talking formats.\n\nAs a Recreation Therapist, Group Fitness Instructor, and Senior Fitness Instructor, my mission is to create fun, safe, and manageable workouts that help you feel your best—physically and mentally.\n\n💺 Love chair workouts?\nI have a second channel dedicated entirely to them! Check out new chair workouts every Thursday on:\n👉 youtube.com/@ImprovedHealthChairWorkouts\n(Older chair workouts will still be available here too!)\n\nThanks for being here—I hope you enjoy the workouts, and I wish you improved health!\nJules\n",
  "tags": [
    "HIIT",
    "HIIT workout",
    "hiit",
    "hiit workout",
    "low impact hiit",
    "low impact HIIT workout",
    "fast walk",
    "fast walking",
    "walk at home",
    "interval training",
    "interval workout",
    "how to lose weight",
    "lose weight",
    "low impact",
    "low impact workout",
    "plus size workout",
    "home workout",
    "beginner workout",
    "at home workout",
    "low impact exercise",
    "low impact exercises",
    "improved health for seniors",
    "30 minute walk",
    "learn to run",
    "fat loss",
    "weight loss workout",
    "fat burn",
    "improved health"
  ],
  "publishedAt": "2021-11-01T05:00:12Z",
  "duration": 2127,
  "durationFormatted": "35:27",
  "viewCount": 1089967,
  "likeCount": 5096,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ehW0K56xTZ0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ehW0K56xTZ0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ehW0K56xTZ0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ehW0K56xTZ0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ehW0K56xTZ0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ehW0K56xTZ0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Yay!!!🎉 Thanks, Jules, for helping me stay committed. I never would have believed that daily exercise would become my habit and that I would look forward to it so much. A thousand thank yous!!!",
    "Hi!! I want to thank you for all these videos. I&#39;m in the middle of my life and I&#39;m obese. I want to recover my health and body capacities to have a better life and old age. More than a year ago, I started purifying my feeding, so I recovered the energy to start moving. Now, these videos have helped me to work out almost every day. Thank you!!",
    "So glad I found you!  Can&#39;t believe I did this - I am proud of my 78 year old self!  Thank you!",
    "Wow!  6 fast jogging intervals of 2 minutes each!  Jules, you really compliment those  of us who work out to your videos by giving us challenging workouts that we might think we can&#39;t do.  Because we find out that we CAN do them and feel pretty darned good about ourselves!  Thank you!",
    "Apple Watch setting: indoor walk<br>Active calories: 191<br>Total calories: 247<br>Approx steps: 4,251<br><br>Thank you to a wonderful workout! I use your workouts on active rest days❤"
  ],
  "channelSubscriberCount": 391000,
  "channelVideoCount": 433
}