{
  "video_id": "enJyOTvEn4M",
  "title": "5 Minute Breathing Exercise (Guided Meditation)",
  "description": "This 5 minute breathing exercise is an easy to follow meditation which guides you to tune in to your breathing, letting it be natural and easy. This is for any level of breathwork experience, but especially great for beginners to simply practice what it feels like to be present with and connected to their own breath, a great way to fend off anxiety.",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "breathing exercises",
    "meditation",
    "meditation guided",
    "anxiety",
    "anxiety meditation",
    "guided meditation anxiety",
    "meditation breathing techniques",
    "5 minute meditation",
    "5 minute guided meditation",
    "5 minute breathing exercises"
  ],
  "publishedAt": "2022-06-09T09:00:27Z",
  "duration": 360,
  "durationFormatted": "6:00",
  "viewCount": 310082,
  "likeCount": 5598,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/enJyOTvEn4M/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/enJyOTvEn4M/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/enJyOTvEn4M/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/enJyOTvEn4M/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/enJyOTvEn4M/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/enJyOTvEn4M\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I love how you don’t keep us unaccompanied for too long, because personally I find that I loose attention when I am only listening to relaxing music or if I am just in silence.😂❤",
    "It&#39;s been quite difficult getting back into meditation. This was very engaging yet relaxing. Thank you",
    "With the way my outer world is rapidly changing, it is more important than ever to maintain my inner peace everyday. Thank you for aiding me through these meditations.🦁",
    "I’ve been meditating for 65 days i started with 2 minutes, to get comfortable with the idea, here i am 65 days later feeling good about it. I really think it helps, especially when im getting real stressed. Glad I started.",
    "I was hyperventilating and meditation with proper breathing exercises helped, so thankful for content creators like this"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}