{
  "video_id": "ETEUzBDJNS8",
  "title": "FAT BURNING Beginner Stationary Bike Workout | 20 Minute",
  "description": "This 20 minute stationary bike workout for beginners is great for burning fat and losing weight!\n\n\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spin class when I was 15. Since then I've been addicted to spin classes and indoor cycling. Now, as a certified Spin class Instructor, Stages Beats Instructor, and NASM certified fitness trainer, my goal is to share the most fun, motivating, and energizing indoor cycling workouts that will bring out your inner BUTT-KICKER!\n\nI'm so glad you decided to join my indoor cycling class today! Grab your water bottle, grab your towel, get on your bike and let's kick some butt! - Kaleigh Cohen Fitness\n_________________________________________________________________________________________________\n\n0:00 - 0:31 Welcome\n0:32 - 3:25 WARM UP | On the Horizon by Louis II\n3:26 - 6:04 CLIMBS | Take It There by The Smocks\n6:05 - 8:05 SPRINTS | Look at Me Now by Marcus Meston\n8:06 - 11:09 JUMPS | Breakout by Deraj\n11:10 - 14:27 ENDURANCE | Turn It Up by Oh The Larceny\n14:28 - 17:40 ROLLING HILLS | Give Me One More Chance by Basixx\n17:41 - 20:51 COOL DOWN | Dust on the Ground by Emily Brimlow\n_________________________________________________________________________________________________\n\nNew to my indoor cycling workouts? START HERE! 👉  https://www.youtube.com/playlist?list=PLBJ0TIYiwZzjLnd3RU_J2y-dm9a34Ggw3\n\nIf you are doing a Spin class on a stationary bike or exercise bike instead of a spin bike and prefer to stay in the saddle, DO THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance and try and keep the same cadence. \n_________________________________________________________________________________________________\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/kaleighcohenfitness\n\n⭐️ Want to maximize your workouts? Find awesome gear here? 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️ The best tablet mount for your spin bike!👉 https://bit.ly/2UeHHK1\n\n⭐️ Book a 1-hour Zoom meeting with me to help you reach your fitness goals!👉 https://www.buymeacoffee.com/kaleighcohen/e/25359\n\n🎶 Jam out anytime and anywhere! Here are all of my Spotify playlists, just for YOU! 👉  https://open.spotify.com/playlist/0ULpucBmI7ZARtkzmL4g54?si=RQlNDjaNREGtHZUNnORe7A\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ KCF fit wear, fitness tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\n⭐️ Want special KCF emojis and behind-the-scenes access? Become a Kaleigh Cohen Fitness channel member here! 👉 https://www.youtube.com/channel/UChY_9WJx0saa0St48lSdytQ/join\n\n⭐️ For those of you that asked how you can help support these indoor cycling workouts 👉 https://www.buymeacoffee.com/kaleighcohen\n\n⭐️ Share this cycling workout with a friend👉  https://youtu.be/B2TJC7RZYOQ\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n#FatBurning #RhythmRide #IndoorCycling #StationaryBike #SpinClass",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "stationary bike workout",
    "fat burning",
    "beginner",
    "beginner spin class",
    "spin class beginner",
    "spin class",
    "spinning class",
    "spinning",
    "kaleigh cohen",
    "kaleigh cohen spin",
    "exercise bike workout",
    "beginner stationary bike workout",
    "cycling workout",
    "indoor cycling",
    "indoor cycling workouts",
    "cycling",
    "exercise bike",
    "bike workout",
    "spin class for beginners",
    "spin workout",
    "free spin class",
    "global cycling network",
    "burn fat",
    "weight loss"
  ],
  "publishedAt": "2021-04-12T09:00:08Z",
  "duration": 1251,
  "durationFormatted": "20:51",
  "viewCount": 582109,
  "likeCount": 9068,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ETEUzBDJNS8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ETEUzBDJNS8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ETEUzBDJNS8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ETEUzBDJNS8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ETEUzBDJNS8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ETEUzBDJNS8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is STILL my go-to ride for almost 3 years now,  It&#39;s just the perfect ride for beginning but also a really good quick workout, I just love this one!!!",
    "Your speech at the end saying to remember this feeling almost had me in tears on my bike. I&#39;m almost 300lbs and I&#39;ve been using your videos three times a week for two weeks now. It DOES get easier but gosh darn it it&#39;s hard lol keep doing what you do please 💗💗",
    "I would love more 20 minute beginner workouts! I’ve been working out with your videos 6 times a week and cooking at home and eating better for a month and a half and I’m down 26 lbs! I love love love your energy and am so thankful I found your videos! I’m currently using a stationary bike, but I enjoy your workouts so much, I’m looking at upgrading to a bike that allows me to ride in second and third position!",
    "More 20 min classes please!!!!! I live them the perfect tune frame for the morning kickoff. Love you 🚴",
    "Thanks!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}