{
  "video_id": "ew3t1XiXLAk",
  "title": "Physio Neck and Shoulder Stretches GUIDED ROUTINE (15 Mins)",
  "description": "Relax and ease neck and shoulder tension with this Physiotherapist guided home stretching exercise routine. Michelle guides you through safe neck stretching exercises that reduce muscle tension and relieve neck and shoulder pain. This stretching routine is the ideal work break at your home desk for relieving stress and neck tension. These stretches are suitable for beginners and intermediate level.\n\n#WithMe  #homeworkout  #neckstretches \nWebsite: https://www.pelvicexercises.com.au\n\nThis 15 minute neck and shoulder stretching routine guides you step by step through a series of gentle stretches for easing neck and shoulder pain and tightness. This routine starts in the sitting position with deep breathing and shoulder mobility exercises. The guided routine progresses through a series of safe stretching and mobility exercises for improving posture and relieving strain on the neck and shoulders. The posture exercises include chest stretches and postural awareness. A combination of static and dynamic neck and shoulder stretches are repeated throughout the routine in sitting and then lying down. This home workout concludes lying down with deep breathing exercises and a short relaxation.\n\nI hope these exercises help you exercise at home, relax and stay well.\n- - - - - - - - - - \nMusic by Aiden Kenway: https://www.youtube.com/channel/UCEeJ... \nLights by Sappheiros https://soundcloud.com/sappheirosmusic Creative Commons — Attribution 3.0 Unported — CC BY 3.0 Free Download / Stream: https://bit.ly/LightsSappheiros Music promoted by Audio Library https://youtu.be/-lbbHQbZNKg\n- - - - - - - - - - \nDisclaimer \nThe information provided in this video is intended as general information and not a substitute for individual medical advice regarding your medical condition. To the extent permitted by law, neither Healthy Fit Solutions Pty Ltd, as trustee for the P & M Kenway Family Trust (“we”), nor any of our officers, employees, agents or related bodies corporate will be liable in any way (including for negligence) for any loss, damage, costs or expenses suffered by you or claims made against you through your use of, or in connection with, this video or information supplied or offered to be supplied on this video. Although we use our best efforts to provide accurate information and other materials on this video, the video is provided “as-is”. To the extent permitted by law, all warranties, conditions and representations provided about or by this video are excluded",
  "channelTitle": "Michelle Kenway",
  "channelDescription": "Welcome to Michelle Kenway's Physiotherapy and Safe Exercise Channel! As a highly experienced physiotherapist, I specialize in pelvic floor health and helping you achieve your health and wellness goals. By subscribing and clicking the notifications bell, you'll receive a new video every week filled with valuable exercises and information to improve your wellbeing.\n\nMy channel is perfect for beginners, individuals recovering from injuries or illnesses, and those challenged by chronic health problems such as neck and back pain, and poor core control. You'll also find a wealth of Pelvic Floor Physiotherapy exercises and information videos to help with pelvic floor strengthening, prolapse management, pelvic pain, bowel problems, and constipation.\n\nVisit https://www.pelvicexercises.com.au for even more resources, including pelvic exercise videos, safe exercise books, and videos to download. Join me on your health, fitness, and recovery journey!\n",
  "tags": [
    "neck and shoulder stretches",
    "home workout",
    "home exercises",
    "stretching exercises",
    "physiotherapy",
    "health education",
    "physical therapist",
    "neck stretches",
    "shoulder stretches",
    "neck pain",
    "shoulder pain",
    "desk stretches",
    "beginners",
    "physical therapy",
    "withme"
  ],
  "publishedAt": "2020-04-09T20:00:09Z",
  "duration": 938,
  "durationFormatted": "15:38",
  "viewCount": 589620,
  "likeCount": 8089,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ew3t1XiXLAk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ew3t1XiXLAk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ew3t1XiXLAk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ew3t1XiXLAk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ew3t1XiXLAk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ew3t1XiXLAk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Nice relaxing voice, ignorable but chill background music, clear instructions with explanations for what we&#39;re working on - this was great!",
    "I tend to get terrible stiffness in my neck and shoulders, and this is by far the best stretching routine I have found. Thank you!",
    "I want to cry. Doing this was the first time I actually had my migraine go away in two weeks, thank you so much.",
    "I do the first 10 minutes of this routine 3x a day every day now while sitting at my desk. This has been helping me SO MUCH to loosen up my neck and shoulders, a problem area for me. Your voice is so soothing too. Thank you for putting together such a lovely video.",
    "As a short bartender, we’re prone to shoulder and neck stiffness because of the repetitive motion that is often above our shoulders (from pouring draft beer or pouring liquor on a bar that’s often high and out in front) this is a life changer.  Thank you!"
  ],
  "channelSubscriberCount": 911000,
  "channelVideoCount": 306
}