{
  "video_id": "eW7DdsBpH8A",
  "title": "20 Minute Guided Meditation for Anxiety: Quiet the Busy Mind | Mindful Movement",
  "description": "Today's guided mindfulness meditation practice is a wonderful tool to help ease anxiety.  It is possible to use this practice to calm the busy mind and sense of overwhelm to relieve stress.   Lengthen the space between your thoughts, and let go of tension in your body to quiet your mind.  \n\nEnjoy a relaxing, focused breath practice and body scan.  Awake to the aliveness in your body to find presence.  \n\nPair with this Sleep meditation to reduce anxiety before you go to bed: https://youtu.be/Qw98u6BS0mw\n\nMeditation was written and read by Sara Raymond\n\nDo not listen while driving. Meditation and mindful movement are powerful tools to support you. This is not a substitute for medical care. Consult a doctor or trusted health professional if needed.\n---------------------------------------------\nRESOURCES:\nRECORDINGS: Purchase your favorite recordings from the Mindful Movement for download\nhttps://themindfulmovement.com/recordings-store/\n---------------------------------------------\nFree Programs\nFREE New Beginnings Personal Retreat:  A body, mind, spirit approach to creating and actually achieving your goals.  https://www.themindfulmovement.com/new-beginnings\n21 day Movement and Meditation Commitment Program.  Start NOW! https://www.themindfulmovement.com/21day-commitment\n7-day Foundations of Meditation Course: https://www.themindfulmovement.com/foundations-of-meditation\n ---------------------------------------------\nWorkshops & Courses\nSix Week Move and Meditate for Self-Care Program: https://www.themindfulmovement.com/offer-page\nBUILD SELF-WORTH: https://www.themindfulmovement.com/self-worth\nRELEASE ANXIETY: https://www.themindfulmovement.com/Anxiety-course\nREGAIN CONFIDENCE:  https://www.themindfulmovement.com/Building-Confidence\nHEALING HYPNOTHERAPY: https://www.themindfulmovement.com/healing-hypnotherapy\n---------------------------------------------\n1:1 Sessions\nPERSONALIZED HYPNOTHERAPY with Sara:  \nhttps://www.themindfulmovement.com/90-minute-session \nPERSONALIZED EXERCISE AND LIFESTYLE PROGRAM DESIGN with Les: https://www.themindfulmovement.com/1-1-coaching-with-les\n---------------------------------------------\nMORE FROM THE MINDFUL MOVEMENT:\n🙏 The Mindful Movement is happy to provide these meditations, podcasts, and videos free of charge. We don't ask for anything in return but if you wish to make a donation, please know that whatever you offer will be received with much gratitude. http://themindfulmovement.com/donations/\n \nConnect with The Mindful Movement community of like-minded people on Facebook.  https://www.facebook.com/themindfulmovementpodcast/\n \nAnd on Instagram https://www.instagram.com/themindfulmovementpodcast/",
  "channelTitle": "The Mindful Movement",
  "channelDescription": "Welcome!  Here at the Mindful Movement, we are an oasis where you can come to tap into your inner calm, develop a positive mindset and heal from the stress that’s blocking your fulfillment. We offer guided meditation, visualizations, and hypnosis as well as Yoga, Pilates and a variety of mindful movement practices to help you live mindfully, move well and feel great!\n\nWe would love to continue working with you personally if you are interested.  We offer self-paced, online courses, group coaching, and 1:1 services.  You can learn more at our website:  Themindfulmovement.com \n\nAdditionally, check out Sara's new book, You Are Not Broken: https://amzn.to/4g6Omyh\n\nThe Mindful Movement is happy to provide these meditations, podcasts, and videos free of charge. If you wish to make a donation, please know that whatever you offer will be received with much gratitude. http://themindfulmovement.com/donations/\n\nOur second channel: @theMindfulMovementinMotion\n\nMuch love!\nSara and Les\n",
  "tags": [
    "guided meditation for anxiety",
    "guided mindfulness meditation",
    "20 minute meditation",
    "mindfulness meditation",
    "meditation for anxiety",
    "body scan",
    "breathing",
    "inner peace",
    "morning meditation",
    "evening meditation",
    "mindfulness",
    "meditation for depression",
    "meditation for ocd",
    "positive affirmations",
    "relaxation",
    "sara raymond",
    "the mindful movement",
    "vipassana meditation",
    "vipassana",
    "vipassana meditation guided",
    "guided meditation",
    "intentional living",
    "self awareness",
    "mindful movement",
    "meditation"
  ],
  "publishedAt": "2018-07-16T13:12:49Z",
  "duration": 1333,
  "durationFormatted": "22:13",
  "viewCount": 708638,
  "likeCount": 6670,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/eW7DdsBpH8A/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/eW7DdsBpH8A/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/eW7DdsBpH8A/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/eW7DdsBpH8A/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/eW7DdsBpH8A/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/eW7DdsBpH8A\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "🌼 Unlock Inner Peace and Release Anxiety with Our Hypnotherapy for Anxiety Course! 🌼 Learn powerful techniques that harness the potential of your mind, helping you overcome anxiety and embrace a life of calm confidence. By uncovering the unconscious beliefs you have about yourself that are causing anxiety, you can let them go. <a href=\"https://www.themindfulmovement.com/Anxiety-course\">https://www.themindfulmovement.com/Anxiety-course</a>",
    "I will be dead honest with you... I thought this would be total BS... but it actually works! This is... really really weird. The burning sensation I had in my stomach was gone when I completed this whole thing. I feel... weird... in a good way. This was my first time ever trying this. Much love.",
    "I love that quote. “See what wants to be seen. Listen to what wants to be listened to. To do this pause in the gap between thoughts”. That quote should be on a tshirt, poster, or billboard.",
    "I’ve used this meditation many times and have found it really helps me relax. The voiceover is just right (I’ve found voices on other videos to be distracting) and the background music/tones are good too.",
    "Thank you for your loving support, you are one of God&#39;s angels on earth."
  ],
  "channelSubscriberCount": 936000,
  "channelVideoCount": 586
}