{
  "video_id": "EXMcwt2USCA",
  "title": "HIIT Workout - Insane 20 Minute Elliptical Workout",
  "description": "Dr. Kevin Sarich DC, demonstrates another insane 20 minute HIIT workout using an elliptical to reach your fitness goals in minimal time. This is a workout you definitely want to try!\n\nThe elliptical is a mainstay in the gym for good reason: it's easy on the joints and provides a great cardio and total-body workout. But the elliptical can also get pretty boring and repetitive. \n\nThis elliptical workout will for sure change things up in a good way you're looking for!\n\nHIIT workouts - known as High Intensity Interval Training, are the most effective way to burn fat in the shortest amount of time possible. However, most people don't utilize this type of workout enough. \n\nIt's recommend to perform a 10-30 minute HIIT workout 2-3 times a week, with 24 hour rest in between HIIT workouts, in addition to other variety of fitness activities. \n\nThis elliptical trainer workout video is 20 minutes of HIIT training, going as hard as you can for 8 rounds of  30 seconds, spaced with 90 seconds of low intensity. \n\nWe start the elliptical workout with a 5 minute warm-up and finish the workout with a 3 minute cool-down. Please make sure you do both to reduce risk or injury!\n\nhttps://www.abundantyou.com/ - Natural Health Made Easy Blog\nhttps://www.abundantyouchiro.com chiropractor columbus ohio\n\n\n-~-~~-~~~-~~-~-\nCheck out our NEWEST killer HIIT video done on any type of static bike: \"HIIT Workout - Insane 25 Minute Spin Bike Workout\" \nhttps://www.youtube.com/watch?v=-_BlExYIimM\n-~-~~-~~~-~~-~-",
  "channelTitle": "AbundantYou with Dr Kevin",
  "channelDescription": "Abundant You is a natural health website dedicated to all aspect of health and wellness as it relates to you! Helping people accomplish higher overall health and better well-being.\n\nOur YouTube channel is a great shortcut to stay connected with us and help others online! The Abundant You team will upload new natural health made easy videos, natural  articles, workouts and of course delicious recipes!\n\nPlease subscribe and share our channel!  Let's make a positive impact in the natural health & wellness community! \n\nFeel free to leave constructive comments or ask questions! We appreciate you, thanks for watching. You can learn more about our natural health made easy website by visiting https://www.abundantyou.com/\n\nP.S. Do you live around Columbus Ohio? Or know someone that does? We have a natural holistic wellness center you can visit and get personal 1 on 1 help to reach your specific health goals. You can learn more about our clinic at https://abundantyouchiro.com/",
  "tags": [
    "High-intensity Interval Training (Literature Subject)",
    "Elliptical Trainer",
    "Physical Exercise (Interest)",
    "HIIT Workout",
    "Insane",
    "20 minute workout",
    "Elliptical workout",
    "HIIT",
    "interval training",
    "Physical Fitness (Industry)",
    "Fat loss",
    "Weight",
    "Loss",
    "Muscle",
    "Body",
    "Personal Trainer (Profession)",
    "Weight Loss (Symptom)",
    "#HIIT",
    "#HIITWorkout",
    "#IntervalTraining",
    "insane workout",
    "burn fat",
    "weight loss"
  ],
  "publishedAt": "2015-09-21T03:34:16Z",
  "duration": 1381,
  "durationFormatted": "23:01",
  "viewCount": 1643933,
  "likeCount": 25036,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/EXMcwt2USCA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/EXMcwt2USCA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/EXMcwt2USCA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/EXMcwt2USCA/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/EXMcwt2USCA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "✅ Don&#39;t forget to hit the LIKE button and SUBSCRIBE 👍\r<br>📕 Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕 ►<a href=\"https://www.abundantyou.com/7-hiit-secrets-ebook/\">https://www.abundantyou.com/7-hiit-secrets-ebook/</a>",
    "quarantine gang where you at??<br>I&#39;m proud you&#39;re using your time to become a better you!!",
    "People!!! He’s not lying! Do this workout while your insulin levels are low (preferably in the morning before breakfast) and you will see results that will blow your mind. 20 pounds in 1 month here.",
    "Saw this video almost 6 months ago while I was still 210lbs and I can&#39;t even finish the first 4 minutes. Today after good diet and regular walking exercises and elliptical exercise I finally finish this workout. I am now 170lbs by the way..",
    "This workout made me cry I put my all in it from problems depression custody issues fear failure and I never thought I can take that off my shoulders I&#39;m very grateful thank you so much God bless you"
  ],
  "channelSubscriberCount": 58900,
  "channelVideoCount": 45
}