{
  "video_id": "ez3GgRqhNvA",
  "title": "A Ten Minute Guided Meditation to Clear Your Mind",
  "description": "This an original 10 minute guided meditation spoken and recorded by one of our own team members,  is an effective way to eliminate overthinking by clearing your mind, allowing yourself to relax and get settled into the moment.  Letting go of all sensations, feelings, impulses and distracting thoughts, we can release from our everyday stressful state of unease.  By placing your attention on your breath, you can observe the many distractions occurring in the background of your mind, allowing them to unwind, enabling us to become even more present in the moment.\n\nSpoken Voice: Original Commentary recorded by us.\nBackground Music: Composed by a member of this channel.\nBackground Image: is an original derivative unique to this channel, Transformed from  licensed images through pixabay.com",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation guided",
    "overthinking meditation",
    "guided overthinking meditation",
    "guided meditation overthinking",
    "10 minute meditation",
    "guided meditation 10 min",
    "clear your mind",
    "clear your mind meditaiton",
    "guided meditation clear mind",
    "clear mind",
    "meditation"
  ],
  "publishedAt": "2020-08-06T01:00:03Z",
  "duration": 609,
  "durationFormatted": "10:09",
  "viewCount": 3244102,
  "likeCount": 59974,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ez3GgRqhNvA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ez3GgRqhNvA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ez3GgRqhNvA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ez3GgRqhNvA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ez3GgRqhNvA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ez3GgRqhNvA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To Help Support our Channel:  <a href=\"https://www.paypal.com/paypalme/gmyoutube\">https://www.paypal.com/paypalme/gmyoutube</a>",
    "I look forward to meditating in the morning. I love to wake up knowing I will have an amazing day because I have the tools to achieve it. Thank you for giving us the tools to create an amazing life.",
    "&quot;straighten your back.&quot;<br><b>proceeds to curl up in a ball</b>",
    "Been meditating every morning and night for the last week or so. This stuff slaps. Even if it’s just ten minutes - it makes a big difference in your day.",
    "who’s all shifting ? 😌"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}