{
  "video_id": "EzEaTen6CMU",
  "title": "Warm Up Cycling Workout",
  "description": "This warm up ride is for ANY cycling or strength workout to get your body ready to KICK BUTT!! \n\n\nIf you're a beginner and working to build up to a 20 minute cycling workout, this rhythm ride is what you need! \n\nI'm so glad you decided to join my cycling class today, let's go for a ride! Grab your water bottle, grab your towel, get on your bike and let's get these pedals spinning! - Kaleigh Cohen Fitness\n\n🟣 New to my indoor cycling workouts? START HERE! 👉  https://www.youtube.com/playlist?list=PLBJ0TIYiwZzjLnd3RU_J2y-dm9a34Ggw3\n\n🟣 For those of you that asked how you can help support these cycling workouts 👉 https://www.buymeacoffee.com/kaleighcohen\n\n🟣 Finish your workout with this workout! 👉 https://youtu.be/efypz3U13us\n\n🚴‍♀‍ If you are doing this on a stationary bike or exercise bike instead of a spin bike and cannot go into the standing positions (2nd and 3rd) and would like an added challenge during these, TRY THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance here but try and keep the same cadence. \n\n🎶 This playlist can be found at my Spotify 👉  https://open.spotify.com/playlist/7yCwp7j33oZjSnj6iLOtxW?si=WHisFz21QbOTwubPCAfj1g\n\n💁🏼‍♀‍ Get to know me here 👉 https://youtu.be/la6BwPsvo9k\n\n🟣 Let’s connect!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n🟣 Subscribe for more cycling workouts👉  https://www.youtube.com/kaleighcohenfitness\n\n🟣 Share this cycling workout with a friend:\nhttps://youtu.be/EzEaTen6CMU\n\n🟣 Next cycling workout!👉  https://youtu.be/i5WE0AghY_s\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spinning class when I was 15. Since then I've been addicted to spin class and indoor cycling workouts. Now, as a certified Spin class Instructor and NASM certified personal trainer, my goal is to provide you with fun, motivating, and energizing cycling and strength workouts that motivate you to be YOUR BEST YOU! This is cycling motivation! Thanks for cycling with me!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n#WarmUp #Beginner #CyclingWorkout",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "cycling workout",
    "warm up",
    "warm up workout",
    "warm up routine",
    "workout",
    "warm up cardio",
    "quick warm up",
    "fitness",
    "cardio",
    "cardio warm up",
    "home workout",
    "cardio workout",
    "easy cardio workout",
    "beginners workout",
    "warm up routine before workout",
    "warm up exercise",
    "workout warm up",
    "fat burning cardio warm up",
    "full body warm up",
    "beginner workout"
  ],
  "publishedAt": "2020-11-05T10:00:07Z",
  "duration": 659,
  "durationFormatted": "10:59",
  "viewCount": 37687,
  "likeCount": 839,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/EzEaTen6CMU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/EzEaTen6CMU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/EzEaTen6CMU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/EzEaTen6CMU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/EzEaTen6CMU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/EzEaTen6CMU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Gurl, that warm up was my workout...lol. I am starting from the bottom here.  Thanks so much putting up these videos.",
    "I’ve watched this one so many times 💪🏼❤️<br>Me: where are youuu?<br>K two secs later: where are youuu?",
    "I needed extra warm up this morning (SO TIRED OMG) so I hit this &quot;oldie but goodie&quot; and dang even your earlier content is on point",
    "Merci pour ce sympa WARM UP! 🙏🧡💛",
    "Awesome and spicy short ride Kayleigh and Jason ❤Perfect for a burst of energy or just a ride to do if you don’t feel up to a longer ride❤Thank you🎉"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}