{
  "video_id": "F28MGLlpP90",
  "title": "15 Minute Deep Breathing Exercise | City of Hope",
  "description": "Deep Breathing exercises help reduce anxiety, stress, fatigue, restlessness, difficulty sleeping and physical discomfort. For more resources for those Living with Cancer, please visit: http://www.cityofhope.org/living-with-cancer\n\nCONNECT WITH US\n\nWEBSITE: http://www.cityofhope.org\nFACEBOOK: http://www.facebook.com/cityofhope\nTWITTER: http://www.twitter.com/cityofhope\nYOUTUBE: http://www.youtube.com/cityofhopeonline\nFLICKR: http://www.flickr.com/cityofhope\nBLOG: http://breakthroughs.cityofhope.org\nand MORE: http://www.cityofhope.org/getsocial \n\n################\n\nABOUT CITY OF HOPE\nCity of Hope is a leading research and treatment center for cancer, diabetes and other life-threatening diseases. Designated as a comprehensive cancer center, the highest recognition bestowed by the National Cancer Institute, City of Hope is also a founding member of the National Comprehensive Cancer Network, with research and treatment protocols that advance care throughout the nation. City of Hope's main hospital is located in Duarte, Calif., just northeast of Los Angeles, with clinics throughout southern California. It is ranked as one of \"America's Best Hospitals\" in cancer by U.S. News & World Report. Founded in 1913, City of Hope is a pioneer in the fields of bone marrow transplantation and genetics. For more information, visit http://www.cityofhope.org.",
  "channelTitle": "City of Hope",
  "channelDescription": "City of Hope is a world leader in the research and treatment of cancer, diabetes, and other serious diseases. We deliver scientific miracles that make lives whole again.\n\nCompassion is the heart of our approach and the driving force behind all our discoveries.\n\nFounded in 1913, City of Hope is one of only 50 comprehensive cancer centers in the nation, as designated by the National Cancer Institute.\n\nEach innovative treatment we create gives people the chance to live longer, better and more fully.",
  "tags": [
    "city of hope",
    "cancer hospital",
    "cancer research",
    "cancer treatment",
    "cancer",
    "meditation",
    "living with cancer",
    "cancer support group",
    "cancer resources",
    "deep breathing exercises",
    "cancer side effects",
    "City Of Hope National Medical Center (Hospital)"
  ],
  "publishedAt": "2015-01-16T22:31:28Z",
  "duration": 837,
  "durationFormatted": "13:57",
  "viewCount": 2286611,
  "likeCount": 19370,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/F28MGLlpP90/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/F28MGLlpP90/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/F28MGLlpP90/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/F28MGLlpP90/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/F28MGLlpP90/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/F28MGLlpP90\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Just give it your best effort. I liked this. At first I was upset cause I was trying to do it perfectly but instead of giving up I just did it my way to an extent. What I mean is I stopped counting after a minute and just did what felt like 4 seconds inhaling/5 seconds exhaling. Before I new it I was more relaxed then when I started. People who are quick to hit the dislike button need to remember this video will help others which has already been proven in the comments and likes. Disliking this video might discourage a potential viewer from watching. A viewer viewing this because they’re stressed out or anxious just like you most likely are.",
    "I absolutely love this script but the pace is too fast for me to actually relax :(",
    "Wow this helped me with my biggest panic attacks whoever made this video thank u so much",
    "Thank you! I have really bad anxiety so this helped so much!",
    "It was perfect to relax to after working out, thank you"
  ],
  "channelSubscriberCount": 31500,
  "channelVideoCount": 772
}