{
  "video_id": "fgChzlOt3XI",
  "title": "Guided MEDITATION To Reconnect & Recharge (English): BK Shivani",
  "description": "Daily Affirmations. Free on ThinkRight.me App - https://bit.ly/3085XEm\nBooks - Being Love: https://tinyurl.com/yhmh8vbp\nHappiness Unlimited (English, Hindi, Marathi): https://tinyurl.com/2snjw7v3\n\nWe want to meditate, but feel that it is difficult, we are unable to concentrate. BK Shivani takes us through a Meditation Experience which will give us inner strength to create miracles in our inner world and our outer world. Take out 15 mins for yourself every morning. Sit back, relax and start this Meditation Guided Commentary. As you listen to each thought, visualise it and start feeling it. This 15 mins will recharge you daily and the journey of regaining Inner Power will begin.\n\n## For more videos: https://www.youtube.com/bkshivani ##\nSUBSCRIBE to get updates on new videos.\nFor English videos:\nhttps://www.youtube.com/playlist?list=PL8BCGs3ul_7TpgAg1tBruSw2Ew3Q8LHZb \nhttps://www.youtube.com/playlist?list=PL8BCGs3ul_7TIdJnEaCPUTuNvT_xVRv_b    \nhttps://www.youtube.com/playlist?list=PL8BCGs3ul_7SAB8lJquba5OxtOgrGjzu-\n\nFor Hindi videos:\nhttps://www.youtube.com/playlist?list=PL8BCGs3ul_7QhEk-rgFGfk-VtRA5dWn7S\nhttps://www.youtube.com/playlist?list=PL8BCGs3ul_7SOkype-Qy7Y4LNKEdnlwCZ\nhttps://www.youtube.com/playlist?list=PL8BCGs3ul_7R4IOLe9wedZv4-xQuygtfr\n\nFacebook: https://www.facebook.com/BKShivani\nInstagram: https://www.instagram.com/BKShivani\nTwitter: https://www.twitter.com/BKShivani\n\n#BKShivani #SisterBKShivani #SisterBKShivaniHindi",
  "channelTitle": "BKShivani",
  "channelDescription": "Sister BK Shivani - Spiritual Guide and Mentor\n* Ability to analyze deep rooted emotions like ego, stress, anger, fear & presents a logical yet comfortable way of adopting practical spiritual principles in our personal and professional life\n* Awarded Nari Shakti Puraskaar (Woman Power Award), the highest civilian honor for women in India.\n* Honored with the Women of the Decade Achievers Award by ASSOCHAM’S Ladies League.\n* Appointed as a Goodwill Ambassador by the World Psychiatric Association.\n\nChannel\nVideos are changing people's lives all over the world by providing deep insight into how and why we think and behave in certain ways. They reveal our perceptions and beliefs which influence our thoughts and feelings. These videos have helped people overcome mental stress, depression, addictions, low self-esteem & unhappy relationships.\n\nDo subscribe to stay updated with the latest videos. Join us on this journey of self transformation. Creating YOUR miracle ...is only ONE THOUGHT away.",
  "tags": [
    "Bk Shivani",
    "Sister Shivani",
    "Shivani brahma Kumari",
    "Bk Shivani latest videos 2018",
    "Sister Shivani latest videos 2018",
    "Brahma Kumari sister Shivani",
    "Bk Shivani meditation",
    "B k shivani",
    "Bk shivani English",
    "Shivani",
    "Soul reflections bk shivani",
    "Meditation by bk shivani"
  ],
  "publishedAt": "2018-04-15T14:30:01Z",
  "duration": 922,
  "durationFormatted": "15:22",
  "viewCount": 7837389,
  "likeCount": 58821,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/fgChzlOt3XI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/fgChzlOt3XI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/fgChzlOt3XI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/fgChzlOt3XI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/fgChzlOt3XI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/fgChzlOt3XI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Dear sister shivani.. i am going through  a very difficult phase in my life.. i am diagnosed with a major illness..my life turned upside down and i lost myself. . it is my husband who asked me to try this out and i do it daily... now i am least worried about the illness..my mind has turned positive and  i am nw a  full fledged  fighter.. thank u thank u thank u sooo much",
    "The Dalai Lama said,  if we would teach every 8 years old, how to meditate,  in one generation,  all the wars and disagreements would disappear and we would be able to solve the world problems without any issue and worries...Who&#39;s ready to meditate today ? ❤❤❤❤❤",
    "There are many spiritual meditation guider through out the world... but when its come about India they really makes our heart with full divinity.... love my india  and our religion",
    "When you said &quot; I&#39;ve reached home, the place where I belong&quot; I was in  tears✨💫",
    "Every time I meditate listening to it, I beleive I become a bit more closer to my soul and to God and I feel I am healed a bit more each day. When I meditate there is no time I had no tears; the voice, the music and the meaning of the guided meditation is simply pure and magical. Thank you is a very small word for Shivani sister and BKs  for the difference that they made to my life. By nature we all wanted to be loved and only love the ppl around. May each and every soul in the world be healed by God&#39;s energy and may our souls be filled with love, purity and peace. Om Shanti!"
  ],
  "channelSubscriberCount": 6210000,
  "channelVideoCount": 1979
}