{
  "video_id": "FH_fKjEEvC8",
  "title": "Prenatal Cardio Workout [FAT BURN] Safe, No Equipment",
  "description": "This 30 minute prenatal cardio workout burns calories to burn fat safely during pregnancy. No equipment needed! This prenatal cardio workout is pregnancy safe for 1st trimester and 2nd trimester up through Week 16 of pregnancy. \n\n♥ FREE Prenatal Schedule: https://www.glowbodypt.com/prenatalworkouts\n\n♥ 12 Week Post Pregnancy Plan: https://glowbodypt.com/12-week-post-pregnancy-plan-2\n\n♥ 10 Minute Plan (30 min/day, 4 x days/wk, 12 weeks + BONUS Runner Plans and Top 30 Recipes): https://www.glowbodypt.com/10minuteplan\n\n♥ 6 Week Lean Fast Strong Capable Plan (most intense plan, includes at-home and gym options in full length video side-by-sides so you know exactly what to do! For runners and non-runners.): https://www.glowbodypt.com/lfsc-plan\n\n♥ FREE 21 Day 8 Minute Workout Challenge: https://www.glowbodypt.com/8minuteworkoutchallenge\n\n♥ Favorite Products: https://www.glowbodypt.com/products\n\n----------------------------------------------------------------------------\nMY INSTAGRAM: https://www.instagram.com/glowbodypt/ \n-----------------------------------------------------------------------------\n\nFACEBOOK: http://www.facebook.com/glowbodypt\n\n******\n-Music from Epidemic Sounds\n-Music Aurora Borealis - Bird Creek\n******\n\nAshley Keller is a former World Champion 70.3 Triathlete, Army Veteran, mom of 3, fitness expert, entrepreneur. She is the creator of GlowBodyPT, known for challenging (yet safe), hard core workouts, even throughout pregnancy & postpartum!\n\nDISCLAIMER:\n\nGlowbodyPT, LLC strongly recommends that you consult with your physician before beginning any exercise program.\n\nYou should be in good physical condition and be able to participate in the exercise.\n\nYou should understand that when participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge GlowBodyPT, LLC from any and all claims or causes of action, known or unknown, arising out of GlowBodyPT, LLC's negligence.",
  "channelTitle": "GlowBodyPT",
  "channelDescription": "EXPERT IN HEALING DIASTASIS RECTI\nI help women confidently close down their ab gaps postpartum on a proven plan, eliminating wasted time. \nFixed Diastasis Recti on over 13,000 women postpartum on the 12 Week Post Pregnancy Plan: https://www.glowbodypt.com/12-week-post-pregnancy-plan-2\n\nYou need to know that the Lord comes first in my life and that reflects in everything I do. \n\nIf you are a motivated woman and you care about maximizing your fitness in just 2 hours of exercise PER WEEK - you are in the right place! \n\nIf you are pregnant, save yourself stress and stay on track with the Free Prenatal Program now: https://www.glowbodypt.com/prenatalworkouts ",
  "tags": [
    "pregnancy safe fat burner",
    "how to burn fat during pregnancy",
    "fat burn cardio prenatal",
    "1st trimester cardio workout",
    "burn fat during pregnancy",
    "challenging prenatal workout",
    "intense prenatal workout",
    "prenatal cardio at home",
    "30 minute prenatal workout",
    "prenatal fat burn workout",
    "prenatal cardio burns fat",
    "how to burn fat in a safe way during pregnancy",
    "pregnancy safe cardio workouts",
    "prenatal fat burning workout"
  ],
  "publishedAt": "2021-04-08T17:00:05Z",
  "duration": 1858,
  "durationFormatted": "30:58",
  "viewCount": 146079,
  "likeCount": 3004,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/FH_fKjEEvC8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/FH_fKjEEvC8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/FH_fKjEEvC8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/FH_fKjEEvC8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/FH_fKjEEvC8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/FH_fKjEEvC8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "So happy to have found your channel. What an answer to prayer. I don’t believe in signs but it was really comforting to read that inspiring quote in back of your videos! I will definitely share your channel with others and I’m interested in your postpartum fitness challenge. Peace &amp; Love 💕",
    "I’m not pregnant anymore, but I LOVED working out with you until I was about 39 weeks along, so I will do this workout anyway! Congrats on baby number 4! Looking forward to seeing more new content for my next pregnancy! Best prenatal instructor!",
    "My 7 year old did this work out with me and when you said &quot;it&#39;s just cardio.&quot; She said &quot;No, it&#39;s torture!&quot; 😆 we got a great workout from this video. Thank you for all you do!!",
    "I am not pregnant, but I did your prenatal and postpartum plans and loved them both. I felt so strong, fit, confident, and just GOOD during my pregnancy, and also similar after the postpartum plan. I love the added timer on the right, and the background music. Keep sharing your talents, Ashley!! I appreciate you!!",
    "This will be my second pregnancy using your prenatal workout program! My first pregnancy and labor went without any complications, and I felt fantastic the entire pregnancy. This one I have been feeling more sluggish, so I&#39;m starting your program back up again around ( 22 weeks ) pregnant. Love it!! Moms really need this program. 💕"
  ],
  "channelSubscriberCount": 142000,
  "channelVideoCount": 189
}