{
  "video_id": "FI51zRzgIe4",
  "title": "8 Minute Stretching Routine For People Who AREN’T Flexible!",
  "description": "Follow-along total-body stretching routine to decrease tightness and improve flexibility! Dr Jared Beckstrand leads you through 8 minutes of stretching exercises that are perfect for beginners, after a workout, or if you generally feel “tight” or “stiff”!\n\n===========================\n➡️ LINK TO DR JARED’S THICK EXERCISE MAT: https://urlgeni.us/amzn/drjaredexercisemat\n\n➡️ LINK TO DR JARED’S STRETCH OUT STRAP: https://urlgeni.us/amzn/stretchoutstrap\n===========================\n\nHave you ever searched for “stretching routines” or “stretching exercises” here on YouTube?\n\nI mean - I understand the importance of stretching as well as anybody, but I don’t feel like you should have to be a yoga master to do it and enjoy it!\n\nEven some of the “beginner” routines out there are way too complex!\n\nThat’s why in this video I wanted to share with you a simple-to-follow 8-minute stretching routine that ANYONE can do at home to improve overall flexibility and mobility.\n\nYou won’t find any crazy positions or complex transitions in this video… just some simple stretches designed to decrease tension and pain in all the major muscles and across all the major joints in your entire body.\n\nThis is the perfect routine to increase your range of motion, cool down after a workout, or decrease tension and pain that comes from long hours working at a desk.\n\nHopefully by the end of the routine you feel loosened up, stretched out, and more mobile than when you started.\n\nSo clear a little room on the floor and let’s get to work!\n\n\nSTRETCHING EXERCISES FOR BEGINNERS\n\n0:00 INTRODUCTION\n0:25 LUMBAR ROTATION\n1:34 SUPINE HAMSTRING\n2:34 PIRIFORMIS\n3:34 HIP FLEXOR\n4:04 KNEELING HAMSTRING\n5:34 UPPER BACK ROTATION\n6:34 CHILD’S POSE\n7:04 EXTENSION\n7:34 UPPER TRAPS\n8:34 DON’T MISS THIS\n\nDid you follow along with this stretching routine? What did you think of it? I LOVE hearing from you - leave your experience in a COMMENT and let me know how you feel!\n\nIf you did like this video, hit the THUMBS UP button to LIKE this video above. That helps more people to find it here on YouTube so thanks so much for doing that!\n\nFinally, if you haven’t SUBSCRIBED to Tone and Tighten yet I would love to see you back here for more videos in the future! Hit the SUBSCRIBE BUTTON above and be sure you hit that little “bell” to get notified of a new T&T video the moment it goes out.\n\n===================================\n🔥OTHER GREAT VIDEOS YOU MIGHT ENJOY🔥\n✅ COMPLETE CORE STRENGTH WORKOUT AT HOME: https://youtu.be/NQxEUC3-aaE\n✅ TOTAL BODY MORNING STRETCHING ROUTINE: https://youtu.be/t2jel6q1GRk\n✅ BEST STRETCHES FOR NECK PAIN: https://youtu.be/XtHfEI5DUE0\n✅ NIGHTTIME STRETCHING ROUTINE TO SLEEP BETTER: https://youtu.be/4XX6AHSYgHA\n✅ UNLOCK YOUR BACK! FOLLOW-ALONG ROUTINE: https://youtu.be/hfJKE1d3rNM\n===================================\n\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. T&T Digital Media, LLC makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.",
  "channelTitle": "Tone and Tighten",
  "channelDescription": "Hi - I'm Jared! I am a doctor of physical therapy who specializes in rehabilitating orthopedic (back, neck, shoulder, knee, etc) and postpartum (diastasis recti) conditions. I love being fit, healthy, strong, and active, and hope to help you accomplish your fitness goals. On this channel you'll learn best treatments for common injuries through exercising and stretching, and how to become a fitter, healthier version of yourself. Please consider subscribing!\n\nDISCLAIMER: The content on this channel is NOT medical advice and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Use of this content is at your sole risk.\n",
  "tags": [
    "stretching exercises",
    "stretching after workout",
    "stretching exercises for beginners",
    "stretching",
    "stretches for flexibility",
    "beginner stretching routine",
    "beginner stretching",
    "beginner stretching exercises",
    "beginner stretching for flexibility",
    "beginner stretching 8 minutes",
    "beginner stretching workout",
    "beginner stretching at home",
    "beginner stretches for flexibility",
    "how to increase flexibility",
    "how to increase mobility",
    "jared beckstrand",
    "tone and tighten",
    "physical therapy"
  ],
  "publishedAt": "2022-06-02T12:00:07Z",
  "duration": 536,
  "durationFormatted": "8:56",
  "viewCount": 9502872,
  "likeCount": 261449,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/FI51zRzgIe4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/FI51zRzgIe4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/FI51zRzgIe4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/FI51zRzgIe4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/FI51zRzgIe4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/FI51zRzgIe4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "So - how flexible are you?! Where are you the tightest and what do you need the most help with? COMMENT below and let me know if you liked this video and how I can help you in the future! 🙏🏼🙏🏼🙏🏼 (Also - not a bad idea to supplement your stretching with some consistent core strengthening. Here&#39;s a 6-minute core routine I recommend: <a href=\"https://www.youtube.com/watch?v=pJp08smdcFk\">https://youtu.be/pJp08smdcFk</a> )",
    "I&#39;m 23 years old and can&#39;t touch my toes. I am definitely active and my lack of flexibility is a running joke between my friends and I. I don&#39;t want to grow up past the point of no return so thank you for a genuinely beginner-flexibility routine",
    "I finally did it. I am 19 years old and after stretching every day for 3 months straight I have no more neck pain, back cramps and I can reach my toes! To everyone that thinks they can&#39;t do it, just be patient and stay disciplined!<br><br>-Edit: For the people asking how I do it.<br>I do this stretching routine every morning after showering cold, sometimes a second time before bed if I am feeling stiff.<br>I do change it up sometimes and don&#39;t exactly follow the instructions, its good to keep variations, for example:<br>- The hamstring stretch i replaced with a sitting hamstring stretch and using a resistance band to pull myself to my toes.<br>- The neck stretch i replaced with a butterfly stretch.<br>- I added a straddle stretch.<br>- For the shoulders, back and chest, I hang with one arm with my feet on the ground and try to relax myself and get as stretched as possible; its important to have your feet on the ground for a relaxed and controlled stretch.<br><br>I am a calisthenics athlete and stretching is very important, to avoid pain and muscle cramps",
    "83 yo grandma here, generally fit but lazy last couple years+. Getting back into step aerobics, core and stretching. Thank you for this video. Also, I’m very encouraged reading the comments. I plan to stick with your core &amp; stretching routine and advance as my strength and balance improve.",
    "I did this video for the first time like 2 months ago. I was NEVER flexible and my chiropractor insisted I incorporate stretching into my routine. Since doing this every morning I&#39;ve noticed SUCH a huge difference not only in my flexibility, but also just how I feel in general. It&#39;s also made me more interested in improving other stretches and looking into yoga more too! Thank you!"
  ],
  "channelSubscriberCount": 2750000,
  "channelVideoCount": 641
}