{
  "video_id": "FJJazKtH_9I",
  "title": "Box Breathing Exercise | TAKE A DEEP BREATH | Pranayama Series",
  "description": "🔹 Ready to transform your health? Download our FREE Breath Mastery Guide Here: https://www.takeadeepbreath.co.uk/feel-good-breathwork-3\n\nAbout This Video:\nStress Relief and Reduce Anxiety - Binaural 396 Hz -   Navy Seal Technique\nBox breathing (or Square Breathing) can be thought of as the opposite of a panic attack. - more details are below.\n\nAbout This Channel:\nHey there! I'm Mike Maher, founder of TAKE A DEEP BREATH and your personal breath coach.\nDid you know that 95% of us don't breathe properly? As a breath coach, I help you master your breath to:\n\n- Eliminate Stress\n- Boost Energy\n- Sharpen Focus and Concentration\n\nFor nearly a decade, I've explored the power of breathwork, combining ancient techniques with modern science. This isn't just another video course – I offer one-on-one live coaching sessions over Zoom, tailored to your needs.\n\nBy harnessing the power of your breath, you can unlock your full potential and transform every aspect of your life. Ready to feel amazing? \n\nLet's take a deep breath together and start your journey to a better you...\n\nBook a Complementary 1:1 Breath Coaching Discovery Call Here: ►►https://calendly.com/mike-maher/breathwork-discovery-call-clone?month=2024-09\n\nFor business inquiries: hello@takeadeepbreath.co.uk\n\nSafety Information: \nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell STOP. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in bodily harm. Deep breathing may cause tingling sensations, a ringing in the ears, and/or light-headedness. These are normal responses and are no cause for alarm. If you faint, however, you have gone too far and should take it more slowly next time.\n\nDisclaimer \nThe information provided in this video is provided for informational purposes only and is NOT to be used or relied on for any treatment purposes. All information provided by TAKE A DEEP BREATH is of a general nature, only for educational/entertainment purposes. No information is to be taken as medical or health advice. Follow this breathing exercise at your own risk. TAKE A DEEP BREATH or Mike Maher is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of your reliance on the information contained in this video. There is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself. We use affiliate links which means if you buy something, we'll receive a commission, we appreciate the support you give us and we hope to keep adding value to you.",
  "channelTitle": "TAKE A DEEP BREATH",
  "channelDescription": "Welcome to TAKE A DEEP BREATH, My name is Mike Maher, I am a breathwork instructor, podcaster and researcher of the breath. I have studied many modalities and I am proud among other things to be an Oxygen Advantage Master Instructor.\n\nOn my channel here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. We also host #Breathcast which is a dedicated Breathwork Podcast where we interview the world's top breath and health experts.\n\nBreathwork is where you consciously alter your breathing pattern to achieve a set of results such as helping you to relax, raise your energy, increase your immune system, change your state of consciousness or calm your parasympathetic nervous system.\n\nBreathwork has been a key component in Yoga for centuries,  now with the help of people such as Joe Rogan & books such as the Oxygen Advantage, breathwork is part of mainstream society.\n\n\n",
  "tags": [
    "sealfit",
    "box breathing",
    "box breathing for anxiety",
    "Meditation",
    "mind body and spirit",
    "box breathing technique",
    "breathing meditation",
    "navy seal breathing techniques",
    "tactical breathing",
    "breathing exercises",
    "pranayama",
    "anxiety breathing",
    "guided meditation",
    "mindfulness",
    "mindfulness meditation",
    "meditate",
    "relaxation technique",
    "meditation guided",
    "breathwork",
    "wim hof breathing technique",
    "breathing exercise for anxiety",
    "breathing exercise for panic attack",
    "take a deep breath pranayama series"
  ],
  "publishedAt": "2019-08-13T13:00:04Z",
  "duration": 376,
  "durationFormatted": "6:16",
  "viewCount": 1926407,
  "likeCount": 28728,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/FJJazKtH_9I/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/FJJazKtH_9I/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/FJJazKtH_9I/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/FJJazKtH_9I/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/FJJazKtH_9I/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/FJJazKtH_9I\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "❤ If you liked this Box Breathing Exercise, then download our FREE Feel-Good Breathwork Guide here: ►► <a href=\"https://www.takeadeepbreath.co.uk/freepdf\">https://www.takeadeepbreath.co.uk/freepdf</a>",
    "my dad sent me this because I freak out crying with anxiety and I can&#39;t breathe half the time, he sent me this to try, it&#39;s definetly working ❤️ thank you",
    "This works if you practice it everyday 10 minutes per day for a month. <br><br>Your brain starts forming neural pathways and the longer and more consistently you practice this the stronger those neural pathways become. <br><br>Do it for one month and write a journal. <br><br>I guarantee you&#39;ll make awesome progress!",
    "<a href=\"https://www.youtube.com/watch?v=FJJazKtH_9I&amp;t=19\">0:19</a> exercise starts here (forget everything you know and just be present like a newborn taking its first breaths, you know nothing) 🙌🏽",
    "After I did this. I felt euphoric. My limbs tingled. My arms became heavy. My face felt heavy and my brain felt like it had been dunked in ice cold water but not in a shocking way. I did it with my eyes closed and followed the breath noises. By the end of the time, my mind was quiet and honestly, I felt almost in a trance like state."
  ],
  "channelSubscriberCount": 295000,
  "channelVideoCount": 386
}