{
  "video_id": "Fn-0TVi7xis",
  "title": "Full Body HIIT Workout | Breakthrough - Day 5",
  "description": "Welcome to your 45 minute full body hiit workout! This workout is going to help you get stronger by using compound exercises for your upper and lower body muscles and we will also boost our metabolism with cardio intervals throughout the workout. This workout is perfect for all fitness levels and you only need a couple sets of dumbbells. \n\nGrab your January BREAKTHROUGH Program Calendar here: https://shop.royalchange.fit/products/breakthrough-january-2024-workout-stretch-calendar\n\nIn today’s workout we will work for 45 seconds and rest for 15 seconds in a circuit of 2 exercises. We will complete each circuit 3 times total before moving on. Each circuit will target your upper and lower body muscles and also aim to get your heart rate up! The training variables we are aiming for this month are strength and improving your conditioning so make sure you’re grabbing weights in the 75%-85% of your max weights range and push yourself to increase the intensity when you are performing a cardio exercise. The cardio exercises can be done on the ground for a low impact modification if you need that but try to push yourself however you perform these exercises. You’ll get the most out of the workout by pushing yourself to your highest intensity in our working periods and breathing in your rests to be able to execute the next set!\n\nThe Exercises: \n1.    Squat and side step\n2.    Front raises alternating\n3.    Jackknives\n4.    Mountain Climbers\n5.    Plank Hold\n6.    Straight Arm pull over and bridge\n7.    Lateral Lunges with db switch\n8.    DB anchored leg raises\n9.    Db Toe taps\n10. Glute Bridge\n11. Romanian Deadlifts\n12. Core flutter and toe touch\n\nSHOP AND PROMO CODES: \nRoyal Change Merchandise: https://shop.royalchange.fit/collections/products \nShop my outfits: https://liketk.it/4hTwD\nJoin the Sydney Squad community: https://www.royalchange.fit/sydneysquad\nMy GHOST supplements discount code “SYDNEY” saves you 20% https://www.ghostlifestyle.com/ \nMy Amazon Store: https://www.amazon.com/shop/sydneycummings\n\nLET'S STAY CONNECTED: \nTag me on your social handles!\nInstagram: https://www.instagram.com/sydneycummings_ \nTikTok: @sydneycummings_\nFan Page: https://www.facebook.com/sydneycummingsfitness \nTwitter: https://twitter.com/sydneycummings_ \nWebsite: https://www.royalchange.fit \n\nLEGAL DISCLAIMER: \nAll information provided by Royal Change and/or Sydney Cummings is furnished strictly for educational and entertainment purposes only. Royal Change and/or Sydney Cummings is not engaged in rendering medical or professional services. No information is to be taken as medical or other health advice pertaining to any individual's specific health or medical condition. Please consult your healthcare professional before participating in or acting on any recommendation found in content provided by Royal Change and/or Sydney Cummings. You agree that use of the information contained in any content provided by Royal Change and/or Sydney Cummings is at your own risk. Royal Change and/or Sydney Cummings is not responsible or liable for any injury sustained as a result of using the content in this video or any other video provided by Royal Change and/or Sydney Cummings.",
  "channelTitle": "Sydney Cummings Houdyshell",
  "channelDescription": "Welcome to your new workout home! I’m your personal trainer and training partner Sydney Cummings Houdyshell and I am a NASM Certified Personal Trainer, Fitness Nutrition Specialist, Women’s Fitness Specialist, and Stretching and Mobility Coach! \nMy husband Dustin and I own Royal Change, our fitness company based in Charlotte, NC. I have been an athlete my whole life and I am a West Virginia University Big 12 alum and Track & Field high jump athlete. I still maintain several school and state records for high jump! I have a bachelor's in Child Development studies and after going back to school for a second degree to become a nurse anesthetist, I dropped out during my second year to chase my passion in fitness and personal training! \nWhen my younger brother passed away in 2017 I knew I had to create something that would leave a legacy so I decided to post my workouts here on YouTube to train people from all over the world with no barriers to anyone! Let’s crush it together! ",
  "tags": [
    "dumbbell workout",
    "full body dumbbell workout",
    "full body workout",
    "strength training",
    "full body workout with dumbbells",
    "strength and cardio",
    "no repeat dumbbell workout",
    "full body workout at home",
    "full body strength and conditioning",
    "full body strength training workout",
    "full body strength training with dumbbells",
    "strength and cardio-hiit",
    "home workout",
    "dumbbell workout at home"
  ],
  "publishedAt": "2024-01-13T10:00:14Z",
  "duration": 2803,
  "durationFormatted": "46:43",
  "viewCount": 160788,
  "likeCount": 13208,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Fn-0TVi7xis/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Fn-0TVi7xis/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Fn-0TVi7xis/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Fn-0TVi7xis/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Fn-0TVi7xis/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Fn-0TVi7xis\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This workout was great! Sydney if you didn’t make these workouts available on YouTube I wouldn’t have the ability to hire a trainer. Thank you for posting the workouts 5 days a week.",
    "Please people - over 20,000 views and only 3,200 likes? She doesn&#39;t charge us for these workouts - the least we can do is press the thumbs up! Thank you Sydney &amp; team!!!",
    "Thank you for all you do.  Found you 1.5 years ago and 110 lbs down ! You are so appreciated.",
    "Thank you for this fitness session, which I completed on Monday, 1-15-2024! Persistence pays off and that&#39;s what I&#39;ve continued doing in my daily routine.",
    "I’ve been working out with Sydney a couple of years and and I must admit….this BREAKTHROUGH program is tapping into a whole new type of Strength and Endurance!!! Just when you think you can’t go anymore, she’s right there pushing you to PUSH a tad harder. I’m STILL recovering from LEGS!  Let’s finish our WEEK 1 STRONG 💪🏾"
  ],
  "channelSubscriberCount": 1650000,
  "channelVideoCount": 2159
}