{
  "video_id": "fQqndzvURAU",
  "title": "15 Minute Beginner Indoor Cycling Session",
  "description": "Welcome to a gentle, short workout here on GCN Training. This week's session is aimed at beginner cyclists looking to start training indoors, or it could be a good one for a rider looking to ease back into training after an injury or long lay off.\n\nThe Session:\nWarm up: \n1 Min very easy pedalling\n- 1 Min slight increase in intensity\n1 Min further increase intensity to comfortably hard\n\nMain set\n1 Min Easy (1/10)\n- 2 Min Comfortably hard (5/10)\n1 Min Easy (1/10)\n- 1 Min comfortably hard (5/10)\n2 Increase effort (6/10) \n- 30s Easy (1/10)\n30s Sprint (9/10)\n- 2 Mins Recovery (1/10)\n1 Min Comfortably hard (5/10)\n\n- 1 Min Very easy cool down (1/10)\n\nCheck out the GCN shop for the best cycling workout gear 👉 https://gcn.eu/5ne\nSubscribe to GCN Training: https://gcn.eu/5jK\nCheck out the GCN App for more training related advice, videos and inspiration, including all of the latest live racing & results: https://gcn.eu/app\n\nNot all exercises are suitable for everyone - there is no ‘one size fits all’ approach. As with any strenuous exercise, you should take into account factors such as your flexibility, strength and overall health to determine if an exercise is appropriate for you, and consult a doctor/physician before beginning a programme of exercise. Discontinue your exercise session immediately if you experience any pain, dizziness or discomfort. \nPartaking in training sessions following GCN's video instruction is entirely at your own risk, and Global Cycling Network, its partners and its affiliated companies cannot be held responsible for any injuries which may occur as a result of these exercises.\n\nWatch more on GCN...\nMore workouts with GCN: https://gcn.eu/gcntraining\n\nThe Global Cycling Network (GCN) is the largest and fastest-growing online cycling channel in the world, bringing together a global community of road cyclists to celebrate everything that’s great about the world of cycling. \n\nOur videos bring fans compelling daily content including expert tutorials, techniques, training, racing, cutting-edge bike tech, unparalleled behind the scenes event coverage, humour,  entertainment, and more. \n\nPresented by ex-pro riders, GCN offers a uniquely qualified insight into the world of cycling, and most importantly it’s fuelled by our passionate and enthusiastic fans – everyone who makes up the GCN community. We also bring you the latest and greatest tech to your attention, showcase the best places in the world to ride and get exclusive access to events and races. \n\nWelcome to the Global Cycling Network | Inside #cycling\n\nThanks to our sponsors:\nWahoo Fitness: http://gcn.eu/Wahoo-Fitness \nWhoop Fitness: https://gcn.eu/Whoop\nCastelli Clothing https://gcn.eu/Castelli\nGiro Helmets https://gcn.eu/Giro\nPinarello Bikes https://gcn.eu/Pinarello\nZipp Wheels: https://gcn.eu/Zipp\nEnervit Nutrition: https://gcn.eu/Enervit\nTopeak Tools: http://gcn.eu/Topeak\nCanyon Bikes: http://gcn.eu/-Canyon\nPirelli Tyres: https://gcn.eu/Pirelli\nOrbea Bikes: http://gcn.eu/Orbea\nVision Wheels: http://gcn.eu/Vision\n\nPark Tool: http://gcn.eu/-parktool\nElite Bottles: https://gcn.eu/EliteBottles\n\nKomoot: https://gcn.eu/komoot\n\nYouTube Channel - http://gcn.eu/gcnYT\nFacebook - http://gcn.eu/gcnFb\nInstagram - http://gcn.eu/GCNInsta\nTwitter - http://gcn.eu/gcnTW\nGCN Japan: https://gcn.eu/subscribe-gcn-japan\nGCN Italia: https://gcn.eu/GCN-Italia\nSuscribirse a GCN en Español: http://gcn.eu/Suscribirse\nThe GCN Club - http://gcn.eu/club\nGMBN Tech - http://gmbn.tech/subscribe\nGCN Tech - http://gcntech.co/subscribe\nEMBN - http://embn.me/subscribe",
  "channelTitle": "GCN Training",
  "channelDescription": "GCN Training, THE channel for free bike workout classes, HIIT workouts on the bike and training tech and nutrition. With a mixture of fat burning workouts, endurance sessions and workouts for weight loss GCN Training is the very best place for free indoor cycling.\n\nEach week of the year we'll be bringing you a free cycle workout video with music, and the very same without music so you can be your own DJ and train along to the tracks you want to hear. Plus we'll have a weekly feature on training, nutrition or fitness.\n\nSubscribe to GCN Training now and hit the bell so you don't miss out: https://gcn.eu/GCNTraining\n",
  "tags": [
    "15",
    "GCN Training",
    "GCN",
    "Global Cycling Network",
    "Sports",
    "Cycling",
    "Bike",
    "Bikes",
    "Bicycle (Product Category)",
    "Road Bike",
    "Cyclist",
    "spin",
    "spin class",
    "spinning",
    "workout",
    "fat burning",
    "burn",
    "burn fat",
    "fat",
    "interval",
    "intervals",
    "HIIT",
    "effort",
    "training",
    "train",
    "interval training",
    "cycling workout",
    "spinning class",
    "spin workout",
    "training video",
    "indoor cycling",
    "turbo trainer",
    "fitness",
    "gym",
    "gym bike",
    "class",
    "morning",
    "commute",
    "stay fit",
    "inside",
    "indoor",
    "turbo",
    "GCN Cycling",
    "velo",
    "sca15",
    "gc21s",
    "ិ",
    "r1",
    "ꗶ",
    "n1",
    "Ղ",
    "ោ",
    "ሙ",
    "ସ",
    "ଙ",
    "ケ",
    "ィ",
    "ළ",
    "Ա",
    "Ե",
    "ፕ2",
    "ェ",
    "ጎ"
  ],
  "publishedAt": "2021-03-22T16:52:18Z",
  "duration": 905,
  "durationFormatted": "15:05",
  "viewCount": 458091,
  "likeCount": 7689,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/fQqndzvURAU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/fQqndzvURAU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/fQqndzvURAU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/fQqndzvURAU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/fQqndzvURAU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/fQqndzvURAU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Did you enjoy this session? What sort of session would you like to do in future? Let us know 👇",
    "74 years old  out of shape, I weight 297, 5 ft tall.. so you see, I&#39;m very round and I&#39;m wanting to feel better about myself.  I have a pacemaker and Dr. Suggested a biking program.  For the last 2 weeks I&#39;ve done 10 minutes  2x  day to build up my endurance.  Today I found this workout and did the 15 minutes with not adverse effects.",
    "30 years old. Overweight and terrible heart health. My dad and his identical twin both had heart attacks. Just got an indoor bike off Craigslist and did this workout. I feel like I am about to die, it&#39;s fantastic.",
    "I got my indoor bike today I&#39;m 86 and overweight  I&#39;m glad I found you, wish me luck",
    "I&#39;m just getting into indoor cycling, and these are by far the best videos - I&#39;m pleased at how genuine it all is, rather than people spouting motivational quotes all the time.  There is encouragement, and it feels like proper encouragement to me.  The infographics are great, timers and data is all easy to read.  The fact this is on YouTube for free is amazing.  Looking forward to building up my fitness and getting the more challenging rides under my belt."
  ],
  "channelSubscriberCount": 200000,
  "channelVideoCount": 251
}