{
  "video_id": "fTky0-ETtjA",
  "title": "10 Minute Pilates Arm Workout | Quick Upper Body Workout with Light Weights",
  "description": "Hello everyone! Join me for an arm workout with weights. Weights are optional here, you can use your bodyweight. \n\nI’m using 1kg dumbells, but feel free to choose your own weight level, from 0.5 to 3kg. If you don't have dumbells at home, you can always use cans of food, milk/juice cartons, bottles of water, or whatever you have handy, just make sure they don't spill! \n\nRemember to switch on those arm muscles throughout this workout, show me those muscles - you need to give yourself that resistance (especially if you're not using weights or you're using a light pair). I always say, 'think you're holding on to heavy weights' or 'pretend you're moving your arms through melted chocolate or melted cheese!' \n\nFeel free to shake out those arms if needed, and then jump right back in! See you soon! Emma x\n\nIf you enjoyed this arms workout, please remember to like, share, subscribe and comment if you have any questions, suggestions or feedback.\n\nMake sure you check out our other great at home Pilates workouts on the Club Forme channel.\n\nI hope to see you here again soon!\n\nEmma x\n\n#pilates #armsworkout #pilatesarmworkout\n\n\nFollow Club Forme on Instagram: https://www.instagram.com/club.forme/\nFollow Emma on Instagram: https://www.instagram.com/emmaspencerlelek/\n\n\nDISCLAIMER:\n\nThis is my own personal workout and it may not be suitable for you. We recommend you speak with your physician and follow all safety instructions before the commencement of any exercise program. By engaging in this exercise or exercise program, you understand that the classes are a form of physical activity and that there are inherent risks in undertaking any form of physical exercise. When participating you agree that you do so at your own risk, are voluntarily participating and assume all risk of injury to yourself.",
  "channelTitle": "Club Forme Pilates & Barre",
  "channelDescription": "Hi everyone! My name is Emma, thank you so much for stopping by. I am a certified Pilates and Barre teacher from Australia and I have created Club Forme to share my love of movement. Here you'll find a collection of mat Pilates, Barre, Reformer, and stretch classes. There are quick and full-length workouts, flows and active workouts, and beginner and advanced workouts. Hopefully you will enjoy working out and having a bit of a laugh with me! :)\n\nDISCLAIMER:\nThese are my own personal workouts and they may not be suitable for you. We recommend you speak with your physician and follow all safety instructions before the commencement of any exercise program. By engaging in this exercise or exercise program, you understand that the classes are a form of physical activity and that there are inherent risks in undertaking any form of physical exercise. When participating you agree that you do so at your own risk, are voluntarily participating and assume all risk of injury to yourself.\n",
  "tags": [
    "arms workout",
    "pilates workout",
    "pilates class",
    "arms workout with light weights",
    "arms workout with equipment",
    "upper body workout with weights",
    "upper body workout",
    "light weights arm workout",
    "10 minute pilates class",
    "10 minute workout",
    "10 min at home workout",
    "quick arm workout",
    "quick pilates workout",
    "quick workout",
    "pilates arm workout",
    "arms with light weights",
    "at home workout",
    "youtube workout"
  ],
  "publishedAt": "2021-02-20T21:21:09Z",
  "duration": 663,
  "durationFormatted": "11:03",
  "viewCount": 194736,
  "likeCount": 3675,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/fTky0-ETtjA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/fTky0-ETtjA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/fTky0-ETtjA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/fTky0-ETtjA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/fTky0-ETtjA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/fTky0-ETtjA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Spotify playlist to play along with this class:  <a href=\"https://open.spotify.com/playlist/2e0MXXkRkB5JOTkIykMwx8\">https://open.spotify.com/playlist/2e0MXXkRkB5JOTkIykMwx8</a><br>Subscribe to Club Forme’s channel for more fitness videos: <a href=\"https://clubforme.com.au/subscribe\">https://clubforme.com.au/subscribe</a>",
    "This was an INSANE burn with two pound weights haha I get the hype!!!!! Had to take a couple seconds inbetween but got right back into it:))",
    "Wow. My arms, chest, shoulders, and upper back were on FIRE with 2lb weights. Fantastically quick and effective workout! 🔥 💪",
    "I keep coming back for my arm workout. also love those little laughs. it&#39;s like working out w/ a friend😍",
    "I have adhd so im picky with choosing workout videos. this video has helped me a lot, quick but really feel my muscles working and also entertaining how simple exercises gets you SWEATING. My attention span and my muscles thank you"
  ],
  "channelSubscriberCount": 9250,
  "channelVideoCount": 97
}