{
  "video_id": "g_tea8ZNk5A",
  "title": "15 Min. Full Body Stretch | Daily Routine for Flexibility, Mobility & Relaxation | DAY 7",
  "description": "Welcome to your 15 Minutes Full Body Stretching Routine! This short and well balanced sequence provides you with everything you need to get your daily dose of flexibility, mobility & relaxation. Feel free to implement this routine in your daily workout schedule to get the best results. Physically and mentally.\n\nI´m also really happy that you enjoy my playlist for this routine.\nThese are the songs I used:\n\nMichael FK - Change\nL.M. Styles - Wait on you\nFaith Richards - My Caffeine\nSarah Angel - Lakeview\nMuted - Belonging (it’s the piano piece)\n\n___\n\nWillkommen zur 15 Minuten Full Body Stretch Einheit! Zu einem ausgewognen Training, gehört auch ausreichend Erholung und Recovery! Daher steht an Tag 7 unserer Fitness-Journey eine wohltuende und ausgleichende Stretching-Routine auf dem Plan. Für mehr Flexibilität, Erholung & Entspannung.\n\nJa, auch dieses Video kommt ohne Voice-Over ;) Bewusst! Denn entgegen einer geführten Stretching- oder Yoga-Einheit ist man hier wirklich mal ganz bei sich! Nur du, die Musik, dein Atem und ein kleiner Beep hier und da ;) Vielleicht öffnest du dich also heute mal ganz unvoreingenommen für genau diesen Weg. Auch wenn es nur ein einziges Mal ist.\nEs wird anders anders sein - davon bin ich überzeugt. Denn wenn es im Aussen still ist, wird es Innen oftmals ganz schön laut.\n\nIch möchte dich ermutigen, dich einzulassen…\nDie Positionen zu genießen und zu erforschen…\nGedanken, die währenddessen aufkommen, einfach zu beobachten…Gut sein zu lassen…Anzunehmen…\nLoszulassen…\nZu sein!\n\nDarüberhinaus ist diese Art des Praktizierens ein gute Möglichkeit für einen Übergang zu einer Yoga Self Practise - also das eigenständige Praktizieren.Die Asanas und die Zeit sind vorgegeben, aber die Instruktionen sind dieses Mal dir selbst überlassen.Falls du also schon ein Weilchen mit mir Yoga praktizierst, nutze die heutige „no-talking-session“ doch gerne für eine kleine Bestandsaufnahme in Sachen Ausrichtung und Mindset. \nWas machen die Schultern in der Vorbeuge, wo sind die Hände im Vierfüßler ausgerichtet und wie hieß nochmal der herabschauenden Hund auf Sanskrit… ;)\n\nDas ist nur eine kleiner Impuls meinerseits, denn in meinen Augen bieten uns unterschiedliche Situation nunmal unterschiedlichste Möglichkeiten. Wir müssen nur genau hinschauen und sie wahrnehmen… und annehmen!\n\nWenn du nicht dennoch sträubst, auch in Ordnung ❤️.\nDann mache stattdessen gerne diese geführte Full Body Stretch Einheit (15 Minuten): https://youtu.be/qFgwrTc1e1I\nWenn du mehr willst, mache 30 Minuten Full Body Stretch: https://youtu.be/FUHzkAbrOlg\n\n\nUnd wenn du dich fragst, was erzählt sie da eigentlich, ich will mich doch einfach nur Dehnen 😂😂😂\nPerfekt! Dann bist du genau richtig hier ❤️\n\nSchön, dass du da bist.\nAlles Liebe.\nMady 🤘🏼🐾\n\n\n\n********************************\n\n\nNO ADS!\nWie in allen meinen Einheiten, schalte ich innerhalb der Videos keine Werbung! Ihr werdet also nicht mitten im Workout unterbrochen.\n\n\n\nDiese Yoga-Einheit könnt ihr ganz prima im Anschluss absolvieren:\nhttps://youtu.be/rjbrTr_EbB4\n\n\nMeine Yogamatte: \nhttp://amzn.to/2mo8NNr *\n\n\n\n********************************\n\n\n\n7  DAYS - 7 WORKOUTS\n\nRepeat this Workout Schedule for at least 4 Weeks to get the best results!\n\nDay 1 // Full Body Workout: https://youtu.be/IMctZ4i2FRw\nDay 2 // Legs & Booty Workout: https://youtu.be/d-8tlYmfbDs\nDay 3 // Intensive ABS Workout: https://youtu.be/7P4-W0D21fg\nDay 4 // Fat Burning HIIT: https://youtu.be/ZO9IG-6SYJA\nDay 5 // Booty Burn: https://youtu.be/ajK3KMWHI60\nDay 6 // Arms, Abs & Back: https://youtu.be/b2sdVtXNecs\nDay 7 // Deep Stretch: https://youtu.be/g_tea8ZNk5A\n\nI am also working on printable workout guides, to keep you motivated and track your sessions!\n\n********************************\n\n\n\nEQUIPMENT:\n\nMeine liebste Matte: \nhttp://amzn.to/2mo8NNr *\n\nMeine Vlogging Cam: \nhttp://amzn.to/1GsIWWo *\n\nMein Make Up 100% Bio- bzw Naturkosmetik\nhttp://amzn.to/1LtYY89 *\n\nMein neuer Mixer (macht die besten Smoothies ever!)\nhttp://amzn.to/2n4BayW *\n\n\n\n\n\n********************************\n\n\nMUSIK: www.epidemicsound.com\n\n\n********************************\n\n\n\n\nFür tägliche Inspiration YOGA, TRAVEL & FOOD :\n\nInstagram : https://instagram.com/madymorrison/\nFacebook: https://www.facebook.com/morrison.mady\nBlog: http://www.madymorrison.com",
  "channelTitle": "Mady Morrison",
  "channelDescription": "Hallo ihr Lieben,\nich bin Mady Morrison, zertifizierte Yogalehrerin und freue mich, dass ihr auf meinem Youtube-Kanal gelandet seid!\nHier teile ich meine größte Leidenschaft - YOGA!\n\nYoga begleitet mich schon seit über 10 Jahren und hat mir in den verschiedensten Bereichen und Phasen meines Lebens geholfen! Neben den Körperlichen Benefits (Muskelaufbau, Balance, Fettabbau (je nach Yogastil)) bin ich achtsamer und vor allem zufriedener geworden. Ich bin super ausgeglichen, glücklich und habe immer ein Strahlen im Gesicht! \nDiese Freude und Leidenschaft möchte ich an euch weitergeben! \nIch liebe was ich tue und freue mich Yoga hier auf Youtube für ALLE zugänglich zu machen! Für Anfänger und Fortgeschrittene ist alles mit dabei!\n\nHabt viel Spaß!\nEure Mady\n",
  "tags": [
    "full body stretch",
    "homeworkout",
    "workout",
    "norepeat",
    "noequipment",
    "beginner",
    "hiit",
    "madymorrison",
    "abs",
    "booty",
    "fitmitmady",
    "yogamitmady",
    "warmup",
    "cooldown",
    "anfänger",
    "sport",
    "lowimpact",
    "totalbody workout",
    "beginnerfriendly",
    "weightloss",
    "abnehmen",
    "kraft",
    "beweglich",
    "ohneequipment",
    "bootcamp",
    "ganzkörper",
    "stretch",
    "deep stretch",
    "dehnen",
    "mobility",
    "Beweglichkeit",
    "relax",
    "Entspannung",
    "yoga",
    "yoga Anfänger"
  ],
  "publishedAt": "2020-06-07T05:00:07Z",
  "duration": 993,
  "durationFormatted": "16:33",
  "viewCount": 93387415,
  "likeCount": 1230663,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/g_tea8ZNk5A/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/g_tea8ZNk5A/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/g_tea8ZNk5A/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/g_tea8ZNk5A/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/g_tea8ZNk5A/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/g_tea8ZNk5A\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hello beautiful people!\u2028<br>First of all: thank you so much for your positive feedback! I really appreciate your lovely comments and i am more than happy that you enjoy this kind of stretching video so much (no talking, only music)!<br><br>Since so many of you asked for the playlist, I put all of the songs together. \u2028<br>Here you go:\u2028\u2028<br><br>Michael FK - Change\u2028<br>L.M. Styles - Wait on you\u2028<br>Faith Richards - My Caffeine\u2028<br>Sarah Angel - Lakeview\u2028<br>Muted - Belonging (it’s the piano piece)<br><br><br>VIDEO REQUESTS:\u2028<br>Also feel free to comment your video requests for more music-only-videos below!<br>I usually do german videos, but the music sessions seem like a perfect way to support even more of you guys &lt;3<br><br>Love from Berlin!\u2028<br>Mady &lt;3",
    "Can we also appreciate the beep every time a stretch will end it helps me focus on my stretches and I&#39;ll know it will end without having to constantly check the video! Mad respect sis! ❤️",
    "Can we just admire her for not putting ads in the middle of the video?? :)",
    "I don&#39;t know why I am crying . I finally got my self out of bed and pushed myself to do something good to my body thank you for this &lt;3",
    "It’s been 4 years since this post and it’s still my go to daily stretch 😊"
  ],
  "channelSubscriberCount": 3840000,
  "channelVideoCount": 210
}