{
  "video_id": "Gb9YxCC5WBw",
  "title": "10 Minute Morning Breathwork Routine I The Key To Happiness",
  "description": "Start your mornings with a calm breathing technique to invite some positivity and joy into your day. By using the breath, mixing conscious breathing with conscious thinking, we can influence our day, and our life to go in any direction that we would like.\n\nWant to deepen your practice? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite with T-Shirts and more:\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBig thanks to this weeks patrons:\nLain\nCecilia\nRTX\nMegan\nKajsa\nDavid\nSev\nOlivier\nGyani\nIngo\nJesus\nSally\nPiotr\nKasper\nLinda\n\nA longer more intense session can open the mind to a more profound and immersive state of self-discovery, serving to bring about a greater degree of insight, stimulate new and enlightening thoughts, spark a greater awareness of oneself and one’s emotional state, and allow you to gain more clarity. Longer sessions available on my Patreon channel if you would like to dive deeper within your own being.\n\nRegular practice of Breathwork can bring real change to your life Including boosted immune system, lowered stress and inflammation, better focus, more energy and the list goes on. My guiding voice mixed with the rhythmic music really helps to go deeper into a state of relaxation and bliss. So if you want the full experience, wear headphones and be in a quiet comfortable place.\n\nAll music, guided voice and video editing is done by me. I thoroughly enjoy creating this content for you all and hope that is can bring improvement into your life. Whether that be more self love, kindness, less stress and anxiety, lowered inflammation,  more energy etc whatever it brings, remember to say thank you to yourself for taking the time do improve your life.\n\nSafety Disclaimer\nAll information provided by this channel is only for educational and entertainment purposes.  Sandy is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n\nMuch love,\nSandy\n\n#breathwork   #morningroutine   #yoga\n00:00 Introduction\n00:24 round 1\n03:17 Round 2\n06:38 round 3\n10:00 Meditation",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "boost immune system",
    "breathing",
    "breathing exercises",
    "breathing techniques",
    "breathwork",
    "cold training",
    "deep breathing",
    "ice therapy",
    "iceman",
    "immu",
    "breath meditation",
    "energy breathing",
    "raise my vibration",
    "how to have more energy",
    "guided breathwork",
    "guided breathwork meditation",
    "guided breathwork for anxiety",
    "guided breathwork for beginners",
    "morning meditation",
    "morning routines 2023",
    "morning routines",
    "how to breathe"
  ],
  "publishedAt": "2023-02-27T16:00:09Z",
  "duration": 747,
  "durationFormatted": "12:27",
  "viewCount": 1294162,
  "likeCount": 24910,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Gb9YxCC5WBw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Gb9YxCC5WBw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Gb9YxCC5WBw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Gb9YxCC5WBw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Gb9YxCC5WBw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Gb9YxCC5WBw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hey Sandy, I joined your patreon this morning. I wanted to thank you for all your doing. I have never given to a Patreon before. It feels good to give something back to you guys for these productions. The music , the sound mixing , your voice recordings , the locations, the camera work. Really very special. Thanks. Tommy.",
    "Who&#39;s every day here???",
    "Here almost everyday! 10 months sober. The breath is the way!!!❤",
    "I am 94 years old and found this has been good for me.  thank you as it is simple to follow and easy to remember.",
    "Welcome all of you beautiful breathing people. Mixing conscious breathing and conscious thinking paves way to a better day. Much love,<br>Sandy<br>Deep your practice and join our Patreon:<br><a href=\"https://patreon.com/breathewithsandy?utm_medium=clipboard_copy&amp;utm_source=copyLink&amp;utm_campaign=creatorshare_creator&amp;utm_content=join_link\">https://patreon.com/breathewithsandy?utm_medium=clipboard_copy&amp;utm_source=copyLink&amp;utm_campaign=creatorshare_creator&amp;utm_content=join_link</a>"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}