{
  "video_id": "GdiQVpWsxeU",
  "title": "Feel Better In 8 Minutes | Morning Breathwork Routine",
  "description": "This quick yet effective 8 minute breathwork routine is designed to help give you that boost of energy whenever you need a reset. You can do this energy breathwork in the morning, afternoon or even in the evening to help wind down from a long day. Enjoy and share with friends. \n\nWant longer videos? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite \nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBy engaging in longer and more intense sessions, breathers may access a deeper and more immersive state of self-discovery. This experience can lead to a greater level of insight, the emergence of new and enlightening thoughts, heightened awareness of one's emotional state, and improved clarity. If you are interested in diving further into your own being, longer sessions are available on my Patreon channel. https://www.patreon.com/breathewithsandy\n\nI personally make all aspects of creating this content, including the music, guided voice, and video editing. It brings me pleasure to create content that can benefit you, and my hope is that it can help you improve your life in various ways, such as fostering self-love and kindness, reducing stress and anxiety, decreasing inflammation, and increasing energy. Whatever improvements it may bring, I encourage you to take a moment to appreciate yourself for investing time in your personal growth.\n\nSafety Disclaimer\nAll information provided by this channel is only for educational and entertainment purposes.  Sandy is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n#energy   #breathwork #stressrelief \n00:00 Intro \n01:00 Round 1\n03:30 Round 2\n06:20 Round 3\n09:00 Meditation",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "breathwork",
    "morningroutine",
    "anxietyrelief",
    "mentalhealth",
    "calmmind",
    "stressfree",
    "mindfulness",
    "dailycalm",
    "wellnessjourney",
    "wimhof",
    "yoga",
    "meditation",
    "pranayama",
    "selfcare",
    "peacefulmorning",
    "healthyhabits",
    "beginnersyoga",
    "holistichealth",
    "emotionalwellbeing",
    "mindbodyspirit",
    "personalgrowth",
    "breathe",
    "feelgoodmorning",
    "positivity",
    "meditationmusic"
  ],
  "publishedAt": "2024-08-12T15:00:27Z",
  "duration": 770,
  "durationFormatted": "12:50",
  "viewCount": 238009,
  "likeCount": 5691,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/GdiQVpWsxeU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/GdiQVpWsxeU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/GdiQVpWsxeU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/GdiQVpWsxeU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/GdiQVpWsxeU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/GdiQVpWsxeU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Enjoy this new routine my friends. You can find longer videos and join our community of fellow breathers here: <a href=\"https://patreon.com/breathewithsandy?utm_medium=unknown&amp;utm_source=join_link&amp;utm_campaign=creatorshare_creator&amp;utm_content=copyLink\">https://patreon.com/breathewithsandy?utm_medium=unknown&amp;utm_source=join_link&amp;utm_campaign=creatorshare_creator&amp;utm_content=copyLink</a>",
    "This is an instant favorite. I recently quit a medication (ADHD stimulant) that no longer served any purpose, but that I was terrified to come off of and so I stayed stagnant and felt stuck for several years. I discovered your channel around 2 years ago and I’ve spent the time since then building up skills, confidence and courage with good habits like these sessions (2 or 3 times daily), ice baths, exercise and nutrition. I’m now over 2 weeks without the meds and I’ve never felt more balanced or as able to live in gratitude with the ability to express it in positive ways. I’ve never felt more connected and alive. I’ve never felt like I had the tools needed to just simply exist and enjoy life as I do now. You’ve really, honestly, sincerely changed my life for the better. I am eternally grateful and will remain a humble student. Thanks for all you do ❤",
    "Dude, the production is so good across the board on these. Impressively intuitive, never thought breathwork could be this streamlined and accessible, thanks Sandy!",
    "I’ve never felt the need to comment on a video before, but this was absolute perfection. My son is doing kids yoga next to me, my baby is sleeping, and this breathing routine felt life changing for a tired mom.. in this moment life is good. Thank you ❤",
    "I wonder if you really know how much you are helping people. Thank you for helping me, these are the best breathing videos on the internet. I am not exaggerating when I tell you that this has changed my life and myself and everyone around me are benefitting. Thanks again, Sandy. Have a great day"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}