{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.6
    },
    {
      "level": "Intermediate",
      "score": 0.75
    },
    {
      "level": "Advanced",
      "score": 0.45
    }
  ],
  "techniqueDifficultyConfidence": 0.7,
  "techniqueDifficultyExplanation": "The technique difficulty for this workout is largely beginner to intermediate, as indoor cycling does not involve complex movements and primarily requires pedaling coordination. Keywords such as \"high intensity training\" and \"pro cycling\" suggest some level of technique, but as this is an indoor cycling session, proper form primarily involves maintaining balance and controlled pedal strokes, making it accessible at a basic level. The presence of professional cyclists indicates that it could challenge intermediates, but generally, cycling workouts require less technique complexity than other fitness domains.",
  "effortDifficulty": [
    {
      "level": "Moderate",
      "score": 0.6
    },
    {
      "level": "Challenging",
      "score": 0.8
    }
  ],
  "effortDifficultyConfidence": 0.85,
  "effortDifficultyExplanation": "The effort difficulty is rated as moderate to challenging based on the description of the workout being 'high intensity' and duration of 21:21, which could be strenuous for less fit users. The use of phrases like 'maximal intensity intervals,' 'tough,' and 'if your legs aren't screaming' indicate significant cardiovascular demand and energy expenditure. The lack of specified rest periods implies continuous work, enhancing the challenging aspect of this routine.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.35
    },
    {
      "level": "Intermediate",
      "score": 0.8
    },
    {
      "level": "Advanced",
      "score": 0.65
    }
  ],
  "requiredFitnessLevelConfidence": 0.9,
  "requiredFitnessLevelExplanation": "This workout suggests a fitness level that spans beginner to advanced, but leans more towards intermediate. The 'high intensity' wording and short duration suggest it's more suitable for those with some fitness base, aligning with beginner to intermediate users especially given the possibility of bike resistance adjustment. The advanced level is also supported because users with greater fitness can intensify resistance or speed, as indicated by 'pro cycling.' The presence of professional cyclists and the tone of comments ('not for kidding,' 'pro workout') further suggest it is challenging."
}