{
  "video_id": "gGGvKt8vWho",
  "title": "20 Minute High Intensity Indoor Cycling Workout",
  "description": "Subscribe to GCN Training: https://gcn.eu/GCNTraining\n\nA tough, highly effective cycling training session designed for home workouts, and packed in to just 20 minutes. \n\nSubscribe to GCN: http://gcn.eu/SubscribeToGCN\nGet exclusive GCN gear in the GCN store! http://gcn.eu/BuyGCNKit_\nSign up to the GCN newsletter: http://gcn.eu/gcnnewsletter\n\nMake no mistake, this 20 minute workout is tough. Train along with five professional cyclists to a great sound track and share in the pain and satisfaction of these high intensity sessions. \n\nA short warmup precedes maximal intensity intervals that are incredibly effective at boosting your top end fitness - fast. If your legs aren't screaming by the end of this, you need to try harder! \n\nMusic - licensed by Cue Songs\nAmbition Is Critical The Blackout http://gcn.eu/15W1OMn\nPandorum Stefano Azati                 http://gcn.eu/16EBFTM\nMountain Guerrilla Last Japan http://gcn.eu/1084EMR\nKaos Therapy (Proktah Remix) Optiv http://gcn.eu/WRwuxT\nThe Beta Set Adam Walder         http://gcn.eu/ZDZJ3Z\nNever Going Home Cassette Jam http://gcn.eu/XkYJ39\nNeuro Video John Foxx                 http://gcn.eu/YmnQm5\nSensor Casue4Concern           http://gcn.eu/1086BZH\nYoung Believers (Instrumental) White Light Parade http://gcn.eu/WyaOpt\nThe Futures Not What It Used To Be (Drifta Remix) The King Blues         http://gcn.eu/1086RYC\nMellow Down Easy The Harpoonist & The Axe Murderer http://gcn.eu/115nWRM\nDroids Cause4Concern                     http://gcn.eu/ZE0XME\nFloat On Stereo MC's                     http://gcn.eu/ZV7Uc1\nAge Of The Platypus A.S.M             http://gcn.eu/Wz2Xa7\n\nNot all exercises are suitable for everyone - there is no ‘one size fits all’ approach. As with any strenuous exercise, you should take into account factors such as your flexibility, strength and overall health to determine if an exercise is appropriate for you, and consult a doctor/physician before beginning a programme of exercise. Discontinue your exercise session immediately if you experience any pain, dizziness or discomfort. \nPartaking in training sessions following GCN's video instruction is entirely at your own risk, and Global Cycling Network, its partners and its affiliated companies cannot be held responsible for any injuries which may occur as a result of these exercises.\n\nIf you want to contribute captions and video info in your language, here's the link to help out 👍 : http://gcn.eu/6F\n\nAbout GCN:\n\nThe Global Cycling Network puts you in the centre of the action: from the iconic summit of the Stelvio to the epic trails of Fort William, Scotland, everywhere there is pavé or dirt, world-class racing, and pro riders, we will be there bringing you all the action, essential analysis and unparalleled access every week, every month, and every year.\n\nWelcome to the Global Cycling Network | Inside cycling\n\nYoutube Channel - http://gcn.eu/gcnYT\nFacebook - http://gcn.eu/gcnFb\nGoogle+ - http://gcn.eu/gcnGPlus\nTwitter - http://gcn.eu/gcnTW\n\nLeave us a comment below!\n\nMusic licensed by Cue Songs\nMusic - licensed by Cue Songs",
  "channelTitle": "Global Cycling Network",
  "channelDescription": "The Global Cycling Network puts you in the centre of the action: from the iconic climbs of Alpe D’Huez and Mont Ventoux to the cobbles of Flanders, everywhere there is road or pavé, world-class racing and pro riders, we will be there bringing you action, analysis and unparalleled access every week, every month, and every year. We show you how to be a better cyclist with our bike maintenance videos, tips for improving your cycling, cycling top tens, and not forgetting the weekly GCN Show. Join us on YouTube’s biggest and best cycling channel to get closer to the action and improve your riding!\n\nWelcome to the Global Cycling Network!\n",
  "tags": [
    "high intensity training",
    "Pro cycling",
    "Cycling",
    "Cycling Training",
    "Sec Features",
    "work out",
    "Turbo session",
    "Road Bike",
    "GCN",
    "Cyclist",
    "turbo-training",
    "Workout",
    "fitness",
    "training session",
    "Sports",
    "Bike",
    "Global Cycling Network"
  ],
  "publishedAt": "2013-03-18T16:36:01Z",
  "duration": 1281,
  "durationFormatted": "21:21",
  "viewCount": 2332366,
  "likeCount": 12075,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/gGGvKt8vWho/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/gGGvKt8vWho/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/gGGvKt8vWho/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/gGGvKt8vWho/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/gGGvKt8vWho/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/gGGvKt8vWho\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "We tackled assembling the bike as a family project. <a href=\"https://www.youtube.com/post/Ugkxzg0clhbtRf2gGxPkVETFKJJKGqdsorQu\">https://www.youtube.com/post/Ugkxzg0clhbtRf2gGxPkVETFKJJKGqdsorQu</a>  The package is heavy, but I have 2 teen boys that were able to move it. The written instructions were great- we didn&#39;t need to watch the videos, but it was good knowing that the option was there if we needed it. After we were able to get it set up, the boys each rode 3 miles and I rode 8 and the bike stayed quiet. The display is easy to reset, and you can put it on whichever setting you are using (time, distance, calories, etc). I will say that my butt is a little sore from the seat, but that could be because I haven&#39;t rode in a while. While it is comfortable for me, it was not comfortable with the seat position for my friend (could not move the seat back far enough and he slightly looked like a kid riding a tricycle that he had outgrown). He also said that the seat hurt his manly parts. We are going to look for a different seat that will be compatible with this bike for him.I did purchase the Wahoo Cadence sensor and strapped it to the crank of one of the pedals. This will sync with my Apple Watch, iPhone and will import data in to my Health app. Wahoo does have other sensors available other than cadence. I can also keep either my phone or my iPad on the display and they both feel pretty secure.",
    "These guys are my heroes! Did my best to pretend to keep up! Loads of fun and very inspiring. THANK YOU!",
    "Great session. Not for kidding . It&#39;s a pro workout. Thank you so much. CGN is the best I never seen on Youtube.",
    "Shoutout from Pittsburgh, Pennsylvania! Love the video - along with the top 10 ways to lose weight on a bike video this channel has helped me lose around 20 pounds so far and going strong. It would be great if you could make a version of this video without the background music so it just had the lady&#39;s voice counting timers and giving encouragement. That way we could play this video and use our own music playlist or even play it while watching a movie so we still know when the intervals are coming. ",
    "Really old masterpiece!<br>Did this one today and felt great in the quarantine."
  ],
  "channelSubscriberCount": 3390000,
  "channelVideoCount": 8298
}