{
  "video_id": "gKjgJ5k3i7c",
  "title": "30 MIN YOGA WORKOUT || Heart Opening Feel Good Flow",
  "description": "Open your heart and maintain a healthy spine with this 30 Minute Yoga Workout Flow. Not only will you stretch and flow through heart opening sequences but you will work the core to keep your body strong and flexible!\n\n\n🌸  Wearing Gymshark \n\n🌸 Mat from Liforme - https://liforme.com/\nUse my code 'MOVEWITHNICOLE' for a discount.\n\n\n♡ INSTAGRAM: @movewithnicole\n♡ EMAIL: movewithnicole.yt@gmail.com\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "yoga pilates",
    "yoga pilates fusion workout",
    "yoga pilates full body",
    "full body workout",
    "yoga pilates full body workout",
    "30 min pilates yoga",
    "30 min yoga pilates workout",
    "30 min pilates",
    "move with nicole",
    "30 min full body workout",
    "yoga workout",
    "at home yoga workout",
    "at home yoga pilates",
    "move with nicole pilates",
    "move with nicole 30 min",
    "yoga",
    "pilates yoga workout",
    "move with nicole yoga",
    "30 min yoga workout",
    "heart opening yoga",
    "30 min feel good yoga",
    "feel good flow"
  ],
  "publishedAt": "2021-11-24T09:24:44Z",
  "duration": 2085,
  "durationFormatted": "34:45",
  "viewCount": 1390445,
  "likeCount": 31152,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/gKjgJ5k3i7c/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/gKjgJ5k3i7c/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/gKjgJ5k3i7c/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/gKjgJ5k3i7c/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/gKjgJ5k3i7c/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/gKjgJ5k3i7c\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you, Nicole! I do your workouts five times a week and they keep me feeling energized and alive! You are my absolute favourite! Big ❤ from Canada 🇨🇦",
    "😊 yes, this is my second day in a row doing yoga.  I&#39;m doing yoga to overcome urges from my addiction so I hope this helps. Thanks may God bless your endeavors in life amen",
    "I can’t explain it. I did this flow last night as a gentle calming low-impact workout due to the day I had. After finishing the workout I felt amazing and super calm, perfect before a shower then sleep. When I woke up the whole day today I’ve felt so much love for everything! The world, my boyfriend, my life, just gratitude and love literally flowing out of my soul. I was trying to think of why I felt this way and then I remembered I did this video the night before. It’s amazing and soul lifting. I love love love Nicole’s videos but this flow hit different. Thank you so much Nicole 🤍🤍🤍🤍",
    "my day has improved in the last 30 mins",
    "I don&#39;t know how to thank you for all your amazing workouts, I got full of positive energy, and I love how beautifully you move and your calming voice. Thank you Nicole, you are absolutely amazing &lt;3"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}