{
  "video_id": "glfUroMzhuk",
  "title": "Law of Attraction Meditation for Deep Positivity & Abundance (Guided Meditation 20 Minutes)",
  "description": "A Law of Attraction meditation, designed to be a powerful catalyst for cultivating deep positivity and harnessing the power of positive energy, this meditation guides you through the essential steps to understanding and embracing the Law of Attraction. Discover how to recalibrate your mindset, ensuring a steady flow of positive thoughts and becoming the architect of your own destiny.\n\nIn this session, you'll learn to manifest abundance, vitality, love, and joy, creating the life you've always dreamed of. Whether you choose to awaken rejuvenated or drift into a peaceful slumber, this meditation supports your journey towards manifestation and removing negativity, leaving you revitalized and ready to seize the day.\n\nEmbrace the transformative energies and infuse your spirit with an unwavering belief in the power of manifestation. Join us in this empowering session to unlock your full potential and manifest the life you desire.\n\nJoin this channel to get access to perks: https://www.youtube.com/channel/UCxBl72R4EzfzROLp1xok4Mg/join\n\n#lawofattraction #guidedmeditation #manifest  \n\n=====================================================\n\nThank you for listening. I hope you enjoy and benefit from this video.\n\nPlease rate and let me know of your experiences in the comment section. Thank you.\n\n=====================================================\n\nAll content provided by Positive Suggestion is intended for entertainment purposes only. None of this content is intended to replace qualified medical, or health related advice. All hypnosis and guided meditation is self hypnosis and must be regarded as such. Positive Suggestion accepts no responsibility or liability, in part or in whole, for any injury, loss or damage, as a direct or indirect result of the use or reliance of the information and material presented here.\n\nDo not listen to this recording whilst driving or operating machinery. Thank you.\n\n=====================================================\n\nRoyalty Free Music Credit:\n\"Fluidscape\" Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 3.0 License\nhttp://creativecommons.org/licenses/by/3.0/\n\nRoyalty Free Stock Footage Credit:\nBeachfront B-Roll: Free Stock Footage\nhttps://www.youtube.com/user/Beachfrontprod/videos\n\nPOSTIVE SUGGESTION\n#meditation #manifesting #lawofmanifestation #loa",
  "channelTitle": "Positive Suggestion",
  "channelDescription": "Subscribe now and start your journey towards a more centered, empowered you.\nUse these guided meditations as your dose of calm, clarity, and inspiration.\n\nWant to give something back? Show some love by liking, sharing, and commenting. \nYour feedback shapes our future content and helps us grow as a channel.\n",
  "tags": [
    "meditation",
    "guided meditation",
    "law of attraction",
    "law of attraction meditation",
    "manifestation meditation",
    "meditation for manifesting",
    "law of attraction guided meditation",
    "positive suggestion meditation",
    "positive thinking law of attraction",
    "positive suggestion law of attraction",
    "meditation guided",
    "loa meditation",
    "law of attraction 20 minute meditation",
    "law of attraction meditation 20 minutes",
    "law of attraction manifestation meditation",
    "meditate",
    "loa meditation guided"
  ],
  "publishedAt": "2016-05-15T17:36:14Z",
  "duration": 1213,
  "durationFormatted": "20:13",
  "viewCount": 3307452,
  "likeCount": 39622,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/glfUroMzhuk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/glfUroMzhuk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/glfUroMzhuk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/glfUroMzhuk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/glfUroMzhuk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/glfUroMzhuk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "HEY GUYS! I know it&#39;s taken a long time, but for those of you not quite happy with this meditation, I&#39;ve remade it, but without those lines you don&#39;t like. Enjoy! <a href=\"https://www.youtube.com/watch?v=fc8ni8wgp_M\">https://youtu.be/fc8ni8wgp_M</a> Thank you all for your support. I hope to be back making videos again very soon!",
    "If you come here definitely means you are on the pathway of success ✍️",
    "When you’re young, you’re always worrying what other people are thinking about you.<br>When you reach middle age, you no longer care what other people think of you.<br>And when you’re old, you realise, everyone was just thinking about themselves all along.",
    "Sometimes I think I’m too young for these stuff and I’m only 12 years old and I’m already interested in these things, people at my age is not even interested in these stuff but me so I just keep these things to myself. My guardian angels and God has help me through a lot and I know I’m young but trust me I’ve been through a lot and I’m really happy that I have these resources at the age of 12.",
    "Your watching this for a reason know miracles can happen if you just believe. When your in alignment everything is in alignment with you. I choose to believe I choose to spread love and I’m only growing from here. The worst has ended and the best is coming! I believe"
  ],
  "channelSubscriberCount": 63000,
  "channelVideoCount": 177
}