{
  "video_id": "Gtr7-Eiirg0",
  "title": "20 min STANDING DUMBBELL WORKOUT | Full Body | Sculpt and Strengthen | Warm Up + Cool Down Included",
  "description": "Join in for a 20 minute STANDING DUMBBELL WORKOUT to sculpt and strengthen the full body. Today I'll be using two 10LB weights. This is a NO WRISTS workout which means no planks, pushups or burpees! I'll also be including a quick WARMUP and COOL DOWN. So grab your equipment and get ready to feel the burn! 💞 xox Mik\n\nEQUIPMENT:\n- Medium set of dumbbells (two 10LB weights)\n\n\n\nFACEBOOK GROUP:\nhttps://www.facebook.com/groups/1283167828900995/\n\n\nWEBSITE: www.fitbymik.com\nINSTAGRAM: https://www.instagram.com/fitbymik/?hl=en\nFACEBOOK: https://www.facebook.com/fitbymik/\n\n\n#homefitness #nowrists #noplanks",
  "channelTitle": "fitbymik",
  "channelDescription": "Hey! My name is Mikala, but you might know me as fitbymik! I am a fitness instructor, personal trainer, dancer and aerialist born and raised in Toronto Canada. I have a passion for health and fitness that lead me to a Bachelors Degree in Kinesiology, and over a decade of teaching in the fitness industry. Some of the class genres I have taught include Barre Fitness, Strength and Conditioning, Yoga, Pilates, Zumba, Aquafit, dance and gymnastics. I also have years of expertise with one-on-one personal training and fitness coaching. One of my favourite things about this industry is the ability to help others achieve their goals and feel their best!\n\nIn between teaching and learning, I spent many years performing as a dancer and aerialist with Norwegian Cruise Line. I also performed as an aerialist at Tokyo Disney Resort in Japan!\n\nI can’t wait to continue bringing more workouts and challenges to help YOU reach your fitness and flexibility goals!\n",
  "tags": [
    "fitbymik",
    "at home workout",
    "follow along workouts",
    "talking workout",
    "standing workout",
    "standing dumbbell workout",
    "dumbbell workout",
    "medium dumbbells",
    "10lb dumbbells",
    "10 pound dumbbell workout",
    "fun dumbbell workout",
    "dumbbell strength workout",
    "full body workout",
    "full body workout with dumbbells",
    "standing workout with dumbbells",
    "20 minute workout",
    "20 min workout",
    "wrist friendly",
    "no wrists",
    "no planks",
    "no pushups",
    "no burpees",
    "wrist friendly workout",
    "full body workout no pushups"
  ],
  "publishedAt": "2023-04-28T16:15:00Z",
  "duration": 1384,
  "durationFormatted": "23:04",
  "viewCount": 950183,
  "likeCount": 22459,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Gtr7-Eiirg0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Gtr7-Eiirg0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Gtr7-Eiirg0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Gtr7-Eiirg0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Gtr7-Eiirg0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Gtr7-Eiirg0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Did this workout for the first time and 20 mins just flew by!",
    "I&#39;ve been doing your work outs for about a month ish, try to do a minimum of 3 per week most weeks I manage 5, I mix it up but I have my favorites. This past week I&#39;ve noticed I&#39;ve got some definition in my biceps and triceps for the first time in my life. Even my husband noticed it without me pointing it out.  I love the simplicity of the moves whilst also feeling how well they&#39;re working each muscle. I dont find I&#39;m having to force myself to work out like I have in the past. Thanks for creating amazing content ❤",
    "Damn y’all dk how much she makes my day whenever she posts a new video 😂❤ Her workout videos are honestly one of the few that I don’t dread and can make myself do even on mentally tough days because they’re easy to follow and not overly complicated but still challenging nonetheless.",
    "more standing full body would be great. Love your workouts!",
    "Loving the workouts. Love the fact they’re standing too. Keep up the great work x"
  ],
  "channelSubscriberCount": 897000,
  "channelVideoCount": 290
}