{
  "video_id": "Gu-zC_1fhyg",
  "title": "15 min Full Body Stretch | Daily Routine for Flexibility & Relaxation",
  "description": "Welcome to your 2022 flexibility challenge! This relaxing 15 minute full body stretching routine will help you get flexible whether you're a beginner, intermediate or advanced. Feel free to implement this stretch into your daily routine for best results.\n\nDo this warm up first: https://www.youtube.com/watch?v=BSh4zJHVxs0\n\n2022 Workout & Fitness Challenge: https://www.youtube.com/watch?v=rDxPfQEKBHw\n\nUp for the 21 day challenge? You can share your results with #annamcnultychallenge on Instagram, TikTok or YouTube Shorts for the chance to be featured at the end of one of my videos! \n\nShop my products ( yoga mats, stretch bands & more ) on http://annamcnulty.com\n\nShop Gymshark: http://gym.sh/Shop-Anna-McNulty2\n\nInstagram: annaemcnulty\nTikTok: annamcnulty\nShorts YouTube channel: @AnnaMcNultyShorts  \n\n0:00 stretch challenge\n0:43 full body stretches\n5:27 back stretches\n8:52 leg stretches\n\n#flexibility #stretch\n\nBusiness Inquires: annam@dulcedo.com",
  "channelTitle": "Anna McNulty",
  "channelDescription": "Self taught contortionist 💕",
  "tags": [
    "full body stretch",
    "stretches for flexibility",
    "how to get flexible",
    "how to get flexible legs",
    "beginner",
    "intermediate",
    "advanced",
    "anna mcnulty",
    "stretching routine",
    "workout",
    "home workout",
    "back stretches",
    "leg stretches",
    "cool down",
    "relaxing",
    "relax",
    "relaxation",
    "flexibility",
    "mobility",
    "stretching",
    "daily",
    "15 min",
    "15 minutes",
    "yoga"
  ],
  "publishedAt": "2022-01-08T14:00:10Z",
  "duration": 920,
  "durationFormatted": "15:20",
  "viewCount": 3938501,
  "likeCount": 50743,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Gu-zC_1fhyg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Gu-zC_1fhyg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Gu-zC_1fhyg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Gu-zC_1fhyg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Gu-zC_1fhyg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Gu-zC_1fhyg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Let’s all get flexible in 2022! You in? 💕",
    "I&#39;ve been doing the &#39;flexible legs fast video&#39; on and of for  quite a while. Also doing stretches throughout the years. I&#39;ve wanted to do contortion but always gave up, and what doesn&#39;t help is when you find a video for example &#39;get flexible in a day&#39; and try it because it doesnt work and it makes you loose the motivation. Once I found your stretching challenges it has been so much better, and you are completely honest about how long it takes. Not trying to get more views using clickbate. It is so helpful to find a truthful and helpful channel and it has truly helped so many people in what they want to achieve. This year 2022 I decided that I will become more flexible and get my right splits. I&#39;m currently on my 4th day of the &#39;flexible legs fast&#39; video and have almost achieved my full split. Afterwards, I would like to work towards my over split or back flexibility (as it is very poor and is great for contortion and tricks) and I  will be sticking with this channel. I was quite flexible when starting as of what I said earlier so dont feel discouraged if you dont achieve it so quickly. But it is possible and the only way to achieve it is not giving up. You just have to have the right mindset and cant set too high standards for yourself. Good luck on 2022 &lt;33",
    "Hi Anna! My flexibility score it&#39;s currently at 0.... I&#39;m the least flexible girl in my class, and I&#39;m not into sports. I&#39;m trying all of your beginner friendly flexibility routines and workouts and I hope I get flexible like you one day! You are very good at it! Keep up the wonderful work!",
    "I&#39;m 30 years old and been doing yoga daily for over a year now. Before then, I didn&#39;t realize just HOW IMPORTANT IT IS TO STRETCH! I started incorporating this routine 2 weeks ago and my flexibility has already improved so much. I&#39;ve begun practicing arm balances and the extra bit of stretching has really improved my crow pose. I&#39;ve never been able to do a split in my life, but it&#39;s a goal of mine this year. Thank you so much for helping us all get flexible (for free!!)",
    "Hey Anna I been doing your stretches for a while now and it has really helped me alot I am 23 and have always been very inflexible but your videos changed that ,now I can do backbends front and middle splits. Right now I hope to achieve over splits so please make a video on that and keep up the good work"
  ],
  "channelSubscriberCount": 10700000,
  "channelVideoCount": 421
}