{
  "video_id": "GViX8riaHX4",
  "title": "30 Min FULL BODY DUMBBELL WORKOUT at Home | Muscle Building",
  "description": "This is a follow along 30 minute full body dumbbell workout that will target every muscle group with compound movement to help you become stronger, build lean muscle, burn energy for hours after completing and basically leave you feeling awesome!! \n\nThe exercises are performed for 30 seconds each, 30 seconds rest. The exercises are performed for 3 sets each. \n\nThe weight I am using is 15kg x 2 dumbbells for your reference. So yes, as heavy as you have access to and slow paced, controlled and full range of motion. If you have lighter weights than you would prefer, simply perform more reps than me and at a slightly faster pace. \n\nHIGH SQUATS\nSUMO DEADLIFT SQUAT\nSTATIC LUNGE (switch leg everytime)\nROMANIAN DEADLIFT\nSHOULDER PRESS (2 or 1 dumbbells)\nBENT OVER ROW (switch arm everytime)\nCHEST PRESS \nPULLOVER\n\nI would just like to point out the following key points to this workout:\n\n● Be sure to switch leg on lunges every set and switch arm on rows every set!\n\n● With the single arm rows, try to stretch upper middle back by taking it slow at bottom to let muscles lengthen then draw elbow up. Switch arm every set!\n\n● I am performing the shoulder press with one dumbbell as well as Sumo deadlift, however if your weights are lighter than you wish, simply perform with both dumbbells!\n\n● Make sure during Romanian deadlifts to keep shoulder blades together, knees slightly bent, push bum back and keep head in line with torso as it lowers!\n\nI hope you all enjoy this strength training and really allow yourself to feel each contraction! \n\nI would consider this strength workout a super workout to progress in weight over time! I would definitely suggest this type of full body workout with dumbbells once a week if you really are wanting to increase muscle, along with bodyweight sessions and isolation sessions as such shoulders, glutes etc. Overtime, aiming to increase reps then move up in weights!💪\n\nAnd don’t forget.. plank 2 minutes at the end!!🤩\n\nHappy training!! \n\nCx\n\nMy FREE 10 Week EPIC Program\n\n▶ Day 1 of my 10 Week EPIC Program: https://youtu.be/c_-v1fYJGO8\n▶ Download The EPIC Program Guide and Schedule: https://carolinegirvan.com\n▶ EPIC Program Playlist (Intermediate / Advanced): https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\n▶ EPIC Beginner Series: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\n▶ My 5 Min Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n\nThe Equipment I Use from Amazon\n\n▶ Amazon UK: https://amazon.co.uk/shop/carolinegirvan\n▶ Amazon US: https://amazon.com/shop/carolinegirvan\n\nNever Miss a Video or Community Update\n\n▶ Subscribe to my YouTube Fitness Channel for FREE: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nMy Social Channels\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Facebook: https://facebook.com/carolinegirvanfitness\n▶ Twitter: https://twitter.com/carolinegirvan\n\n▶ Business Enquires: info@carolinegirvan.com\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "dumbbell workout",
    "full body workout",
    "dumbbell full body workout",
    "workout with weights",
    "full body dumbbell workout",
    "dumbbell workout at home",
    "home dumbbell workout",
    "at home dumbbell workout",
    "full body workout at home",
    "dumbbell workout for women",
    "strength training",
    "strength workout",
    "full body workout with dumbbells",
    "dumbell workout",
    "full body dumbbell workout at home",
    "dumbbell home workout",
    "30 minute workout",
    "full body",
    "muscle building",
    "muscle"
  ],
  "publishedAt": "2020-08-03T12:21:05Z",
  "duration": 2188,
  "durationFormatted": "36:28",
  "viewCount": 13611982,
  "likeCount": 217412,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/GViX8riaHX4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/GViX8riaHX4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/GViX8riaHX4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/GViX8riaHX4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/GViX8riaHX4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/GViX8riaHX4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "One of my favorite videos, been doing this one and then the 15 mins arms video for a month and a half and Ive lost 15lbs!",
    "3 days in a row of Ms Caroline for my wife and I. We’ve been doing lots of Beach Body and we just found Caroline. Folks...this is better. Nobody yelling at you. Nobody trying to tell you to give it more effort. Nobody making the fat girl in the corner do the dumb-down version. No breaks that are too short. No hyperactive moves. We just did this full body and guess what?  I have a full body burn. Yes - the body needs change doesn’t it. Sometimes the mind does too. Right now this is good on many levels. Caroline gives this away. She’s like AthleanX Jeff Cavalier - they just care about you and want you to get a good workout with them. Thanks again Ms Caroline. You are very helpful!",
    "I’m seventy-two years old and have been doing this routine 6 times a week for the past 5 weeks to offset the loss of muscle mass due to hormone therapy for prostate cancer. Started barely able to plank for 30 seconds and now more or less breeze through the 2 minutes. Started with 14.4 pound dumbbells, moved up to 16.5, and today did the routine with 19 pound dumbbells. THANKS, CAROLINE! <br><br>Update, 07/29/2024:  Still following Caroline’s routine with 19 pound dumbbells. Just finished 28 sessions of radiation, which was a bear, but I’m still standing. Hoping to add a little more weight to the dumbbells soon and settle into a 4 times a week routine!<br><br>Update, 10/30/2024:  Still following Caroline’s routine... now using 24 pound dumbbells 3 or 4 times a week! Just had my blood test and PSA registered at zero, which means at least for now, the prostate cancer is asleep and/or dying, with the help of hormone therapy. Wish me luck!<br><br>Update, 03/24/2025:  Still following Caroline’s routine with 24 pound dumbbells, 3  times a week. Plus the 2 minute plank! I’d like to get to 33 pound dumbbells,  matching Caroline, but I’ve got a ways to go. She’s amazing! My most recent PSA test still registered zero,  so all good. I’m kicking the poop out of cancer, at least for  now, on the one year. anniversary of my diagnosis. Best wishes to all!!!",
    "I love how clear your instructions are without speaking!  I get so tired of being yelled at during my online video classes.  Thank you!",
    "Four days back when I started doing this workout I could last 45 seconds in the plank challenge. I could double it to 90 today. Thanks Caroline !"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}