{
  "video_id": "gVO_Zre2Tbg",
  "title": "10 MinUte Tone Your ARM Workout With WEIGHTS | Biceps, Triceps, Shoulders",
  "description": "10 minute arm workout with dumbbell weights to target triceps/batwings, shoulders and biceps. Your arms will burn with this fabulous50s arm workout with weights. Choose a dumbbell weight-that challenges you so yo gain the maximum benefit. Suitable workout for beginners and seniors #getfit #armworkout #armworkout \n\n✅Link for Dumbbell Set... https://amzn.to/3m2Uscf\n\n✅Click here and sign up for the NEW YOU 14 Day Challenge...https://challenges.fabulous50s.online/weight-loss\n\n❤️💪 \n✅PLEASE SUBSCRIBE FOR MORE FREE VIDEOS 🙌\n☞ https://www.youtube.com/c/fabulous50s?sub_confirmation=1\n\n🦋TAKE THE 30-DAY MINDFULNESS CHALLENGE\nhttps://challenges.fabulous50s.online/mindfulness\n\nWelcome to fabulous50s! Join millions of women just like you, taking their heath, lifestyle, and vitality into their own hands!\n\nBy joining us, you will have free access to workouts created for women over 50, that are challenging but do-able (with consideration and plans for the absolute beginner too) plus awesome tips on beauty, fashion and lifestyle over 50. \n\nIf you are just getting started here, again welcome 🤗 Below you will find a list of videos you can watch to get you started, plus a direct link to my website and socials for even more free stuff 🙌\nIf you have something in particular you are looking for, just type the key words into the search bar and choose one of the videos.\n\n🤗 LET’S BE FRIENDS ❤️ \n\n🟢 WEBSITE: https://fabulous50s.com\n\n🟣 INSTAGRAM: https://www.instagram.com/fabulous.50s/ \n\n🟡 FACEBOOK: https://www.facebook.com/fabulous50ss/\n\n🔵PRIVATE FACEBOOK GROUP: https://www.facebook.com/groups/29024\n\n🟠PINTEREST: https://www.pinterest.com.au/SchelleaF/\n\n✅ 30 MINUTE INDOOR WALKING WORKOUTs\n\n30 Minute GET FIT Indoor Walking Workout For Women Over 50! https://youtu.be/kp67VFhbpsQ \n30 Minute FAT BURNING Walking Workout | Get Fit LOSE WEIGHT Low Impact! https://youtu.be/g8Bc1TA6pbM \n30 Minute 5000 STEPS Indoor Walking Workout For Women Over 50! https://www.youtube.com/watch?v=DhwJaDkgFkk&ab_channel=fabulous50s\n \n🔷 JOIN THE 14 DAY CHALLENGE:\nhttps://www.youtube.com/watch?v=8sUFKRzP9Uc&ab_channel=fabulous50s\n\n ▶️ SHARE FABULOUS50S WITH SOMEONE YOU CARE ABOUT: \n https://www.youtube.com/c/fabulous50s/?sub_confirmation=1\n\n **Disclaimer: Information provided in this video is of a general nature only and is for entertainment/educational purposes. We strongly recommend that you consult with your physician before beginning any exercise program. Performing any of these exercises is done so at your own risk.\n#fabulous50s #getfit #armworkout #armworkout#14daychallenge \n\n💌EMAIL ALL ENQUIRIES TO:pr@fabulous50s.com \n📧MAIL: Po Box 12239 Clunes, NSW 2480 Australia 2480\n#fabulous50s #armworkout #beginnerworkout",
  "channelTitle": "fabulous50s",
  "channelDescription": "Hi, I'm Schellea (Shelly), the founder and CEO of Fabulous50s. At 58, I live in Australia, and it brings me immense joy to help women over 50 feel confident, vibrant, and empowered. My passion is to inspire them to embrace who they are and look forward with excitement to the future.\"\n\nWith 40 years of experience as a small business entrepreneur, my journey has encompassed a wide range of fields, including creative design, health, fitness, fashion, and beauty. I am a certified fitness instructor and Neuroathletics coach, specializing in exercise and brain health for older adults. My focus is on helping women maintain vitality, creativity, longevity, and mental sharpness as they age.\n\nI am also a certified life and business coach, meditation and mindset coach, personal stylist, and color consultant. My mission is to help women over 50 thrive in every aspect of their lives, empowering them to live with confidence, purpose, and joy.\n\nI'm here to guide and support you on your journey. xx\n",
  "tags": [
    "fabulous50s",
    "Schellea Fowler",
    "arm workout for women",
    "fabulous 50s",
    "toned arms",
    "arm workout",
    "workout for women over 50",
    "fabulous 50s arm exercises",
    "bat wings workout for women",
    "home workout",
    "fitness over 50 women",
    "toned arms workout",
    "arm exercises for women",
    "fabulous 50s arms",
    "bat wings",
    "arms workout",
    "fabulous50s exercises",
    "arms workout for women",
    "fabulous 50s arm exercises with weights",
    "upper body workout",
    "best exercise for women over 50",
    "arm workout with dumbbells"
  ],
  "publishedAt": "2023-04-04T11:00:33Z",
  "duration": 686,
  "durationFormatted": "11:26",
  "viewCount": 1551162,
  "likeCount": 27270,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/gVO_Zre2Tbg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/gVO_Zre2Tbg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/gVO_Zre2Tbg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/gVO_Zre2Tbg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/gVO_Zre2Tbg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/gVO_Zre2Tbg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Love this workout…arms are burning....also love your little fur baby",
    "I’m 52 and this is the BEST arm workout I’ve ever found for my flabby arms. It is only 10 min and burn my arms in just right extent afterwards. I’ve been doing this right before bedtime daily for only a week and my arms are CHANGING! Thank you and more of this please!!",
    "This is my favorite arm workout because I really feel the burn.   I feel like I&#39;ve accomplished something, and it only takes 10 minutes!  Thank you for this!  By the way, I&#39;m almost 73. 😊",
    "Just completed the 10 minute workout with dumbbells.  Loved it.  I am 67 years old, have bat wings bad because I have lost 48 pounds.  Hoping this will help me.  Love your videos.  Thanks",
    "I have been doing this exercise for 2 months now I am able to do 2 rounds instead of 1! Thank you I love this exercise! My arms are starting to get definition ❤"
  ],
  "channelSubscriberCount": 1980000,
  "channelVideoCount": 722
}