{
  "video_id": "hb8sJOC5aEQ",
  "title": "20 minutes of FAT BURNING FUN! | Intense Indoor Cycling Workout",
  "description": "20 minutes is all you need to get closer to your goals, get an amazing workout, and improve your overall health! This cycling workout includes intense climbs, sprints, and jogs for a seriously awesome burn! Get ready to have FUN and reach your goals! Let's do this!\n\nIMPORTANT! The RPMs noted throughout the ride are just a range! Make sure to ride where you feel comfortable! That may be above or below the range indicated. \n\n🇮🇸 We're hosting a trip to ICELAND in JUNE 2024! Reserve your spot here! 👉 https://www.trovatrip.com/trip/europe/iceland/iceland-with-kaleigh-cohen-jun-2024\nCheck out what's included and the itinerary above! 👆\nSpots are limited | ONLY 15 SPOTS AVAILABLE! The first 10 people to sign up get an early bird rate and SAVE $100! Payment plan options are available! \n\nNeed a longer WARM-UP?  https://youtu.be/tOjKOmtPcqs\n\nMY LINKS:\nLooking for indoor cycling shoes?- https://ride.shimano.com/KCF15\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nSpotify playlist- https://spoti.fi/3KBayDE\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\nADD IT:\nENCORE!- https://youtu.be/CSJm2ThlAOc\nDESSERT!- https://youtu.be/eumN5TrtnzI\n\nRESISTANCE for my classes\nYou always want to feel something under your feet, this will ensure you are doing the work, prevent you from bouncing in the saddle, and protect your knees!\n6 - Working your way up that hill | Moderately Light \n7 - Mid-hill already, you can definitely feel this! | Medium\n8 -  This is where heavy really starts to kick in | Moderately Heavy\n9 - We are really starting to climb now! This is a challenging resistance! | Heavy\n10 - Top of your hill! You should be able to keep a smooth pedal stroke. | VERY Heavy\nWatch this for more detail: https://youtu.be/8DbpBXGAB8Q\n\nMODIFICATIONS for seated options\n2nd position jogs and moves: Stay seated and increase speed a bit, really focus on the pull-up to activate the quadriceps.\n3rd position climbs and moves: Stay in the saddle and increase resistance a smidge, really focus on the push-down and pull-up of the pedal stroke to activate the glutes, hamstrings, and quadriceps maximizing power with the heavy resistance.\n\nCHAPTERS:\n0:00 - 2:40 WARM UP | Down by Ruby Neon\n2:41 - 5:59 LEAPS | Ready for It by CRMNL\n6:00 - 8:30 INVERTED SPRINTS | All Starts Now by Laurell\n8:31 - 10:55 CLIMBS | Ain't Seen Nothin' by Paper Kings\n10:56 - 14:07 FREEZES | Impossible (Orchestral Remix) by Blackway\n14:08 - 19:04 ROLLING HILLS | Embers by KillWill\n19:05 - 20:34 COOL DOWN | Something's Coming by Mega Rev\n\n\nSome of the links listed above are affiliate links, such as Amazon, and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for the harm, damage, or injury as a result of any information provided.\n\n\nMB01EVNHQKXCVFP",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [],
  "publishedAt": "2023-09-25T08:59:56Z",
  "duration": 1235,
  "durationFormatted": "20:35",
  "viewCount": 65200,
  "likeCount": 2014,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/hb8sJOC5aEQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/hb8sJOC5aEQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/hb8sJOC5aEQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/hb8sJOC5aEQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/hb8sJOC5aEQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/hb8sJOC5aEQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I did not want to press play on this rainy dark Monday morning… so glad I did!  💪 Thank you",
    "Never underestimate a 20 minute ride. A real burner. Impossible to not sing along with you.",
    "Week 1 - FFTH - Day 3 - Done. These lower time limit rides are helping immensely. Just enough to keep the body moving. Thank you Kaleigh! Thank you Jason!🏁WINNING🏁⚡️🔥⚡️🔥⚡️🔥⚡️",
    "What an amazing workout! I’m drenched in sweat!",
    "Week 4 - INCREDIBLE - Day 22 - Done. That cameo and intro effect was straight fire! Motivation on set! Amazing ride session today Kaleigh, thank you! Thank you Jason! Effects are always popping!🏁WINNING🏁⚡🔥⚡🔥⚡🔥⚡"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}