{
  "video_id": "HcHCMG4azzs",
  "title": "Standing Cardio Workout | No Jumping | Includes Warm Up and Cool Down Stretch | 30 Minutes",
  "description": "Standing Cardio Workout | No Jumping | Includes Warm Up and Cool Down Stretch | 30 Minutes\n\nJoin me for a 30 minute standing pilates cardio workout. This will help you lose weight, gain muscle tone and improve your cardiovascular health.  Safe for the joints as no jumping, this session is a fun workout targeting the whole body to boost your metabolism and give you a really good full body pilates workout. It will be a challenge so be prepared to get a little sweaty! \n\nDo check out my other high energy workouts here: \n\n30 Minute Standing Cardio Pilates + Abs https://youtu.be/HauHdwahJvM\n\n15 Minute Standing Pilates for Strong Legs https://youtu.be/gX23jrqY_nk\n\n14 Minute Standing Pilates and Barre Workout: https://youtu.be/PWbRI5PqV2I\n\nThis is a new 'exercise only' edit of a previous livestream. If you want to see the full version including the live chat click here: https://youtube.com/live/X-__VHomEC4\n\nPlease click the Like button and Subscribe to the channel to help me make more films just for you. \n\nMuch love,\nRachel ❤️ \n#girlwiththepilatesmat #cardioworkoutathome #standingcardio \n\nIf you enjoyed this video, feel free to buy me a coffee to show your support: https://ko-fi.com/thegirlwiththepilatesmat\n\nI am currently featured in the Stay in, Work out campaign with Sport England here:\nhttps://www.sportengland.org/jointhemovement#get_active_at_home\n\nIf you'd like to join my live online classes via Zoom, pop to my website for details;\nhttp://www.rachellawrencepilates.com\n\nWant to keep in touch? Come join me on my other social channels:\nhttps://facebook.com/RachelLawrencePilates\nhttp://www.instagram.com/thegirlwiththepilatesmat\nhttp://twitter.com/rachel_pilates\n\nDisclaimer: It is recommended that you consult your Doctor or Healthcare Professional before starting any exercise programme. If you experience any pain or discomfort during this workout you should stop immediately and if necessary seek medical attention. When participating in any exercise or exercise programme, you agree that you do so at your own risk and assume all risk of injury to yourself. By using this video you understand and agree that Rachel Lawrence- The Girl with the Pilates Mat- will not be held responsible or liable for any injury or loss you may suffer as a result of undertaking the workout.\n\n\nStanding Pilates Cardio Workout | Burn fat and tone muscles| 30 minutes,30 minute standing fat burning exercise,30 minute standing cardio workout,full body workout at home,pilates for weight loss at home,standing pilates workout,standing cardio workout no jumping,standing cardio workout at home,standing cardio and strength workout,home workout for women over 40,girl with the pilates mat cardio workout,low impact cardio workout,pilates for weight loss,standing pilates cardio",
  "channelTitle": "The Girl With The Pilates Mat",
  "channelDescription": "Welcome to My Channel!\n\nI'm Rachel—a Certified Pilates Instructor with 25 years of Pilates practice and a background as a Professional Dancer. I'm passionate about ageing gracefully through Pilates and believe everyone deserves to feel good in mind and body, no matter their age or stage in life.\n\nOn this channel, you'll find Pilates and Dance-based fitness for all abilities and ages, from Beginners to Advanced Levels. Our focus is on nurturing a healthy mind, body, and spirit in a supportive, positive, and kind community.\n\nI also share health and wellbeing tips during livestream chats and classes, where my beloved rescue dog often makes an appearance! Originally from London, I now enjoy life in Brighton on the beautiful South Coast of England.\n\nSubscribe today and join our warm, welcoming community of wellbeing enthusiasts from around the world.\n\nMy book: The Little Book of Pilates is available now.\nTo Order UK: https://amzn.to/3WvZ074\nTo Order US/Worldwide: https://amzn.to/3XqD4LT\n",
  "tags": [
    "30 minute standing fat burning exercise",
    "30 minute standing cardio workout",
    "full body workout at home",
    "pilates for weight loss at home",
    "standing pilates workout",
    "standing cardio workout no jumping",
    "standing cardio workout at home",
    "standing cardio and strength workout",
    "low impact cardio workout",
    "pilates for weight loss",
    "cardio workout",
    "weight loss workout for women",
    "standing cardio no jumping",
    "standing cardio abs",
    "girl with the pilates mat standing cardio workout",
    "cardio"
  ],
  "publishedAt": "2025-02-05T07:30:06Z",
  "duration": 2000,
  "durationFormatted": "33:20",
  "viewCount": 11998,
  "likeCount": 854,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/HcHCMG4azzs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/HcHCMG4azzs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/HcHCMG4azzs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/HcHCMG4azzs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/HcHCMG4azzs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/HcHCMG4azzs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Fantastic video. I used to have such negative feelings towards exercise because of being bullied at school in particular in PE classes it put me off for a long time. After finding you I feel like I can get back into it it feels like a safe space for me with no judgements only encouragement and a smile . Thanks Rachael for doing this we all appreciate it ❤",
    "Wow so much packed into half an hour loved it Rachel thanks so much x",
    "A very good cardio workout workou. Thanks Rachel.",
    "Great to do a cardio class again Rachel, thank you so much, kind regards B",
    "Your classes are now part of my morning routine"
  ],
  "channelSubscriberCount": 302000,
  "channelVideoCount": 793
}