{
  "video_id": "Hhw7z3koeHs",
  "title": "15 MIN TABATA AB Workout - No Repeat Exercises, Tabata Cardio Style, Low Impact",
  "description": "NEW Tabata Workout! Are you ready for a 15 MIN Tabata Ab Burner? Super fun + super effective! All you need is 15 minutes and your mat 💪🏼 Let's strengthen our core muscles together team! Don't stop when you feel your core shake... embrace the burn! Let's do it! 🔥\n\n▸ Muscles Worked: Total Core Burner\n▸ Time: 15 Min\n▸ Equipment: No Equipment\n\n▸ Instructions: Follow along and complete as many reps as possible in 20 Seconds. After 10 Seconds of Rest continue to the next move.\n\n▸ The Workout:\n1. Tabata Workout 0:00 - 13:05\n2. Cool Down 13:13 - 16:24\n\nPlease remember that we are all different and that you can make this your own workout ♡ Take a longer break when you need to.\n\n♡ Join the OFFICIAL TEAM GROW Community Group: www.facebook.com/groups/teamgrowsupport/\n\n♡ Workout Challenges & Guides: http://growingannanas.com\n\n\n\n\n\n♡  The Gear I Use: \nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n♡ SUBSCRIBE: http://bit.ly/2QLvpXn\n♡ Instagram: http://bit.ly/2ZSdHFR\n♡ Facebook: http://bit.ly/2SVkgpE\n\n♡ My Music: https://www.epidemicsound.com\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "15 MIN TABATA AB Workout",
    "no repeat workout",
    "ab burner workout",
    "15 min ab workout",
    "15 min core workout",
    "abs workout",
    "abs workout at home",
    "home workout",
    "no equipment workout",
    "tabata workout",
    "no talking workout",
    "body weight workout",
    "abs core",
    "workout with music",
    "growingannanas",
    "tabata style workout",
    "tabata growingannanas",
    "at home workout",
    "tabata training",
    "6 pack workout",
    "how to get a sixpack",
    "low impact workout",
    "sixpack workout",
    "workout of the day",
    "core strength"
  ],
  "publishedAt": "2021-05-19T04:00:15Z",
  "duration": 984,
  "durationFormatted": "16:24",
  "viewCount": 2042086,
  "likeCount": 32454,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Hhw7z3koeHs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Hhw7z3koeHs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Hhw7z3koeHs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Hhw7z3koeHs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Hhw7z3koeHs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Hhw7z3koeHs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Who&#39;s in love with Tabata-style workouts like me?? Please leave me a comment below if you&#39;re a fan 🤗💜Big love Team Grow!! Anna x",
    "Have just started home workouts less than a week ago and after searched for several famous female fitness YouTubers I think you are the best out of them. Good music and clean background, no talking and your body shape inspires me to do your workouts.",
    "I discovered your channel with your 4 min tabata workout on survivor song. Back then I used to take breaks during the four minute workout and now I&#39;m able to do your 12  and 15 min ones without any break. I&#39;m completely in your debt for bringing me this far in my fitness journey. Love you Anna.",
    "TABATA AND ABS????? THIS IS GONNA BE SO GOOD!! THANK YOU ANNA, I LOVE YORU WORKOUTSS!!<br>To whoever is reading this, you got this! Let&#39;s get through this and feel accomplished after! We are strong!! 💪💪",
    "Thank you so much, I am gonna be the most fittest 60 year woman, when I do all your workouts everyday. Love your work!"
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}