{
  "video_id": "HLdcBgl35u4",
  "title": "15 Minute Senior Strength Workout",
  "description": "Pick up your weights and challenge yourself with these senior muscle strengthening exercises to ward off atrophy and osteoporosis. \n\n--Find more FREE workout videos on my website: https://bit.ly/2qIYZ71\n--Download my list of afternoon ENERGY BOOSTERS: https://bit.ly/2RhXebq\n--Order my FULL BODY Tone & Firm DVD: https://amzn.to/2YSdZKT",
  "channelTitle": "Fitness With Cindy",
  "channelDescription": "Senior workouts, over 50 fitness and wellness tips from Fitness With Cindy. Increase your energy, decrease your pain and improve your health inside and out so you can live life feeling good!",
  "tags": [
    "senior muscle strength",
    "weight training for seniors",
    "muscle strength for seniors",
    "dumbbell exercises for seniors",
    "exercises for osteoporosis"
  ],
  "publishedAt": "2020-04-16T12:44:10Z",
  "duration": 1125,
  "durationFormatted": "18:45",
  "viewCount": 736016,
  "likeCount": 7672,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/HLdcBgl35u4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/HLdcBgl35u4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/HLdcBgl35u4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/HLdcBgl35u4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/HLdcBgl35u4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/HLdcBgl35u4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Cindy, I have 74 years old. have done these exercises for quite a while and my body is changed. Thank you very much. 👋👋👋🥰🥰🥰",
    "I have just had a short break away I felt I needed it. I went to the Isle of Man as I had lived there many years ago and my late husband and I had had a couple of lovely holidays there.  I was apprehensive as how far I could walk but after my walking having improved so much with your various exercises, and I treated myself to a walking stick/seat, I thought I could manage.  One of the other ladies in our group I buddied up with had a step watch/counter.  The second day she made a point of checking for me and I did 10,000 steps.  I only sat down unofficially twice.  Once having walked up a bit of a steep hill with a not very stable surface.  In fact another couple waited for me half way up as they were worried about me but I made it just in time to collapse onto my seat haha.  This was much down to all your exercises really so thank you Cindy.  I had a lovely holiday and can definitely walk much further than I thought, maybe not quite 10,000 steps every day though, yet.  I did these strength exercises just now as haven&#39;t done any while away.  Sorry I have rambled on rather much 🙂",
    "I like your workouts because you get to point, no long discussions and have a variety to choose from - thank you,",
    "I did your workout today.  I think your strength workout is awesome.  You worked all of the muscles in my 80 year old body.  Plan to do this workout 3 times a week.  Very easy to follow your video.",
    "Cindy, I have been doing the 15 minute senior muscle strength video with you almost every day for 9 months now and I feel great! I look better too, thank you so much for sharing your workouts!"
  ],
  "channelSubscriberCount": 88000,
  "channelVideoCount": 226
}