{
  "video_id": "hNCqIgl7Pjc",
  "title": "10 Minute Stretching - FULL BODY -Stress Relief & Recovery",
  "description": "#stretching #mrandmrsmuscle #postworkoutstretch #musclerecovery #yoga\n\nHi Guys, \n\nHere is a Full Body Stretch to get you right after one of our intense workouts at home or at the gym. \nI have included a combination of stretches that I find highly effective to do post workout or simply to use on an active recovery day. \n---\nMuscle tightness can occur Post Workout or build up over time so I recommend doing Full Body stretches to help relieve that overall tightness in the body. \n\nTips:- \n1) Inhale Deeply Through your Nose as much as you can.(even breathing alone can help to relax you). \n2) Exhale though your mouth expelling as much oxygen as possible before inhaling again.\n3) Engage your core at all times and squeeze your Glutes it will help to improve your posture. \n4) Smile inside out & allow that feeling to radiate through you & heal you.\n5) (Optional) Try lying flat on your back at the end of the stretch. Breath in & out deeply as described in tips 1 & 2 and hold for 60s or as long as you need to complete your stretch and fully relax. \n---\nTake this time to really connect with your body, listen to its cues and move around in the stretches gently hitting your muscles from different angles to allow you to experience  a more efficient and satisfying stretch.\n---\nIf you are looking for some guidance in your fitness journey Check out our website :\n\nhttps://www.mrandmrsmuscle.com\n---\nAlso Follow Us on Instagram for More Workouts, Tips & Motivation: @mrandmrsmuscle .\n---\nEnjoy \n---\nLots of Love \nViv",
  "channelTitle": "MrandMrsMuscle",
  "channelDescription": "☆Why use MrandMrsMuscle Workouts?\nWe use scientifically proven micro workouts combined with HIIT to bring you extremely effective short workouts that burn fat, build muscle, increase your strength and develop your functional fitness.\n\nThe MrandMrsMuscle training style is suited to those who need time efficient workouts that are easy-to-follow and deliver real results in record time!\n\n☆How to get the BEST RESULTS with the MrandMrsMuscle Workouts?\nDownload our App! \nhttps://MrandMrsMuscle.com for more details\n\n☆Are MrandMrsMuscle Trainers Qualified?\nYes.\nViv Addo:\n- GCSE & A-Levels in Physical Education\n- BSc Hons Degree in Sports Science\n- AIQ Level 3 Diploma in Fitness Instruction and Personal Training\n\nMike Addo:\n- AIQ Level 3 Diploma in Fitness Instruction and Personal Training\n\nInvest in yourself and Subscribe.\n",
  "tags": [
    "fitness",
    "mrandmrsmuscle",
    "mr and mrs muscle",
    "mr and mrs muscle instagram",
    "weight loss workouts",
    "fat loss workouts",
    "home workouts",
    "stretch",
    "yoga",
    "fullbodystretch",
    "musclerecovery",
    "activerecovery",
    "well being",
    "wellness",
    "stretching at home",
    "stretchatthegym"
  ],
  "publishedAt": "2019-09-01T09:30:02Z",
  "duration": 674,
  "durationFormatted": "11:14",
  "viewCount": 3297343,
  "likeCount": 0,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/hNCqIgl7Pjc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/hNCqIgl7Pjc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/hNCqIgl7Pjc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/hNCqIgl7Pjc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/hNCqIgl7Pjc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/hNCqIgl7Pjc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is my 2nd time doing this and I just had to say that I love that you preview an exercise before you do it so I don&#39;t feel left behind or confused mid stretch. Maybe it&#39;s just me but I have had that problem with so many other videos so it is great that yours is the way it is",
    "I&#39;ve been going to this routine whenever I feel like I have been going through a stressful day or after work. Surprisingly, it&#39;s been helping me feel motivated, and it eases out any muscular pain I&#39;ve been having. I&#39;m glad I came across this video to help me get a move on of my day. Thank you for this gem!",
    "Amazing video! Love that there is no unnecessary talking and there&#39;s music playing with the beeps so you know when to switch stretches. Also nice that in between you can take rest and see what&#39;s coming! This will be part of my morning routine from now on 🥰",
    "out of all the after-workout stretch videos i&#39;ve tried THIS guided stretching was the only one to actually relax me after a workout and target all the muscles that needed to cool down! thank you!!",
    "Trying to make this a morning habit. Long neglected stretchs and yoga while weight training. Im so stiff some of these hurt but i hope after a few times i loosen up"
  ],
  "channelSubscriberCount": 1410000,
  "channelVideoCount": 1012
}