{
  "video_id": "HnEqUkVNmPU",
  "title": "Day 5 - Deepen  |  MOVE - A 30 Day Yoga Journey",
  "description": "When we take time to deepen the relationship with our subtle body and breath, we are creating a sense of wholeness, of feeling complete, more true. \n\nThis can then lead to us feeling more confident and more capable of loving ourselves. \n\nAnd that of course can have a beautiful ripple effect, a movement beyond ourselves. \n\nSo as we begin to add more vocabulary and depth through visualization and imagination remember, \n\nHow you move matters. \n\nVisit the community tab to read today’s full daily message + poem: \nhttps://www.youtube.com/c/yogawithadriene/community\n\n- - - - - - - - - - \n\n🖤 MOVE - Downloadable Collection 🤍\nhttps://ywa.co/MOVE\nBased on requests from the community, we are excited to announce a downloadable version of MOVE. It is offered on a donation basis, so just pay what feels good!\n\n- - - - - - - - - - \n\n🖤 WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! 🤍\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "30 day challenge",
    "30 day yoga challenge",
    "30 day yoga journey",
    "30 days of yoga",
    "30 days of yoga with adriene",
    "adriene mishler",
    "adriene mishler yoga",
    "at home yoga",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "home yoga",
    "home yoga practice",
    "morning yoga",
    "move 30 day yoga journey",
    "move yoga",
    "move yoga with adriene",
    "online yoga",
    "yoga at home",
    "yoga for weight loss",
    "yoga practice",
    "yoga with adriene",
    "yoga with adrienne",
    "30 days of yoga day 5"
  ],
  "publishedAt": "2022-01-06T10:00:11Z",
  "duration": 1679,
  "durationFormatted": "27:59",
  "viewCount": 2628221,
  "likeCount": 44976,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/HnEqUkVNmPU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/HnEqUkVNmPU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/HnEqUkVNmPU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/HnEqUkVNmPU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/HnEqUkVNmPU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/HnEqUkVNmPU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "What does it mean to deepen your practice?",
    "Something she said on day 2 that has stuck with me and really drives me to return every day: &quot;The brain will give up before the body does.&quot;",
    "When Adriene spots the cardinals, she shows us how little moments of observation of nature can be pure joy.",
    "&quot;Your choice in how to end the practice...&quot; Am I the only one who was like, &quot;Wait, what...?&quot; Lol <br>I feel like I was so enveloped in today&#39;s practice and that no time had passed at all.<br>Many thanks for such a beautiful flow today, Adriene. A true gift.<br>It&#39;s only been five days of practice for me, but I can already tell a difference in my movement on the mat - there&#39;s a new, but welcome, lightness and a gentleness that I hope I can find off the mat sometime soon, too.<br>Happy to be here w. you all &lt;3<br>xx Shel",
    "For anyone who&#39;s behind on the practice I just wanted to say, it&#39;s never too late. You can always choose to show up for yourself &lt;3 Thank you Adriene, Namaste."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}