{
  "video_id": "ho1ZeTCHdLU",
  "title": "BEST BEGINNER Tread Workout for 15 MINUTES",
  "description": "We are back after a week break and we missed you! Coming at you with the BEST Beginner 15 minute tread run on YouTube! Come get sweaty!\n\n15:00 minutes of run and recovery intervals\n\nAll speeds and inclines are suggestions. Please stay safe and within your comfort zone!\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCJumOlRn9C592ijW9sUC2Hg/join\n\nJoin our community of runners: http://www.ibxrunning.com\nMerch: https://www.ibxrunning.com/store\nIBX Instagram: https://www.instagram.com/ibxrunning/\nRachael's Instagram: https://www.instagram.com/bedopefitness/\n\n00:00 - Intro\n00:37 - Warm Up\n02:38 - Workout!\n13:05 - Cool Down\n\nSongs Used:\n1. Everytime I Fall - Hallman\n2. Like A Ricochet (Deek Cloud Remix) - Loving Caliber\n3. Runaway Girl - spring gang\n4. So Different - Rocco Vanwell\n5. Stormy Weather (Manta Circle Remix) - Middle And End\n\nWhat did you enjoy about this workout? What suggestions do you have? We would love to hear from you below 👇\n\nSUBSCRIBE to our Channel for more workouts!► https://www.youtube.com/c/IBXRunning/featured\n\nNote: All information provided by IBX Running is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold IBX Running harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.\n\n#ibxrunning #hiitworkout #treadmillworkout",
  "channelTitle": "IBX Running",
  "channelDescription": "We are a community that wants to improve ourselves through running. Whether that improvement comes in the form of bettering our health, becoming more disciplined, creating a more positive attitude, or simply decreasing our mile times, the IBX Running community is welcoming and constructive. IBX Running knows that runners come in all shapes, sizes, and skill levels, and endeavors to be a place where members of our community can feel comfortable to strive to be better than they were last week, last month, and last year.\n\nNewsletter: https://ibx-running.beehiiv.com/subscribe\nWebsite:  https://www.ibxrunning.com\nInstagram: https://www.instagram.com/ibxrunning/\n",
  "tags": [
    "treadmill workout",
    "15 min run",
    "indoor running cardio workout",
    "how to treadmill",
    "follow along running workout",
    "treadmill follow along workout",
    "calorie burn running workout",
    "free treadmill workout",
    "running treadmill workout for beginners",
    "fat loss treadmill workout",
    "beginner running workout",
    "treadmill follow along run",
    "coached treadmill run",
    "treadmill running routine",
    "15 minute hiit run",
    "15 minute follow along run",
    "15 minute treadmill run",
    "ibx running",
    "beginner hiit"
  ],
  "publishedAt": "2022-09-26T10:30:07Z",
  "duration": 950,
  "durationFormatted": "15:50",
  "viewCount": 37874,
  "likeCount": 906,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ho1ZeTCHdLU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ho1ZeTCHdLU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ho1ZeTCHdLU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ho1ZeTCHdLU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ho1ZeTCHdLU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ho1ZeTCHdLU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "My muscles were sore, but I really wanted to do some form of cardio after my strength workout. That’s when I found this 15-minute, beginner-friendly, moderate-to-low-intensity workout on your channel. I wasn’t in the mood to exercise, but your words motivated me to push through—and before I knew it, the 15 minutes were over! I’m so grateful for your content. I never thought I would try running, but because of your workouts, I’ve started incorporating short runs too. The way you coach makes it feel like you’re right there in front of me, guiding me. Keep up the amazing work!",
    "I absolutely love this video. I&#39;ve been doing it all week. I started getting really bored with long distance running on a treadmill and nothing could keep my attention or motivation. Doing interval running like this really helps me stay focused and I feel like I have a great workout in a lot less time!!!",
    "Coach Rachael, I think you&#39;re an amazing instructor. I haven&#39;t been active for at least the past 7 years and I wanted to change that. Of all the YouTube instructors I&#39;ve tried, you&#39;ve helped me stay focused the entire time. It&#39;s the second time I&#39;m doing your video this week and I&#39;m surprised how much easier it is. Looking forward to next time, thank you!",
    "I needed to build up to 1 hr a day for my health goal. Where we live now isn&#39;t the best place for outside running so we have a treadmill... I&#39;m sooooo glad I found these running videos! There&#39;s also so many to build on! Plus the positive encouragement that reminds you that you&#39;re headed in the right direction despite other voices :) THANK YOU!",
    "I love this workout as a beginner at running. I keep coming back to it"
  ],
  "channelSubscriberCount": 53700,
  "channelVideoCount": 403
}