{
  "video_id": "Ho9em79_0qg",
  "title": "Yoga For Hips & Lower Back Release  |  Yoga With Adriene",
  "description": "This Yoga With Adriene practice invites you to go inward, uniting breath and body to cultivate balance.\n\nInvite stability and welcome release.\n\nCome on everyone.\n\nSigh it out today!\n\nThis seemingly simple practice has depth.\n\nENJOY!\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for back pain",
    "yoga for lower back",
    "yoga for back",
    "yoga for good posture",
    "yoga for hip pain",
    "yoga",
    "yoga at home",
    "free yoga",
    "online yoga",
    "free yoga videos",
    "yoga with adriene",
    "online yoga class",
    "yoga for hips",
    "yoga for flexibility",
    "yoga for lower back pain",
    "yoga with adrienne",
    "yoga every damn day",
    "yoga for pain relief",
    "adriene mishler"
  ],
  "publishedAt": "2018-03-11T08:00:01Z",
  "duration": 1400,
  "durationFormatted": "23:20",
  "viewCount": 20829427,
  "likeCount": 193562,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Ho9em79_0qg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Ho9em79_0qg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Ho9em79_0qg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Ho9em79_0qg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Ho9em79_0qg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Ho9em79_0qg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Carve out the time, my friends! Let me know how your practice went in the comment section below! <br><br>&quot;And still, after all this time, <br>The sun never says to the earth, <br>&quot;You owe Me&quot;<br><br>Look what happens with<br>A love like that.<br>It lights the Whole Sky&quot;<br><br>-Hafiz",
    "Dear Adrienne,  My daughter did your videos every day for many years. We often did some together. She died suddenly from an undetected heart condition last year before her 26th birthday.  This year on her birthday I did Yoga for Vulnerability, and felt her close to me.  Thank you for the beautiful effect you had in her life.  I miss her every day.   Until I see her again.   Bless you in your gift to this hurting world.",
    "My chiropractor sent me this video to help with my chronic lower back pain. Just wanted to let you know; five years later, and you&#39;re still helping people. 💕",
    "This video taught me that in my old age, I have to take better care of my old body.<br><br>Then I remember I’m 26 and I shouldn’t be this tense. Thank you for your work, I didn’t know that’s what a loose lower back feels like.",
    "Was a heroin and meth user for a decade. Clean for 8 years now. The only thing my mum asks me when she calls now isn&#39;t &quot;are you safe?&quot; it&#39;s &quot;did you do yoga with Adriene today love?&quot; Thank you for the help and inspiration during a really difficult time."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}