{
  "video_id": "HszzIPCwbKY",
  "title": "Full Body Guided Workout | Session 1",
  "description": "Welcome to the MrandMrsMuscle guided training series, where I train you and we SWEAT together!\n\nI will be guiding you through each exercise and giving you form tips, cues and little reminders as we move. The pace is far from intimidating but intense enough to spark the change that your body needs!\n\nThis series has a full body focus and is designed to benefit all fitness levels. The workouts include modifications (where necessary) and are designed to increase your strength, sculpt your body and help you lose excess pounds in the process!\n\nThere will be 2 sessions released a week and 12 total classes in a season.\nALL CLASSES IN THIS SERIES will be released to the MrandMrsMuscle Mobile App users first alongside a wealth of exclusive workout content!\n\nYou should complete each workout 1-2x over a six week period before having a de-load week or a consecutive days off.\n\nThis will be a very exciting series that is going to fast help you achieve your fitness goals as well as keep you feeling confident & happy!\n\nShare this workout experience with family and friends so we can all get fit together!\n----\n\nInstall the MrandMrsMuscle iOS & Android Mobile App today!\n* Workout Challenges\n* Workout Calendars\n* Meal Plans\n* Workout Classes\n* Real-Time Workouts\n* Hundred's of HIIT Classes\n* Extensive Recovery & Rehabilitation Stretch Videos\n* + More content coming soon!!!!\n\nFull access 7-day free trial upon sign-up\nhttps://mrandmrsmuscle.com\n\n---\nShop My Outfit: https://gym.sh/muscle-home-YT\nShop My Supplements: https://womens.best/mrandmrsmuscle\nUSE CODE: MrMrsMuscle20\n---\n\n\nDisclaimer:\nMrandMrsMuscle strongly recommends that you consult your physician before starting any exercise or workout program.\nYou should be in good physical and mental condition and be able to participate in the exercises.\nYou should be aware and understand that when participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this workout, exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge MrandMrsMuscle from any and all claims or causes of action, known or unknown, arising out of MrandMrsMuscle's negligence.",
  "channelTitle": "MrandMrsMuscle",
  "channelDescription": "☆Why use MrandMrsMuscle Workouts?\nWe use scientifically proven micro workouts combined with HIIT to bring you extremely effective short workouts that burn fat, build muscle, increase your strength and develop your functional fitness.\n\nThe MrandMrsMuscle training style is suited to those who need time efficient workouts that are easy-to-follow and deliver real results in record time!\n\n☆How to get the BEST RESULTS with the MrandMrsMuscle Workouts?\nDownload our App! \nhttps://MrandMrsMuscle.com for more details\n\n☆Are MrandMrsMuscle Trainers Qualified?\nYes.\nViv Addo:\n- GCSE & A-Levels in Physical Education\n- BSc Hons Degree in Sports Science\n- AIQ Level 3 Diploma in Fitness Instruction and Personal Training\n\nMike Addo:\n- AIQ Level 3 Diploma in Fitness Instruction and Personal Training\n\nInvest in yourself and Subscribe.\n",
  "tags": [
    "guided workout",
    "real time workout",
    "full body",
    "workout",
    "training",
    "glute",
    "butt",
    "booty",
    "ass",
    "legs",
    "muscle",
    "round",
    "exercise",
    "slim thighs",
    "toned legs",
    "kim kardashian",
    "glute bridges",
    "round butt workout",
    "home workout",
    "30 min",
    "glutes workout",
    "glute workout",
    "butt workout",
    "shape your booty",
    "sculpt glutes",
    "shape glutes",
    "thighs",
    "cellulite",
    "lower body",
    "low impact",
    "big glutes",
    "big booty workout",
    "megan the stallion",
    "thick thighs workout",
    "thicc",
    "glute training",
    "grow glutes",
    "strong workout"
  ],
  "publishedAt": "2021-10-25T14:31:10Z",
  "duration": 1850,
  "durationFormatted": "30:50",
  "viewCount": 238085,
  "likeCount": 0,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/HszzIPCwbKY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/HszzIPCwbKY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/HszzIPCwbKY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/HszzIPCwbKY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/HszzIPCwbKY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/HszzIPCwbKY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Sorry to sound stupid 😄but do we do this session 1 2x a week then session 2 the week after 2x week,session 3 week 3 ect,as I&#39;m confused if you can&#39;t tell,and what about if we don&#39;t have weights to do these exercises,would be thankful for any sort of reply or guidance 😀",
    "Hey Squad, this is going to be a transformative series where I train you and give you tips &amp; reminders along the way. These personal training sessions will be 2x a week. For the more intense NON-SPEAKING workouts keep an eye out in the week as we will be uploading those separately. I hope you enjoy the session 🥰❤",
    "By far the best workout on YouTube!",
    "A lot of workout videos these days have no talking and I am just watching someone with a countdown clock. These are great exercises with a great personality training you. Motivating but not in your face. Calm energy and amazing weight suggestions and modifications.",
    "Where have you guys been? Missed you like hell. So good to see you back! Keep rocking ❤️❤️"
  ],
  "channelSubscriberCount": 1410000,
  "channelVideoCount": 1012
}