{
  "video_id": "HT09YZyGQ3Q",
  "title": "25 Min Evening Yoga Flow | Daily Routine To Relax & Unwind",
  "description": "Welcome to this 25 min evening yoga flow. This is a gentle yoga practice for mixed levels to help you relax and unwind after a busy day. \n\nThis full body sequence is intended to give your whole body the attention it needs after a busy day to help prepare you for a restful nights sleep.\n\nThe sequence includes postures to stretch the whole body, guided at a slow and steady pace to help you relax and unwind. \n\nI hope you enjoy this evening yoga flow. \n\nCharlie x\n\nLinks:\nOnline Programs: https://www.charliefollows.com/programs\nNewsletter: https://www.charliefollows.com/newsletter\n\nSocial Media:\nInstagram: https://www.instagram.com/charlieafollows?igsh=MWdxMjE0ZHR1bzlydg%3D%3D&utm_source=qr\nFacebook: https://www.facebook.com/charliefollowsyoga\nTikTok: https://www.tiktok.com/@charlieefollows?_t=8jbfibQBEiO&_r=1\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2024-07-07T13:00:17Z",
  "duration": 1523,
  "durationFormatted": "25:23",
  "viewCount": 454256,
  "likeCount": 11423,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/HT09YZyGQ3Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/HT09YZyGQ3Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/HT09YZyGQ3Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/HT09YZyGQ3Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/HT09YZyGQ3Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/HT09YZyGQ3Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Happy Sunday friends I hope you enjoy todays class ❤",
    "I just wish I could magically transport myself from shavasana on the mat to my bed 😂 <br>A really wonderful practice and stretch - thank you xx",
    "It&#39;s amazing how every time a practice is as wonderful as this one gets my nerves calmed down and slows my thoughts as if there were clouds that got gently blown away and now the sky is clear ❤",
    "My nervous system was so shot this week, and this practice totally helped it come back to ease. Thank you. That stretch with the back leg in low lunge and the front knee forward of the ankle with one arm high was amazing!",
    "This is the ultimate stress-relief yoga! The focus on relaxation and mindfulness is perfect for winding down. I&#39;m making this part of my daily routine."
  ],
  "channelSubscriberCount": 991000,
  "channelVideoCount": 1004
}