{
  "video_id": "i6TzP2COtow",
  "title": "15 MIN FULL BODY STRETCH - Improve Mobility and Flexibility",
  "description": "Join ​⁠@MarieSteffen and I for a 15 min full body smooth stretch routine! This will help you recover faster and increase your range of motion. All you need is flat space, use a mat for extra comfort!\n\nJust remember, mobility is key for many HIIT and Strength exercises, so make sure to include regular stretching in your week and stay consistent with it!\n\n♡📱 My workout APP has a new design and lots of exclusive workouts, sign up to my Grow with Anna APP today: https://www.growwithanna.com/\n\n▸ Level: All Levels\n▸ Time: 15 Min\n▸ Equipment: No Equipment\n▸ Full Body Stretch 50 sec on, 10 sec rest\n\nPlease remember that we are all different and that you can make this your own workout ♡ Take a longer break when you need to.\n\n♡ Sign up to the Team Grow Newsletter: https://manage.kmail-lists.com/subscriptions/subscribe?a=VLsDDa&g=WikyFT\n\n♡ Join the OFFICIAL TEAM GROW Community Group: https://www.facebook.com/groups/teamgrowsupport/\n\n♡ My WITHINGS ScanWatch: Bit.ly/WITH-TEAM-GROW\n\n♡ My @KorodrogerieDe  DISCOUNT CODE: GROW\n\n♡ My Amazon Storefront: https://www.amazon.de/shop/growingannanas \n\n♡ The Gear I Use:\nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n♡ SUBSCRIBE: http://bit.ly/2QLvpXn\n♡ Instagram: http://bit.ly/2ZSdHFR\n♡ Facebook: http://bit.ly/2SVkgpE\n\n♡ My Music: https://www.epidemicsound.com/referral/gw5avz\n\n#growingannanas #growwithanna #homeworkouts #hiitworkout\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "15 min full body stretch",
    "Stretch routine",
    "Full body stretch",
    "Rest day stretch",
    "Improve range of motion",
    "Increase mobility",
    "Improve flexibility",
    "Mobility routine",
    "Home workout",
    "Growingannanas",
    "Grow with Anna",
    "Fitness at home"
  ],
  "publishedAt": "2024-02-15T02:00:07Z",
  "duration": 963,
  "durationFormatted": "16:03",
  "viewCount": 6264972,
  "likeCount": 101364,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/i6TzP2COtow/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/i6TzP2COtow/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/i6TzP2COtow/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/i6TzP2COtow/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/i6TzP2COtow/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/i6TzP2COtow\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hey Team ❤ I hope you enjoy this rest day routine, give back some self love to your body! I’m sure you’ll feel better after it 🤗 Anna x",
    "taking care of my body is so important to me. i never used to exercise or practice mindfulness or ate food that actually made me feel good. and now it’s like a whole new perspective. i’m more grateful for everything and generally more at peace with myself. it’s easier to manage tasks. i’m sleeping better. it’s amazing.",
    "I got my periods today and this was literally all i needed! I was not in the mood to do any high intensity ones and you posted this right on time &gt;&lt; thank you soo muchh anna 💖",
    "When I read “Take Care of Your Body, It&#39;s Your Home,” I felt mixed emotions.  I don&#39;t know if it&#39;s sadness, a desire to cry, or a feeling of pity for what I do to myself every day.  In fact, eating disorders destroy a person&#39;s life and can even kill them.  Thank you for your work and thank you for your effort ❤❤❤",
    "After suffering from an incomplete paralyzation with 17, I was in hospital for half a year, learning to walk again. Now it&#39;s been 3 ¾ years and right after getting out of hospital my physio started to use various Yoga stretches and exercises in our weekly appointments. Then I visited a yoga class in my gym once and been doing it since then. I was very flexible before the accident and I gained it all back, despite the metal and titan pieces holding my back and my feets together. So, I have to say thank you. Been watching your channel for a while and it helped me very much on my ongoing journey. It makes me proud to be able to follow along with most positions correctly when I once couldn&#39;t even move my legs. So please keep up the good work, it is worth it! 😁"
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}