{
  "video_id": "iCkek3txJL4",
  "title": "10 MIN DAILY STRETCH | Flexibility, Mobility and Relaxation | Daniela Suarez",
  "description": "This video is a 10 minute full body stretching routine that you can do dailyIt helps with flexibility, mobility and relazation! \n\nThis video includes a sequence of different full body exercises, and it can be completed after your workouts, in the mornings or evenings! \n\nDon’t forget that stretching is extremely important to help your muscles recover! \n\nYou can find the new Ēvolvō Challenge here: https://shopevolvo.com/pages/challenges \n\nSince this challenge is free, don't forget to like it, subscribe to my channel, turn on notifications, and leave a comment down below letting me know what you think!! \n\nUse the #danielasuarezchallenge if you're joining us on this challenge!\n\n⤐ Shop My Outfits:\n\nhttps://shopevolvo.com \n\n⤐ Free Workout Challenges:\n\nhttps://shopevolvo.com/pages/workout-...\n\n⤐ Filming Camera: \n\nhttps://www.amazon.ca/dp/B06VT2NQD8?r...\n\n⤐ Filming Equipment: \n\nhttps://www.amazon.ca/shop/danielasua...\n\n⤐ Shop My Products:\n\nhttps://shopevolvo.com \n\n⤐ Instagram Links: \n\nhttps://www.instagram.com/danielasuar...\n\nhttps://www.instagram.com/evolvo__/\n\nMusic: Music from Epidemic Sound\n\nDISCLAIMER: note that you should always consult your health physician before you perform any form of exercise, including this video. Furthermore, the title of this video is subjective and results vary depending on your body type and nutrition practices. I strongly suggest to make sure you check your form for each exercise with a certified trainer and you follow a meal plan to get to your weight loss goals. Perform this workout in a safe space. If you really want to challenge yourself and see results in 2 weeks make sure you are consistent and perform this workout 4-5 times per week over the next 2 weeks! Please remember that abs are also build in the kitchen and that you should be on a healthy balanced diet for ultimate results! You might build your abs but if there’s always a layer of fat from unhealthy habits, you might not see them!\n\nworkoutathome,workoutathomeforbeginners,workout,homeworkouts,Daily stretch,dailystretchroutine,stretchroutine,stretchingroutine,fullbody,fullbodystretch,fullbodystretchroutine,fullbodystretchingroutine,fullbodystretchingdaily,dailydoseofstretch,flexibility,mobility,relaxation,getflexible,berelaxed,improvemobility,athomestretches,adterworkoutdailystretch,afetrworkoutstretch,fullbodysequence,danielasuarez,danielasuarezchallenge,improveflexibility,bemorerelaxed,relax,muscles,stretch,stretching",
  "channelTitle": "Daniela Suarez",
  "channelDescription": "Welcome to your ultimate destination for fitness, flexibility, and wellness! Whether you're a beginner, a fitness enthusiast, or an athlete, my channel is designed to help you achieve your goals while having fun!\nDiscover stretching routines, flexibility exercises, and mobility workouts to improve posture, reduce muscle tension, and enhance your overall well-being. Here, you’ll find a variety of workouts, including abs challenges, full-body HIIT workouts, and weight loss workouts for women. Whether you need a full-body workout at home, a workout without equipment, or specialized slim waist ab routines, I got you! Explore HIIT cardio, targeted stretches for recovery, and dynamic routines designed to help you build strength and flexibility. From enhancing your range of motion and joint health to achieving your dream body, this channel is your partner in every step of your fitness journey. Subscribe now and let’s smash those fitness goals together—your best self awaits! Let's get it done\n",
  "tags": [
    "workoutathome",
    "workoutathomeforbeginners",
    "workout",
    "homeworkouts",
    "Daily stretch",
    "dailystretchroutine",
    "stretchroutine",
    "stretchingroutine",
    "fullbody",
    "fullbodystretch",
    "fullbodystretchroutine",
    "fullbodystretchingroutine",
    "fullbodystretchingdaily",
    "dailydoseofstretch",
    "flexibility",
    "mobility",
    "relaxation",
    "getflexible",
    "berelaxed",
    "improvemobility",
    "athomestretches",
    "adterworkoutdailystretch",
    "afetrworkoutstretch",
    "fullbodysequence",
    "danielasuarez",
    "danielasuarezchallenge",
    "improveflexibility",
    "bemorerelaxed",
    "relax",
    "muscles",
    "stretch",
    "stretching"
  ],
  "publishedAt": "2022-06-04T03:13:33Z",
  "duration": 622,
  "durationFormatted": "10:22",
  "viewCount": 186412,
  "likeCount": 3354,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/iCkek3txJL4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/iCkek3txJL4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/iCkek3txJL4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/iCkek3txJL4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/iCkek3txJL4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/iCkek3txJL4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Have loads of different stretch videos saved but this one by Daniela is definitely numero uno for getting rid of all that daily stress before bed!!",
    "Just finished this and it was incredible, not just the way my body feels after the stretch but your choice of music and over all vibe of the video. Can&#39;t wait to add this to my daily routine 😊",
    "I do your routines every morning and after gym, they just make me feel so fresh! thanks 💕",
    "Finally a stretch routine I can complete!",
    "I was feeling sore today and this made me feel so much better!❤️"
  ],
  "channelSubscriberCount": 266000,
  "channelVideoCount": 376
}