{
  "video_id": "IjH_8pdybfs",
  "title": "POST-WORKOUT STRETCH for Injury Prevention & Flexibility",
  "description": "⭐️ Find tips, recipes, and more here! 👉  https://www.kaleighcohen.com \n\n⭐️ Find all of the equipment used for these workouts here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/channel/UC0PZtgIWY5__DxIR0iVttQA\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ Tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.\n\n\n#stretching  #postworkout  #flexibility",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2022-12-02T10:00:17Z",
  "duration": 702,
  "durationFormatted": "11:42",
  "viewCount": 2344495,
  "likeCount": 38461,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/IjH_8pdybfs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/IjH_8pdybfs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/IjH_8pdybfs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/IjH_8pdybfs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/IjH_8pdybfs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/IjH_8pdybfs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "When the workout is tough but then you do the stretch and realize just how broken your poor body is. Definitely coming back to this one every day to improve that mobility. Thank you!",
    "Love how she congratulates us after our workout and talks us through the whole video. Her voice sounds so pleasing too! Definitely coming back to this video",
    "<a href=\"https://www.youtube.com/watch?v=IjH_8pdybfs&amp;t=697\">11:37</a> It&#39;s really nice to hear someone saying &quot;you are awesome and I love you&quot; in every morning. Thank you ❤",
    "that felt like 2 minutes. I LOVE HER. I’m a dancer and I just worked for about an hour and a half on a difficult hip-hop choreo that is very demanding stamina and strength-wise. Felt terrible but the stretch was very calming. I feel better already, we’ll see how sore I am tomorrow 💓",
    "the pug laying on the couch is the cutest thing ever"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}