{
  "video_id": "ImI63BUUPwU",
  "title": "30 Min CARDIO WORKOUT at Home [LOW IMPACT STEADY STATE] LISS",
  "description": "A perfect 30 minute full body no repeat, low impact steady state cardio workout at home (LISS) that requires a continuous, maintainable level of effort! \n\nCardio workouts and HIIT workouts are very different. HIIT is absolutely one of my favourites however low impact cardio such as walking (daily steps target etc), swimming, cycling all contribute to improved cardiovascular health, great for mood boosting, burns energy and still allows for recovery. You have to be aware when your body needs a complete rest also. \n\nThis full body cardio workout is a perfect session to burn that energy whilst not over exerting on those active rest days or after a weight session. \n\nNo equipment required, you will simply need a mat and a bottle of water.\n\nPlease remember that you can’t out train a poor diet. \nNutrition, a training plan, training with intensity and activity levels outside of specific workouts all go hand in hand in order to see and feel results.\n\nThe timer will be on for 45 seconds of work for each exercise and no rest. Ensure you pace yourself as there is no specific rest!\n\nNO-JUMPING JACKS\nALT REAR STEP LUNGES\nLATERAL LUNGE TO FOOT TAP\nLUNGE TO KNEE DRIVE\nLUNGE TO KNEE DRIVE (switch)\nPLANK WALK OUT TO PUSH UP\nPLANK LEAN TO CROUCH\nSQUAT WALK TO SQUAT \nQUIET PUSH UP BURPEE TO TOES\nPLLANK HOVER STEP IN\nX1 LEG DOG TO KNEE TUCK\nX1 LEG DOG TO KNEE TUCK (switch)\nSQUAT TO ALT REAR FOOT TAP\nSTANDING ALT STRAIGHT LEG KICK\nPIVOT PUNCHES\nKNEE CROSS BODY CRUNCH\nKNEE CROSS BODY CRUNCH (switch)\nLATERAL LUNGE TO KICK\nLATERAL LUNGE TO KICK (switch)\nWINDMILLS\nCROUCH ON TOES TO ARMS UP STAND\nCURTSEY HAND TOUCH TO KICK\nCURTSEY HAND TOUCH TO KICK (switch)\nSKIER TO TOES\nPUSH UP TO ALT SIDE PLANK\nON ELBOWS ALT LEG EXTENSION \nBICYCLES\nSIT UPS\nREVERSE CRUNCH\nMOUNTAIN CLIMBERS\nSUMO SQUAT w/PULSE\nSPRINTER KNEE DRIVE TO TOES\nSPRINTER KNEE DRIVE TO TOES (switch)\nSTATIC LUNGE\nSTATIC LUNGE\nSUMO SQUAT TO HAND TAP\nPLANK ELBOWS TO ALT SIDE PLANKS\nPLANK SHOULDER TAPS\nPLANK UP & DOWN TO FEET IN & OUT!\n\nRemember.. pace yourself and don’t strain! \n\nI hope this is useful to you whether you are completing the EPIC Program or are simply completing the other workouts in the playlists! \n\nEnjoy and have fun! \n\nCx\n\n▶ My 5 Minute Warm Up: https://youtu.be/c0VxUFHdYzs\n▶ My 30 Min Defined Abs Workout: https://youtu.be/5i8y-_cbwgw\n\n▶ Subscribe to my YouTube Fitness Channel for FREE: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\n▶ Caroline Girvan FREE 10 Week Program Guide and Schedule: https://carolinegirvan.com\n▶ Begin My EPIC Program: https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\n▶ Begin My EPIC Beginner Series: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Facebook: https://facebook.com/carolinegirvanfitness\n▶ Business Enquires: info@carolinegirvan.com\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "cardio workout",
    "low impact cardio workout",
    "liss workout",
    "liss",
    "steady state cardio",
    "30 min cardio workout",
    "30 minute workout",
    "cardio",
    "cardio at home",
    "liss cardio",
    "30 minute cardio",
    "at home workout",
    "low intensity steady state cardio",
    "low intensity steady state cardio workout",
    "low impact cardio",
    "workout",
    "caroline girvan",
    "low impact",
    "no jumping",
    "full body workout",
    "fitness",
    "no jumping workout",
    "full body"
  ],
  "publishedAt": "2020-10-31T12:30:03Z",
  "duration": 2244,
  "durationFormatted": "37:24",
  "viewCount": 3553952,
  "likeCount": 59816,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ImI63BUUPwU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ImI63BUUPwU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ImI63BUUPwU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ImI63BUUPwU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ImI63BUUPwU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ImI63BUUPwU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "What a fab wee surprise for a Saturday Afternoon. I have been looking for something to up the cardio for these cold winter nights.....this is it. Great sets that keep full on work for the 30mins and keep the heart rate up my average  was 138 and my calorie burn was 310. Great for rest days or for me in the evenings after an EPIC workout earlier in the day. Thanks Caroline 😊 just what I needed. See you tomorrow.",
    "guys, keep this in mind when doing this or any other workout from a coach or ppl with experience in this.<br>they are used to this and they can do it fast, if you&#39;re a beginner like me, do it at your own pace and take breaks in between if you need. we&#39;ll get used to this but we have to be patient and persistent and never give up.",
    "Nearly 5 months ago, my lungs and heart threatened to explode as I did this workout for the first time. Today I did it for the 60th time, and totally rocked it. I think I&#39;m about ready for one of your &quot;regular&quot; workouts now. Thank you!",
    "Do not let the “low impact” in the title fool you! You are STILL gonna sweat your ass off and your heart rate WILL go up!  Just found you a couple days ago and I have not been disappointed!! Heading over to Instagram to follow you right now!!!",
    "Attention asthmatics: you will not be able to talk thru this BUT you will be able to do the whole workout without stopping to catch your breath. And that my friends is a win for us lung impaired folk."
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}