{
  "video_id": "IumIKwyx8pg",
  "title": "4-7-8 Calm Breathing Exercise I 5 Minute Guided Breathwork to Relax or Fall Asleep Fast",
  "description": "Want to deepen your practice? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nRemember To Breathe T-Shirts:\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nThe 4-7-8 breathing technique can help calm your sympathetic nervous system, which controls your fight-or-flight response. The music is here to guide you along and you can do this exercise whenever you feel stressed or want to fall asleep faster. \n\nThe 4-7-8 breathing technique can help calm your sympathetic nervous system, which controls your fight-or-flight response. The music is here to guide you along and you can do this exercise whenever you feel stressed or want to fall asleep faster. \nRegular practice of Breathwork can bring real change to your life Including boosted immune system, lowered stress and inflammation, better focus, more energy and the list goes on. My guiding voice mixed with the rhythmic music really helps to go deeper into a state of relaxation and bliss. So if you want the full experience, wear headphones and be in a quiet comfortable place !\n\nAll music, guided voice and video editing is done by me. I thoroughly enjoy creating this content for you all and hope that is can bring improvement into your life. Whether that be more self love, kindness, less stress and anxiety, lowered inflammation,  more energy etc whatever it brings, remember to say thank you to yourself for taking the time do improve your life.\n\nSafety/Disclaimer: \n\nAll information provided by this channel is only for educational and entertainment purposes.  Sandy is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n\nMuch Love,\nSandy\n\n#breathwork #relax #breathewithsandy",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [],
  "publishedAt": "2022-07-28T16:00:12Z",
  "duration": 337,
  "durationFormatted": "5:37",
  "viewCount": 332463,
  "likeCount": 5970,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/IumIKwyx8pg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/IumIKwyx8pg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/IumIKwyx8pg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/IumIKwyx8pg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/IumIKwyx8pg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/IumIKwyx8pg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Welcome all of you beautiful breathing people. If you are stressed at work, or are having trouble falling asleep, this quick yet effective breathing technique can help. Much love to all. If you want to receive updates and other information sign up for my newsletter🙏<br><a href=\"https://www.breathewithsandy.com/\">https://www.breathewithsandy.com/</a>",
    "Just a casual here doing this breathwork every night before i go to sleep, this is literally a free upgrade in life at no cost. So good!!",
    "This video has literally helped me get out of fighter flight after some of the most stressful weeks of my life, thank you",
    "Just did this one with my 15 year old son.  He couldn’t believe how quickly it went by…such a great short practice for my sometimes reluctant teen boys.  Definitely going to keep this as a favorite as it was so relaxing.",
    "Best breathwork coach and channel on YouTube! Thanks Sandy"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}