{
  "video_id": "iY0acFOmbgI",
  "title": "Pilates for Beginners - 15 Minute Beginner Pilates Workout",
  "description": "This 15 Minute Pilates for Beginners Workout takes you through the basic Pilates exercises you need to feel strong in Pilates! It is a full body beginner Pilates workout perfect for anyone to do at home anytime.\n\n🔥 Use my 10 Minute Warm Up video to get ready for any of my other workouts: https://youtu.be/oGt6idqFekE\n\n⚡️ Subscribe to my YouTube channel: http://bit.ly/2E3rNbs\n\n💪🏽 Get all my full length workouts, monthly fitness plans, recipes, free app and more  http://www.jessicavalant.com/unlimited\n\n📣 Free one week workout program and my favorite resources for healthy aging  - https://jessicavalant.com/sign-up-below\n\n➡️ Subscribe to my newest YouTube channel to listen and watch all my podcast episodes - https://www.youtube.com/@meetyourbodypodcast\n\n🎧 Find my podcast Meet Your Body anywhere you listen to podcasts! Or listen here http://www.jessicavalant.com/podcast\n\n💥 Find the Jessica Valant app here!\nApple IOS - https://tinyurl.com/mry5ya8r\nGoogle - https://tinyurl.com/yh3ty5fp\n\n💪🏽 Four Week Beginner Workout Program: https://payhip.com/b/d3ARC\n🙌🏻 Instagram: https://www.instagram.com/jessicasvalant\n✅ All my resources and services: https://jessicavalant.com/home-workouts-and-services\n\n⭐️ Join my UNLIMITED program and app and get immediate access to over 400 workout videos you can do anywhere and anytime! Members get two new workouts every month that aren't available anywhere else and a monthly workout calendar telling you what to do every day for the best exercise program. You also get full length versions of your favorite YouTube videos, monthly healthy recipes and a supportive and encouraging community. Join here 👉🏼 http://www.jessicavalant.com/unlimited\n\n🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀\nJessica Valant and Jessica Valant Pilates, LLC, recommend you consult with a physician before starting any new exercise program. The information given here is not meant to treat or diagnose any medical condition. Please stop if you feel any pain or dizziness. You understand that physical activity can pose a risk and by watching this channel and these videos you assume all risk and release Jessica Valant and Jessica Valant Pilates, LLC, from all liability.",
  "channelTitle": "Jessica Valant",
  "channelDescription": "I’m Jessica, a licensed physical therapist, Pilates teacher and women's health expert with over 25 years of experience. I believe movement should be empowering, encouraging and fun! On my channel you’ll find workouts for everyone, regardless of skill level or experience. I also talk through various injuries and conditions, including my own experience with women’s health issues such as prolapse and hysterectomy. I want you to remember you are strong, you are powerful and you deserve to move your body and feel good while you do it. \n\nYou can find more of my tips and full length workout programs at http://www.jessicavalant.com.\n\n You can also find me and behind the scenes action on Instagram @jessicasvalant.\n\n🙌🏽 Do you like our free content? Consider donating to Jessica Valant Pilates to help support all our free resources: https://tinyurl.com/mvt56pfv\n",
  "tags": [
    "pilates for beginners",
    "beginner pilates workout",
    "full body pilates workout",
    "15 minute pilates workout",
    "pilates for weight loss",
    "beginner core workout for women",
    "Jessica Valant pilates",
    "pilates abs workout for beginners",
    "Jessica Valant Pilates for beginners",
    "gentle pilates",
    "basic pilates"
  ],
  "publishedAt": "2025-01-13T12:30:39Z",
  "duration": 898,
  "durationFormatted": "14:58",
  "viewCount": 76241,
  "likeCount": 2033,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/iY0acFOmbgI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/iY0acFOmbgI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/iY0acFOmbgI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/iY0acFOmbgI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/iY0acFOmbgI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/iY0acFOmbgI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "You&#39;re the best instructor on YouTube, especially for beginners! You explain and show things so clearly, and everything feels doable. You&#39;re right when you say many beginner workouts on here are too hard. Thank you 💖.",
    "Thank you, Jessica.  I loved this beginner/refresher workout.  It&#39;s just what I needed.   I&#39;m thankful that my power was on this morning so I could enjoy seeing you and doing my Pilates this morning.   My thoughts and prayers are with everyone affected by the horrendous fires in Southern California.  ❤",
    "My 74 year old body loved this basic Pilates class!❤️",
    "I was feeling very stiff and achy this morning. This is just what I needed. Thank you for a true beginner level video.",
    "So happy to see another beginner workout posted when I went to exercise. I am getting back into my fitness routine and this is just what I needed to stretch out the soreness from my last session. Thank you Jessica!"
  ],
  "channelSubscriberCount": 914000,
  "channelVideoCount": 510
}