{
  "video_id": "J0vhOvj5Kms",
  "title": "20 minute Full Body Standing Strength Workout with Dumbbells | Seniors, Beginners",
  "description": "This 20 minute full body strength workout will build muscle in your arms, legs, back, and core. We use dumbbells with these standing exercises, but you can use anything with weight such as water bottles or cans. The goal is to use weight that is challenging for you.\n\nThe 7 exercises are done in 30-second intervals. Aim to do 8 to 12 repetitions during each interval. We do two rounds of the exercises.\n\n✳️ Mini traditional squats\n✳️ Rows\n✳️ Mini sumo squats\n✳️ Rows with a tricep kickback\n✳️ Reverse lunges\n✳️ Bicep curls\n✳️ Wood Chops\n\nThis workout can be done at least twice a week on its own or with another yes2next workout. \n\nyes2next celebrates fitness and joy at any age. It’s never too late to start exercising, creating, and doing. Say “yes” 2 your next steps to fitness and joy.\n\nIf you are new to our channel, we're happy you clicked on our video! We hope you enjoy it!  Please show your love💓 and support 🤝 and join the yes2next community by subscribing and pressing (🔔) to join the Notification Squad and stay updated with new uploads ✨ If you have any inquiries or requests, feel free to leave them in the comments below.\n\n🔴 Subscribe Here: https://www.youtube.com/@yes2next\n👍 Like the video (it helps a ton!)\n💬 Comment below to share your opinion!\n🔗 Share the video with anyone you think it might help :)\n\n\n📲 Stay Connected: \n📷 𝐈𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦: https://instagram.com/yes2next \n⚫️ 𝐓𝐢𝐤𝐓𝐨𝐤: https://tiktok.com/yes2next \n🔵 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤: https://facebook.com/yes2next \n🔵 𝐓𝐰𝐢𝐭𝐭𝐞𝐫: https://twitter.com/yes2next \n🔴 𝐏𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭: https://pinterest.com/yes2next\n🌐 𝗪𝐞𝐛𝐬𝐢𝐭𝐞: https://yes2next.com\n ✉ 𝐄𝐦𝐚𝐢𝐥: yes2next@gmail.com \n\nDisclaimer: This program is provided with your health and safety in mind, but every individual has their own limitations. It is crucial that you consult with your physician before beginning this or any other exercise program. This program is not a substitute for professional medical diagnosis, treatment or advice. By participating in this exercise program, you do so at your own risk. Please stop if you experience pain, dizziness, or shortness of breath.\n\n\n#beginnerworkout #seniorexercises #seniorfitness",
  "channelTitle": "yes2next",
  "channelDescription": "yes2next is all about fitness and joy at any age, including seniors over 50. Say yes to your next adventures and reaching your full potential. I’m April, a personal trainer with senior fitness and functional training specialist certifications from the American Council on Exercise and The Biomechanics Method for Corrective Exercise. My 83-year-old mom and I are excited to share our passion for healthy living with our exercise videos for beginners and seniors, lifestyle tips, and fun. \n\nStay connected with us by subscribing and following us on:\n⭐️ Facebook: https://facebook.com/yes2next\n⭐️ Instagram: https://instagram.com/yes2next\n⭐️ Twitter: https://twitter.com/yes2next\n⭐️ Pinterest: https://pinterest.com/yes2next\n⭐️ Tiktok: https://tiktok.com/@yes2next\n\n👉 To keep in touch by email,  sign up at https://yes2next.com\n👉 Find yes2next gear at our store: https://yes2next.com/shop\n\n❤️ To donate, visit our Paypal page: https://bit.ly/y2ndonate Thank you!\n\nSee you soon! 🏃‍♀️🏋️‍♀️ 😊\n",
  "tags": [
    "beginner workout",
    "senior workout",
    "at home workout",
    "exercise routines",
    "chair exercises for seniors",
    "exercises for seniors",
    "senior workouts",
    "strength workout"
  ],
  "publishedAt": "2021-11-30T14:06:22Z",
  "duration": 1246,
  "durationFormatted": "20:46",
  "viewCount": 664627,
  "likeCount": 13648,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/J0vhOvj5Kms/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/J0vhOvj5Kms/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/J0vhOvj5Kms/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/J0vhOvj5Kms/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/J0vhOvj5Kms/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/J0vhOvj5Kms\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Headline in Washington Post today: It’s never too late to lift weights: Older bodies can still build muscle.<br>Someone wrote in the comments, &quot;I&#39;m 66, how do I start?&quot;  I replied about the YouTube channels that are geared to seniors and/or beginners, and mentioned Yes2Next as an example.  I hope you get some new visitors from that.<br>Thanks for the workouts!",
    "I&#39;m a beginner at 57. I just finished the first session. I&#39;m a little emotional because I have finally done it and broken my procrastination. <br>Your gentle and kind attitude kept me going. I loved it and broke out of my stuck attitude. <br>Thankyou and bless you both.",
    "Thank you for this! I&#39;m a breast cancer survivor and am currently in chemical menopause for the next 5-10 years and my body feels older than I am because of it. I&#39;ve been looking for workouts I can do to loosen up and build muscles back up and there aren&#39;t many. I used to be able to do more and it&#39;s so hard finding workouts that I can do to build my body back up (many are geared toward young, already-in-shape people without joint issues). This was one I could do and gives me so much hope that I can workout and do strength training again.",
    "January 1 2024...Started this year with this exercise.....proud of myself....it is still a struggle to get exercise in.  Thanks to you It&#39;s not as challenging!  Happy New Year!  <br>❤🎶🎺🎉",
    "Thank you, I am a new subscriber and I love you both 🙏🏽"
  ],
  "channelSubscriberCount": 457000,
  "channelVideoCount": 324
}