{
  "video_id": "j4-7XX2AhAs",
  "title": "Regulate Your Nervous System | 15 Minute Yoga Practice",
  "description": "Homeostasis, here we come. Take 15 minutes to tend to your nervous system with this regulating rest and digest practice. In this video you will find valuable techniques to cultivate a sense of safety and grounding in times of nervous system disregulation. \n\nGently guide your body back to a harmonious state through awareness of the breath. Regulate the nervous system by entering the role of the observer. Release self-judgment by practicing self-compassion. The mat is your place to return home to yourself, and a great place to become more familiar with your unique window of tolerance. \n\nSoothe symptoms of stress and nurture the parasympathetic nervous system (AKA the “rest and digest” state) with this calming yoga practice. We will do it together. \n\nSave this session for when you are feeling off balance and need an energetic reset.\n\nLet me know how this one goes for you in the comments!!\n\n- - - - - - - - - - \n\n💫 Find What Feels Good - FREE 7-day Trial 💫 \nhttps://ywa.co/fwfg7dayfree\nAccess all my digital courses, hundreds of exclusive videos, and recommended daily practices + our all-new Community.  Stop by and say \"Hi!\"\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "morning yoga",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne",
    "15 minute yoga",
    "15 minute workout",
    "15 minute stretch",
    "15 minute yoga flow",
    "15 minute morning yoga",
    "yoga for overall health",
    "free yoga online",
    "yoga for tension",
    "parasympathetic nervous system"
  ],
  "publishedAt": "2024-07-13T05:00:07Z",
  "duration": 921,
  "durationFormatted": "15:21",
  "viewCount": 1003084,
  "likeCount": 20955,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/j4-7XX2AhAs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/j4-7XX2AhAs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/j4-7XX2AhAs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/j4-7XX2AhAs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/j4-7XX2AhAs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/j4-7XX2AhAs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Made with love after delving into my own healing journey with the nervous system which my body definitely called on me to address (Via body anxiety and panic attacks a couple years ago.) It&#39;s an ongoing process and almost everyone can benefit from short and consistent practices that help us tune into our individual nervous system health and utilize the tools to guide back toward homeostasis. It can also just feel good to give these issues visibility and allow there to be more accessible shame free support. I got you. Thank you for sharing your practice with me.",
    "Awaken day 12🎉 thank you, Adriene, perfect Saturday practice and is just what my body needed, I&#39;ve been tired all day due to a hard night trying to get to sleep, hopefully tonight will be better after this practice. 💖🧘🏼‍♀️🙏🏻",
    "A short and sweet reset. Why do I feel so good after this practice?! I didn&#39;t think I was feeling nervous, but now I am much relieved. Thanks, Adriene, for every day&#39;s cure.",
    "I started watching these at 19… I’m 27 now and still pop in when I need more guidance thank you!!!!",
    "My yoga space today was filled with bright sunshine through the window. It was really lovely to reside in its light. I allowed my breath to flow however it wanted, no resisting or pushing. Thank you for such a loving start to the day!"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}