{
  "video_id": "J_e00F5QPtc",
  "title": "Strong in 30! FULL BODY dumbbell workout to strengthen and sculpt!",
  "description": "Weight lifting for women at home! Join me for this 30 minute full body dumbbell workout. Strengthen and sculpt the total body, lifting weights at home. Low impact means no jumping or fast movements during this weight training workout. \n\n#homeworkout #dumbbellworkout  #strengthworkout \n____ \nWarm Up   \n\nONE\n1. Sumo deadlift 55lb/25kg (my dumbbell weight for reference only) \n2. Bent arm side lateral raise 15lb/6.5kg\n \nTWO\n1. Goblet squat 55lb/25kg\n2. Dumbbell pullover 30lb/14kg (bench or from floor)\n\nTHREE\n1. Alternating cross body hammer curl 17.5lb/8kg\n2. Skiers 17.5lb/8kg\n3. Bird dog (bodyweight)\n\nCool down stretch \n____\n\n✅ W O R K O U T  P R O G R A M\nComplete three LIFT WITH CEE  full body workouts each week.\nYou can either:\n- Repeat this video 3x/week for a 4-8 week training block (called a mesocycle)\n- Pick a different video 3x/week from a 30 min or 40 min workout playlist\n\nBuild muscle by consistently increasing the challenge, forcing your body to adapt and grow. When you’re familiar with a workout routine it’s easier to focus on proper form, get a better connection to the target muscle, add in an extra rep and know when it’s time to increase your dumbbell weight!\n\n👍🏻 S O C I A L S\nYouTube: https://www.youtube.com/channel/UCoa5ojNBRIMesizzinT3OBQ\nInstagram: https://www.instagram.com/cheryl.c.coulombe/\nFacebook: I’m not on FB, those are fake accounts\nI will never ask you for money or message you to join a group\n\n🛑 D I S C L A I M E R \nThis is my own personal workout and may not be right for you. If you’re new to exercise or planning on embarking on a new fitness program, you should consult your physician first. All information is intended for your general knowledge and is not intended for use if you are a minor, are pregnant, or have a health condition. Please know that by engaging in this exercise or workout program, you agree that you do so at your own risk. Cheryl Coulombe, LIFT WITH CEE will not be responsible or liable for any injury or harm you sustain as a result of this video.\n\n© 2023 Cheryl Coulombe\nAll Rights Reserved",
  "channelTitle": "Cheryl Coulombe",
  "channelDescription": "Muscle for fat loss & strength gains! \n\n",
  "tags": [],
  "publishedAt": "2023-09-11T10:30:05Z",
  "duration": 1754,
  "durationFormatted": "29:14",
  "viewCount": 174266,
  "likeCount": 6314,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/J_e00F5QPtc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/J_e00F5QPtc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/J_e00F5QPtc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/J_e00F5QPtc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/J_e00F5QPtc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/J_e00F5QPtc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I love it when it doesn&#39;t go over 30 min. Mornings are really busy and when workouts are over 30 miin I  have to rush over rest between sets to get it done faster. Keep it up! Amazing workout! Thank you so much!",
    "Who am I??  Up at <a href=\"https://www.youtube.com/watch?v=J_e00F5QPtc&amp;t=330\">5:30</a> to make sure I get my workout in.  I do feel amazing!  Thanks, Cee!",
    "Four months ago, on my 65th birthday, I gave myself the gift of self care and started “lifting with Cee”. I lift every other day and feel so much stronger. Also, I’m 10 pounds down which is amazing. Thank you so much for helping me recalibrate my life!",
    "Of all the daily week formats, I think this one is the best.<br><br>1. Music is instrumentally positive (no words). Nice volume.<br>2. Workout is in 3 quick sets.<br>3. No mic.<br><br>This one pushes you hard - but feels good!<br><br>Thanks for doing what you do Cee. You are single-handedly getting people (like me) more fit &amp; fabulous at 40+!",
    "I was diagnosed with breast cancer last April, and went through 16 cycles of chemo, two surgeries, and radiation treatments.  A year ago, I was a fit 56-year old, and at my ideal weight.  Now I find myself 45 pounds heavier, and very out of shape!  I have been frustrated by the weight gain, and the fatigue which has kept me from doing the exercise I used to enjoy.  I have been looking for a way to gently begin an active lifestyle again, and I am encouraged and inspired by your videos! I too love to weight lift, so your format and style are a great fit for me.  I just finished my first 30-minute workout, and am thrilled that I made it through!  Please continue to make videos — I don’t care how long they are — I plan on continuing to follow you!"
  ],
  "channelSubscriberCount": 528000,
  "channelVideoCount": 421
}