{
  "video_id": "JAsQGn2rzmY",
  "title": "15 min METABOLIC BOOSTING cycling workout",
  "description": "Do this ride every morning to boost your metabolism and start your day off in a positive way! This 15 minute cycling workout will make an energizing addition to your day! This ride is perfect if you want a low-intensity ride on an active recovery day or if you are in the mood for a high-intensity push to really get your sweat on. You can also add this ride before any workout to get your mojo flowing and your mind in the game! It might be hard to push play, but I know by the end of this ride, you will be so happy you did! \n\nCheers and chug to an awesome day ahead! Make it an amazing one! Thanks for working out with me!\n\nIMPORTANT! The RPMs noted throughout the ride are just a range! Make sure to ride where you feel comfortable! That may be above or below the range indicated. If you'd like to make this ride a bit more intense, you can always work at a higher RPM. \n\nNeed a longer WARM-UP?  https://youtu.be/tOjKOmtPcqs\n\nMY LINKS:\nLooking for indoor cycling shoes?- https://ride.shimano.com/KCF15\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/43VG2e9\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nSpotify playlist- https://spoti.fi/3KBayDE\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\nADD IT:\nDESSERT!- https://youtu.be/eumN5TrtnzI\n\nRESISTANCE for my classes\nYou always want to feel something under your feet, this will ensure you are doing the work, prevent you from bouncing in the saddle, and protect your knees!\n6 - Working your way up that hill | Moderately Light \n7 - Mid-hill already, you can definitely feel this! | Medium\n8 -  This is where heavy really starts to kick in | Moderately Heavy\n9 - We are really starting to climb now! This is a challenging resistance! | Heavy\n10 - Top of your hill! You should be able to keep a smooth pedal stroke. | VERY Heavy\nWatch this for more detail: https://youtu.be/8DbpBXGAB8Q\n\nCHAPTERS:\n0:00 - 2:34 WARM UP | Brand New by Nevada Wild\n2:35 - 5:00 CLIMBS | Excellent by WOLVES\n5:01 - 7:51 ROLLING HILLS | Make It So Good by Noah Neiman\n7:52 - 10:24 JUMPS | Feel Alive by Coola Maya\n10:25 - 13:33 INVERTED SPRINTS | I Turn On by Ruby Neon\n13:34 - 14:58 COOL DOWN | Good Days by KENA\n\n\nSome of the links listed above are affiliate links, such as Amazon, and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for the harm, damage, or injury as a result of any information provided.\n\n\nMB01LAMQXIHCWZ3",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [],
  "publishedAt": "2023-06-07T08:59:57Z",
  "duration": 898,
  "durationFormatted": "14:58",
  "viewCount": 226410,
  "likeCount": 6869,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/JAsQGn2rzmY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/JAsQGn2rzmY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/JAsQGn2rzmY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/JAsQGn2rzmY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/JAsQGn2rzmY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/JAsQGn2rzmY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Kaleigh is the BEST… absolute BEST on YouTube! Her workouts are always 👌🏾👌🏾👌🏾👌🏾",
    "Do more of these!!! Great for those “not enough time” mornings! Thanks from South Africa👍🎉",
    "Stroke gal here and feeling very defeated today after 2 years of DAILY physio exercises with minuscule gains so this was the mental boost I needed to shake my funk. Thank you.",
    "Week 7 - INCREDIBLE - Day 47 - Done. This recovery ride is always a thrill to ride! Thank you Kaleigh! Week 7 is almost in the books! Where did the time go! Almost time to order “Incredible” hoodie merch!😄 LIVES tomorrow! LET’s GO!!!<br>🏁WINNING🏁<br>⚡️🔥⚡️🔥⚡️🔥⚡️",
    "I LOVED this 15 min class! I work in medicine and often have 12+ hr shifts. It makes it hard to get up earlier to do a full on workout. Even 20 min sometimes becomes hat]rider to fit in. But 15 min, that’s hard to find an excuse and it puts me in a good place for the rest of the day. Thank you!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}