{
  "video_id": "JDpULX1MnPI",
  "title": "15-Minute Guided Meditation to Reset Your Nervous System",
  "description": "Join me for a 15-minute guided meditation to reset your nervous system through some simple techniques that tone the vagus nerve. You can practice this guided meditation seated or lying down. You'll be placing your hands on different parts of your body and breathing easily. Over-the-ear headphones will make the first part of this meditation difficult to practice, so I recommend no headphones or using earbuds. No prior meditation or yoga experience required. Practice anytime you would like to quickly calm or balance your mind and body.\n\n❤️ DONATE: https://paypal.me/carenbaginski\n Consider donating so that I may continue to make more free meditations available to all. \n\n🌿 MORE GUIDED MEDITATIONS \nhttps://youtube.com/playlist?list=PLmWz_om3j9svx5Y6JKX87ACjasRonF0ci \n\n📘 MY BOOK: Restorative Yoga: Relax. Restore. Re-energize. \nhttps://amzn.to/2FVh19Z \n\n* * * * * * \nI'm Caren Baginski, yoga therapist (C-IAYT), author of Restorative Yoga: Relax, Restore, Re-energize, and the creator of Being Enough. I've been teaching yoga and meditation since 2009 and I live in Denver, Colorado, USA. \n\nSubscribe for new weekly videos: https://www.youtube.com/c/carenbaginskiyoga?sub_confirmation=1 \n\n▪️ Website: https://www.carenbaginski.com/ \n▪️ Instagram: https://www.instagram.com/carenbaginski/ \n▪️ Insight Timer: https://insighttimer.com/carenbaginski/ \n\nBeing Enough Disclaimer \nWhen participating in a physical program there is the risk of injury. Please consult a healthcare professional before beginning. You understand and acknowledge that you are fully responsible for any and all risks, injuries, or damages, known or unknown, which might occur as a result of your participation. Caren Baginski is not providing health care, medical, or nutritional therapy services, or attempting to diagnose, treat, prevent or cure any physical, mental or emotional issue, disease or condition. \n\nDisclosure: Some of the links above are affiliate links and I earn a commission if you decide to make a purchase after clicking the link. I only recommend things I personally use and love.\n\n#GuidedMeditation #YogaMeditation #CarenBaginski",
  "channelTitle": "Caren Hope",
  "channelDescription": "Relax & unwind with meditation, yoga nidra and restorative yoga.\n\nAbout me: Caren Baginski (she/her) is a yoga therapist and author who has been teaching yoga and meditation since 2009. Her book Restorative Yoga: Relax. Restore. Re-energize. is a visual guide to receiving deep, healing rest. In addition to Restorative Yoga, she is trained in Vinyasa Yoga, Yoga Nidra, and certified through the International Association of Yoga Therapists. She lives in Denver, Colorado, USA. Their papillon dog Willow (in many videos) passed away in February 2020.\n",
  "tags": [
    "guided meditation",
    "15 minute guided meditation",
    "vagus nerve meditation",
    "vagal tone",
    "guided yoga meditation",
    "yoga meditation",
    "yoga",
    "15 minute meditation",
    "meditation",
    "mindfulness",
    "nervous system reset",
    "balance nervous system",
    "caren baginski"
  ],
  "publishedAt": "2021-12-14T14:00:07Z",
  "duration": 911,
  "durationFormatted": "15:11",
  "viewCount": 728434,
  "likeCount": 13127,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/JDpULX1MnPI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/JDpULX1MnPI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/JDpULX1MnPI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/JDpULX1MnPI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/JDpULX1MnPI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/JDpULX1MnPI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Lots of changes, lots of stress. Overstimulated nervous system. This was different than other videos. Plenty of space between instructions. Soothing voice. Feeling so much better.",
    "i felt my stomach relax for the first time in months. i did this practice sitting up before bed to help me unwind and i almost fell asleep sitting up. will be rewatching (:",
    "I ADORE THIS. This video needs millions and billions of views! Thank you very much god bless you ❤",
    "This helped me decompress after working two 12 hour shifts at the hospital. Thank you so much and blessings to you. ❤",
    "I have been meditating for years but with 5 chronic health conditions I am often stuck in fight or flight. My holistic gp asked me to focus more on my meditation and lowering my stress as much as possible. Today was the 2nd day in a row I&#39;ve done your meditation and it&#39;s by far had the biggest impact on my stress levels. Thank you ❤️"
  ],
  "channelSubscriberCount": 53900,
  "channelVideoCount": 190
}