{
  "video_id": "Jru5B044HOs",
  "title": "The Scientific 7 Minute Workout Video - Bodyweight Only Total Body Workout",
  "description": "NEW: Exclusive workout videos + full 5, 10 & 30 Day Workout Challenges - Click \"Join\" @ https://gofb.info/FB_Exclusive \nCalorie burn, printable routine + Fitness Blender's review of the Scientific 7 Minute Workout @ https://gofb.info/DVLHpL\n\nAt-home Workout Programs @ https://gofb.info/Programs \nExclusive workout videos, Workout Challenges, and site features @ https://gofb.info/FBPlus \n\n2 Week Workout Challenges @ https://gofb.info/PlusChallenges \nAdvanced search tool for over 600+ free workout videos @ https://gofb.info/WorkoutVideos \nThe most supportive fitness Community on the web @ https://gofb.info/FBCommunity \nMeal Plans written by Registered Dietitians @ https://gofb.info/FBMealPlans \nHealthy Living articles and recipes @ https://gofb.info/HealthyLiving\n\nFitness Blender Gift Cards @ https://gofb.info/GiftCards \nWe use PowerBlock adjustable dumbbells @ https://gofb.info/PowerBlock\n\nFitness Blender’s Workout Programs and subscription platform, FB Plus, make it possible to keep our individual workout videos and website free. We were founded with, and remain committed to, the goal of making health and fitness attainable, affordable, and approachable. We hope you enjoy our content and consider subscribing to our YouTube channel and registering on our website, which is free and open to all @ https://www.fitnessblender.com/ \n\nKeep up with us on Facebook @ https://gofb.info/Facebook Instagram @ https://gofb.info/Instagram Twitter @ https://gofb.info/Twitter Pinterest @ https://gofb.info/Pinterest\n\nNote: All information provided by Fitness Blender is of a general nature and is furnished for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold Fitness Blender harmless from any and all losses, liabilities, injuries, or damages resulting from any and all claims.",
  "channelTitle": "FitnessBlender",
  "channelDescription": "We offer at-home workout videos created by certified personal trainers and doctors of physical therapy. In our videos, you’ll see us sweat, laugh, lose count, and modify exercises based on what our bodies are telling us—we have fun with our workouts, and we want you to enjoy yourself, too! No matter your fitness level, if you need help with consistency, motivation, or achieving specific fitness goals, we’re here for you.\n• Explore our library of workout videos, from strength training and HIIT to yoga\n• Reach your goals with smart and effective workout programs\n• Use the customizable workout calendar and personalized stats to track your progress\n• Eat better with healthy recipes and meal plans built by registered dietitians\n• Reduce stress with mental wellness resources from licensed psychologists\n• Interact with our community of like-minded exercisers for support and motivation\nJoin for free or access exclusive content with an FB Plus Pass or Subscription: https://gofb.info/Membership\n",
  "tags": [
    "fitness blender",
    "fitness",
    "blender",
    "free workout",
    "free workout videos",
    "workout videos",
    "bodyweight workout",
    "scientific workout",
    "7 minute workout",
    "scientific 7 minute workout",
    "7 minute workout video",
    "7 minute workout app",
    "7 minute workout timer",
    "scientific 7 minute workout video",
    "scientific 7 minute workout youtube",
    "scientific 7 minute workout review",
    "hiit",
    "fat loss workout",
    "fat burning",
    "cardio",
    "hiit workout",
    "cardio workout",
    "at home cardio",
    "total body workout"
  ],
  "publishedAt": "2014-09-29T02:16:14Z",
  "duration": 570,
  "durationFormatted": "9:30",
  "viewCount": 5437288,
  "likeCount": 37630,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Jru5B044HOs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Jru5B044HOs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Jru5B044HOs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Jru5B044HOs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Jru5B044HOs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Jru5B044HOs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I cannot begin to tell you how much this workout has helped me(36 M). I started about 4 months ago and at first I could barely get through it once but since then I&#39;ve started doing it every other day and I&#39;m up to 3X per workout, which takes 26 mins total. For starters I always had issues getting into a workout routine, I&#39;d ride my stationary here and there, shoot some hoops or do some rowing, which are all great but I could never find a good balance for a consistent full body workout. This circuit has given me structure, efficiency and, most importantly, results. When I started doing the workout I was hovering above 200 lb, I&#39;m now sitting below 180, a weight I haven&#39;t even sniffed since I was in my early 20&#39;s. I also had been struggling to squeeze into size 34 pants, but now size 32 is nearly falling off of me, which is also something I haven&#39;t experienced since my early 20s. If you&#39;re interested in the science behind this workout there is a Harvard study on high intensity circuit training (HICT) that is very interesting and is where this circuit originated. One interesting thing I learned from that study is that when you do HICT your metabolic rate is increased for up to 48-72 hours after working out. I&#39;d also like to mention that I DID NOT make changes to my diet, I think I&#39;m generally  a fairly healthy eater but I still indulge just as much as I used to, if not more now because I don&#39;t feel the guilt, I know I&#39;m burning it off even on my rest days. Thank you🙏I highly recommend!!",
    "Hi! I&#39;ve been doing this exercise 4 rounds a day for 4 months. Along with proper diet, I lost 17 pounds and moved from being Obese Type I to having Normal BMI ^_^ Thank you!",
    "Here’s the regimen, in case anyone else likes having it written down!:<br><br>Remember to keep moving during rest phases!<br>It’s okay to modify these to make it easier for you. Just keep up the routine! The harder techniques will become easy if you keep building those muscles in any way that works best!<br><br>30sec Jumping jacks<br>10sec REST<br>30sec Wall sit/static squat<br>10sec REST<br>30sec Push ups<br>10sec REST<br>30sec Crunches (note: do NOT sit up all the way. sit ups aren’t as beneficial as crunches the way she does them in the video)<br>10sec REST<br>30sec Step ups (chair, stair, etc)<br>10sec REST<br>30sec Squats<br>10sec REST<br>30sec Tricep dips (chair behind you, pull yourself up with those back muscles!)<br>10sec REST<br>30sec Plank<br>10sec REST<br>30sec High knees<br>10sec REST<br>30sec Lunges<br>10sec REST<br>30sec Push up + rotation<br>10sec REST<br>30sec Side plank - Side 1<br>10sec REST<br>30sec Side plank - Side 2<br>~ WORKOUT COMPLETE! ~<br>Keep at it! Make this routine just as ordinary as breakfast. This won’t be difficult forever—your muscles will build and learn to be efficient over time. I’m trying to get back into shape, and I wish you just as much luck as I hope to have, myself. Go out there and gain that extra endurance, stranger!",
    "There&#39;s no many versions of this available, but I keep coming back to this one. I think it&#39;s Kelly&#39;s personality and presentation style. It feels like a good friend is talking me through it.",
    "Thanks for your video. It&#39;s very well put together, and so are you! I&#39;m 78 yrs old, and I&#39;m still able to do the exercises to a great extent."
  ],
  "channelSubscriberCount": 6590000,
  "channelVideoCount": 1605
}