{
  "video_id": "jTJSJckA-oY",
  "title": "40 Minute Guided Breathing Meditation for Deep Relaxation and Inner Stillness",
  "description": "To skip intro click here: 00:37\n\nThis is a long 40 minute guided meditation, focussing on using the breath to help you sink beneath distractions into a spacious inner stillness. There's 30 minutes of guided breathing and deep relaxation, followed by 10 minutes of pure stillness. \n\nIf you'd like a shorter version here's a 15 minute version of this meditation: https://www.youtube.com/watch?v=4Undv6MmQeE&feature=youtu.be\n\nYou can sit or lie down...\n\nIf you’re on the floor:\nSit with your legs crossed. Sit on the edge of a big cushion (or a couple of pillows) so that your hips are slightly higher than your knees (this helps keep your back upright and supports your lower back). Rest your hands wherever they feel most comfortable on your knees, thighs or in your lap. \n\nIf you’re on a chair:\nSit with your legs at least shoulder width apart with the soles of your feet flat against the floor (or with your legs crossed meditation style if the seat is big enough and you're comfortable). Sit with your back unsupported or supported by the back of the chair with a cushion in the small of your back. Rest your hands wherever they feel most comfortable on your knees, thighs or in your lap. \n\nLying down:\nLie on your back. If you have any trouble with your lower back try placing a pillow beneath your knees, or lie with your knees bent towards the ceiling and the soles of your feet flat on the surface you're lying on. Rest your hands by your sides, or resting lightly on your lower stomach.\n\nIs it better to sit on the floor, a chair or lie down? - This depends on how you're best able to find a balance between being comfortable and alert. Meditation is a state of both relaxation and focussed attention, so find a position that you will be as comfortable as possible in as well as being able to focus on your breathing without falling asleep (unless you want to of course!).\n\n_______________________________________________________________________\n\n\r\r\rThanks for listening. Subscribe for more guided meditations and breathing practices. \n\nYou can support by hitting the like and subscribe buttons, commenting below or by becoming a patron...\nPatreon: https://www.patreon.com/carolinemccready​\n\nFor more resources visit http://www.carolinemccready.com\n\n\nOriginal music and vocal by Caroline McCready.\nCopyright 2019 - Caroline \rMcCready all rights reserved",
  "channelTitle": "Caroline McCready",
  "channelDescription": "Caroline McCready has been teaching and guiding meditation practices since 2011. She focuses on deep relaxation, breath work and gentle guidance to lead the mind into a natural state of effortless focus and stillness. \n\nFor more information and resources visit: http://www.carolinemccready.com",
  "tags": [
    "Meditation",
    "Relaxation",
    "Breathing meditation",
    "Guided meditation",
    "Relaxing meditation",
    "Full-body relaxation",
    "Sleep",
    "Anxiety",
    "Mindful",
    "Breath",
    "Breathing",
    "Yoga meditation",
    "breathe",
    "stillness",
    "calm",
    "english accent",
    "female voice",
    "40 minute",
    "45 minute",
    "long",
    "soft meditation",
    "gentle meditation",
    "40 minutes",
    "deep meditation",
    "deep relaxation",
    "40 minute meditation",
    "relaxation meditation",
    "stillness meditation",
    "anxiety meditation",
    "ASMR",
    "arms",
    "soothing meditation",
    "stress booster",
    "british",
    "stress-relief"
  ],
  "publishedAt": "2019-12-04T11:21:03Z",
  "duration": 2430,
  "durationFormatted": "40:30",
  "viewCount": 475772,
  "likeCount": 4924,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/jTJSJckA-oY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/jTJSJckA-oY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/jTJSJckA-oY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/jTJSJckA-oY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/jTJSJckA-oY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/jTJSJckA-oY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I was in such an intense state of terror, dread, doom and despair this morning! Thank you sooooooo very much for helping me let go and replace all that misery with calmness, peace.",
    "You undoubtedly have the BEST guided meditations on the entire YouTube. Your voice and approach is unlike any other, I&#39;ve been scouring the entire Internet for someone that does it like you, finally. THANK YOU and please make more!",
    "I taught this was gonna be terrible and boring, tried it and it was excellent, and great for emptying the head of worries.",
    "I was really tense and searched for an extensive breathing session. Found your channel and followed this videos instructions and I felt much more relaxed and calm afterwards. You have a very relaxing voice and the sound of the video itself was calming too. Thank you very much.",
    "I was up half the night and was a wreck. Found this, and how lovely, I felt totally restored after listening, me and the dog on the couch. Wonderful."
  ],
  "channelSubscriberCount": 88700,
  "channelVideoCount": 39
}