{
  "video_id": "jtYZDrYL634",
  "title": "Yoga for Complete Beginners - Ep. 1  | Easy 10-Min Full Body Routine",
  "description": "📣 Join my 7-Day Sexual Wellness for Men Challenge for FREE! No credit card required, link to sign up below: https://shrtlnk.co/uA27H\n\n- Here’s a workout made for complete beginners. 10 minutes. Easy to follow. Proper technique instruction, modifications for the inflexible. \n\nThis is a 10-minute full body yoga routine created for men completely new to yoga. This routine goes slowly through proper technique, breathing, and key information for each pose. It also includes modifications to help those who are new or inflexible get the intended benefits. Dialogue is encouraging and focused on building you up, to give you confidence to keep doing these workouts consistently. \n\nThis workout is part of the Yoga for Complete Beginner Series, featuring easy-to-follow, beginner-focused routines demonstrating appropriate modifications for men who are new to yoga and / or inflexible, as well as proper technique instruction to help you maximize the benefits and avoid the negative effects of improper technique. There are a total of 6 workouts in this series.\n\nOther Videos Mentioned: 30 Minute Workout | Yoga for Men Series - Workout #1 | https://youtu.be/HzznoIsFsj8\n\nTimestamps:\n00:00 - Introduction\n00:35 - Low Lunge\n05:45 - Supported Side Bend\n08:58 - Standing 1-Leg Balance\n13:00 - Closing Notes\n\n📣 Join our FREE 7-Day, Beginners Yoga Challenge - No Flexibility Required! |  Click Here to Get Your Free Yoga Workouts -  https://shrtlnk.co/CB89C\n\n👉 WELCOME to your yoga for men channel by Man Flow Yoga.  Man Flow Yoga was made for guys who are new to yoga, who aren’t flexible and want a more effective workout. \n\nOur workouts are non-spiritual and designed to help men at all levels build mobility, flexibility, and strength.  😍 SUBSCRIBE! We upload a new video every week:: http://bit.ly/2vDQ6dz\n\n💪 YOGA FOR MEN SERIES PLAYLIST: http://bit.ly/MFY6yfm\n💪 BEGINNER VIDEOS PLAYLIST: http://bit.ly/MFYbegvid\n\nMORE MAN FLOW YOGA: \n▶︎ Try Man Flow Yoga for free with our 7-Day Trial  -  https://shrtlnk.co/4krS1\n▶︎ $40 off our Man Flow Yoga Cork Yoga Mat & Block Bundle |  Use code \"MFYGEAR\" - https://shrtlnk.co/iImuH \n▶︎  Facebook: /manflowyoga\n▶︎  Instagram: @manflowyoga\n\n#yogaformen #mensyoga #yogaforbeginners #yoga",
  "channelTitle": "Man Flow Yoga",
  "channelDescription": "Hello! Welcome to Man Flow Yoga. My name is Dean Pohlman - author, yoga instructor, & athlete.\n\nMan Flow Yoga was made for guys who are new to yoga, who aren’t flexible, and want a more effective workout.\n\nIf any of the following applies to you -\n- Life got in the way of your fitness.\n- You’re inflexible and yoga is intimidating.\n- I’m scared I’m not going to use proper technique and hurt myself.\n\nAnd if you’re looking for a workout, not chants or gongs.\n\nI’ve got you.\n\nTo get started, check out the following playlists on this channel:\n- The Yoga for Men Series\n- The Strength Foundations Course (My Most Popular Program!)\n-  Yoga for Beginner’s Series\n\nGet started TODAY! Follow along to a workout at home. Use whatever you have lying around the house - no equipment required.\n\nFor structured programs and more workouts, I invite you to join me on the Man Flow Yoga website at manflowyoga.com/join\n\nEnjoy the Channel!\nDean\n\nPS - Learn more about me here: http://manflowyoga.com/about-us",
  "tags": [
    "yoga for beginners",
    "beginner yoga",
    "yoga for complete beginners",
    "yoga workout",
    "morning yoga for beginners",
    "yoga for beginners at home",
    "yoga for weight loss",
    "beginners yoga",
    "yoga beginners",
    "yoga exercises",
    "10 minute yoga",
    "yoga for men workout",
    "yoga for athletes",
    "yoga for beginners mind",
    "yoga for beginners flexibility",
    "yoga for beginners men",
    "beginner yoga workout",
    "beginner yoga at home"
  ],
  "publishedAt": "2023-10-10T14:00:33Z",
  "duration": 813,
  "durationFormatted": "13:33",
  "viewCount": 320166,
  "likeCount": 8426,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/jtYZDrYL634/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/jtYZDrYL634/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/jtYZDrYL634/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/jtYZDrYL634/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/jtYZDrYL634/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/jtYZDrYL634\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "📣 Join our FREE 7-Day, Beginners Yoga Challenge - No Flexibility Required! |  Click Here to Get Your Free Yoga Workouts - <a href=\"https://shrtlnk.co/xM27p\">https://shrtlnk.co/xM27p</a>",
    "I’m a 25 year old male that works 7 days a week currently. Finally requested a full day off, and I spent my morning doing stretches. Just basic stretching gave my body so much relief, especially in my back and legs. This routine fit perfectly with my stretches. I recommend this to anyone recovering from injury, and more importantly to anyone that deals with work related stress. This has given me so much peace in a short amount of time, and I feel very satisfied after doing something physical.",
    "Struggling with injury, confidence and finding yoga that&#39;s accessible, boom found you😊❤",
    "Finally a yoga video without annoying music. Love it.",
    "This was my first time trying this and I absolutely love it.  I&#39;m looking forward to being consistent.  Thank you for all that you do and offer."
  ],
  "channelSubscriberCount": 551000,
  "channelVideoCount": 1438
}