{
  "video_id": "Jyy0ra2WcQQ",
  "title": "Guided Meditation - Blissful Deep Relaxation",
  "description": "This guided meditation will gently ease you into a state of blissfully deep relaxation. Join our community/see our products: https://www.thehonestguys.co.uk/products\n\nThis MP3 available here:  https://www.thehonestguys.co.uk/digital-downloads/blissful-deep-relaxation1\n\n____________________________________\n\nTHE HONEST GUYS\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, meditation and sleep, without ever having to try.  In particular, we cater to anyone who is turned-off by the idea of \"meditation\", but still want to reap the massive health benefits, that meditation can bring. We offer this through high-quality audio productions, called 'guided visualisations'. These include sleep talk-downs, meditations, wonderful fantasy imagery and stories. \n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nIf you enjoy our work and would like to support the channel, please consider purchasing one of our high-quality products: https://www.thehonestguys.co.uk/products\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n____________________________________\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n\n___________________________________\n\nMusic by Kevin Macleod (incompetech.com)\n\n#guidedmeditation #guidedvisualisation #deeprelaxation #thehonestguys",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "guided meditation",
    "guided",
    "meditation",
    "deep",
    "relaxation",
    "guided relaxation",
    "law",
    "of",
    "attraction",
    "deep relaxation",
    "meditations",
    "affirmations",
    "ocean waves",
    "i'm stressed",
    "can't sleep"
  ],
  "publishedAt": "2011-03-09T16:27:27Z",
  "duration": 1116,
  "durationFormatted": "18:36",
  "viewCount": 24596491,
  "likeCount": 115668,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Jyy0ra2WcQQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Jyy0ra2WcQQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Jyy0ra2WcQQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Jyy0ra2WcQQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Jyy0ra2WcQQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Jyy0ra2WcQQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "<b>To the people who read this, may you have a good sleep, good appetite, good day, good mood, good luck, and a good life</b> ☺",
    "Listening at <a href=\"https://www.youtube.com/watch?v=Jyy0ra2WcQQ&amp;t=1290\">21:30</a> on what&#39;s been the worst day so far however in spite of being unproductive, suicidal, unemployed, lonely, depressed, angry etc I will not give up. I am worthy of living. I am worthy of better. I am worthy of peace.",
    "Whoever comes across this message, may your heart radiate with all the colors that you are. You are a blessing to this earth. Believe in yourself 😊",
    "This comment section warms my heart. We are all going through hard times yet we are so kind and beautiful. Sending love and strength to you all ❤️",
    "It’s really hard for me to meditate because of PTSD. I really want to meditate. I just listened to this and oh my god. When you counted down to 0... I swear, something came over me. I was filled with light and laughter and felt so relaxed. I have tried so many times to meditate and I have not been successful until this video. Wow. Thank you. <br><br>Also- for anyone who struggles staying calm for this long. After I was in this peaceful state for about one minute, I started to freak out for a second. And I just told myself “I deserve peace. I deserve calm. It is okay to be happy. It is safe in peace. I am safe in peace. There is nothing to worry about here.” And that really helped me get back into meditation. Maybe that will help someone else !"
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}