{
  "video_id": "Jzgqjb16Oek",
  "title": "The PERFECT 10 Minute HIIT Cardio Workout To Lose Fat (Gym or Home)",
  "description": "Unfortunately, HIIT has been abused by the fitness industry and used totally out of context. Most HIIT workouts you’ll find on the internet and probably experimented with are not true HIIT and won’t deliver the unique benefits that HIIT has to offer. In today’s video though, I’ll show you how to design a true HIIT workout for you to use. It doesn’t matter if you have access to equipment or not; my example HIIT workout is suitable for use at home with no equipment or at the gym. Plus, I’ll also go through how to properly implement a HIIT workout to maximize your results (e.g. if you’re looking for fat loss) with the routine. \n\nMaintaining a high enough intensity and an elevated heart rate is by far the single most important factor there is when performing HIIT. To ensure you’re working hard enough, first, get your heart rate to around at least 85% of your max heart rate. Second, during your rest intervals, keep moving at a moderate intensity. This will not only help increase your overall oxygen consumption which ultimately leads to more calories burned and greater physiological improvements, but will also ensure that your average heart rate remains high enough throughout the whole HIIT session.\n\nThere’s no set protocol for a HIIT workout, nor is there a perfect ratio for your work:rest intervals. That said, the research indicates that a 2:1 work:rest ratio may be the most time efficient. But, keep in mind that your current level of fitness will govern what work:rest ratio is most appropriate for you. But intensity is what’s most important. Something like a 1:2 work:rest ratio (e.g. 30 second sprint with 1 minute brisk walk in between) would be a good starting point, which can eventually be progressed to a 1:1 work:rest ratio (e.g. 30 second sprint with 30 second brisk walk in between),  and then even a 2:1 work:rest ratio if appropriate (e.g. 30 second sprint intervals with a 15 second brisk walk in between). \n\nIf you’re at the gym, a simple yet effective option are sprints on an exercise bike. But you can essentially use any modality you have available (rowing machine, assault bike, treadmill) and perform your HIIT workout on that. For rest intervals, you would simply perform that exercise at a slower pace. Now if you’re performing your HIIT workout at home with no equipment, then all you need is your bodyweight. In addition to burpees, other effective bodyweight exercises include squat jumps, jump lunges, running in place, mountain climbers, jump rope, star jumps, and shadow boxing. Avoid using strength training exercises as they make it tough to reach your target heart rate safely. \n\nThe duration of your workout and how many rounds you want to commit to ultimately depends on your goals and why you’re doing HIIT. If you’re trying to improve or maintain your cardiovascular fitness: a HIIT workout as short as 8-minutes with a 1:1 work:rest ratio is adequate. But if you’re performing a HIIT workout for fat loss, then you’re going to need to work a little longer since HIIT was primarily designed to increase performance rather than shed belly fat by burning a ton of calories. \n\nHere are 2 examples of how to structure your HIIT workout - both using a 1:1 work to rest ratio. Feel free to tweak the work:rest ratio and durations to better suit your fitness levels.\n\n10-Minute Home HIIT Workout \n\nWORK - Burpees: 1 Minute\nACTIVE REST* – 1 Minute\nWORK - Mountain climbers: 1 Minute\nACTIVE REST – 1 Minute \nWORK - Squat Jumps: 1 Minute\nACTIVE REST – 1 Minute \nWORK – Running in place: 1 Minute\nACTIVE REST – 1 Minute \nWORK – Jump Rope: 1 Minute\nACTIVE REST – 1 Minute\n\n*Can jog in place or perform light jumping jacks\n\n10-Minute Cycling Workout\n\nWORK – High Intensity Cycling: 1 Minute\nACTIVE REST – Light Cycling: 1 Minute\nRepeat x5\n\nAs for how often to do these HIIT workouts, generally, I’d recommend between 1-3 times per week, as they are quite intense and will require adequate recovery. But all in all, I hope you were able to see what a true HIIT workout really entails and how to structure one based on your needs. Just keep in mind though that when it comes to transforming your body, HIIT is just one tool in the toolbox and has its place. But knowing how to also properly incorporate steady state cardio, weight training sessions, and your nutrition into your overall plan is what’s key to transforming your body as efficiently as possible. And for a step-by-step program that uses science to guide you every step of the way to a lean, muscular physique then take the analysis quiz to discover which science-based program would be best for you and where your body is currently at below:\nhttps://builtwithscience.com/bws-free-fitness-quiz/gender?utm_source=Youtube&utm_medium=Video&utm_content=Description%20box&utm_campaign=10%20minute%20hiit%20to%20lose%20fat%20Mar%2021%2F2021\n\nSubscribe to my channel here:\nhttps://www.youtube.com/jeremyethier/?sub_confirmation=1\n\nMUSIC: https://soundcloud.com/iamryanlittle",
  "channelTitle": "Jeremy Ethier",
  "channelDescription": "This channel is focused on providing science-backed training and nutritional videos in order to help you become the best version of yourself. I'm certified by NASM and FMS (functional movement screening), and a Kinesiology graduate based in Vancouver, Canada. I focus on providing unbiased information to help you optimize your training and nutrition.",
  "tags": [
    "HIIT",
    "HIIT workout",
    "HIIT workout for fat loss",
    "HIIT workout at home",
    "how to HIIT workout",
    "how to HIIT train",
    "how to HIIT exercise",
    "how to do HIIT",
    "HIIT cardio workout",
    "HIIT workout for beginners",
    "HIIT workout with weights",
    "HIIT workout no equipment",
    "high intensity interval training",
    "HIIT cardio",
    "cardio HIIT",
    "HIIT workouts",
    "home hiit workout",
    "cardio workout",
    "hiit for fat loss",
    "best cardio workout",
    "bodyweight workout",
    "fat loss workout",
    "jeremy ethier",
    "built with science"
  ],
  "publishedAt": "2021-03-21T17:19:21Z",
  "duration": 658,
  "durationFormatted": "10:58",
  "viewCount": 639029,
  "likeCount": 23288,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Jzgqjb16Oek/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Jzgqjb16Oek/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Jzgqjb16Oek/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Jzgqjb16Oek/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Jzgqjb16Oek/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Jzgqjb16Oek\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hope you enjoyed this one! Here&#39;s the written article for those interested: <a href=\"https://builtwithscience.com/perfect-hiit-workout/\">https://builtwithscience.com/perfect-hiit-workout/</a> . Have fun! ;)",
    "“For rest even slow jumping jacks work” bruh. Slow jumping jacks is how I used to get my heartrate up",
    "I utilize longer rest periods with a 30 second work and a 1 year rest.",
    "This guy reads my mind and then uploads a video",
    "My favourite form of HIIT is doing sprinting. I sprint from 1 end of a football pitch to the other and walk back, and then repeat. Around 10 minutes is all it takes. I also like doing high knees with a 20 on, 10 off approach. 😊"
  ],
  "channelSubscriberCount": 7100000,
  "channelVideoCount": 301
}