{
  "video_id": "k5N3BqLHMKI",
  "title": "20-Min Interval Run + Giveaway! | Burn 1000+ Calories",
  "description": "★ Try Our NEW 20min Interval Treadmill Run: https://youtu.be/Ggub5uUtG-U\n\n👉 START HERE:  Get our FREE 7-Day Health Transformation Video Guide: https://bit.ly/3TkucrN\n\n🥗 NEW! Join The EatMoveRest Club (for instant access to our Meal Planner & recipe app, entire ebook collection, private Facebook community, and so much more)!: https://membership.eatmoverest.com\n\n\nThis workout is inspired by Orange Theory treadmill workouts. Visit OrangeTheory.com to find a studio near you! *Not sponsored \n\nEspecially during this quarantine, home health and fitness is of utmost importance. That's why we've teamed up with Bowflex to bring you guys a 20-minute high intensity interval training workout on our BXT216 Treadmill AND we're going to give one away! \n\nHere are the giveaway entry rules:\n\n1. Give this video a thumbs up and share it with one other person.\n2. Follow all 3 accounts on Instagram: @ErinStanczyk @DBStanczyk @Bowflex\n3. Comment on BOTH of our Instagram posts WHY you'd benefit from winning your very own treadmill!\n★ Erin: https://bit.ly/3c9kakz\n★ Dusty: https://bit.ly/2VfJej6\n\n* Continental US only. Winner will be announced on Saturday Apr 18 @ 10am Central on Instagram Stories!\n\n➤ Shop More Bowflex Equipment (use discount code EATMOVEREST): http://bit.ly/2lEpzvC\n\nEatMoveRest Your Best, \n♥ Erin & Dusty\n\n#fitfam #treadmill #homeworkout\n-------\n\n★ EatMoveRest 1st Bali Retreat (Plant-based, All-Inclusive, Full-Immersion, 7-Day (date: October 2020): http://bit.ly/3aiFCCJ\n\n★ EatMoveRest 3rd Annual Costa Rica Retreat (Plant-based, All-Inclusive, Full-Immersion, 7-Day (next date: March 2021): EatMoveRest.com/costarica\n\nCheck out Erin's website and blog at https://www.EatMoveRest.com for more info on coaching services, as well as delicious and nutritious plant-based recipes, workouts, and rest & relaxation techniques. \n\nBe sure to joint the EatMoveRest Fam and subscribe to the email list to receive a FREE \"How To Go Vegan\" PDF + Members Only Wellness Webinar discount. In your inbox, you'll also find the monthly motivational \"In The Raw\" newsletter, including product discounts, exclusive content, announcements, and more!\n\n-------\n\n➤ More Home Workouts: http://bit.ly/36sx1eN\n\n➤ More Raw & Vegan Recipes: https://eatmoverest.com/archives \n\n➤ More Plant-based FAQ: https://www.eatmoverest.com/faq\n\n-------\n\nSUPPORT US! \nYour support helps us to create more frequent & higher quality content!\n\n★ Shop Our Amazon Store: https://www.amazon.com/shop/eatmoverest\n\n★ Shop Erin's LiketoKnow.it Styles: https://www.liketoknow.it/Erin%20Stanczyk\n\n-------\n\nFOLLOW US:\n\n★ Instagram: http://www.instagram.com/ErinStanczyk \nhttp://www.instagram.com/DBStanczyk\n\n★ Snapchat: ErinStanczyk DBStanczyk \n\n★ Facebook: http://www.facebook.com/EatMoveRest\n\n★ Pinterest: http://www.pinterest.com/ErinStanczyk \nhttp://www.pinterest.com/DBStanczyk \n\n★ Twitter: http://www.twitter.com/ErinStanczyk\nhttp://www.twitter.com/DBStanczyk\n\n★ Spotify: https://open.spotify.com/user/erinstanczyk\n\n★ Blog: http://www.eatmoverest.com/blog\n\n★ Coach, Connect, Collaborate:\nhttp://www.eatmoverest.com/contact\n\n-------\n\nOUR PHOTO/VIDEO GEAR:\n\n☀ Sony Alpha Mirrorless Camera: https://amzn.to/2Qw11PR\n\n☀ 30mm Lens: https://amzn.to/2NOWKZa\n\n☀ 50mm Lens: https://amzn.to/2CYcPry\n\n☀ 19mm Lens: https://amzn.to/2NjhSYp\n\n☀ GoPro: https://amzn.to/2NdxSuO\n\n☀ GoPro Accessories: https://amzn.to/2MFkvi0\n\n☀ Drone: https://amzn.to/2NdxrR2\n\n☀ Mics: https://amzn.to/2MyYBN7 https://amzn.to/2pc28b6\n\n☀ Lights: https://amzn.to/2Oq2Kou https://amzn.to/2D0qSg1\n\n☀ Tripods: https://amzn.to/2MA5PAD https://amzn.to/2Op8FtP\n\n☀ Batteries: https://amzn.to/2D0r0Mx https://amzn.to/2NdtsEa",
  "channelTitle": "EatMoveRest - The Stanczyks",
  "channelDescription": "🌟 ON SALE NOW! The Happy Healthy Plant-Based Cookbook - Get Your Copy at EatMoveRest.com/book\n\nThere are three things we all do every day, and we could all be doing them better: Eat Move Rest! 🥗🏃‍♀️💤 Eat more plants, move your body daily, and get adequate rest--it's as simple as that!\n\nDusty & Erin Stanczyk combined their formal education in Communication Studies and Biology, coupled with their passion for health & wellness, to create their health & lifestyle coaching business, EatMoveRest. The couple specializes in what they like to call \"Lifestyle Design.\" Through one-and-one and group coaching, workshops, retreats, and their social media presence, Dusty and Erin's mission is to help others realize their fullest potential and become the best version of themselves!\n\nBe sure to Subscribe, share with friends, and visit EatMoveRest.com for more!",
  "tags": [
    "EatMoveRest",
    "health",
    "healthy",
    "fitness",
    "exercise",
    "vegetarian",
    "vegan",
    "plant-based",
    "raw food",
    "raw vegan",
    "Christian",
    "Midwest",
    "Nebraska",
    "marriage",
    "parenting",
    "motherhood",
    "pregnancy",
    "postpartum",
    "all natural",
    "holistic",
    "whole foods",
    "cooking",
    "juicing",
    "wellness",
    "inspiration",
    "love",
    "mom",
    "baby",
    "treadmill",
    "givewaway",
    "home workout",
    "home fitness",
    "run",
    "running",
    "HIIT",
    "high intensity",
    "interval training",
    "cardio",
    "calorie burn",
    "burn calories",
    "sweat",
    "workout",
    "sculpt",
    "tone",
    "weight loss",
    "Bowflex",
    "sprint",
    "jogging",
    "Orange Theory",
    "race",
    "marathon",
    "fit"
  ],
  "publishedAt": "2020-04-11T15:30:33Z",
  "duration": 1478,
  "durationFormatted": "24:38",
  "viewCount": 918969,
  "likeCount": 14101,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/k5N3BqLHMKI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/k5N3BqLHMKI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/k5N3BqLHMKI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/k5N3BqLHMKI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/k5N3BqLHMKI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/k5N3BqLHMKI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "As an exercise physiologist with 27 years of experience - thought I would explain exactly how to do HIIT without someone killing themselves since everyone has a different level of exercise tolerance.<br><br>Step 1. Have a heart rate monitor that uses a chest strap or one that goes on the bicep so you can track your heart rate during the workout.<br><br>Step 2. Check your baseline morning resting heart rate before starting. Example - 70bpm.<br><br>Step 3. Subtract your age from 220 to get your estimated maximum heart rate. Example - 35 years of age -220=185bpm. <br><br>Step 4. Warm up for 5-10 minutes to allow time for your muscles to create heat and blood vessels to dilate. <br><br>Step 5. Get off the treadmill, elliptical, or stationary bike and then stretch.<br><br>Step 6. Get back on the exercise equipment and start at a comfortable pace for 1 minute.<br><br>Step 7. Start exercising at a moderate pace but use resistance or an incline over speed to exercise the working muscles. Doing this will create an oxygen deficit and you will feel the muscles burn due to lactic acid buildup without having to go so fast to cause injury to joints. Example, steep incline on treadmill can even be walked at a fast pace and still achieve the goal, especially if you are extremely overweight because the last thing you want to do is pound your joints and injure yourself. Running is okay too if you are acclimated to running, but you might have a price to pay when it comes to your joints as you get older! Keep that in mind!<br><br>Step 8. The goal for this 1st round is to get your heart rate to 140bpm considering your maximum heart rate is 185bpm OR if your legs burn so badly you cannot continue the exercise to achieve that heart rate of 140bpm OR if you are totally out of breath! <br><br>Step 9. Decrease the resistance or incline and slow down to a comfortable pace to allow for the lactic acid to be flushed from your muscles and allow your heart rate time to recover back to 25-40bpm above your morning resting heart rate (95 to 110), OR 40bpm below your exercise heart rate which in this case your recovery target HR would be 100bpm. Have a second hand clock in plain view so you can see how long it takes for you to recover from this 1st round and we will use that time as your baseline recovery time. Let&#39;s assume it took 60 seconds for your heart rate to recover from 140bpm to 100-110bpm or so. This is very individualized and it may take even longer if you are not physically fit and/or have not exercised in a long time.<br><br>Step 10. Get ready for round 2 by repeating step 7, but this time you will continue until your heart rate reaches 150bpm and then slow down, decrease incline or resistance, etc. and take note of when you begin the recovery phase. Let&#39;s say it took you 60 seconds to recover from 150bpm to 110bpm. <br><br>Step 11. Get ready for round 3 by repeating step 7, but this time you will continue until your heart rate reaches 160bpm and then slow down. NOTE: If you are doing this step properly, you should reach your target heart rate within 30 seconds or less in some cases. If it takes you longer than 30 seconds to achieve your target heart rate of 160bpm, then you are not working out hard enough.<br><br>Step 12. Once you achieve 160bpm take note of the clock and see how long it takes you to recover. If it still takes 60-75 seconds to recover back to your baseline of 120bpm then you are ready to do round 4, but this time your target heart rate will be 170bpm.<br><br>Step 13. Get ready for round 4 by repeating step 7, but this time you will increase the resistance, incline, and/or speed so that you are able to achieve your target heart rate of 170bpm within 20 seconds. Decrease exercise and take note of the clock so you can monitor your recovery time. If it still takes 60-75 seconds to recover to 40bpm less than your exercise HR then you can proceed to round 5.<br><br>Step 14. Get ready for round 5 by repeating step 13 except this time your target heart rate will be 180bpm - 5 beats less than your maximum heart rate. You should achieve this heart rate within 20 seconds if you are exercising at the proper pace, resistance, incline, etc.. Decrease exercise and take note of the clock. If it takes 60-75 seconds to recover 40bpm less than your exercise HR, then you can do another round by repeating step 14. <br><br>When are you done? <br><br>1. Whenever it takes more than 75 seconds for your heart rate to decrease 40bpm less than your exercise HR which would be 140bpm in this example.<br><br>2. If your leg muscles are not clearing lactic acid within that time-frame. In other words, your leg muscles are hurting/burning after 75 seconds during the recovery phase. YOU MUST go by how you feel, BUT your heart rate is your best indicator for how stressed your body is. If you continue pushing yourself and it takes 2 minutes to recover back to baseline then you are headed for disaster. Why? Your body will start to increase stress hormones which then puts your body into fight or flight mode activating the sympathetic nervous system. You never want to activate that system and beginners are especially vulnerable so please use caution if you are a beginner at this!<br><br>3. You are exhausted or feeling nauseous, etc.<br><br>4. You have completed a maximum of 20 rounds.<br><br>COOL DOWN and STRETCH: Make sure you cool down for at least 2-5 minutes or until your heart rate returns to below 100bpm if possible. If you pushed yourself too hard it will take several minutes for your heart rate to recover below 100bpm. Stretch lightly as well. DONE!<br><br>How often can you do HIIT? Most people can do HIIT every other day. However, if your morning resting heart rate is 10bpm higher than your average, then skip exercise for that day. The best way to track daily recovery is HRV (Heart Rate Variability). Tracking HRV prevents over-training! I personally use ithlete.<br><br>Every person is different! Some well conditioned athletes might do 20 rounds, while someone just starting out might only do 2-3 rounds, if that.<br><br>The key here is to increase 10bpm every round so the heart acclimates and allows time for blood vessels to dilate even more. Failure to do this puts an extreme amount of exertion on the heart and cardiovascular system and can result in an infarction and/or stroke, especially in older individuals or people who have underlying health conditions. Always consult with your physician for clearance before starting any exercise program, especially if you have been sedentary for years and/or if you are extremely overweight. <br><br>If you have arthritis or other inflammatory diseases you should have your physician check your interleukin inflammatory markers, TNF-alpha, and Lp-PLAC2. If you have endothelial dysfunction combined with vulnerable plaques AND inflammation, then refrain from doing HIIT whatsoever until your markers are under control and your health improves. Failure to do this could result in ruptured plaques which would result in infarction, stroke, and/or embolism and could be fatal. <br><br>NOTE: DO NOT do HIIT if you have just eaten a high fat meal or you RISK DEATH, especially if you have underlying cardiovascular issues. Why? Because blood goes to your stomach to digest the food you ate and if you ate fats with carbohydrates you will have a significant amount of lipids in your blood which results in THICK BLOOD that cannot circulate as efficiently. Combine thick blood with restricted blood vessels and a very fast heart rate while exercising and you are asking for trouble! <br><br>CAUTION: If at any time during the HIIT exercise you feel nauseous, faint, dizzy, or chest pain - STOP immediately and consult with your physician.<br><br>I know this may sound complicated and a little scary, but it&#39;s the correct way to do HIIT without injuring yourself and as a professional I tend to use extreme caution when working with people.<br><br>Wait at least 4 hours after eating before you do HIIT or do so first thing in the morning about an hour after a very light breakfast or on an empty stomach in some cases. Sorry for all the info, but it varies so much depending on the individual person and I hate to see someone get hurt. In any case I hope this helps someone.",
    "I’m 60 kg on 5 July, and now my weight is 56,3 kg on 20 July! I do this exercise 4 times a week combines with consuming lot of fruit (cherry tomatoes!) and vegetables, as a note, I am not feeling hungry at all! As my job requires 7 hours a day and have to take care of my sisters, this workout is fantastic.",
    "After finishing the last sprint, I cried! I never cried after a workout and it feels like such a breakthrough. Working out has always been so hard for me, this workout really pushed me and I feel so good about it. Thank you! I’ll be adding this to my routine, thank you so much",
    "As a registered nurse who has to be at work by 6:30am, I would LOVE this treadmill! Waking up early around 4am to run in the dark outdoors is not the safest thing for me! I’d love to be able to run indoors at my house! 🤩 Y’all are awesome!  Liked and shared with friends and family! 💗🥳",
    "Update... Lost 4kilos with this routine during six weeks. THANK YOU and cheer up everyone, you got this!"
  ],
  "channelSubscriberCount": 170000,
  "channelVideoCount": 595
}