{
  "video_id": "klmBssEYkdU",
  "title": "The BEST way to start your day!  |  10-Minute Morning Yoga",
  "description": "In this quick but extremely beneficial routine, we will release tension, clear the mind, and connect to what matters most. Take 10 minutes to start the day on the right foot for better mental, emotional, and physical health. \n\nStretch out stiffness, let’s energize for the day ahead! You won’t regret it. \n\n- - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "morning yoga",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne"
  ],
  "publishedAt": "2022-06-06T09:00:10Z",
  "duration": 665,
  "durationFormatted": "11:05",
  "viewCount": 6934313,
  "likeCount": 84812,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/klmBssEYkdU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/klmBssEYkdU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/klmBssEYkdU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/klmBssEYkdU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/klmBssEYkdU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/klmBssEYkdU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Absolut best way to start my day &lt;3",
    "53 years old. Just did my very first yoga session here. Lots of pain. My teenage daughter and wife took great delight in my groans and moans. I feel very good, and I like the way you have described everything. I have committed to doing yoga every morning this week as a way of becoming more healthy.",
    "Please, Adrienne, I would dream of having a 30 days challenge of 10 min morning routine. This one is gorgeous and 10 min would be perfect to create a new yoga habit",
    "My dad told me last night that he has cancer in all of his lymphnodes. He told me that all he can do to beat it is; stay strong. So my word today was strength. When we circled back to the word and I realized how strong I need to be, I cried in happiness. I can do it. Thanks for your videos Adriene!",
    "Here I send an explosion of LOVE  to everyone reading this. <br>You are WORTHY, you are LOVED and you are full of LIGHT. <br>I am going through a difficult period trying to find myself again, so if anyone here feels the same, know that YOU GOT THIS."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}