{
  "video_id": "KNeqD-U-KVg",
  "title": "15 MIN FULL BODY STRETCH - For Rest Day, Improve Mobility & Flexibility, Follow Along Style",
  "description": "Stretch and recover with this follow along 15 min Full Body Stretch. We need to remember to recharge our bodies and mind, because it's so important if we want to keep growing! I hope you enjoy this, and feel grateful for your beautiful body ♡ \n\n📱 My workout APP has a new design and lots of exclusive workouts, sign up to my Grow with Anna APP today: https://www.growwithanna.com/\n\n▸ Focus: Recovery & Mobility\n▸ Time: 15 Minutes\n▸ No Equipment\n▸ 50 sec on, 10 sec off to change to the next stretch \n\nPlease remember that we are all different and that you can make this your own workout ♡ Take a longer break when you need to.\n\n♡ Sign up to the Team Grow Newsletter: https://manage.kmail-lists.com/subscriptions/subscribe?a=VLsDDa&g=WikyFT\n\n♡ Join the OFFICIAL TEAM GROW Community Group: https://www.facebook.com/groups/teamgrowsupport/\n\n♡ My WITHINGS ScanWatch: Bit.ly/WITH-TEAM-GROW\n\n♡ My @KorodrogerieDe  DISCOUNT CODE: GROW\n\n♡ My Amazon Storefront: https://www.amazon.de/shop/growingannanas \n\n♡ The Gear I Use:\nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n♡ SUBSCRIBE: http://bit.ly/2QLvpXn\n♡ Instagram: http://bit.ly/2ZSdHFR\n♡ Facebook: http://bit.ly/2SVkgpE\n\n♡ My Music: \n🎵 Music licensed from Lickd. The biggest mainstream and stock music platform for content creators. https://go.lickd.co/growingannanas \nDancing On My Own by Calum Scott, https://lickd.lnk.to/RNhsiRID License ID: GjydQaVeXEp. \nJust Like A River Does by Birdy, https://t.lickd.co/agGgwVgpGZL License ID: B0rvXNA0w4N\n\nhttps://www.epidemicsound.com/referral/gw5avz\n\n#growingannanas #growwithanna #homeworkouts #hiitworkout\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "15 min stretch",
    "15 min full body stretch",
    "stretch and recover",
    "rest day stretch",
    "growingannanas stretch",
    "grow with anna app",
    "growingannanas",
    "stretch for sore muscles"
  ],
  "publishedAt": "2024-05-20T01:00:06Z",
  "duration": 919,
  "durationFormatted": "15:19",
  "viewCount": 1171847,
  "likeCount": 17007,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/KNeqD-U-KVg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/KNeqD-U-KVg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/KNeqD-U-KVg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/KNeqD-U-KVg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/KNeqD-U-KVg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/KNeqD-U-KVg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I took 2 weeks off from ur workouts cause I was EXTREMLY filled with exams, like I would study 24/7, now when most of my final exams are over, i finally have time again!! See you on the mat. 💯💥",
    "I was always insecure about my self cuz my classmates always body shamed me because a was a little chubbier than them but I don’t know how doing these exercises and stretching makes me forget the insecurity and develops my self esteem and makes me love my self more and more ❤",
    "Here for anyone who needs it: <br><br>1. Hip rotations <br>2. Butterfly stretch <br>3. Lunge + push knee out (right) <br>4. Pigeon pose (right) <br>5. Lunge + push knee out (left) <br>6. Pigeon pose (left) <br>7. Downward dog <br>8. Hamstring stretch (right) <br>9. Hamstring stretch (left) <br>10. Cobra ab stretch <br>11. Quad stretch (right) <br>12. Quad stretch (left) <br>13. Camel stretch <br>14. Forward fold <br>15. Chest opener <br><br>😄 have a great day ❤️<br><br>edit: stop replying pls :(",
    "I’ve done this full body stretch for one month straight and let me say omggg!!! The improvement in my flexibility is insane !! This is coming from someone who’s had stiff joins due to an illness, but I’ve healed and this after my exercise was just everything ! It calmed down my body ( Inhale w ur nose and exhale w ur mouth for better breathing ) and like I can literally move my body around so freely! Like ofc at the beginning it was hard to hold but after consistency it became a breeze ! And I’ve got to say I have less joint pains, back aches are gone and my posture is wayyy better. Thank you so much for this amazing stretch! <br>I totally recommend it to others because it’s just so lovely to end your workouts with ❤.",
    "Liebe Anna, vor 1 Jahr habe ich angefangen Dir zu folgen und bin mit 58 Jahren fitter als je zuvor in meinem Leben!<br>Bitte mehr Video without jumping!<br>Danke , Danke ,Danke !!!"
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}