{
  "video_id": "koTzaUu7Vws",
  "title": "40 MIN FULL BODY WORKOUT || Intermediate Pilates Class",
  "description": "Hope you enjoy this new 40 Minute Full Body Pilates Workout! This Intermediate Pilates class will strengthen the entire body, with an extra emphasis on our legs and core! \n\n♡ INSTAGRAM: @movewithnicole\n♡ EMAIL: movewithnicole.yt@gmail.com\n\n\n♫ Music from https://www.epidemicsound.com/\n\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 40 minutes full body",
    "pilates workout 40 minutes",
    "40 minutes pilates workout",
    "40 minute pilates",
    "pilates class",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "40 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "move with nicole",
    "intermediate pilates",
    "move with nicole pilates"
  ],
  "publishedAt": "2021-01-07T08:11:41Z",
  "duration": 2631,
  "durationFormatted": "43:51",
  "viewCount": 2908060,
  "likeCount": 58952,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/koTzaUu7Vws/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/koTzaUu7Vws/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/koTzaUu7Vws/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/koTzaUu7Vws/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/koTzaUu7Vws/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/koTzaUu7Vws\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Let’s take a moment to appreciate this beautiful woman for keeping uploading videos for free and keeping us in shape while other instructors doing it for money and they’re not professional as Nicole. Thanks, gorgeous Nicole Looking forward to more videos like this. PS just finished this workout and it feels amazing. Sending you lots of love fabulous Nicole. ❤️❤️❤️❤️❤️",
    "It is hilarious when the exercise gets difficult and begins to burn that I glance at the screen in agony and see Nicole glancing back smirking",
    "Hope you enjoy this New Full Body Pilates Workout! Sending you all lots of love and wishing you a beautiful 2021! 😊❤️",
    "You have an amazing ability to push us so hard with the most calm, encouraging voice and cadence. It is masterful. I love your instruction. Thank you!",
    "Took me almost an hour to do this workout after adding mini breaks but I did it and am so proud of myself."
  ],
  "channelSubscriberCount": 4470000,
  "channelVideoCount": 229
}