{
  "video_id": "Kq1RZFV5tM4",
  "title": "15 Min Full Body Stretch for Flexibility & Mobility",
  "description": "Your workout isn't complete until after you've stretched and who doesn't LOVE dessert! This full body stretch is going to help reduce muscle soreness after a workout, increase flexibility, reduce stress, and help decrease your risk of injury. \n\nStretching is crucial to a well-rounded training plan, so hang out with Stella and me while we work through this full body stretch and hit all of the muscles, big and small. This stretching is perfect for after a workout or on its own on a recovery day. Take full advantage of this relaxing, but beneficial 15 minute stretch and enjoy dessert!\n\nI love hearing from you, so let me know down below how you got along with this stretch!\n\nBig hugs, \nKaleigh\n\n\n⭐️ Find all of the equipment used for these workouts here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/kaleighcohencycling\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ Tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\n⭐️ Share this workout with a friend👉  https://youtu.be/78Uex6eUfg8\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.\n\n\n#FullBody #Stretching #Flexibility",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [
    "full body stretch",
    "full body stretching routine",
    "stretching",
    "stretching routine",
    "stretch",
    "full body stretching",
    "stretching exercises",
    "total body stretch",
    "flexibility",
    "stretching workout",
    "post workout stretch",
    "flexibility routine",
    "home workout",
    "mobility",
    "flexibility stretches",
    "relaxing stretch",
    "follow along stretching routine",
    "stretches",
    "15 min stretch",
    "Kaleigh cohen"
  ],
  "publishedAt": "2021-04-26T13:34:40Z",
  "duration": 963,
  "durationFormatted": "16:03",
  "viewCount": 1466743,
  "likeCount": 27148,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Kq1RZFV5tM4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Kq1RZFV5tM4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Kq1RZFV5tM4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Kq1RZFV5tM4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Kq1RZFV5tM4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Kq1RZFV5tM4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I LOVE that you have a little couch for your sweet pup! It warms my heart!",
    "I have downloaded it in my YouTube app and I do this every morning. I have type 1 diabetes so it helps me relax my body pain. ❤🇮🇳⚘",
    "this is so good❤ instead of scrolling the cellphone everymorning, it is better watch this channel and follow the exercises",
    "This has quickly become my every day stretch- and its especially fantastic after a power ride and superset.",
    "I&#39;ve been doing this for a month now for pain management, and not only does this help with general pain, but I&#39;m also so much more flexible than I was before. Gonna have to branch out and see what else this channel has to offer."
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}