{
  "video_id": "kqmut7-RARw",
  "title": "45 Min Yoga Routine | Full Body Beginner Friendly Yoga",
  "description": "Welcome to this 45 min full body yoga routine. This class is great for mixed levels and includes a well rounded sequence to build strength, flexibility, and improve balance and coordination. \n\nThis beginner friendly sequence includes options to suit different levels and is intended to give you a complete practice that you can come back to whenever you want a full body flow.\n\nThe sequence includes a steady vinyasa flow with sun salutations, hip openers, backbends, standing balances and twists. It's designed to help you feel like you've given your body everything it needs to have a great day. \n\nI hope you enjoy this full body yoga flow. \n\nCharlie x\n\nLinks:\nOnline Programs: https://www.charliefollows.com/programs\nNewsletter: https://www.charliefollows.com/newsletter\n\nSocial Media:\nInstagram: https://www.instagram.com/charlieafollows?igsh=MWdxMjE0ZHR1bzlydg%3D%3D&utm_source=qr\nFacebook: https://www.facebook.com/charliefollowsyoga\nTikTok: https://www.tiktok.com/@charlieefollows?_t=8jbfibQBEiO&_r=1\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2024-10-31T14:00:53Z",
  "duration": 2766,
  "durationFormatted": "46:06",
  "viewCount": 309181,
  "likeCount": 8209,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/kqmut7-RARw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/kqmut7-RARw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/kqmut7-RARw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/kqmut7-RARw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/kqmut7-RARw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/kqmut7-RARw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hello friends I hope you enjoy the practice, for those that would like to know this was filmed in Alicante and the mountain in the background is called Aitana and it’s the highest in Alicante.",
    "Glorious! Don&#39;t let beginner friendly fool you. I&#39;m a seasoned yogi, and this one is just slow and mindful. Putting this in my regular rotation. Thank you Charlie! Namaste!",
    "I started following you about one year ago, and I&#39;ve been doing the practices almost every day. I have noticed an overall change in how i look and feel. At 5&#39;10&quot;,  I struggle holding certain poses. However, I did malasana for the first time with my feet flat on the ground today. I was so excited I just wanted to share. 😊 I am so happy to have you as my teacher. Thank you for all you do!",
    "I am 50yo and started to practice yoga seriously the day of Christmas. After 2 months and a half,4/5 classes a week, I feel amazing. I feel stronger,confident and peaceful. I can see the changes in my body and my mind. I would have started before,but probably there is the right time for everything.  Thank you Charlie for your classes,you are helping people to find themselves.❤",
    "I’m 16 (nearly 17), and I’m out of shape and out of tune with my body. I see several comments from more experienced yoga enthusiasts about how this is a break in their usual routine, yet for me, this is difficult. I hope one day, I will be able to say the same about having these videos in my weekly routine, and I know practice builds and will eventually get me there. Thank you for making these videos, and god bless 💙"
  ],
  "channelSubscriberCount": 991000,
  "channelVideoCount": 1004
}