{
  "video_id": "L1QOh-n-eus",
  "title": "5 Minute Stress Relief Guided Meditation",
  "description": "Let yourself sink into calmness. (details below) Join our community/see our products: https://www.thehonestguys.co.uk/products\n\nThis stress relief meditation is a relaxing 5-minute time-out that will allow you to focus and regain control of any stressful situation. \n\n___________________________________\n\nTHE HONEST GUYS\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, meditation and sleep, without ever having to try.  In particular, we cater to anyone who is turned-off by the idea of \"meditation\", but still want to reap the massive health benefits, that meditation can bring. We offer this through high-quality audio productions, called 'guided visualisations'. These include sleep talk-downs, meditations, wonderful fantasy imagery and stories. \n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nIf you enjoy our work and would like to support the channel, please consider purchasing one of our high-quality products: https://www.thehonestguys.co.uk/products\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n____________________________________\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n\nMusic: \"Letting Go\" by Christopher Lloyd Clarke. http://www.christopherlloydclarke.com\n\n\n\n#quickmeditation #stressrelief #stressmanagement #instantrelaxation #guidedmeditation #thehonestguys",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "guided meditation",
    "5 minute meditation",
    "deep relaxation",
    "short relax",
    "quick meditation",
    "calming",
    "calm down",
    "guided visualisation",
    "guided imagery",
    "meditation",
    "exam stress",
    "interview nerves",
    "nerves",
    "anxiety",
    "zen",
    "relaxing",
    "relaxation meditation",
    "zen music",
    "background",
    "meditate",
    "calm",
    "soothing",
    "healing"
  ],
  "publishedAt": "2019-08-06T16:04:16Z",
  "duration": 301,
  "durationFormatted": "5:01",
  "viewCount": 859907,
  "likeCount": 9798,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/L1QOh-n-eus/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/L1QOh-n-eus/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/L1QOh-n-eus/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/L1QOh-n-eus/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/L1QOh-n-eus/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/L1QOh-n-eus\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To anyone reading this, you deserve to have moments of letting go and simply being. You are so awesome and growing, the fact that you&#39;re on this video is a sign of self-love and mindfulness. Great job",
    "Thanks again and again.  I saw this quote just this afternoon.  &quot;Everything will be okay in the end.  If it&#39; s not okay, its not the end.",
    "I seriously needed this. School is just so weird right now. There&#39;s no certainty to anything. This helped me to overcome the anxiety. Thank you so much",
    "This is my favorite meditation.  At only 5 minutes, you can do it any time you need a little help.  The waves are especially calming - within seconds, I find myself breathing in rhythm with the waves.",
    "I was studying for two hours and was dying my head hurt so bad. Im glad I found you when i did"
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}