{
  "video_id": "l9_SoClAO5g",
  "title": "20 Minute Dumbbell Full Body Workout - No Repeat | Caroline Girvan",
  "description": "Technically no repeat but repetition on those muscles!! Mostly compound movements to recruit as many muscles as possible with lots of variations throughout! \n\nThe dumbbells I am using for your reference are 17.5kg however I reduce to 9kg each for the shoulders and MAKERS at the finisher! \n\nThe timer will be on for 40 seconds of work, 20 seconds rest!\n\nCHEST PRESS\nALTERNATING CHEST PRESS\nDEADSTOP CHEST PRESS\nSUITCASE SQUAT\nSLOW LOWER GOBLET SQUAT\n1/2 REP SQUATS\nRENEGADE ROW ONE SIDE\nSWITCH SIDE!\nALTERNATING RENEGADE ROW\nSTATIC LUNGE (one side)\nSWITCH SIDE!\nFORWARD LEAN LUNGE (one side)\nSWITCH SIDE!\nSHOULDER PRESS\nPUSH PRESS\nARNOLD PRESS\nRDL SLOW!\nRDL PAUSE AT BOTTOM!\n1/2 REP RDL!\n\nFINISHER!\nMAKER FOR 1 MINUTE!\n\nYes! The MAKER to finish! Once of my favourite movements! The MAKER is a slight twist to the popular MAN MAKER with the push ups and curls! Ensure your heels are flat on the floor and looking straighten ahead before curling the dumbbells.\n\nFull body in 20 minutes for that Friday feeling!! \n\nCx\n\nAlways ensure you warm up before any workout. Here’s my 5 Min Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n\nToday’s Optional Add-on: https://youtu.be/FgqmrQ2rnfM\n\nChristmas Workout Advent Playlist: https://www.youtube.com/playlist?list=PLhu1QCKrfgPVKViubrzd6hP3ziAs60qfD\n\nJoin The Caroline Girvan Community\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Private Facebook Group: https://facebook.com/groups/carolinegirvan\n\nMy Amazon Stores\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\n▶ Business Enquiries Email: info@carolinegirvan.com\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "full body workout with dumbbells",
    "full body workout",
    "caroline girvan",
    "20 minute full body workout",
    "20 min dumbbell workout",
    "workout",
    "home workout",
    "20 min full body workout",
    "no repeat full body workout",
    "dumbbell workout",
    "full body",
    "no repeat workout",
    "chest workout",
    "back workout",
    "shoulder workout",
    "leg workout",
    "dumbbell leg workout",
    "quads",
    "hypertrophy",
    "muscle building"
  ],
  "publishedAt": "2021-12-10T05:00:31Z",
  "duration": 1442,
  "durationFormatted": "24:02",
  "viewCount": 4409613,
  "likeCount": 60739,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/l9_SoClAO5g/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/l9_SoClAO5g/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/l9_SoClAO5g/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/l9_SoClAO5g/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/l9_SoClAO5g/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/l9_SoClAO5g\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To anyone doing this workout . . . this workout is so good and you will see results!!  I did, and just  after a month of  doing it 4 times a week.   (combined with moderate to intense 10  minute walking), I could see results.    Please keep on doing it, no matter how difficult it sometimes get.  You deserve the  body <del>and muscles</del>  you are  trying  so hard to achieve.   Thank you, Caroline!!",
    "A workout does NOT need to take 2 hours, these no-repeat, quick workouts are great for us at the firehouse trying to find the time to get in a well balanced workout!",
    "Wow! I&#39;m a 47 year old Mum with 20 years of yoga but not much strength training under my belt. Realising how important strength is as I approach menopause. This was so doable and so very well set out. Love. Thank you so much. Will continue. 🙏",
    "Ive been doing this 2-3 times a week for 3 weeks, combined with 10-15 minutes of cardio and I can see the difference in my whole body my arms and back are getting stronger/smaller and toned and my apron belly is shrinking and my booty is getting lifted. I am using 20 pound dumbbells for reference. Also, I have been sleeping SO good since implementing this into my daily schedule. I work full time and have 2 kids so I barely have time for myself but I do this in the morning before getting ready for the day or on my lunch break at home and it is helping me tone like crazy. I hope this motivates someone to try it. Thank you so much Caroline, I look forward to trying to add your 10 minute weighted abs into my routine as well!",
    "Full body with weights and NO repeats are my absolutely favorite workouts! And it is 20 mins! Thank you so much for spoiling us here with your daily workouts in December!"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}