{
  "video_id": "LbG1ovCGp-E",
  "title": "30 MIN MORNING PILATES || Energising Full Body Workout (Moderate)",
  "description": "Wake up and energise your body with this 30 Minute Morning Pilates class. 😊\n\n🌸 Mat from Liforme - https://liforme.com/\nUse my code 'MOVEWITHNICOLE' for a discount.\n\n\n🤍 INSTAGRAM: @movewithnicole\n🤍 EMAIL: movewithnicole.yt@gmail.com\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole Pty Ltd will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "morning pilates",
    "morning pilates workout",
    "morning pilates 30 minutes",
    "30 min pilates",
    "30 min pilates workout",
    "30 min morning pilates",
    "move with nicole",
    "move with nicole pilates",
    "move with nicole 30 minutes",
    "full body workout",
    "full body workout pilates",
    "full body pilates",
    "full body pilates workout",
    "pilates morning workout",
    "pilates full body",
    "30 min full body workout",
    "30 minute pilates workout",
    "sunrise pilates",
    "at home pilates workout no equipment",
    "at home pilates"
  ],
  "publishedAt": "2022-08-11T09:20:49Z",
  "duration": 2083,
  "durationFormatted": "34:43",
  "viewCount": 1683075,
  "likeCount": 48808,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/LbG1ovCGp-E/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/LbG1ovCGp-E/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/LbG1ovCGp-E/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/LbG1ovCGp-E/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/LbG1ovCGp-E/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/LbG1ovCGp-E\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I love it when she says a well deserved child&#39;s pose. Makes me feel like I&#39;ve really done something for my body",
    "as someone who struggles a lot with body image, which makes trying to be more healthy and fit really mentally/emotionally exhausting, i really appreciate that your videos aren’t focused on achieving a certain body type but rather on the movements and how the exercises will make you feel. i love the variety and it’s amazing that you’re able to achieve a level of effectiveness that doesn’t feel punishing or exhausting! thank you so much 💕",
    "I have been a Pilates teacher for over 20 years and have seen many teachers but you are most definitely the best! Your concise instruction, the tone of your voice, the pace, variety……..everything…….thank you for your inspiration!",
    "So happy my daughter found you.  It’s really helped my balance as well as my overall well being.  Your production is also very professional. Congratulations on a great job!",
    "finally was able to do this one with no breaks SLAYYYY"
  ],
  "channelSubscriberCount": 4470000,
  "channelVideoCount": 229
}