{
  "video_id": "LbTVfgZd6OE",
  "title": "Day 28 - 30 MIN Stretch, Relax & Recover Workout - Mobility, No Equipment, No Repeat",
  "description": "WE DID IT!!!! \nIt's day 28, the final day of the GROW HIIT JANUARY CHALLENGE! High Five TEAM ✋ To finish the challenge, enjoy this 30 minutes of stretching to relax and recover - I bet your bodies will be SO thankful for a rest day. Please don't be sad that the challenge has come to an end, I have something exciting planned for February... you didn't really think we would stop crushing workouts together, did you?? 😜 \n \n\nWORKOUT DETAILS\n\n👉🏼 Duration: 30 MIN\n👉🏼 Intensity: Stretch 🧘‍♀️\n👉🏼 No Equipment\n👉🏼 50 Sec Work, 10 Sec Rest\n👉🏼 No Repeat\n\nPlease remember that we are all different and that you can make this your OWN workout... take a longer break when you need to.\n\nMusic: https://www.epidemicsound.com\n\n📷 GEAR I USE: \nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n💪🏼 MY HOME TRAINING GUIDE: http://growingannanas.com\n\n» Subscribe to my Channel for weekly workouts: http://bit.ly/2QLvpXn\n» Instagram: http://bit.ly/2ZSdHFR\n» Facebook: http://bit.ly/2SVkgpE\n✉ Contact (business inquiries):  anna@fyndafit.com\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "30 MIN Stretch",
    "Relax & Recover Workout - Mobility",
    "stretch workout",
    "recovery workout",
    "stretch routine",
    "yoga stretch full body",
    "yoga stretching exercises",
    "yoga stretching exercises for flexibility",
    "yoga stretch after workout",
    "yoga stretches for flexibility",
    "stretching exercises for beginners",
    "growingannanas stretch",
    "growingannanas yoga",
    "yoga",
    "mobility exercises",
    "growingannanas",
    "stretch no talking",
    "full body stretch no talking",
    "stretching routines for flexibility"
  ],
  "publishedAt": "2021-01-31T06:00:12Z",
  "duration": 1814,
  "durationFormatted": "30:14",
  "viewCount": 1163169,
  "likeCount": 16584,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/LbTVfgZd6OE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/LbTVfgZd6OE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/LbTVfgZd6OE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/LbTVfgZd6OE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/LbTVfgZd6OE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/LbTVfgZd6OE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Woohoo congratulations team 🥳 We did it!!! 28 days of crazy workouts together - I am beyond happy!!! THANK YOU THANK YOU THANK YOU!!! Have the best recovery day today, see you tomorrow for something exciting 💪🏼 Big love, Anna xx",
    "I come back to this video quite often. No talking, no excessive demonstration, no props. Just non-stop stretches. Thanks. 👍🏼",
    "It’s been an awesome 28 days, thank you so much Anna, I feel totally amazing and you’ve been such a blessing to me and the rest of the community. Kudos Anna🥂looking forward to more challenging and exciting workouts 🎉",
    "Merci Anna, tu es incroyable, je t&#39;ai découverte il y a 3 semaines, je ne décroche plus depuis, et là, il y a 3 jours j&#39;ai commencé ton parcours sur 28 jours, c&#39;est trop bien, trop bien pensé, et tu es très forte ! Merci merci merci pour ce que tu proposes, pour ton sourire, pour ta grâce et la qualité des vidéos. Je vais commencer à m&#39;intéresser à tes autres propositions, notamment en matière de nourriture.",
    "best stretch video on youtube"
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}