{
  "video_id": "LdFgFco_8p8",
  "title": "30 MIN FULL BODY STRENGTH Workout - With Weights - Build Strength, Tone your Body, No Repeat",
  "description": "Team, it's time to WORK! 30 min Full-Body Fat-Burning Workout to burn calories and tone all major muscle groups. If you don't have dumbbells, grab some water bottles or anything you have at home to add some extra weight. Let's push our bodies, work hard, and have FUN! Let's do it!!\n\n▸ Muscles Worked: Full Body\n▸ Time: 30 Min\n▸ Equipment: Dumbbells (I used 5kg for your reference)\n\n▸ Instructions: Follow along and complete as many reps as possible in 50 Seconds. After 10 Seconds of Rest continue to the next move.\n\nPlease remember that we are all different and that you can make this your own workout ♡ Take a longer break when you need to.\n\n♡ Join the OFFICIAL TEAM GROW Community Group: https://www.facebook.com/groups/teamgrowsupport/\n\n♡ Workout Challenges & Guides: http://growingannanas.com\n\n\n\n\n\n\n\n♡  The Gear I Use: \nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n♡ SUBSCRIBE: http://bit.ly/2QLvpXn\n♡ Instagram: http://bit.ly/2ZSdHFR\n♡ Facebook: http://bit.ly/2SVkgpE\n\n♡ My Music: https://www.epidemicsound.com\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "home workout",
    "full body workout",
    "30 min full body fat burning workout",
    "full body fat burning workout at home 30 min",
    "30 min fat burning & full body toning workout",
    "hiit workout",
    "workout from home",
    "full body hiit workout",
    "intense workout",
    "full body exercise",
    "workout of the day",
    "no talking workout",
    "fat burning workout",
    "fat burn",
    "hiit with dumbbells",
    "high intensity interval training",
    "hiit with weights",
    "no repeat workout",
    "full body hiit with weights",
    "hiit cardio for fat loss"
  ],
  "publishedAt": "2021-07-17T07:00:11Z",
  "duration": 2066,
  "durationFormatted": "34:26",
  "viewCount": 1318592,
  "likeCount": 24003,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/LdFgFco_8p8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/LdFgFco_8p8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/LdFgFco_8p8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/LdFgFco_8p8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/LdFgFco_8p8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/LdFgFco_8p8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "It’s WEIGHTS day Team! Grab your dumbbells (or bottles), your mat and let’s smash it together 🤗💪🏼 Let me know how you go in the comments, I’d love to hear which dumbbells you use 🔥 Anna x",
    "I feel the need to document that my cat had fallen asleep on my mat and so for the &quot;legs over dumbbell&quot; (<a href=\"https://www.youtube.com/watch?v=LdFgFco_8p8&amp;t=1594\">26:34</a>)  I used her as my marker",
    "It&#39;s so crazy. The day always passes so fast but when I do your workouts  I notice how long a minute can be 😂😂  thank you for that!",
    "Anna, it takes mental strength more than physical strength or anything else to do such hard, challenging workouts. You are a goddess, you makes them look like nothing, and hats off to you for all your hardwork. Really, immense respect 👏👏👏👏",
    "This is my first time using dumbells to work out, wish me luck😬<br><br>Edit: I did it😅 I took a lot of breaks but a few months ago i wouldn&#39;t have even been able to get through the warm up😌 thanks Anna, you&#39;re the best❤"
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}