{
  "video_id": "lenl104oiFU",
  "title": "Workout To Lower Your Blood Pressure Permanently – 10 Minutes Per Day",
  "description": "Workout To Lower Your Blood Pressure Permanently – 10 Minutes Per Day // Caroline Jordan // Get your Lower Your Blood Pressure Naturally Guidebook: \nhttps://bit.ly/HowToLowerYourBloodPressureNaturally\n\nJoin us on Patreon for more exclusive content to help you and your health: https://www.patreon.com/carolinejordanfitness \n\nHelp me to maintain and grow this channel!!!\nDonate Paypal: https://www.paypal.me/CarolineJordanUS\nor Venmo: https://venmo.com/carolinejordanfitness\n\nIf you struggle with high blood pressure, you are not alone. As a certified fitness coach people are always surprised to hear that I have to watch my blood pressure. Hypertension runs in my family and if i'm not careful my blood pressure creeps UP there. In fact I can hear my 100 year old grandmother (yes she's 100!) in my head all the time reminding me to “cut the salt honey. You can't have salt in your life with our family genes!” That’s one reason I choose to lead a healthy lifestyle and stay active. I can keep my blood pressure low without medication through exercise and diet. In this video, I want to show you a quick low impact workout that can be used in the management of high blood pressure.\n\nExercise lowers blood pressure by reducing blood vessel stiffness so blood can flow more easily. The effects of exercise are most noticeable during and immediately after a workout.\n\nOne way to combat high blood pressure might be to break up your workout into several sessions throughout the day. In fact, one study found that three 10-minute walks a day more effectively prevented future blood pressure spikes than one 30-minute trek per day. But if you cant make it outdoors to get your steps in, this 10 minute low impact home workout combines dynamic exercises that are safe to do multiple times throughout your day to keep your blood pressure in a good place. In this routine we have 10 different exercises performed for one minute sequenced back to back. Once we start there are no programmed breaks, but of course listen to your body and modify as needed to meet yourself where you are at today. The goal is just to get moving to feel better together for 10 minutes total.\n\nDaily exercise not only helps control high blood pressure but it also helps manage your weight, strengthen your heart and reduce stress. Trust me nothing feels better than taking control and seeing your health improve. So join me and keep your blood pressure in check the natural way. Use this workout 2-3 times per day for at least a week. Make sure to monitor your blood pressure numbers and share what positive health effects you experience below in the comments.\n\nWhen it comes to taking care of yourself and improving your health I want you to remember: you can do anything you set your mind to. Are you ready? YOU CAN DO THIS! Let's get moving!\n\nPositive Feel Good Fitness,\n-Caroline Jordan\n\n👇SUBSCRIBE TO CAROLINE’S YOUTUBE CHANNEL NOW👇\nhttps://bit.ly/3zIHqnS\n\nJoin this channel to get access to perks:\nhttps://bit.ly/3E25xAm \n\nSHOP MERCH HERE: 🛍️\nhttps://bit.ly/carolinejordanmerch\n\n✨✨✨ CONNECT WITH CAROLINE ON SOCIAL MEDIA ✨✨✨ \nCaroline Jordan Blog: https://carolinejordanfitness.com/blog/\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: https://www.instagram.com/carolinejordanfitness/\nTwitter: https://twitter.com/carolinefitness\nPinterest: https://www.pinterest.ph/carolinejordanfitness/ \nLinkedin: https://www.linkedin.com/in/carolinejordanfitness\n \n💪TRAINING AND PROGRAMS 💻\n▶︎ HURT FOOT FITNESS EXCLUSIVE COACHING PROGRAM: https://www.hurtfootfitness.com\n▶︎ WORKOUT VIDEO LIBRARY: https://www.hurtfootfitness.com/workout-video-library\n▶︎ HURT FOOT DIET GUIDE: https://www.hurtfootfitness.com/healingdiet\n▶︎ STRONG BODY PROGRAM: https://www.hurtfootfitness.com/strongbody\n▶︎ DIABETES WEIGHT LOSS PROGRAM: https://hurtfootfitness.com/diabetes-exercises-for-weight-loss-workout-program\n▶︎ SCIATIC NERVE PAIN RELIEF PROGRAM: https://get-pain-relief-now.teachable.com/p/sciatic-nerve-pain-relief\n\n#CarolineJordan  #lowerbloodsugar #patreon #cjfitsquad \n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless Caroline Jordan Fitness its officers, employees, and contractors for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Caroline Jordan Fitness makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.\n\nRelated Searches: \nis blood pressure lower after exercise",
  "channelTitle": "Caroline Jordan",
  "channelDescription": "Hello! I'm Caroline Jordan, a Certified Health and Fitness Coach here to help you heal, grow, and kick butt in life.  If you are looking for more energy, less stress, and a healthier mindset, you have come to the right place. I specialize in helping people find safe, effective ways to exercise. I am here to teach you how to use MOVEMENT AS MEDICINE for mental and physical well being. My mission is to help you develop a positive relationship to self and exercise that adds to the quality of your life. I can teach you how to drop the extremes, create lasting lifestyle change, and feel good in your skin. Through my Youtube channel you will learn how to challenge yourself in a healthy way and explore your full potential. Let’s get your mind, body, and spirit in great shape so you can love your life. \n\nBusiness Inquiries : Carolinejordan@gushcloud.com \nWebsite: http://www.carolinejordanfitness.com\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: @carolinejordanfitness",
  "tags": [
    "workout to lower your blood pressure",
    "caroline jordan",
    "exercise to lower blood pressure",
    "exercise for high blood pressure",
    "blood pressure exercise",
    "caroline jordan blood pressure",
    "high blood pressure exercise",
    "workout to lower blood pressure",
    "how does exercise lower blood pressure",
    "blood pressure exercises",
    "exercise for health",
    "lower blood pressure exercise",
    "exercise",
    "bp exercise",
    "lower bp",
    "bp",
    "blood pressure",
    "hypertension",
    "heart disease",
    "heart health"
  ],
  "publishedAt": "2023-01-23T14:00:20Z",
  "duration": 845,
  "durationFormatted": "14:05",
  "viewCount": 2652158,
  "likeCount": 35604,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lenl104oiFU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lenl104oiFU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lenl104oiFU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lenl104oiFU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lenl104oiFU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lenl104oiFU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Get your Lower Your Blood Pressure Naturally Guidebook: <br><a href=\"https://bit.ly/HowToLowerYourBloodPressureNaturally\">https://bit.ly/HowToLowerYourBloodPressureNaturally</a>",
    "hi. My name is Domenick and I am 54 years old.  I have been on BP medication now for about 20 years. High BP runs in my family. For the past 3 months have been walking quite a bit each day, about 12,500 steps, 6-7 days per week.  I walk for about 1 hour early in the morning and for about 1/2 hr after lunch.  I monitor my BP regularly and noticed my numbers going down to a consistent 110/65 so I decided to stop taking my meds.  I have been checking my pressure 3 x per day and it has remained under 120/80 for over a week now.  I did also lose 15 lbs however i have lost weight in the past (without exercise) and still needed to take my BP meds.  I really do think walking every day is what made a huge difference. I will continue checking my BP each day for at least a month and will let my cardiologist aware of what i&#39;m doing.",
    "Wow - I did this workout this morning for the first time , I’ve been up since 5am as my BP is creeping up to 170/115 and I’ve been worrying about it. So I typed in Exercises to reduce BP in YouTube and this video popped up. I did the workout once, sat and did some slow breathing exercises for 5 mins . My BP before the exercise was 158/115. Afterwards it was 127/97. I did a second reading to confirm 129/98. <br>I will be incorporating this workout into my daily routine at least once a day, i will comment again in a months time to update if anyone is interested. <br>Thankyou Caroline for this video.",
    "May the Lord God bless you Caroline, just started this exercises 4 days now and bp back to normal from 166/90 to 130 down back to 120/80 may the Lord God restore our health and I decree and declare that we will all live longer in Jesus name 🙏",
    "My 2 weeks process:<br><br>Day 1: 197/140<br>Day 2: 180/134<br>Day 3: 178/121<br>Day 4: 160/116*<br>Day 5: 162/124*<br>Day 6: 159/112*<br>Day 7: 162/107*<br>Day 8: 161/113*<br>Day 9: 160/114*<br>Day 10: 164/112*<br>Day 11: 159/106*<br>Day 12: 167/113*<br>Day 13: 170/120*<br>Day 14: 166/111*<br><br>Thank you @Caroline Jordan"
  ],
  "channelSubscriberCount": 669000,
  "channelVideoCount": 1095
}