{
  "video_id": "LFyVJIlSYkA",
  "title": "[BREATH BUFFET] Guided Alkaline DMT Breathing | Dan Vadanais",
  "description": "👉🏻 Get The Breathsouce App Here; https://portal.thebreathsource.app/downloadTheApp\n\nUnlock the full power of breathwork and elevate your practice to new heights with The Breath Source App! With exclusive content and classes not available on YouTube, you'll discover a world of co-created breathing exercises, each tailored to fit your unique needs. Whether you're a beginner or an advanced practitioner, our team of global Breath Masters will guide you every step of the way. \n\n💚 The Breath Source App is on ios and android - click here https://portal.thebreathsource.app/downloadTheApp\n\nCheck out Dan's AMAZING Breath YouTube Channel; https://www.youtube.com/@BreathworkBeats\n\nSafety Information: \nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell STOP. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in bodily harm. Deep breathing may cause tingling sensations, a ringing in the ears, and/or light-headedness. These are normal responses and are no cause for alarm. If you faint, however, you have gone too far and should take it more slowly next time. \n\nDisclaimer \nThe information provided in this video is provided for informational purposes only and is NOT to be used or relied on for any treatment purposes. All information provided by TAKE A DEEP BREATH is of a general nature, only for educational/entertainment purposes. No information is to be taken as medical or health advice. Follow this breathing exercise at your own risk. TAKE A DEEP BREATH or Mike Maher is not responsible for any losses, liabilities, injuries, or damages resulting from any and all claims as a result of your reliance on the information contained in this video. There is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself. We use affiliate links which means if you buy something, we'll receive a commission, we appreciate the support you give us and we hope to keep adding value to you.\n\nSubscribe so you never miss a new video: https://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=1",
  "channelTitle": "TAKE A DEEP BREATH",
  "channelDescription": "Welcome to TAKE A DEEP BREATH, My name is Mike Maher, I am a breathwork instructor, podcaster and researcher of the breath. I have studied many modalities and I am proud among other things to be an Oxygen Advantage Master Instructor.\n\nOn my channel here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. We also host #Breathcast which is a dedicated Breathwork Podcast where we interview the world's top breath and health experts.\n\nBreathwork is where you consciously alter your breathing pattern to achieve a set of results such as helping you to relax, raise your energy, increase your immune system, change your state of consciousness or calm your parasympathetic nervous system.\n\nBreathwork has been a key component in Yoga for centuries,  now with the help of people such as Joe Rogan & books such as the Oxygen Advantage, breathwork is part of mainstream society.\n\n\n",
  "tags": [
    "guided breathwork",
    "guided wim hof breathing",
    "breathwork music",
    "dmt breathing",
    "guided dmt breathing",
    "dmt breathing 3 rounds",
    "holotropic breathwork",
    "alkaline breathing",
    "wim hof guided breathing",
    "dmt breathwork guided",
    "breathing exercises",
    "wim hof",
    "wim hof breathing",
    "breathwork beats",
    "wim hof breathing technique",
    "breathwork",
    "dmt breathwork meditation",
    "dmt breathwork",
    "breath of fire",
    "soma breathwork",
    "holotropic breathwork guided",
    "psychedelic breathing",
    "dmt meditation"
  ],
  "publishedAt": "2023-04-19T13:06:55Z",
  "duration": 338,
  "durationFormatted": "5:38",
  "viewCount": 117977,
  "likeCount": 2878,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/LFyVJIlSYkA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/LFyVJIlSYkA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/LFyVJIlSYkA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/LFyVJIlSYkA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/LFyVJIlSYkA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/LFyVJIlSYkA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is the best breath work I&#39;ve done so far. I seem to have built a slight resistance from doing the wim hof method by itself but this is like the first time I ever did it.",
    "Get the full length version of this breathing exercise here; <a href=\"https://portal.thebreathsource.app/downloadTheApp\">https://portal.thebreathsource.app/downloadTheApp</a>",
    "Namaste! Amazing session. What I like the most is you have made the ancient traditional science of Pranayam made available to modern generation in a way that is not boring and gives results very quickly.",
    "I love all the DMT breathwork sessions with Dan Vadanais! 😍",
    "Thanks!"
  ],
  "channelSubscriberCount": 295000,
  "channelVideoCount": 386
}