{
  "video_id": "LiUnFJ8P4gM",
  "title": "4-7-8 Calm Breathing Exercise | 10 Minutes of Deep Relaxation | Anxiety Relief | Pranayama Exercise",
  "description": "Enjoy deep relaxation and increase lung capacity with this ten minute version of the 4-7-8 breathing technique. The breaths gradually slow and extend to an ideal calming pace.\n\n4-7-8 rhythmic breathing is a core part of many meditation and yoga practices as it promotes relaxation and can also be used to help you fall asleep in a shorter period of time. The goal is to calm your sympathetic nervous system, which controls the fight-or-flight response. \n\nNOTE: In this video, the 4-7-8 counting does not follow seconds (the pace is purposefully slower). There are other versions of the 4-7-8 exercise on this channel that have a faster breathing pace and versions that have a slower breathing pace. You should try them all to learn what works best for you.\n\nIf you tend to be a shallow breather, it’s common to feel a little lightheaded when you start taking deeper breaths. This sensation will pass as your body becomes accustomed to a greater flow of oxygen. You can always take a short break and resume the exercise once you feel normal. It is not necessary that your timing perfectly matches the video example. You can take shorter or longer breaths as long as you maintain the ratio - Inhale 4, Hold 7, Exhale 8. Also, try to keep your expectations realistic. Some days will be easier than others, but the more often you practice, the more effective the exercise becomes.\n\n\n\n//  STRUGGLING TO TAKE A DEEP BREATH?\n\nIf you are having difficulty taking a deep enough breath to complete the 4-7-8 exercise, you may wish to begin with a simple video that teaches proper abdominal breathing.\n\nhttps://youtu.be/ApAsKd4hYiw\n\n\n\n//  GUIDED HANDS-ON MEDITATIONS\n\nIf you would like to try meditation, I encourage you to try the Hands-On Meditation technique. It's easier than traditional meditation.\n\nhttps://www.youtube.com/playlist?list=PLzK1U3HzIGbgtuKVCRmXgOV8U1RzC_xcC\n\n\n\n// SOCIAL\n\n• Instagram https://www.instagram.com/HandsOnMeditation\n\n• Pinterest https://www.pinterest.com/HandsOnMeditate\n\n• Twitter https://twitter.com/HandsOnMeditate\n\n• Facebook https://www.facebook.com/HandsOnMeditation\n\n#HandsOnMeditation\n\nWANT TO HELP SUPPORT THE CHANNEL?\n☕ Please, buy me a coffee  https://www.buymeacoffee.com/HandsOnMeditate\n\n________________________\n\n\nI hope you enjoy this approach to anxiety and stress relief.  Please leave a comment about how it's working for you. Also, please subscribe to stay updated with my newest videos and resources. I'll be posting additional exercises soon.\n\nWarm Regards,\nPeter\n\nVoice-over: Matthew Hall\n\n© 2023 Vivid Prana LLC. All rights reserved. | HandsOnMeditation.com",
  "channelTitle": "Hands-On Meditation",
  "channelDescription": "The easiest guided meditations and calm breathing exercises. Try our simple relaxation practices. They're more active than traditional methods and free.\n\nNo subscription fee • No overwhelming content • Meditation shouldn't be difficult.\n\nUtilized by:\n• University of Florida College of Medicine\n• Mission Kids - Child Advocacy Center\n• Manchester Metropolitan University\n• South Piedmont Area Health Education Center\n• Therapists around the world\n_____\n\nComments:\n\"From day one I noticed I felt much calmer & have slept better\"\n\"My son calms himself faster with this method.\"\n\"The first meditation video for guys.\"\n_____\n\nThanks for taking a moment out of your busy schedule for some mindful relaxation.\n\nSubscribe to stay updated with the newest videos and resources, and please share this channel with others.\n\nWant to Help Support the Channel?\n☕ Please, buy me a coffee  - www.buymeacoffee.com/HandsOnMeditate\n\nWarm Regards,\nPeter\n\n© 2019-2025 Vivid Prana LLC | All rights reserved.\n",
  "tags": [
    "ten minute breathing exercises",
    "10 minute 478 breathing",
    "4 7 8 breathing",
    "4-7-8 breathing technique",
    "mindful breathing meditation",
    "relieve stress alleviate anxiety and stress",
    "to relax or fall asleep",
    "to stop a panic attack",
    "increase lung capacity",
    "progressively slow breathing",
    "take a deep breath",
    "hands on meditation",
    "how to 4 7 8 calm breathing",
    "how to reduce anxiety",
    "How to relax",
    "anxity relief breathing",
    "people try headspace",
    "anxiety relief breathing",
    "pranayama exercise"
  ],
  "publishedAt": "2023-02-10T02:37:18Z",
  "duration": 633,
  "durationFormatted": "10:33",
  "viewCount": 1590225,
  "likeCount": 20308,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/LiUnFJ8P4gM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/LiUnFJ8P4gM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/LiUnFJ8P4gM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/LiUnFJ8P4gM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/LiUnFJ8P4gM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/LiUnFJ8P4gM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;ve been shocked how well this helps.  I&#39;ve been in such a bad and depressed mood since coming to college.  After one session I noticed a shift.  I wasn&#39;t anxious anymore and have been laughing and enjoying the world again.  I don&#39;t know if anyone else has gotten such a dramatic shift, and I highly doubt it&#39;s the placebo effect (I&#39;ve done plenty of meditation exercises and have never had so quick and dramatic of a shift).  Thanks so much for making this video! :)",
    "For everyone here in 2025. I&#39;m glad you&#39;re doing good stuff to improve yourself rather consuming shit dopamine. Just don&#39;t quit and keep pushing hard to make a greatest version of yourself 🔥💪",
    "Thanks this honstly helps. I have anxinty so I stress out 24/7. Also who ever is reading this I hope this helps you get the mental health break you need .",
    "i am suffering anxiety from the past month and it was very hard for me to be calm, it took more than 10 minutes before i&#39;ll be ok , but for this video it took 2 minutes only.. big thanks to you.. For   those who are suffering ANXIETY,  Let us all be healed in jesus name.. 🙏 Someday we will be ok, someday we will inspire others 🫶",
    "Close your lips and inhale through your nose for a count of four. Hold your breath for a count of seven. Exhale completely through your mouth making a whoosh sound for a count of eight. Do 4-7-8 breathing anytime you feel stressed. It will become more powerful as you use it. Practice doing it before you respond to an upsetting situation and whenever you&#39;re having trouble getting to sleep. Thanks so much for making this video!"
  ],
  "channelSubscriberCount": 55000,
  "channelVideoCount": 65
}