{
  "video_id": "lJUIDBBqJOE",
  "title": "30 MIN FULL BODY STRETCHING - perfect for rest days / No Equipment I Pamela Reif",
  "description": "This 30min Full Body Stretching Routine is perfect for Rest Days or anytime your muscles feel extra stiff or sore. This also helps to increase mobility and flexibility, which then again helps to perform exercises during our other workouts better. \nI also like to do this before bed, if I need to calm down my mind and feel like relaxing. \n\nThe routine is basically a longer version of the „15min Daily Stretch“ :) We will stretch our entire body: from neck, to hamstrings, thighs, butt, hip flexors, back, spine mobility, hip mobility and so on. I\n\nxx\n__\n\nNo Equipment needed. Just prepare a soft surface like a yoga mat or towel :) \n\n__\n\n▸ You can find free WORKOUT SCHEDULES on my Instagram Channel. I saved them in my highlights. \n➞ Instagram http://www.instagram.com/pamela_rf/\n\n__\n\n➞ Instagram http://www.instagram.com/pamela_rf/\n➞ Food Account http://www.instagram.com/pamgoesnuts/\n\n__ \n\nMusic by Epidemicsound.com \nhttps://www.epidemicsound.com\n\nDisclaimer:\nWhen joining me for this workout video, you need to take some precautions as your health and safety is the most important. To avoid any injury or harm, you need to check your health with your doctor before exercising. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Pamela Reif will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "Pamela Reif",
  "channelDescription": "Super happy to be your online training buddy! \n♡ free fitness videos in real time \n♡ free workout schedules every 2nd Sunday on my Instagram (pamela_rf). \nDifferent versions: Lose Weight, 30min per day, etc. \n♡ 12 different workout plans in my Pam App: https://www.pam-app.de/app\n♡ have a look at the YouTube Playlists to filter the workouts depending on your level!  \n\nall links / Impressum:\nwww.pamelareif.com\n",
  "tags": [
    "workout",
    "training",
    "abs",
    "sickpack",
    "flat",
    "tummy",
    "stomach",
    "exercise",
    "how to get",
    "home workout",
    "no equipment",
    "sport",
    "body fat",
    "lose weight",
    "fit",
    "healthy",
    "strong",
    "instagram",
    "lower abs",
    "bauchfett",
    "30 seconds",
    "kurz",
    "keine gewichte",
    "no weight",
    "bodyweight",
    "pamela rf",
    "best ab workout",
    "muscle",
    "madfit",
    "tammy hembrow",
    "bauchmuskeln",
    "bauchspeck",
    "beginner",
    "leicht",
    "easy",
    "Chloe ting",
    "maddie",
    "Tammy hembrow",
    "medium",
    "corona",
    "home",
    "quarantine",
    "stretch",
    "yoga",
    "flexible",
    "cooldown",
    "after workout",
    "before bed",
    "sore",
    "stiff",
    "split",
    "spagat"
  ],
  "publishedAt": "2020-06-11T18:07:06Z",
  "duration": 1878,
  "durationFormatted": "31:18",
  "viewCount": 7333664,
  "likeCount": 97270,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lJUIDBBqJOE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lJUIDBBqJOE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lJUIDBBqJOE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lJUIDBBqJOE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lJUIDBBqJOE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lJUIDBBqJOE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Pam: looking glorious from start to finish <br><br>Me: Rolling around like a hippo on meds",
    "Only pamela would put a 30 second timer on relaxing",
    "I LOVE when you talk in the videos. Makes me feel more motivated and a part of.",
    "guys, please do some of these stretches safely or do not do them at all! here are some of my notes (edited):<br><br>1. always always always do these stretches with warming up first. it is always best to do some strength training but even leg lifts, swings, squats and hip exercises are enough to get you warmed up properly<br>2. the pigeon pose (<a href=\"https://www.youtube.com/watch?v=lJUIDBBqJOE&amp;t=1015\">16:55</a>) can be very dangerous if you do not position yourself correctly or you strain your knee too much! you can genuinely hurt your knees if you put them in a 90 degree angle right away! DO NOT put it in a 90 degree angle if it hurts you, position it closer to your body, or even right next to your thigh, especially if you are new to stretching!<br>3. this one (<a href=\"https://www.youtube.com/watch?v=lJUIDBBqJOE&amp;t=1120\">18:40</a>) i just wouldn’t do at all, same reasons for the pigeon pose. it can be way too dangerous for the knees to put them in a 90 degree angle and it could lead to a strain. please be careful. <br>4. when in the pancake position (<a href=\"https://www.youtube.com/watch?v=lJUIDBBqJOE&amp;t=1305\">21:45</a>), squeeze your thighs always! especially when lowering your back - you do not want to harm your inner thigh tendons! if you go way too hardcore in pancake, your tendons could very much break so keep those quads activated and pressing down on the floor! if you’re training for splits it’s best to keep you back straight too :)<br>5. be mindful of your back, try to keep your spine aligned with your neck in stretches unless bending is needed<br>6. if anything hurts, especially your knees - STOP. stretches can be uncomfortable but if you feel actual shooting pain stop immediately! reposition yourself in a less-intense way or if your knees that are on the floor are hurting, fold your mat underneath them or put a cushion under them! better to have less of an invasive stretch than to hurt yourself! always!<br><br><br>P.S this is in NO way a dig at pamela. i love her workouts! i just realized as i was doing this routine that some of the poses were off and wanted to correct it because i do not want anyone that has 0 experience in stretching to hurt themselves, i’ve been there :/ and i also of course hope this will make your stretches even more successful! good luck!",
    "THIS IS SO RELAXING AND PAINFUL AT THE SAME TIME &gt;:(("
  ],
  "channelSubscriberCount": 10400000,
  "channelVideoCount": 290
}