{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.75
    },
    {
      "level": "Intermediate",
      "score": 0.5
    }
  ],
  "techniqueDifficultyConfidence": 0.8,
  "techniqueDifficultyExplanation": "The workout is described as including asymmetrical poses, pelvic floor exercises, and core work, which suggests a focus on form and coordination appropriate for pregnant individuals. These exercises are typically simple and focus on maintaining health during pregnancy rather than complex movement patterns, aligning with Beginner and potentially Intermediate levels due to pregnant women's need for body awareness.",
  "effortDifficulty": [
    {
      "level": "Moderate",
      "score": 0.7
    },
    {
      "level": "Challenging",
      "score": 0.4
    }
  ],
  "effortDifficultyConfidence": 0.7,
  "effortDifficultyExplanation": "The video duration is 30 minutes, which is moderately long but not overly intense, and the cardio involved aims to get the heart pumping. However, being tailored to pregnant women, the intensity is likely moderate to ensure safety. This suggests a moderate level of physical exertion appropriate for pregnant individuals, with a potential for those less active to find it challenging, thus covering Moderate and somewhat Challenging effort levels.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.6
    },
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.4
    }
  ],
  "requiredFitnessLevelConfidence": 0.7,
  "requiredFitnessLevelExplanation": "Given the focus on pregnancy-friendly exercises, the fitness requirements are maintained at a low entry level (Beginner) but also accommodate Intermediate due to the 30-minute duration and inclusion of balanced poses. Advanced fits for individuals with more fitness experience who may still find benefit given the specific pregnancy-related exercises. The inclusion of various modifications inherently offered by yoga and pregnancy workouts suggests flexibility in entry points. This workout can be modified further, providing access across a range of fitness levels."
}