{
  "video_id": "lKx0sOz31C4",
  "title": "Best Exercise For Pregnant Women | 30-Minute Pregnancy Exercises For Easy Delivery",
  "description": "I get asked all the time for a the best exercise for pregnant women.  \"You have so many videos...Is there just one that I can do daily?\" Today's video is a routine with a little of everything to keep you and your baby healthy and prepare for an easy delivery! We will warm up, get the heart pumping with cardio, do some hip openers, asymmetrical poses, pelvic floor and core work and get baby is an optimal fetal position.  I hope you feel great after these pregnancy exercises! Safe for first trimester, second trimester and third trimester!\n\nNatural Birth Preparation Playlist: https://youtube.com/playlist?list=PLRuFBUMIEg8D-ztAOzvozZojBAzobeBjn\n\nPregnancy Workout Playlist: https://youtube.com/playlist?list=PLRuFBUMIEg8AKiIJt_o3uk7234iif1TI8\n\nGuide to cope with pain in labor: http://bit.ly/31MnU5Q \nPregnancy Meal Plan: https://landing.mailerlite.com/webforms/landing/w5v4m5\nPelvic Floor Guide For Birth Prep: https://landing.mailerlite.com/webforms/landing/n1q6t1\nPregnancy Yoga Cards: https://landing.mailerlite.com/webforms/landing/z7k4x9\nBirth Position Printable: https://landing.mailerlite.com/webforms/landing/v3t6i9\n\nYou can also check out my 7-day pregnancy workout challenge: https://youtube.com/playlist?list=PLRuFBUMIEg8Ab60Ha7S8l_pvtJ5RyaIm1\n\nYou can also find me on instagram @pregnancyandpostpartumtv \n\nMy other pregnancy cardio walking workouts: \nhttps://youtu.be/VOd-mJBwav4\nhttps://youtu.be/oNDOT_P2Cgc\n\nMy other pregnancy pilates workouts: \nhttps://youtu.be/26NPMmROB2Q\nhttps://youtu.be/xnTUuhtdWsI\n\nNatural Birth Education Playlist: \nhttps://youtube.com/playlist?list=PLRuFBUMIEg8D-ztAOzvozZojBAzobeBjn\nHow to avoid tearing during labor: https://youtu.be/aqLO5esBo0M\n_______________________________________________________________________________________________\nOther pregnancy workouts you may enjoy:\nPregnancy Exercises For Easy Delivery: https://youtu.be/CRpfORhoi2A\nPregnancy Exercises Second Trimester: https://youtu.be/qJ3L-YztHog\n15 Minute Pregnancy Workout: https://youtu.be/HB7rhqj9mn0\nPregnancy Cardio Workout: https://youtu.be/Aalbd7nco8I\n\n_______________________________________________________________________________________________Check with your doctor before trying any of these strategies or before starting this or any new exercise routine. Only do the movements safe for you in your pregnancy. You are responsible for your own safety. Full disclaimer at the bottom.\n_______________________________________________________________________________________________\nMore Freebies: \n\nGESTATIONAL DIABETES MEAL PLAN BY A DIETITIAN\nhttps://landing.mailerlite.com/webforms/landing/q5m7q8\n\nFREE WEIGHT MANAGEMENT COURSE WITH REGISTERED DIETITIAN AND CERTIFIED DIABETES AND BARIATRIC EDUCATOR: http://bit.ly/2mjlsF5\n\nTHE COMPLETE GUIDE TO HOW I HEALED MY 4-FINGER DIASTASIS RECTI GAP\nhttps://www.pregnancyandchildhoodnutrition.com/diastasis-recti\n\nTHE BEST 4 SCIENTIFIC-BASED DIETS (LIFESTYLES) TO LOSE WEIGHT with all 4 types of meal plans (KETO, PLANT-BASED, MEDITERRANEAN AND CALORIE COUNTING)\nhttps://www.pregnancyandchildhoodnutrition.com/weightloss\n\nHOW TO LOSE WEIGHT AND INCREASE BREAST MILK SUPPLY\nhttps://www.pregnancyandchildhoodnutrition.com/milksupply\n_______________________________________________________________________________________________\n\nDisclaimer: This is general prenatal fitness only. Please check with your doctor or health care provider to see if this video is safe for you. You are responsible for your own safety. Don’t do anything that feels unsafe for you or baby. Stop if you have any pain or discomfort, bleeding, chest pain or shortness of breath, dizziness or if you feel unwell. P&P Health Inc., Pregnancy and Postpartum TV and Jessica Pumple are not liable in any way for any injury, loss, damages, costs or expenses suffered by you in relation to this video or its content. \n\n\nJessica Pumple is a registered dietitian, and pre & postnatal fitness instructor.  She helps pregnant women stay fit, have healthy babies, and easier labors. She helps new moms with postpartum recovery, to heal and strengthen their core and lose the baby weight.\n\nIf you enjoy our content subscribe to our channel, hit the bell button, leave a comment, and share with your friends so I can make you more of the videos you enjoy!\n\nCopyright P&P Health Inc. 2022. All rights reserved. \nMusic: Epidemic Sound\n\n#bestexerciseforpregnantwomen #pregnancyexercises #pregnancyworkout",
  "channelTitle": "Pregnancy and Postpartum TV",
  "channelDescription": "Passionate about spreading positivity, confidence and encouragement for a healthy and fit pregnancy, an easier delivery and fast recovery postpartum!\n\nI have 400+ free pregnancy and postpartum workouts in many different styles: Yoga, HIIT, Pilates, Dance, Diastasis Recti Safe & More.\n\n*Check out my Birth Education Playlist to create your positive and empowering birth experience.\n\n*Heal and flatten your core after birth using my DIASTASIS RECTI Playlist.\n\nI hope you find something helpful here on the channel and I’m so grateful to be able to share my passion and life with you!\n\nJessica Pumple\nRegistered Dietitian\nYoga & Fitness Instructor\nCertified Pregnancy and Postpartum Core Exercise Specialist\n\nContact: support@pregnancyandpostpartumtv.com\n\n",
  "tags": [
    "best exercise for pregnant women",
    "best exercise for pregnant 3rd trimester",
    "exercise for pregnant women",
    "exercise for pregnant women third trimester",
    "exercise for pregnant women 9 months",
    "pregnancy exercises",
    "pregnancy exercise for normal delivery",
    "pregnancy exercise third trimester",
    "pregnancy exercises third trimester",
    "pregnancy exercises for easy delivery",
    "pregnancy exercises 3rd trimester",
    "pregnancy exercises to induce labor",
    "pregnancy workout",
    "30 minute pregnancy workout"
  ],
  "publishedAt": "2022-05-26T17:08:49Z",
  "duration": 1822,
  "durationFormatted": "30:22",
  "viewCount": 1179321,
  "likeCount": 11779,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lKx0sOz31C4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lKx0sOz31C4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lKx0sOz31C4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lKx0sOz31C4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lKx0sOz31C4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lKx0sOz31C4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Congratulations on your pregnancy! You can check out my natural birth preparation list here: <a href=\"https://www.youtube.com/playlist?list=PLRuFBUMIEg8D-ztAOzvozZojBAzobeBjn\">https://youtube.com/playlist?list=PLRuFBUMIEg8D-ztAOzvozZojBAzobeBjn</a>",
    "Hello! This is my second time being pregnant, and I&#39;m only a little over 6 weeks along. My first pregnancy didn&#39;t go beyond 7 weeks, and I was devastated. I&#39;m not gonna lie: I&#39;m still recovering mentally and emotionally from it since it happened in the middle of last year. I&#39;m hoping I make it beyond the 7 weeks this time, but it&#39;s not easy: I&#39;m already considered a high risk pregnancy with only one kidney, and I&#39;m taking the necessary time off from work to help reduce my stress. However, it is making me very restless. I got back into yoga just shortly before I found out I was pregnant, and your videos have helped me tremendously! Thank you so much! I&#39;m trying to stay positive for myself, my baby, and my husband! I&#39;d welcome any and all healing vibes- and I&#39;ll be sure to give quite a few back to you all! Be well! ❤",
    "alhamdulillah I am very grateful to find this video, currently I am pregnant with my 7th child at the age of 40. I pray that Allah will ease the pregnancy process until delivery for me and all of us who are currently pregnant.",
    "Almost 33 weeks pregnant and trying to do 2-3 videos of yours a week plus daily walks. Preparing for the big day!",
    "Im not very active. I’m 29 weeks 5 days today. I stopped at <a href=\"https://www.youtube.com/watch?v=lKx0sOz31C4&amp;t=803\">13:23</a> this is hard when you aren’t a very active person. I have hardwood floors and I need to figure out something to help ease the pain off my knees and hands when on the ground. I don’t have a mat and the rug I have doesn’t feel different than the floor. Tomorrow I’m going to try again but I am out of breathe and my hands and knees hurt. 😅 I know this won’t compare to labor pain but I’m still proud of myself."
  ],
  "channelSubscriberCount": 2140000,
  "channelVideoCount": 1015
}