{
  "video_id": "lLJN10iIrUI",
  "title": "5 Minute HIIT workout | Seniors, beginners",
  "description": "This 5 minute high intensity interval training session (HIIT) will get your heart rate up and burn calories! This workout can be done standing or in a chair. Benefits of HIIT include improving:\n✅ blood pressure\n✅ cardiovascular health\n✅ insulin sensitivity (which helps the exercising muscles use glucose for fuel to make energy)\n\nHIIT can also help lower cholesterol levels and abdominal fat and body weight while maintaining muscle. \n\nThis workout includes five exercises in 30 second rounds with 20 seconds of rest in between intervals:\n✳️ Jumping Jack\n✳️ Fast Arms\n✳️ Out out/In in\n✳️ Knee ups\n✳️ Punch ups\n\nTo learn more about HIIT, check out our blog post \"Should I be doing HIIT?\": https://bit.ly/3gPi2TN\n\nyes2next celebrates fitness and joy at any age. It’s never too late to start exercising, creating, and doing. Say “yes” 2 your next steps to fitness and joy.\n\nIf you are new to our channel, we're happy you clicked on our video! We hope you enjoy it!  Please show your love💓 and support 🤝 and join the yes2next community by subscribing and pressing (🔔) to join the Notification Squad and stay updated with new uploads ✨ If you have any inquiries or requests, feel free to leave them in the comments below.\n\n🔴 Subscribe Here: https://www.youtube.com/@yes2next\n👍 Like the video (it helps a ton!)\n💬 Comment below to share your opinion!\n🔗 Share the video with anyone you think it might help :)\n\n\n📲 Stay Connected: \n📷 𝐈𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦: https://instagram.com/yes2next \n⚫️ 𝐓𝐢𝐤𝐓𝐨𝐤: https://tiktok.com/yes2next \n🔵 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤: https://facebook.com/yes2next \n🔵 𝐓𝐰𝐢𝐭𝐭𝐞𝐫: https://twitter.com/yes2next \n🔴 𝐏𝐢𝐧𝐭𝐞𝐫𝐞𝐬𝐭: https://pinterest.com/yes2next\n🌐 𝗪𝐞𝐛𝐬𝐢𝐭𝐞: https://yes2next.com\n ✉ 𝐄𝐦𝐚𝐢𝐥: yes2next@gmail.com \n\nDisclaimer: This program is provided with your health and safety in mind, but every individual has their own limitations. It is crucial that you consult with your physician before beginning this or any other exercise program. This program is not a substitute for professional medical diagnosis, treatment or advice. By participating in this exercise program, you do so at your own risk. Please stop if you experience pain, dizziness, or shortness of breath.",
  "channelTitle": "yes2next",
  "channelDescription": "yes2next is all about fitness and joy at any age, including seniors over 50. Say yes to your next adventures and reaching your full potential. I’m April, a personal trainer with senior fitness and functional training specialist certifications from the American Council on Exercise and The Biomechanics Method for Corrective Exercise. My 83-year-old mom and I are excited to share our passion for healthy living with our exercise videos for beginners and seniors, lifestyle tips, and fun. \n\nStay connected with us by subscribing and following us on:\n⭐️ Facebook: https://facebook.com/yes2next\n⭐️ Instagram: https://instagram.com/yes2next\n⭐️ Twitter: https://twitter.com/yes2next\n⭐️ Pinterest: https://pinterest.com/yes2next\n⭐️ Tiktok: https://tiktok.com/@yes2next\n\n👉 To keep in touch by email,  sign up at https://yes2next.com\n👉 Find yes2next gear at our store: https://yes2next.com/shop\n\n❤️ To donate, visit our Paypal page: https://bit.ly/y2ndonate Thank you!\n\nSee you soon! 🏃‍♀️🏋️‍♀️ 😊\n",
  "tags": [
    "beginner workout",
    "senior workout",
    "at home workout",
    "exercise routines",
    "chair workout",
    "senior chair exercises",
    "chair exercises for seniors",
    "exercises for seniors",
    "senior workouts",
    "HIIT",
    "HIIT for beginners"
  ],
  "publishedAt": "2022-02-15T14:00:53Z",
  "duration": 439,
  "durationFormatted": "7:19",
  "viewCount": 51667,
  "likeCount": 1732,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lLJN10iIrUI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lLJN10iIrUI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lLJN10iIrUI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lLJN10iIrUI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lLJN10iIrUI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lLJN10iIrUI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "We really need you on our UK morning shows to get us going. You are a tonic to the soul. You remind me of my fun times with my late mom.",
    "If you feel tempted to skip your exercise on a certain day, along comes these 5min HITT workouts, and then you say... &quot; I can manage this one!&quot;  I really appreciate these short but active sessions! Thanks again to both you lovely ladies!! :-)",
    "Love the jumping jacks. I thought those days were long gone. 5 minutes makes it easy to not avoid doing all of them. 30 second count downs I love. As short spurts and not &quot;when will this end?&quot; Looks like many of us can benefit from 5 minute work outs. Plus during the day, just do some spread out during some downside.",
    "Love this! I am obese, 61, and haven&#39;t moved much in over 2 years. I could do this while sitting and am proud to have finished it. My heart rate went up. I can see me doing this at least twice a day and build up to the other exercise videos. My shoulders have been hurting lately and this will get them moving. Thank you so much. You just may have saved my life! ♥",
    "I have not been on top of my workouts lately, but this video has helped me to kick start my daily exercise routines and get back in the game!!❤❤💪🏼"
  ],
  "channelSubscriberCount": 456000,
  "channelVideoCount": 322
}