{
  "video_id": "lMTyp5npt78",
  "title": "Upper Back Love  |  Yoga For Back Pain",
  "description": "Activate, stretch, and relieve any tension in this 23-minute yoga session specifically designed for the upper back. Take time for yourself to breathe deep and bring balance back to your mind and body. In this video, we use yoga asana to counteract the effects of daily life (like hunching over your computer) that contribute to upper backaches, pain, and tightness. Practice this session regularly for the ultimate preventative care in the upper back, welcoming healthy posture and an open heart.\n\nFor more yoga sessions for Upper Back, Neck & Shoulders, try the Yoga for Back Pain playlist: https://www.youtube.com/playlist?list=PLui6Eyny-UzywNCo0zRu9dduvlNXzfDyk\n\nLet me know how your practice went in the comment section below!\n\nSubscribe to this channel to support YWA and free yoga FOR ALL!\n  \n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "upper back stretches",
    "yoga for back pain",
    "yoga for the spine",
    "yoga for spine",
    "sciatica stretches",
    "back pain",
    "free yoga videos",
    "yoga at home",
    "morning yoga",
    "home yoga practice",
    "30 days of yoga",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga",
    "healing yoga",
    "Online yoga class"
  ],
  "publishedAt": "2019-05-26T05:00:02Z",
  "duration": 1404,
  "durationFormatted": "23:24",
  "viewCount": 6759830,
  "likeCount": 97789,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lMTyp5npt78/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lMTyp5npt78/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lMTyp5npt78/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lMTyp5npt78/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lMTyp5npt78/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lMTyp5npt78\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Take some time for you today, my friends. Remember, a little goes a long way. xx",
    "YWA Feb 2024! So excited for this one tomorrow, gonna be delicious. Have a great day everyone and FWFG 🌸",
    "Hello Adrienne, Thankfully, I want to share with you that my daughter (22years old ) and I (58 years old) have been doing Yoga with you, since pandemia started in Mexico by the middle of March 2020. We started with your 30 day yoga videos, the first time we finished the sequence of the complete 30 days including Saturdays and Sundays, we felt so successful and grateful to you ( you will never know how much yo have helped to our physical and mental health. <br>We live in Cuernavaca , Morelos, Mexico. After the third month of your 30 days videos, we started to pick a different video for each day, according our necessities as you always say “ listening to the needs of our bodies” , for lower back, for upper back, to relax, to sleep, etc . We do yoga with you every day, now we are doing it from Monday to Friday but if one of us is in pain or in need we do it even on Saturday or Sunday. What you have done putting your videos at no cost and available to everybody no matter where we are. That is the way we found you and you have really reached to us. We love you Adrienne. THANK YOU SO MUCH FOR EXISTING, AND DO WHAT YOU DO. YOU ARE AWSOME. We admire you so much. We sent you our very best wIshes for whatever you need. THANK YOU SOOO SOOOOO MUCH. From Mexico with love.",
    "Celebrating my 50th birthday today! Thankyou for this upper back stretch to set me up for the day! x",
    "This is exactly what my body needed today.  Her schedule always seems to be spot on.  Thank you all for joining me and Adriene for the creation and time spent."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}