{
  "video_id": "lMWOrDH694c",
  "title": "Yoga For Weight Loss  |  Healthy Energy Flow  |  Yoga With Adriene",
  "description": "Yoga For Weight Loss, Healthy Energy Flow guides you to the mat to cultivate the healthy flow of energy you need to explore your body and create a sustainable practice. \n\nTrim, tone and build lean muscle mass with attention on alignment, action, and sensation. \n\nWant to feel your best this Spring and Summer? Commit to this practice and you will want to return to the mat again and again. \nKeep returning to the mat and you will feel and see results. \n\nLet me know how it goes down below!\n\nNamaste. \n\n- - - - - - - - - - - - - - - - - - - - -\n\nOur Yoga For Weight Loss series is a set of full-length yoga workout videos designed to burn fat, workout your core and strengthen and lengthen your body. Check out the full playlist here: https://www.youtube.com/playlist?list=PLui6Eyny-Uzx2jQYA8MS73ND2kUMHyII8\n\n- - - - - - - - - - - - - - - - - - - - -\n\nRELATED VIDEOS\n\nYoga For Weight Loss - Balance Practice\nhttps://www.youtube.com/watch?v=rcIPOy_wOuE\n\nYoga For Weight Loss - Total Body Workout\nhttp://www.youtube.com/watch?v=qSG7PsdZG04\n\nYoga For Weight Loss - Abs & Arms\nhttps://www.youtube.com/watch?v=HEHdQxdQT5c\n\nYoga For Weight Loss - Core Workout\nhttp://www.youtube.com/watch?v=a83LhW_CX4g\n\nYoga For Weight Loss - Strengthen & Lengthen\nhttp://www.youtube.com/watch?v=6UEWJsljPVM\n\n- - - - - - - - - - \n\n❤️SUBSCRIBE to the YWA channel for free yoga videos every week and to support high-quality free yoga for all! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\n🧘🏽♂️🧘♀️Become a FWFG YOGA member! 🧘🏻♂️🧘🏿♀️\nhttps://fwfg.com/?via=adriene\nJoin Find What Feels Good and access over 700 videos including yoga and meditation for all levels. Explore daily practices, workshops, in-depth learning, weekly or monthly accountability series, and an opportunity to connect with a one of a kind global community. This is your one-stop-shop for yoga, creativity, wellness, and all things FWFG. Try it FREE for 7 Days! \n\n- - - - - - - - - - \n\n🗓Get your FREE Yoga Calendar: 🗓\nhttp://yogawithadriene.com/calendar/\n\n- - - - - - - - - - \n\nMore at www.yogawithadriene.com\n▶︎ Instagram: @adrienelouise\n▶︎ Twitter: @yogawithadriene\n▶︎ Facebook: Yoga With Adriene\n▶︎ Shop: https://shop.fwfg.com\n\n- - - - - - - - - - \n\nMusic by Shakey Graves: \nhttps://www.shakeygraves.com\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for weight loss",
    "yoga to lose weight",
    "weight loss yoga",
    "yoga",
    "yoga (sport)",
    "yoga workout",
    "adriene mishler",
    "weight loss",
    "workout",
    "yoga class",
    "exercise",
    "weight loss (symptom)",
    "lose weight",
    "burn fat",
    "online yoga",
    "austin yoga instructor",
    "yoga with adrienne",
    "online yoga class",
    "yoga at home",
    "yoga practice",
    "free yoga",
    "yoga lesson",
    "fitness",
    "beginners yoga",
    "beginner yoga",
    "transformation",
    "yoga for core",
    "yoga for arms",
    "yoga sculpt",
    "yogi",
    "yoga for butt and thighs",
    "yoga fit"
  ],
  "publishedAt": "2017-03-19T13:20:37Z",
  "duration": 2166,
  "durationFormatted": "36:06",
  "viewCount": 7888096,
  "likeCount": 70732,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lMWOrDH694c/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lMWOrDH694c/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lMWOrDH694c/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lMWOrDH694c/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lMWOrDH694c/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lMWOrDH694c\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you so so very much Adriene! Thanks to your inspiration and wonderful teaching. I have committed to a regular, mostly daily home yoga practise for over two years and its thanks to you and your programmes. I have noticed a difference physically for sure (i was rocking the core today, something that i used to dread and hate but now do with a smile on my face!) but for me its been about connecting with my spirit and my breath (so this practise was spot on!) and how its carried off my mat into my consciousness, the way i treat others, deal with my emotions and being able to observe my actions and reactions on a daily basis. I thank you in my &#39;gratitude practise&#39; i have at the end of every session in shavasana / meditation; you are in a star studded line up of the tools of yoga, the  Universe and Spirit :D So so much love to you and gratitude, keep up the amazing work sis*star, you inspire so so many people. Arohanui (lots of love and community) from Aotearoa! (New Zealand) Please come visit here someday! I live in the paradise world of Wanaka and you would be a welcome guest anytime :-) xxx",
    "Adriene,   I am celebrating my 71st birthday with your class.  I am so very grateful to you.  Your happiness and positivity gives me hope, love and gratitude.  XOXXO",
    "79 yo and still do yoga 5 to 7 days a week. 😊 good health to all in 2025. Stand up for those who are vulnerable, fragile, the very young, and the old.",
    "Anyone else here in 2024? Absolutely loving this series❤",
    "There are days when i just don&#39;t feel like doing yoga. Today i&#39;ve come to the mat, did 18 minutes of the practice and stopped the video, i simply couldn&#39;t continue to follow it, it felt wrong. <br>I&#39;m writing this as a reminder of Adriene&#39;s words &quot;Find What Feels Good&quot;. Yoga doesn&#39;t always feel good and that&#39;s OK. I&#39;m still proud of myself for doing yoga almost daily for over a year now! I notice how my mind and body get stronger with every practice.<br>Thank you, Adriene!"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}