{
  "video_id": "lNPaDikuRhU",
  "title": "15 Minute Gentle Full Body Stretch",
  "description": "Jessica Valant, physical therapist and Pilates Teacher, brings you a 15 minute gentle full body stretch routine that you will love! This full body stretching workout is perfect for anyone experiencing back, hip or hamstring tightness. This full body stretch will leave you feeling relaxed, rejuvenated and more flexible in a safe and gentle way!  \n\n⭐️ Join my online UNLIMITED community and membership with hundreds of home workouts, recipes, workout plans, women's health information, beginner programs, podcasts and more to support you in your body!  ➡️ http://www.jessicavalant.com/unlimited\n\n🎧 Find my podcast Meet Your Body anywhere you listen to podcasts! Or listen here http://www.jessicavalant.com/podcast\n\n💜 A week of free workouts and resources to your inbox: http://bit.ly/2EMBhsJ\n\n💥 Find the Jessica Valant app here!\nApple IOS - https://tinyurl.com/mry5ya8r\nGoogle - https://tinyurl.com/yh3ty5fp\n\n🎧 Podcast - https://meetyourbody.buzzsprout.com\n💪🏽 Four Week Beginner Workout Program: https://payhip.com/b/d3ARC\n🎥 Subscribe to my YouTube channel: http://bit.ly/2E3rNbs\n🙌🏻 Instagram: https://www.instagram.com/jessicasvalant\n🤸‍♀️ Shop my favorites and discount codes: https://jessicavalant.com/favorites-2\n\n⭐️ Join my UNLIMITED program to feel strong, safe and secure in your body in all seasons of life! Get immediate access to over 400 home workout videos, monthly workout plans, women's health info, free app, recipe library, perimenopausal and postmenopausal support and the most supportive online community available! Join here 👉🏼 http://www.jessicavalant.com/unlimited.\n\n\n🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀\nJessica Valant and Jessica Valant Pilates, LLC, recommend you consult with a physician before starting any new exercise program. The information given here is not meant to treat or diagnose any medical condition. Please stop if you feel any pain or dizziness. You understand that physical activity can pose a risk and by watching this channel and these videos you assume all risk and release Jessica Valant and Jessica Valant Pilates, LLC, from all liability.",
  "channelTitle": "Jessica Valant",
  "channelDescription": "I’m Jessica, a licensed physical therapist, Pilates teacher and women's health expert with over 25 years of experience. I believe movement should be empowering, encouraging and fun! On my channel you’ll find workouts for everyone, regardless of skill level or experience. I also talk through various injuries and conditions, including my own experience with women’s health issues such as prolapse and hysterectomy. I want you to remember you are strong, you are powerful and you deserve to move your body and feel good while you do it. \n\nYou can find more of my tips and full length workout programs at http://www.jessicavalant.com.\n\n You can also find me and behind the scenes action on Instagram @jessicasvalant.\n\n🙌🏽 Do you like our free content? Consider donating to Jessica Valant Pilates to help support all our free resources: https://tinyurl.com/mvt56pfv\n",
  "tags": [
    "full body stretching",
    "15 minute full body stretches",
    "15 minute full body stretching",
    "full body stretches",
    "stretch workout for beginners",
    "beginner stretches",
    "stretches for beginners",
    "gentle stretch workout",
    "gentle stretches",
    "gentle stretch routine",
    "gentle pilates workout",
    "Jessica Valant pilates",
    "askdoctorjo",
    "pop sugar fitness",
    "back stretches",
    "hamstring stretches"
  ],
  "publishedAt": "2021-07-12T11:30:16Z",
  "duration": 913,
  "durationFormatted": "15:13",
  "viewCount": 575858,
  "likeCount": 10381,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lNPaDikuRhU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lNPaDikuRhU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lNPaDikuRhU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lNPaDikuRhU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lNPaDikuRhU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lNPaDikuRhU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "💪🏽 Want my full length workouts, daily routines, women&#39;s health info and more? Get a full home workout library, monthly fitness plans, recipes, free app and more  <a href=\"http://www.jessicavalant.com/unlimited\">http://www.jessicavalant.com/unlimited</a>",
    "I’ve been using your Pilates videos for about a year and I can’t say enough good things about your teaching and workouts.  You explain the techniques and exercises so it’s easy to understand and encourage to be at your level without guilt.  And I love that the workouts are 30 minutes or less.  It seems very doable and it’s why I’ve stayed with these workouts for so long.  I appreciate you offering these on YouTube!  Thank you so much!",
    "Really excellent gentle stretch. Your reminders to take care of ourselves and not go beyond comfort levels is priceless. Thank you and Let&#39;s Keep Moving!",
    "I love her! She’s the Bob Ross of pilates",
    "I love all your “gentle” classes. Such good stretches."
  ],
  "channelSubscriberCount": 914000,
  "channelVideoCount": 510
}