{
  "video_id": "lNWTMwvAJ9Q",
  "title": "Feel Incredible in 10 Minutes - Morning Yoga Stretch at Home Routine",
  "description": "Start your day feeling refreshed and energized with this quick 10 minute morning yoga stretch, perfect for beginners and experienced practitioners alike! This simple yet effective at home yoga session will help improve flexibility, reduce stress, and enhance your overall well-being. Whether you’re looking to wake up your body or find a peaceful moment before tackling your day, this stretch routine will leave you feeling incredible. No equipment needed—just you, your mat, and a commitment to feeling great!\n\nKey Benefits:\n-Boost energy and circulation\n-Improve flexibility and posture\n-Reduce morning stiffness and tension\n-Stress-relieving stretches\n-Perfect for all levels\n\nWatch this quick yoga video now to enjoy a gentle yet revitalizing yoga session to kickstart your morning with calm and focus.\n\nMake sure to give this video a LIKE and SUBSCRIBE to my channel for more free at home yoga videos like this one.\n\nOnline yoga classes are the perfect addition to your daily life. These accessible yoga classes make filling your cup each and every day a breeze, and it can be so enjoyable. You should feel good in your body and mind, filling your cup is the first step. So join me in the comfort of your own home for free online yoga practices!\n\n#Yoga #YogaClass #FreeYoga\n\nJoin this channel as a Member to get access to Members-Only Classes:\nINSTRUCTIONS TO JOIN MEMBERS-ONLY CLASSES\n1. Log onto YouTube via a computer/laptop.\n2. Click the JOIN button beside Subscribe on my channel page or video page. (Direct Link: https://www.youtube.com/channel/UCxYVPua6HC46HzgT8IIn3vg/join)\n3. You will be shown the Join page where you can choose between 2 Tiers. (Please READ what you are signing up for).\n4. You can then access Members-Only classes via my channel page in the Members-Only Playlist.\n\n\n\nDISCLAIMER:  Please consult with a physician before beginning any exercise program. By participating in this activity you acknowledge that this exercise is a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. \nYou agree to work according to your own limitations and take full responsibility for your own safety and well-being. You agree that you have been given permission by a doctor to perform any of the exercises in this video and any videos on this channel. By participating in this activity you agree to listen to your body at all times and never do anything that causes pain. You acknowledge that participation in this activity exposes you to a possible risk of personal injury. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "yoga",
    "yoga class",
    "free yoga",
    "at home yoga",
    "online yoga",
    "online yoga class",
    "morning yoga",
    "10 minute yoga",
    "10 minute morning yoga",
    "morning stretch",
    "10 minute stretch",
    "stretch at home",
    "stretch",
    "morning stretches"
  ],
  "publishedAt": "2025-01-07T12:00:59Z",
  "duration": 572,
  "durationFormatted": "9:32",
  "viewCount": 58508,
  "likeCount": 3801,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lNWTMwvAJ9Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lNWTMwvAJ9Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lNWTMwvAJ9Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lNWTMwvAJ9Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lNWTMwvAJ9Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lNWTMwvAJ9Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you so much for sharing your yoga sessions with the world. Every morning I practice with one of your videos before getting ready for work, I have ADHD and having this practice daily really makes a huge difference.   Greetings from Colombia!",
    "Your yoga is my favourite yoga! I don&#39;t know what type it is exactly, but I&#39;ve been following along with your videos for about 2 years now. It&#39;s so relaxing!!",
    "I have mostly done vinyasa which I enjoy but in the mornings my favourite is gentle sitting / laying down stretches, with other words - your videos! I’ve been starting my mornings with you for 2 years now and your videos have become an integral part of my routine. Thank you so much for sharing your classes, effort and beautiful energy Bird 🩷 and congratulations on your wedding. Here’s to a lifetime of happiness for you two! 💞",
    "My favorite type of yoga is this ❤ And I prefer laying because of my back pain but doing both is also good. 👍",
    "Congrats on your wedding! My fav poses are the ones I can do laying down cause it helps with back aches and pains and I feel like I release a lot of tension laying down on the floor. I also enjoy hip openers! 💗💗💗😘"
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}