{
  "video_id": "LqXZ628YNj4",
  "title": "Morning Yoga Flow  |  20-Minute Morning Yoga Practice",
  "description": "You just woke up. It is a brand new day. The canvas is blank. How do you begin? Take 21 minutes to cultivate a peaceful mind and strong body with this juicy breath-centric morning flow. \n\nWake up your core muscles, open to new horizons, shape your day in a beautiful way with this strengthening morning routine. \n\nMade with love. \n\nBenefits may include: strong muscle tone, more mobility, peaceful inner feelings, opportunity to take up space and feel your worth with your whole body. Benji. \n\nThis practice is designed to support you as you cultivate and manifest. \n\nLet me know how it goes for you in the comment section down below! \n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "morning yoga",
    "20 minute morning yoga",
    "morning yoga flow",
    "morning yoga stretch",
    "morning yoga 20 minutes",
    "morning yoga workout",
    "morning yogas for beginners",
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne",
    "morning yoga with adriene",
    "Morning yoga in bed",
    "20 minute yoga flow",
    "20 minute yoga stretch"
  ],
  "publishedAt": "2021-08-02T05:00:12Z",
  "duration": 1307,
  "durationFormatted": "21:47",
  "viewCount": 10076818,
  "likeCount": 117998,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/LqXZ628YNj4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/LqXZ628YNj4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/LqXZ628YNj4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/LqXZ628YNj4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/LqXZ628YNj4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/LqXZ628YNj4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Remember that this fiery morning session is designed to support you as you cultivate and manifest. <br><br>How do you feel after today&#39;s practice?",
    "I was in a medically induced coma back in April because of an intentional overdose. I was in that coma for nearly 3 weeks. When they pulled out the breathing tube they were literally praying because at that point only God knew if I was going to make it. For some reason I was never offered physical therapy. Then my father committed suicide a little over a month ago. I picked up yoga again shortly after that. Yoga is one of few things that are helping me today. My mother even practices with me sometimes. Thank you, Adriene, for this beautiful practice. I got frustrated at first because my wrists and knees are still weak, but the sweat and shake reminds me that I&#39;m still alive. Even if things are messy and difficult, I&#39;m going to keep moving. I love you and I love everyone in the yoga community. Pain is temporary. 🖤🖤🖤",
    "I cried about 1 minute into the video, while doing child&#39;s pose.. I felt so lonely. Being an adult is more hard work than they let on 😂<br>I cried again just now because I realised over 10,000 people did the yoga with me. Not so alone after all. That&#39;s a nice thought to hold on to. Thank you.",
    "Today marks 1,095 consecutive days of YWA. 3 full years. Thank you Adriene, Benji, YWA team and community. This is life changing. 🙏",
    "I did not expect to get absolutely rocked by yoga this morning, but here we are. I haven&#39;t even had coffee yet and I feel like I could run a marathon (which is a gross overestimation of my abilities)."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}