{
  "video_id": "lZxxH-xNBto",
  "title": "20 Minute Everyday Vinyasa Yoga Flow",
  "description": "This is a 20 minute yoga flow perfect for everyday practice. Re-visit whenever you need a quick pick me up. :) \n\nIf you enjoyed this video, be sure to give it a thumbs up and subscribe so you don't miss out on free yoga content.\n\nSee you on the mat!\n\n-\n\nMOBILE APP 📲🧘🏽‍♀️\nAccess exclusive classes on the Jess Yoga App! Available worldwide on iOS & Android. \nFREE to download:\nhttp://onelink.to/jessyogayt \n\n\nFAVORITES ✨ \nYoga Mat:\nLiforme (Use code 'JESSICARICHBURG' for 10% off)\nhttp://bit.ly/2uH0xNf​​​​​\n\nActivewear:\nStudio Kolektif Organic Yogawear (Use code 'JESSICARICHBURG' for 15% off)\nhttps://bit.ly/2WDxXtr\n\nJournal:\nWeekly Reset Planner + Artist of Life Workbook from Lavendaire\nhttps://shop.lavendaire.com/JESSICA10 (Use code 'JESSICA10' for 10% off)\n\n\nDONATE 🦋\nDonations to this channel allows me to keep creating new content + keeps yoga free & accessible to all.  \nIf you'd like to donate you can click the link below:\nhttps://bit.ly/31WdAZE\nThank you for supporting my work! \n\n\nCONNECT 🙏 \nBlog: https://jessicarichburgyoga.com​​​​​\nInstagram: https://instagram.com/Jessicarichburg​\nFacebook: https://www.facebook.com/jessicarichburgyoga/\n💌 Sign up for my newsletter:\nhttps://jessicarichburgyoga.com/newsletter/\n\n- \n\nDISCLAIMER\nThe information and practices on this website are not meant to diagnose, treat or cure any illness and and should not be used as a substitute for professional medical care. As with any exercise program, you take the risk of personal injury when you practice yoga. Please be mindful and listen to your body. By voluntarily participating in these practices, you acknowledge this risk and release Jessica Richburg from any liability. You are responsible for your own body's well being. Please consult with your physician prior to beginning exercise.\n\n\nMUSIC PLAYLIST:\nTicker by Silent Partner\nCalm by Silent Partner\nWhere I Am From by Topher Mohr and Alex Elena\nWindows Rolled Down by The 126ers\nEasy Day by Kevin MacLeod\nEastminster by Kevin MacLeod",
  "channelTitle": "Jess Yoga",
  "channelDescription": "Welcome to the channel! \n\nI'm Jessica, a 500-hr certified yoga instructor with a passion for health, wellness and sharing mindful movement. I'm here to support you on your yoga journey and give you the tools to live a more balanced and mindful life, both on and off the mat. \n\nOn this channel you will find a variety of classes with different styles, lengths and levels, along with the occasional vlog or sit-down chat.\n\nIf you enjoy practicing with me and want more exclusive yoga classes, meditations + courses then check out my app, Jess Yoga - available worldwide for iOS and Android (link below). \n\nThank you for practicing with me, and I’ll see you on the mat! \n\nFor business inquiries/collaborations please email richburg.jessica@gmail.com. ",
  "tags": [
    "yoga",
    "yogavideo",
    "yogaflow",
    "yogaclass",
    "vinyasayoga"
  ],
  "publishedAt": "2019-08-13T11:51:02Z",
  "duration": 1216,
  "durationFormatted": "20:16",
  "viewCount": 803905,
  "likeCount": 16631,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/lZxxH-xNBto/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/lZxxH-xNBto/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/lZxxH-xNBto/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/lZxxH-xNBto/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/lZxxH-xNBto/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/lZxxH-xNBto\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hi everyone! Thanks so much for practicing with me and I appreciate all of the feedback. 💕<br><br>It takes quite a bit of time to plan, film and edit each class so knowing how I can improve is helpful! My newer classes have improved audio/video sync so be sure to check those out, if this one didn’t suit you. Have a great day! <br><br>P.S. this video was filmed in one of my favorite places - Lombok, Indonesia 😊🙏",
    "Jess you’ve become my favorite YouTube yoga instructor! You don’t talk to much, you’re very informative and a great help. Keep up the good work!",
    "YouTube is flooded with yoga classes and I find most instructors talk way too much.  It makes it difficult to immerse yourself in a practice and make it your own with constant talking.  Jessica&#39;s minimal cues provide just enough to follow and gives the practice room to breathe. It&#39;s perfect.",
    "I like how slow and peaceful this was, no rushing, just soft and calm.",
    "I am a certified yoga teacher - and I can tell that this video is amazing! Very professional! Wonderful voice!!!!"
  ],
  "channelSubscriberCount": 837000,
  "channelVideoCount": 141
}