{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.4
    },
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.3
    }
  ],
  "techniqueDifficultyConfidence": 0.7,
  "techniqueDifficultyExplanation": "The description mentions a mix of high-intensity strength, cardio, and plyometric movements, with some exercises possibly being too advanced. The mention of modifications suggests that while there may be complex elements, the workout is accessible at multiple levels. Comments praise the absence of overly complicated moves, suggesting a balance between approachable and challenging exercises, supporting a moderate assignment across Beginner, Intermediate, and Advanced levels.",
  "effortDifficulty": [
    {
      "level": "Moderate",
      "score": 0.5
    },
    {
      "level": "Challenging",
      "score": 0.8
    }
  ],
  "effortDifficultyConfidence": 0.8,
  "effortDifficultyExplanation": "The workout is described as high-intensity with a focus on endurance and burning body fat, indicating a significant energy expenditure. With a duration of 29:03, it demands considerable effort for deconditioned users. The use of 'no repeat' suggests a sustained effort without breaks from simpler routine structures, appealing to more experienced participants, thereby justifying a strong score for 'Challenging'.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.4
    },
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.5
    }
  ],
  "requiredFitnessLevelConfidence": 0.8,
  "requiredFitnessLevelExplanation": "The video's technique difficulty and effort intensity suggest it can be approached by users at Beginner, Intermediate, and Advanced fitness levels. The availability of modifications (via following Toya) makes it accessible to beginners despite the intense nature of HIIT. The 29-minute duration and no-repeat high-intensity format require a readiness for sustained activity, aligning well with Intermediate and Advanced users. Beginner inclusion is justified by the feedback on modifications and positive testimonials from less experienced users."
}