{
  "video_id": "m1DBJhxKmiU",
  "title": "Do This Every Morning 20 min (low impact) full-body workout",
  "description": "Start your day with a smile on your face and by putting your health first! This will set the tone for your day and you will get your workout done first thing!\n\nWhen I asked my community on Instagram (@growwithjo) what the most difficult part of their days were, there was a huge response saying \"WAKING UP\", \"STARTING MY DAY RIGHT\", \"BEING IN A GOOD MOOD WHEN I WAKE UP\".\n\nI totally get this. Especially if you are waking up early and just not feeling like getting yourself to move out of your bed.\n\nThis is why I created this workout; to help you feel energized when you wake up, to boost your metabolism and for you to lose weight faster!\n\nRemember that exercise is only part of the journey. If your goal is to see a physical change, you will also have to take into consideration the amount and quality of the food that you are eating! \n\nIf your goal is not to lose weight, that's okay! This workout is great for all (especially beginners) - the entire workout is all standing, no equipment is needed, and you can even do this workout in a small space.\n\nIf any of the exercises are too challenging for you or too fast, slow it down, go at your own pace and if you cant continue to do the exercise, just walk in place. The goal is to keep your heart rate elevated so you get that metabolism boost and see RESULTS from this workout!\n\nI know you've got this- there is nothing that can stop you if you put your mind to it!\n\n0:00 Intro\n2:10 Workout\n21:54 Ending Notes\n\n_________________________________________________________________\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.\n\ngrowwithjo beginner workouts abs workout walking all standing low impact fun fitness videos",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "walking workouts",
    "all standing workouts",
    "no jumping",
    "low impact",
    "low impact workouts",
    "women beginner workout",
    "fitness videos",
    "abs",
    "absworkout",
    "Chloe ting",
    "do this everyday to lose weight",
    "Chloe ting shred",
    "lose weight",
    "do this every morning to get shredded",
    "thenx",
    "workout",
    "daily workout",
    "home workout",
    "weight loss routine",
    "2 weeks program",
    "weight loss challenge",
    "workout to lose weight",
    "workout challenge",
    "14 days weight loss program"
  ],
  "publishedAt": "2021-07-03T15:00:11Z",
  "duration": 1339,
  "durationFormatted": "22:19",
  "viewCount": 17751351,
  "likeCount": 368320,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/m1DBJhxKmiU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/m1DBJhxKmiU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/m1DBJhxKmiU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/m1DBJhxKmiU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/m1DBJhxKmiU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/m1DBJhxKmiU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "the top 3 things that keep me motivated are: workouts with no interruptions, a schedule to follow, and a community that keeps me accountable and inspired. Get this recipe for success and support the growwithjo channel here: <a href=\"https://growwithjo.com/pages/homefitness\">https://growwithjo.com/pages/homefitness</a>",
    "I commented 10 months ago when I said I will start. I&#39;m here and happy to report that I lost 16kg so far. Thank you🙌🏾🇿🇦",
    "leaving a comment so that everytime someone likes it i have to come back and workout",
    "Day 1: made it through 15 minutes! (I haven&#39;t ever worked out, and I am obese). Really proud of myself :) <br>Day 2: Got through the entire workout, and I am super proud of myself! I need to lay down now. It was pretty hard, but I did it! Next goal is to get through the video and not take any breaks.<br>Day 3: Got through the whole video, no breaks! Next time, I will try to focus on engaging my muscles more :)<br>Day 4: Finished! It feels like it&#39;s getting easier already. Let&#39;s see how long I&#39;ll hold up! <br>Day 5: Did the whole video, but I&#39;m sick so didn&#39;t do the movements as big and engaged as I&#39;d like. Hopefully I&#39;ll get back to it when I&#39;m no longer sick :) <br>Day 6: Still sick. My goal right now is just consistency. Wasn&#39;t able to get through the whole video, but I still got up and tried which is a win for the day. Hopefully I&#39;ll get well soon.<br>Day 7: Made it through half of the vid today. At least I&#39;m keeping up consistency, which is my biggest enemy! Update: felt better later today, and finished the rest of the video. So happy!<br>Day 8: Feeling better, and switched it up for one of the other 20minute beginner vids! Did the whole thing, and I&#39;m proud :) Sweaty and got the pulse up. <br>Day 9: Not feeling too great, but did 15 minutes today. My main goal is still consistency!<br>Day 10: I made it through 10 days!! Not as sick today, and felt like I could go through the whole thing without dying this time!<br>Day 11: Probably my best workout yet! Managed to actuallly give it all in all of the moves! Now I&#39;m all sweaty and happy :)<br>Day 12: Had a break day :)<br>Day 13: Had a great night&#39;s sleep, and it showed! Didn&#39;t feel as dead at the end this time, and I gave it my all. Feels so good to see improvements!<br>Day 14: Two whole weeks down, and I&#39;m feeling great :) I think it&#39;s time to move on and try some new videos to challenge myself a little!<br>Day 15: A bit tired today, but still got up and did the video :) <br><br>Day 20: had a elongated break due to health and traveling, but I am now back at it :) Didn&#39;t log the last 5 days. I feel a bit more out of shape than I did before my break, but still a lot better than day 1. Did the whole video, but with a little less energy towards the end. Goal is to do this every day until day 40! And I will allow myself to not be perfect every time as energylevels fluctuate. My goal is consistency, not perfection!<br>Day 21: Feels good to be back on the grind :) Tip if you&#39;re starting to &quot;get bored&quot; with the same video every time - watch something else while following the video! I just turn down the volume enough to hear the music in the background to follow the beat, and then watch something. Good for low energy days at least. For high energy days, I turn up the volume and focus on the video itself.<br>Day 22: Best day so far! I have never felt so motivated and engaged during the video before. I am sweaty and red-faced, as I should be. <br>Day 23: Less energy today (started my period) -- but did the whole video without a break! Less effort in the motions, so not as exhausted as yesterday, but as mentioned: goal is consistency :) Happy about it.<br>Day 24: Cramps today, so low energy workout today as well - but I did it :) Goal is to do this every day of May. Wish me luck!<br>Day 25: It&#39;s my birthday today! I got new kettlebells and dumbells :) So today I added some light weight to some of the movements - did them a little slower, but with engaged muscles and some added weight. Feels amazing :) <br>Day 26: Slow, but weighted workout today. Feeling good! A little sore from yesterday.<br>Day 27: Did an alternative video today, with some dumbells! Gonna switch it up a bit more often as I love the weighted videos too. <br>Day 28: Amazing workout today! Went all out, and I am so breathy, sweaty, and happy! <br>Day 29: I have managed to rupture my achilles (not from this vid!)... so won&#39;t be doing this workout until that is healed. Will be doing some weight workouts for upper body until I&#39;m back :) <br><br>Update: I&#39;ll be honest with you guys: it&#39;s been pretty rough lately. After I injured my achilles, I&#39;ve fallen back into some bad habits, and gained all the weight back T_T BUT! I am starting again today. Although my motivation is pretty low, I know in my mind that if I just stick with it (doesn&#39;t have to be perfect), I will eventually feel better, more motivated, and after some time I&#39;ll get results that show. It takes TIME! So consistency over perfection, every day :) Do it half-assed instead of not at all on the days I&#39;m not feeling it. You NEVER regret working out once you&#39;re done.<br><br>Day 30: (New start again!) Update March 2025: I am back at it, guys! I have gone down again to my original &quot;current weight&quot;. I got a dog a few months back, so I&#39;ve been doing my walks outside (45 mins every day). I now want to start doing these again, and I&#39;ve set myself a challenge to do both a walk with the dog and one at-home workout every day I can. If I&#39;m tired, I&#39;ll do it slowly. I still need to work on consistency, so that&#39;s my goal. Not to do it perfect every time, but to DO it every time. LET&#39;S GO!<br><br>Day 31: Weighed in again today, and have lost another kg since last time. Yay! Low energy today after a full workday and due to my cycle, but I&#39;m here - which is what counts. Let&#39;s keep at it :)<br><br><br>Starting Weight: 93kg / 205 pounds<br>Current Weight: 88,5kg / 195 pounds",
    "Every time someone likes this comment I will add a minute to my workout"
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}