{
  "video_id": "mBY3cjQYBm0",
  "title": "Cycling | Biking To LOSE BELLY FAT | Speed Up Fat Burning",
  "description": "Biking comes in many forms, including the bicycle, the stationary bike or spin bike and it can be a great tool for focusing on fat loss. How do we lose the lower belly fat, the lower back for or any fat that you body is holding on to that you don't like? Cardio can be used in specific circumstances and we will discuss the time, the intensity and how to ensure you are doing it properly. \n\nThe stationary bike has many options. We can use it for lower intensity, moderate intensity or even high intensity cardio session. How do we target body fat with these options?\n\nTry our free calorie calculator\nwww.prophysique.com/calculator\n\nFat loss comes down to creating a caloric deficit and using cardio as a tool to help you do just that. Doing cardio for fat loss the right way can make the process easier, improve other health markers and even improve recovery and hunger. \n\nBiking to lose belly fat, could it be better than walking for fat loss?",
  "channelTitle": "Paul Revelia",
  "channelDescription": "Fitness, health, Nutrition, Training and all things Pro Physique and Paul Revelia.",
  "tags": [
    "Why 93% of People NEVER LOSE BELLY FAT",
    "Why 93% of People Will Never Lose BELLY FAT | 5 Simple Steps",
    "You Won't Lose Belly Fat Until You Do This...",
    "The #1 Exercise To Lose Belly Fat (FOR GOOD!)",
    "The #1 Method to Lose Love Handles (FOR GOOD!)",
    "The Worst Cardio Mistakes Everyone Makes For Fat Loss (Avoid These)",
    "7 Surprising Ways to Speed Up Fat-Burning (AND LOSE WEIGHT FASTER)",
    "speed up fat loss",
    "diet hack"
  ],
  "publishedAt": "2023-08-08T16:35:57Z",
  "duration": 544,
  "durationFormatted": "9:04",
  "viewCount": 337053,
  "likeCount": 6226,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/mBY3cjQYBm0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/mBY3cjQYBm0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/mBY3cjQYBm0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/mBY3cjQYBm0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/mBY3cjQYBm0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/mBY3cjQYBm0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I lost 40 pounds since November and a stationary bike was a big part of that. I’ve got a bad knee and the bike was zero impact and strengthened my legs, helping my knee pain too. With that, I lifted three days a week and tracked my calorie intake. I feel great, and in better shape than ever since college, and I’m 51!",
    "I&#39;m 52 and I&#39;m in the best shape of my life. I&#39;ve been riding a stationary bike for a minimum of an hour everyday since Jan. 11, 2023. I wake up at 3:30am Monday through Friday, on Saturday and Sunday I do it whenever I can fit it in. I weigh my food and I count my calories. This has become a lifestyle for me and I absolutely love it.",
    "I suffer from depression, anxiety and gaming addiction. Thanks to you guys i overcome all of it and became more active in exercise. I recently bought a yesoul stationary bike and some weight lifting equipment. I do stationary bike about 3-4hrs in the morning and weight lifting in the afternoon in midnight I also do light cycling in stationary about 2hrs. Before this I weigh about 120kg that was october of 2023 and now February 2024 I weigh about 90kg. Cycling and weight lifting really changed my life. I hope this continues",
    "I totally agree with cardio early in the morning. There&#39;s always something getting in the way of my cardio session throughout the day. It has bothered me for months.",
    "I enjoy walking on my treadmill with or without my weighted vest on the highest incline (15), lifting heavy weights and riding my spin bike and road bike.  Having a home gym is a blessing. <br><br>Variety is key. <br>Looking excellent Paul. 💛"
  ],
  "channelSubscriberCount": 630000,
  "channelVideoCount": 1650
}