{
  "video_id": "mGSBbizjLMg",
  "title": "Upper Body Tabata Workout -- Intense 60 Minute Back, Shoulders, and Arms Workout",
  "description": "Calorie burn, how to combine this with our other videos, & all other information about this Fitness Blender Upper Body Toning Workout Video @ https://gofb.info/cZP7hA\n\nAt-home Workout Programs @ https://gofb.info/Programs \nExclusive workout videos, Workout Challenges, and site features @ https://gofb.info/FBPlus \n\n2 Week Workout Challenges @ https://gofb.info/PlusChallenges \nAdvanced search tool for over 600+ free workout videos @ https://gofb.info/WorkoutVideos \nThe most supportive fitness Community on the web @ https://gofb.info/FBCommunity \nMeal Plans written by Registered Dietitians @ https://gofb.info/FBMealPlans \nHealthy Living articles and recipes @ https://gofb.info/HealthyLiving\n\nFitness Blender Gift Cards @ https://gofb.info/GiftCards \nWe use PowerBlock adjustable dumbbells @ https://gofb.info/PowerBlock\n\nFitness Blender’s Workout Programs and subscription platform, FB Plus, make it possible to keep our individual workout videos and website free. We were founded with, and remain committed to, the goal of making health and fitness attainable, affordable, and approachable. We hope you enjoy our content and consider subscribing to our YouTube channel and registering on our website, which is free and open to all @ https://www.fitnessblender.com/ \n\nKeep up with us on Facebook @ https://gofb.info/Facebook Instagram @ https://gofb.info/Instagram Twitter @ https://gofb.info/Twitter Pinterest @ https://gofb.info/Pinterest\n\nNote: All information provided by Fitness Blender is of a general nature and is furnished for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold Fitness Blender harmless from any and all losses, liabilities, injuries, or damages resulting from any and all claims.",
  "channelTitle": "FitnessBlender",
  "channelDescription": "We offer at-home workout videos created by certified personal trainers and doctors of physical therapy. In our videos, you’ll see us sweat, laugh, lose count, and modify exercises based on what our bodies are telling us—we have fun with our workouts, and we want you to enjoy yourself, too! No matter your fitness level, if you need help with consistency, motivation, or achieving specific fitness goals, we’re here for you.\n• Explore our library of workout videos, from strength training and HIIT to yoga\n• Reach your goals with smart and effective workout programs\n• Use the customizable workout calendar and personalized stats to track your progress\n• Eat better with healthy recipes and meal plans built by registered dietitians\n• Reduce stress with mental wellness resources from licensed psychologists\n• Interact with our community of like-minded exercisers for support and motivation\nJoin for free or access exclusive content with an FB Plus Pass or Subscription: https://gofb.info/Membership\n",
  "tags": [
    "upper body workout",
    "upper",
    "body",
    "workout",
    "video",
    "fitness",
    "blender",
    "fitness blender",
    "tabata",
    "tabata workout",
    "hiit",
    "cardio",
    "tone",
    "fitness videos",
    "full length workout videos",
    "workout videos online",
    "free workout videos",
    "home workout videos",
    "dumbbell workouts",
    "tone upper body",
    "upper body toning workouts",
    "kelli and daniel",
    "kelli and daniel workouts",
    "couple workouts",
    "live workouts",
    "fitness blender live"
  ],
  "publishedAt": "2013-02-20T00:17:44Z",
  "duration": 3522,
  "durationFormatted": "58:42",
  "viewCount": 1526393,
  "likeCount": 10111,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/mGSBbizjLMg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/mGSBbizjLMg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/mGSBbizjLMg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/mGSBbizjLMg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/mGSBbizjLMg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/mGSBbizjLMg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Yes! If you guys like this style of workout video, we can do more like this (in additional to our normal, voiced-over workouts) and possibly, hopefully, hypothetically speaking, bring you even more new workout videos :)",
    "We thought so too! We were a bit nervous for this first one so I am sure there&#39;s a bit of a learning curve, audio will get better, etc. It was actually really hard to remember not to say smart alec things to each other haha",
    "Still one of the most effective upper body workout so far!",
    "Thank you! And you know you&#39;re setting an awesome example for your kids by working out and treating your body well!",
    "I actually really loved this one! My upper body is completely toast. I normally have a hard time targeting muscles on my upper body, but after so many sets I feel like I hit everything!"
  ],
  "channelSubscriberCount": 6590000,
  "channelVideoCount": 1603
}