{
  "video_id": "miI70WR4FXo",
  "title": "30 MIN TRISETS Full Body Workout with Dumbbells | Strength Training",
  "description": "30 minutes full body let’s go!!! Grab your dumbbells and let’s work through trisets with compound and isolation exercises with dumbbells and bodyweight to help increase strength, endurance, core stability and finish feeling accomplished!!\n\nThe timer will be on for 30 seconds throughout! We will work through 3 similar exercises changing from 2 dumbbells, to 1, to alternating or bodyweight only!\n\nYou effectively reduce the weight between each set in the trisets through it doesn’t necessarily mean it will feel easier!\n\nHIGH SQUATS x2/x1/BW\nLUNGES x2/ x1/ BW (same side)\nLUNGES x2/ x1/ BW (switch side)\nRDL x2/ x1 STAGGERED / x1 OPP\nPRESS x2 / x 2 ALT/ x 1\nUPRIGHT ROW x2 / ALT x2/ x1\nKNEEL TO SQUAT x2/ x1/ BW (same side)\nKNEEL TO SQUAT x2/ x1/ BW (opp side)\nBENT OVER ROW x2/ x2 ALT/ x1\nCURLS x2/ x2 ALT / x1\nREAR DELT FLYES x2/ ALT x2/ BW\nCURTSEY LUNGE x2/ x1/ BW\nCHEST PRESS x2 / x1/ x1\nTRICEP DIAMOND x2/ ALT/ x1 DB\n\nFinisher:\nSQUAT TO PRESS INDIV/ IN ONE/ x1\n\nFor those who are working through EPIC or have already smashed the EPIC Program, you will love this 30 minute session!! \n\nLet’s feel those muscles work hard! \n\nCx\n\n▶ My Instagram: https://instagram.com/carolinegirvan\n▶ Subscribe to my YouTube Fitness Channel for FREE: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nExtras:\n\n▶ My 5 Min Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n▶ My 30 Min PUMPING Cardio Workout: https://youtu.be/kZDvg92tTMc\n▶ My NEW 10 Min UNBROKEN Abs Workout: https://youtu.be/cS-bIr-6hQM\n▶ My NEW 20 Min SOLID Arms & Shoulder Workout: https://youtu.be/ME0cj3FTbms\n\nEquipment I use in my workouts:\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\nEPIC Program:\n\n▶ My FREE 10 Week Program Guide: https://carolinegirvan.com\n▶ Official EPIC Program Apparel: https://teespring.com/stores/carolinegirvan\n▶ The EPIC Program Playlist: https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\n▶ The EPIC Beginner Series: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\n\nBusiness Enquiries:\n\n▶ Email: info@carolinegirvan.com\n\nCaroline Girvan \nPO BOX 115\n\nCounty Antrim \nNorthern Ireland \nBT38 8WB\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "caroline girvan",
    "full body workout",
    "dumbbell workout",
    "workout",
    "dumbbells",
    "strength training",
    "strength workout",
    "workout with dumbbells",
    "full body workout with weights",
    "full body workout with dumbbells",
    "full body dumbbell workout",
    "full body workout at home",
    "30 minute workout",
    "strength training for women",
    "full body",
    "full body strength workout",
    "fitness",
    "exercise",
    "core",
    "home workout",
    "abs",
    "six pack",
    "arms",
    "shoulders",
    "legs",
    "isolation exercises",
    "compound exercises"
  ],
  "publishedAt": "2020-12-18T05:00:08Z",
  "duration": 2120,
  "durationFormatted": "35:20",
  "viewCount": 874466,
  "likeCount": 18751,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/miI70WR4FXo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/miI70WR4FXo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/miI70WR4FXo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/miI70WR4FXo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/miI70WR4FXo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/miI70WR4FXo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Everyday I tell myself I&#39;m never doing another Caroline workout. and yet here we are!!! Beast mode.",
    "Wife, mother, housewife, certainly busy with Christmas preparations, but you dear Caroline, do not miss the opportunity to make us happy with new videos every day. 🙌I write deliberately happy because we could be more than  lucky that you have decided to put such great, unique, creative, demanding, varied exercises online.\r❤💯<br>You can easily manage the missing 5000 subscribers up to 450,000\r🖐<br>\r<br>Today&#39;s video was great, I had a lot of fun. Ultimately, you could decide which dumballs to use. Trisets are a great idea, more of them please.\r<br>\r<br>I would like to positively mention that the tips / hints can now be seen much better.\r👍<br>\r<br>Wish you a nice evening",
    "I woke up thinking I want to do full body but don’t have time for an hour and here was a gift from Caroline!",
    "I love trisets! Every single workout shows your creativity. Thank you! Have a loveley day, everyone!",
    "I&#39;ve never worked with weight in my life (strictly Yoga &amp; Pilates kind of chick.) My husband told me to give a weight workout a shot, &quot;Find ANYONE on YouTube for a beginner/intro weights workout and just TRY IT.&quot; You were the first person I clicked on, and I HAVE NOT LOOKED BACK!!!!! Thank you for all your AMAZING videos! so grateful to have found your channel. YOU ROCK xx"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}