{
  "video_id": "MIr3RsUWrdo",
  "title": "20 Minute Guided Meditation for Reducing Anxiety and Stress--Clear the Clutter to Calm Down",
  "description": "This is a guided meditation to take you on a journey of relaxation.  You will clear the clutter of your mind to calm you.   It will reduce your stress level,  as well as improve your overall health and well being when practiced regularly.  \n\n**For a powerful experience to help calm the overactive, overthinking mind, this meditation can be paired with this sleep practice to help you calm your mind before bed:  https://youtu.be/jcprGTfC4vc  \n  \nWritten and read by Sara Raymond\nMusic: Living Meditation Chris Collins, indiemusicbox.com\n\nSara's Book\nYou Are Not Broken: A compassionate guide to uncovering inner wisdom and transforming your life with hypnotherapy\nhttps://amzn.to/3CUdABJ\n\nDo not listen while driving. Meditation and mindful movement are powerful tools to support you. This is not a substitute for medical care. Consult a doctor or trusted health professional if needed.\n---------------------------------------------\n1:1 Sessions\nPERSONALIZED HYPNOTHERAPY & TRANSFORMATIONAL COACHING\nhttps://www.themindfulmovement.com/sara\n#healing #meditation #personaldevelopment",
  "channelTitle": "The Mindful Movement",
  "channelDescription": "Welcome!  Here at the Mindful Movement, we are an oasis where you can come to tap into your inner calm, develop a positive mindset and heal from the stress that’s blocking your fulfillment. We offer guided meditation, visualizations, and hypnosis as well as Yoga, Pilates and a variety of mindful movement practices to help you live mindfully, move well and feel great!\n\nWe would love to continue working with you personally if you are interested.  We offer self-paced, online courses, group coaching, and 1:1 services.  You can learn more at our website:  Themindfulmovement.com \n\nAdditionally, check out Sara's new book, You Are Not Broken: https://amzn.to/4g6Omyh\n\nThe Mindful Movement is happy to provide these meditations, podcasts, and videos free of charge. If you wish to make a donation, please know that whatever you offer will be received with much gratitude. http://themindfulmovement.com/donations/\n\nOur second channel: @theMindfulMovementinMotion\n\nMuch love!\nSara and Les\n",
  "tags": [
    "Meditation",
    "hypnosis",
    "relaxation",
    "stress reduction",
    "health",
    "morning meditation",
    "recovery meditation",
    "health meditation",
    "20 minute meditation",
    "evening meditation",
    "mindfulness meditation",
    "mindfulness",
    "mindful",
    "Sara Raymond",
    "The Mindful Movement",
    "breathing",
    "body scan",
    "letting go of negativity",
    "unlock your full potential",
    "connect with yourself",
    "open your heart",
    "emotions",
    "connect with your emotions",
    "reduce stress"
  ],
  "publishedAt": "2016-10-03T09:00:01Z",
  "duration": 1235,
  "durationFormatted": "20:35",
  "viewCount": 11577780,
  "likeCount": 143957,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/MIr3RsUWrdo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/MIr3RsUWrdo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/MIr3RsUWrdo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/MIr3RsUWrdo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/MIr3RsUWrdo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/MIr3RsUWrdo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I wrote this book for you. To give you a detailed snapshot of how hypnotherapy can help you release many of your dream-life blocks like guilt, shame, trauma symptoms, anxiety, self-doubt, or fear-related silence. <a href=\"https://amzn.to/4g6Omyh\">https://amzn.to/4g6Omyh</a>",
    "Whoever’s reading this, I hope something really wonderful happens to you today!!!",
    "I wish those who read this have a successful life, have a clear goal and find the right love.",
    "I am in such a bad place right now. My body hurts but my soul hurts even worse. This meditation brings me a bit of a relief. I so want to feel better again, to feel like my old self. I wish all of you people out there who are hurting to find peace and calm.",
    "just here to remind whoever is reading this that i am proud of you, of even the littlest effort you have made to get up and do something, it matters. You matter ❤️"
  ],
  "channelSubscriberCount": 936000,
  "channelVideoCount": 586
}