{
  "video_id": "mkD_qGRrDbg",
  "title": "Fat Burning Cardio Low Impact Quiet Barefoot - Full 30-Minute Workout (Cardio Mat Fusion 2)",
  "description": "GET OUR LOW IMPACT \"WALK ON: 21 DAY WEIGHT LOSS PLAN\" ON DVD: ‪http://amzn.to/1HVVgyp‬\n\nGET THE DIGITAL DOWNLOAD: ‪http://bit.ly/1vEMf76‬\n\nCardio doesn't have to mean loud, joint jarring moves! Join certified instructor Jessica Smith for this non stop session that will keep your heart rate up (and your downstairs neighbors happy) and is gentle enough to be done barefoot (but you'll still work up a good sweat).\n\nOh, and Peanut the french bulldog makes an appearance in this video too :)\n\nLevel: All\n\nEquipment: Mat\n\nIntensity: Moderate\n\nThis workout targets the muscles in the thighs, back, calves, glutes, hamstrings, abs, core, hips, shoulders, arms, biceps, triceps, lower back (and more) with moves like:\n\nLateral Taps\nGrand Plies\nSide Lunges\nSide Stretches\nSide Oblique Crunch\nArm Circles\nSide to Side Step Taps\nSide Walking\nSquats\nLateral Squats\nLow Impact Skaters\nHamstring Curls\nPlies\nFigure-8 Lunges\nStanding Saw\nPasse Steps\nSquat Reaches\nChair Pose\nTwisted Chair\nPrayer Pose\nPlank Pose\nPlank Running\nPlank Squats\nSit Up Crunches\nCan Can Abs\nStretching\n\nSUBSCRIBE to join our community and follow on social media for daily tips & support:\nInstagram: http://bit.ly/1kHhpX0\nFacebook: http://on.fb.me/196EUU6\nTwitter: http://bit.ly/12qqPkl\nBlog: http://jessicasmithtv.com/\nShop DVDs: http://www.jessicasmithtv.com/shop/",
  "channelTitle": "jessicasmithtv",
  "channelDescription": "If you are tired of trying to keep up with complicated programs, hardcore extreme exercise and ripped and shredded 'beach body' ideals, then this is the place for you! We would love to have you join our incredible global community of women focused on (but not obsessed with) staying healthy, strong and fit. Come join our community and get monthly access to our over 2,400+ hours (and counting!) of workout programming and series designed to help you stay CONSISTENT with exercise during all seasons of life. Learn more + start your 7-day free trial at: https://www.jessicasmith.fitness/ \n\nBe sure to join our free mailing list and receive our regular updates! https://bit.ly/3ysN63m\n\nDisclaimer: Be sure to consult your doctor before beginning this or any other exercise program. Not all exercises are suitable for everyone. By engaging in these workouts, you agree that you do so at your own risk, and assume all associated risk of injury. \n",
  "tags": [
    "home workout video",
    "Exercises To Lose Belly Fat",
    "Jessica Smith",
    "Pure Barre",
    "dance",
    "low impact",
    "cardio",
    "Physical Exercise (Word)",
    "aerobic exercise",
    "Fitness (Magazine)",
    "abs",
    "exercise",
    "fusion workout",
    "aerobics",
    "barre",
    "pilates",
    "core",
    "fusion",
    "workout",
    "barefoot",
    "fitness",
    "joint friendly",
    "French Bulldog",
    "walking",
    "quiet cardio",
    "Weight Loss",
    "yoga"
  ],
  "publishedAt": "2014-06-28T16:00:07Z",
  "duration": 2086,
  "durationFormatted": "34:46",
  "viewCount": 561067,
  "likeCount": 4827,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/mkD_qGRrDbg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/mkD_qGRrDbg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/mkD_qGRrDbg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/mkD_qGRrDbg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/mkD_qGRrDbg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/mkD_qGRrDbg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you for doing so many quiet workouts. I broke my pelvis four months ago and I can do most of your moves. I love being able to safely get my heart rate up! I used your sitting workout for the first few months of my recovery. You are awesome!",
    "This channel has some of the most engaging, fun, and &quot;feel good&quot; workouts! Never stop doing what you&#39;re doing!",
    "well this was my first ever workout with Jessica smith.  I do a lot of Ellen Barrett barefoot fusion workouts.  THis one I had sweat pouring off of me.  I thought I would not make it through.  But I did,  Look forward to doing more of her workouts.",
    "oh boy, i thought i was ready to move on to your moderate intensity workouts...made it about half way and am drenched. Guess I&#39;ll stick with the beginners for a while longer! Thanks!",
    "I paused the video for 30 seconds to caught breath and drink water every 12 minutes. I kept having to convince myself to keep going, but I did the whole thing and I feel good. I really needed a good sweat. I love that you have workouts for all fitness levels. Thank you for your hard work. You are so encouraging and realistic."
  ],
  "channelSubscriberCount": 539000,
  "channelVideoCount": 495
}