{
  "video_id": "MOrRRvSGIQc",
  "title": "45 Min FULL BODY WORKOUT | No Equipment | No Repeat | Rowan Row",
  "description": "► 45 Min FULL BODY WORKOUT | No Equipment | No Repeat | Rowan Row   \n------------------------------------------­­­­­­­----------------------------------\n• My Links •\nInstagram • https://www.instagram.com/rowanrow\nFacebook • https://www.facebook.com/rowanrow\nTwitter • https://twitter.com/rowanrowrowan\nWebsite • https://www.rowanrow.com\n----------------------------------------­­­­­­­----------------------------------­-­-­-­-\n• Music • \nEpidemic Sound \nhttps://www.epidemicsound.com\n----------------------------------------­­­­­­­----------------------------------­-­-­-­-\n• Contact • info@rowanrow.com\n----------------------------------------­­­­­­­----------------------------------­-­-­-­-­\n•  Subscribe to my channel here: https://www.youtube.com/rowanrow\n----------------------------------------­­­­­­­----------------------------------­-­-­-­-­\nAnd here it is a full 45min full body workout with no equipment and no repeat. \nI did not make it super intense so everyone can complete the whole workout. \nGreat for those who does not have any equipment as this workout it is body \nweight only and it is super effective. Give it a go and let me know how you find it. \nEnjoy!",
  "channelTitle": "Rowan Row",
  "channelDescription": "Welcome to my YouTube channel.\n\nAs always I love hearing from you! Leave a comment and let me know what type of video content you would like to see from me!\n\nINSTAGRAM - www.instagram.com/rowanrow\nFACEBOOK - www.facebook.com/rowanrow\nTWITTER - www.twitter.com/rowanrowrowan\nWEBSITE - www.rowanrow.com",
  "tags": [
    "45 Min FULL BODY WORKOUT | No Equipment | No Repeat | Rowan Row",
    "FULL BODY WORKOUT AT HOME",
    "45MIN WORKOUT AT HOME",
    "45 MIN WORKOUT WITH NO EQUIPMENT",
    "HOW TO TRAIN FROM HOME",
    "NO EQUIPMENT WORKOUT",
    "CHEST WORKOUT",
    "BACK WORKOUT",
    "LEGS WORKOUT",
    "SHOULDER WORKOUT",
    "ABS WORKOUT",
    "CARDIO WORKOUT",
    "ARMS WORKOUT",
    "UPPER BODY WORKOUT",
    "LOWER BODY WORKOUT",
    "BIGGER ARMS",
    "BIGGER CHEST",
    "THE BEST FULL BODY WORKOUT ON THE INTERNET",
    "ROWAN ROW FULL BODY",
    "WARM UP BEFORE WORKOUT",
    "6 PACK",
    "ABS"
  ],
  "publishedAt": "2024-03-08T11:26:58Z",
  "duration": 2517,
  "durationFormatted": "41:57",
  "viewCount": 2114909,
  "likeCount": 52724,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/MOrRRvSGIQc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/MOrRRvSGIQc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/MOrRRvSGIQc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/MOrRRvSGIQc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/MOrRRvSGIQc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/MOrRRvSGIQc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Section 01:<br>Warm-up:<br><br>1. Neck rotation × 30 Sec<br>2. Shoulder Rotation (Clockwise and Anticlockwise) × 30 Sec<br>3. Arm rotation (Clockwise and Anticlockwise) × 30 Sec<br>4. Hip Rotation (Clockwise Anti-Clockwise) ×30 Sec<br>5. Lower Back &amp; Hamstring ×30 Sec<br>6. Standing Toe Touh (Right) ×30 Sec<br>7. Standing Toe Touh (Left) ×30 Sec.<br>8. Side Lunge Pulse ×30 Sec<br>9. Knee to Chest ×30 Sec<br>10. Squat Rotations Reach the Sky ×30 Sec<br><br>Rest For 50 Seconds.<br><br>Section 02<br>Upper Body:<br>(Each Workout duration is 30 Secs followed by 30 Secs of Rest Time)<br><br>1. Pike Walkouts ×30 Sec<br>2. In and Out Push up ×30 Sec<br>3. Low Plank to High Plank ×30 Sec<br>4. Regular Pushups ×30 Sec<br>5. Burpees ×30 Sec<br>6. Plank Shoulder Tap ×30 Sec<br>7. Pike Pushups ×30 Sec<br>8. Diamond Pushups ×30 Sec<br><br>Rest for 60 Sec<br><br>Section 03<br>Lower body:<br>(Each Workout duration is 30 Secs followed by 30 Secs of Rest Time)<br><br>1. Squat Jump ×30 Sec<br>2. Alt Side Lunges ×30 Sec<br>3. Alt Front Lunges ×30 Sec<br>4. Squat Walk Outs ×30 Sec<br>5. Bridges ×30 Sec<br>6. Alt Curtsy Lunges ×30 Sec<br>7. In and Out Squat ×30 Sec<br>8. Squat Hold ×30 Sec<br><br>Rest For 60 Second<br><br>Section 04<br>Core:<br>(Each Workout duration is 30 Secs followed by 30 Secs of Rest Time)<br><br>1. Star Crunches ×30 Sec<br>2. Bicycle Kicks ×30 Sec<br>3. Lying Leg Raises ×30 Sec<br>4. Regular Crunches ×30 Sec<br>5. Reverse Crunches ×30 Sec<br>6. Leg Scissors ×30 Sec<br>7. Alt L-Sit Toe Touches ×30 Sec<br>8. Plank Hold ×30 Sec<br><br>Rest for 60 Sec<br><br>Section 05<br>HIIT<br>(Each Workout duration is 30 Secs followed by 30 Secs of Rest Time)<br><br>1. High Knees ×30 Sec<br>2. Criss Cross Oblique Crunch ×30 Sec<br>3. Mountain Climbers ×30 Sec<br>4. Jumping Jacks ×30 Sec<br>5. Butt Kicks 🤭 ×30 Sec<br>6. Squat Hold Punches ×30 Sec<br>7. Side To Side Run Touch The Floor ×30 Sec<br>8. Fast Feet ×30 Sec<br><br>××××××××××End Of Workout××××××××××<br><br><br>Please Like This Took So Long For Me 😢😢<br><br>Edit: Thanks for all the Like Ya&#39;ll ❣❣",
    "Muscles: Every Man’s Dream is pure gold! It’s helped me see real results and stay focused on my goals.",
    "Day 1 of workout and feels good.<br><br><br>Guys please remind me daily by liking 😂 in case i forget to workout.",
    "Day 1 of doing this for 60 day 1-2 active rest day per week:}<br><br>Day 2 my thighs is really sore but I did it anyways <br><br>Day3 my legs is too sore I&#39;ll just do the warm up -Rest day<br><br>Day 4 I did it I feel great<br><br>Day 5 I felt stronger I’m dead serious I’m improving!<br><br>Day 6 I rested<br><br>Day 7 today felt hard but I did it anyways <br><br>Day 8 I did it, Im getting fit<br><br>Day 9 I rested<br><br>Day 10 also rested<br><br>Day 11 I did the workout with some my bro<br><br>Day 12 I did it!<br><br>Day 13 today was strange leg one gotten easier and upper body is easier too you guys gotta try this workout so good luck<br><br>Day 14 felt sore but finished <br><br>Day 15 I decided to rested<br><br>1 month in I’m so much stronger <br><br>2 months in I eat less sugar less fast food and I gotta say I’m not fit yet but the progress is so much better I recommended trying this workout with running jogging balance diet drink water bough water like 1 gulp of water every 30 minutes I’ll keep doing this workout I’ll keep you guys updated every month<br><br>3 months in I almost forgot about this comment because it gained barely any attention but I keep working out the thing is it’s not about losing fat it’s about yourself making yourself feels proud for achieving something that you would never though before like when I started it I thought what the heck man the upper body and lower body is so hard I can barely do 10 then now I can do it with ease I’m getting leaner to! but thanks YumeArora for reminding me to update this please guys if you see this comment please support me so that I can remember about this.<br><br>Months 4 it’s been an amazing journey through out the year it’s crazy how things went so fast I have to say one thing I stop watching this workout because it’s not as effective I now change my schedule someday I workout upper body only some lower and some core but every day I focus on cardio but I’ll continue to update my journey, My back was so much more developed my strength increased my mood also gotten better I love it I love working out at first it might be hard to keep working out due to laziness but I swear if you don’t give up it will become your daily routine anyways just focus on eating healthy BUT don’t give up on your favorite food eat it but not everyday maybe like once a week yeah don’t forget to get hydrated to. Thanks to everyone in the comments for supporting love y’all bye see you next month.<br><br>Months 5 6 7 and 8<br>Guys guess what I&#39;m back <br>I have a lot of story to tell you guys I have become taller since I enter puberty and I gain lots and lots of strength, yesterday I just did 105 pushs up I&#39;m 14 by the way, just imagine yourself if you&#39;re older than me and keep working out frequency you would became a beast I have become skinny and ugh I hate it lol 8 months ago I&#39;m fat and now I&#39;m skinny, I&#39;m trying to bulk now, I have stop using this video because it&#39;s gotten way too easy, my arm has grown quite a lot to!<br>I also drink protein shakes to repair my muscle after workout <br>For anyone who wants my workout routine I&#39;ll tell you it&#39;s wayyy more effective first thing first you gotta eat calories dense food like avocado brown rice stuff like that and avoid fast food (but you can eat it once a week or so)<br>Here&#39;s my workout, btw warm up first this is very important (no equipment for Monday I called it chest day do 15 push up and rest 30 second then do 14 and rest 30 sec and do it until 10, in total it will be 75 push up (if it&#39;s too hard do knees push up) <br>Tuesday, Core day<br>Mountain climbers x40 each side <br>Hallow body hold 30-40 second <br>&quot;How to perform hollow body hold lift your legs and lift your torso and keep your hand straight at the leg direction &quot;you can search how to do it if you don&#39;t understand <br>Russian twist x24 each side <br>Leg raises x20<br>Leg scissor 25-40 second <br>Plank 1 minutes <br>Bicycle kick 40 each side <br>Whole body crunch x15<br>Sit up x25<br>Sorry if it&#39;s too ruthless:p you can adjust it on your own like 10 sit up instead of 25<br>Tuesday legs day<br>Jump squats x20<br>Weight squats x15(you can use heavy bag pack or something heavy but make sure it&#39;s not too heavy)<br>In and out squat x20<br>Squat hold 40 second <br>Burpees x20<br>Do it again or rest<br>Thursday cardio <br>You have two option first running second hitt<br>For running do this workout it increases your growth hormone, and increases testosterone  <br>Sprint with your full speed for 30-40 second rest 90 second 5 set <br>For hitt just do what the video did, or you can also jump rope<br>Friday upper body<br>Push up x12<br>Diamond push up x12<br>Chair dip x20 (place both of your hand on the hair make sure you butt is the same level as the chair pretend your doing l sit but your leg stay on the ground and dip down then up that count as 1 rep)<br>Crocodile push up x12<br>Pike push up x12<br>Burpees x12<br>Saturday and Sunday are rest day<br>Guys after every week you can increases by 1 in every exercise like 13 instead of 12.<br>And for the chest day keep increasing until you did 15 to 1 push up then increases it to 20 until 10 and gradually increases it to 1 and after that you can add 10 more, something like that<br>Sorry for not updating guys I have an new account, see you next update!",
    "I started doing your ab workouts in 8th grade. I feel like I&#39;ve been on a journey with you! Thank you so much for everything :)"
  ],
  "channelSubscriberCount": 2150000,
  "channelVideoCount": 302
}