{
  "video_id": "mv0H9iCz8Ms",
  "title": "45 Minute Cycle Training Workout - Sprint Training",
  "description": "Subscribe to GCN Training: https://gcn.eu/GCNTraining\n\nGet fit with GCN! This indoor cycle training video is a 45 minute sprint training session, designed to help you improve your cycle fitness.\n\nSubscribe to GCN: http://gcn.eu/SubscribeToGCN\nGet exclusive GCN gear in the GCN store! http://gcn.eu/BuyGCNKit_\nSign up to the GCN newsletter: http://gcn.eu/gcnnewsletter\n\nIncrease your sprinting ability with this short indoor training session for turbo trainer or static bike which can equally be used on rollers too. Designed to be a improve your seated and standing sprint, this session is a great workout for the legs, core and of course to improve cardiovascular fitness. If you're not sweating buckets at the end, you're not doing it right... Turn 'n' Burn!!!\n\nThanks to:\nPaul Ryman: http://www.paulrymanfitness.co.uk\nNuffield Health: http://www.nuffieldhealth.com/gyms/Bristol\n\nIf you want to contribute captions and video info in your language, here's the link to help out 👍 : http://gcn.eu/6z\n\nMusic - licensed by Cue Songs\nTemper Trap - Science Of Fear: http://gcn.eu/147u67m\nBronze Radio Return - Shake, Shake, Shake: http://gcn.eu/1eXDvWJ\nUgly Duckling - Eintestin: http://gcn.eu/1dBW5T0\nAlmost Anyone - Airship Anchor Land: http://gcn.eu/1cAYvLm\nUgly Duckling - Sprint: http://gcn.eu/1hhAkqC\nTochner - We Go Ego (Original Mix): http://gcn.eu/1jbgHnk\nAdam Salkeld, Neil Pollard - The Will To Win: http://gcn.eu/19zK67k\nBorderline - Informed: http://gcn.eu/1601lsp\niLL Audio - One Man War: http://gcn.eu/1eQQW8p\nAn Echo - From Dust: http://gcn.eu/1cB0102\nWinston Ready - Dim The Light: http://gcn.eu/1mgSU5c\n\nNot all exercises are suitable for everyone - there is no ‘one size fits all’ approach. As with any strenuous exercise, you should take into account factors such as your flexibility, strength and overall health to determine if an exercise is appropriate for you, and consult a doctor/physician before beginning a programme of exercise. Discontinue your exercise session immediately if you experience any pain, dizziness or discomfort. \nPartaking in training sessions following GCN's video instruction is entirely at your own risk, and Global Cycling Network, its partners and its affiliated companies cannot be held responsible for any injuries which may occur as a result of these exercises.\n\nAbout GCN:\n\nThe Global Cycling Network puts you in the centre of the action: from the iconic summit of the Stelvio to the epic trails of Fort William, Scotland, everywhere there is pavé or dirt, world-class racing, and pro riders, we will be there bringing you all the action, essential analysis and unparalleled access every week, every month, and every year.\n\nWelcome to the Global Cycling Network | Inside cycling\n\nYoutube Channel - http://gcn.eu/gcnYT\nFacebook - http://gcn.eu/gcnFb\nGoogle+ - http://gcn.eu/gcnGPlus\nTwitter - http://gcn.eu/gcnTW\n\nLeave us a comment below!\n\nMusic - licensed by Cue Songs",
  "channelTitle": "Global Cycling Network",
  "channelDescription": "The Global Cycling Network puts you in the centre of the action: from the iconic climbs of Alpe D’Huez and Mont Ventoux to the cobbles of Flanders, everywhere there is road or pavé, world-class racing and pro riders, we will be there bringing you action, analysis and unparalleled access every week, every month, and every year. We show you how to be a better cyclist with our bike maintenance videos, tips for improving your cycling, cycling top tens, and not forgetting the weekly GCN Show. Join us on YouTube’s biggest and best cycling channel to get closer to the action and improve your riding!\n\nWelcome to the Global Cycling Network!\n",
  "tags": [
    "GCN",
    "Global Cycling Network",
    "Sports",
    "Cycling",
    "Bike",
    "Road Bike",
    "Cyclist",
    "hill training",
    "high intensity training",
    "Pro cycling",
    "Cycling Training",
    "Sec Features",
    "work out",
    "sprint training",
    "hiit",
    "Turbo session",
    "turbo-training",
    "Workout",
    "fitness",
    "training session",
    "Training (Industry)",
    "Bicycle (Sports Equipment)",
    "sp-santini"
  ],
  "publishedAt": "2014-01-18T12:00:04Z",
  "duration": 2751,
  "durationFormatted": "45:51",
  "viewCount": 4252670,
  "likeCount": 21696,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/mv0H9iCz8Ms/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/mv0H9iCz8Ms/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/mv0H9iCz8Ms/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/mv0H9iCz8Ms/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/mv0H9iCz8Ms/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/mv0H9iCz8Ms\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I am STILL doing this year after year - it&#39;s still the best synergy of inspiration, music and choreography. I&#39;ve done 100&#39;s of spin classes in person over the years and enjoyed being pushed by some seriously inspiring leaders - but nothing online has been as good as this one class. It even got me fit again after battling stage 4 cancer and massive back surgery. A totally inspiring session with a fun group and a motivating leader. His evocation of actual road riding is especially appreciated - I can picture some of my favourite strava segments as I&#39;m doing some of these intervals. And if I&#39;m perfectly honest - I&#39;ve occasionally heard Paul&#39;s exhortations while I&#39;m out road riding! Thanks so much for this - it&#39;s an incredibly valuable and appreciated session!",
    "Hey GCN, you guys need more videos with Paul he’s an excellent teacher",
    "One of the best spinning instructors I ever have the opportunity to see on the internet. I think Paul Ryman is a very knowledgeable instructor. Thanks, GCN for this video.",
    "Paul is the best gcn instructor. More of Paul please!!",
    "One of my fave GCN rides, keep going back to it and now found nearly all the tracks on Spotify"
  ],
  "channelSubscriberCount": 3390000,
  "channelVideoCount": 8298
}