{
  "video_id": "mVlJ2-8C0BA",
  "title": "30 Min FULL BODY DUMBBELL WORKOUT To Burn Fat | Best Dumbbell Exercises for Ages 50+",
  "description": "30 Min FULL BODY DUMBBELL WORKOUT at Home | Muscle Building | OVER 50! THis workout is suitable for beginners (using a light weight to begin) And the best dumbbell workout for women over 50+ and is a safe and effective at home strength workout #fullbodyworkout #fabulous50s #exerciseover50\nThis 30-Min Full Body Dumbbell Workout for Women Over 50 is designed to , burn fat, build muscle strength and boost metabolism. Suitable for beginners, this workout includes seven exercises done in three sets with 45 seconds on and 15 seconds rest. We'll be targeting all major muscle groups to help maintain muscle mass and enhance vitality.\n\nJoin me as we warm up, set our intention, and push ourselves to be proud of what our bodies can achieve. From single-hand rows to sumo squats, shoulder presses to tricep extensions, every move is crafted to challenge you and adapt to your fitness level. Remember, the goal is to feel strong and confident!\n\nThis home workout is perfect for improving both physical and mental health. Always consult a physician before starting any new exercise routine. Don't forget to subscribe, like, and comment below to share your experience. Let's stay fit and fabulous together! 💪✨\n\n#FullBodyWorkout #WeightTrainingOver50 #WorkoutWithWeights #WorkoutWomenOver50 #WorkoutOver50\n\nCHAPTERS:\n00:00 - Intro\n03:17 - Round 1\n10:23 - Round 2\n17:33 - Round 3\n25:20 - Cool down and stretch\n28:40 - Outro\n\n✅ START THE 14 DAY WEIGHT LOSS GLOW UP CHALLENGE NOW ✅\nhttps://fabulous50s.com/14-day-glow-up-fitness-course/\n\n🦋 SUBSCRIBE TO MY NEWSLETTER\nI'll send you the latest updates in fitness, health, lifestyle for Women Over 50!\n✉️ Signup is free: https://fabulous50s.com/subscribe-to-our-newsletter/\n\n🦋 WORLD RENOWNED COURSES\nGlow Up Fitness Course: https://fabulous50s.com/14-day-glow-up-fitness-course/\n14-Day Weight Loss Challenge : https://fabulous50s.com/new-you-weight-loss-14-day-challenge-sign-up/\nMore Courses: https://fabulous50s.com/courses/\n\n🦋 GET MY FREEBIES\nFree Workout Plan: https://fabulous50s.com/freebies/\nFree eBook: https://fabulous50s.com/free-tools/\nFree Resources: https://fabulous50s.com/blog/\nBuy Me A Tea And Get 5 Bonuses: https://www.buymeacoffee.com/fabulous50s\n\n🦋 SHOP PRODUCTS\nAmazon Favorites: https://www.amazon.com/shop/fabulous50s\nBeauty, Fashion and More:  fabulous50s.com/shop\n\n🦋 SOCIALS \nYoutube:  Subscribe for more videos https://www.youtube.com/c/fabulous50s?sub_confirmation=1\nFacebook: https://www.facebook.com/fabulous50ss\nPinterest: https://www.pinterest.com.au/SchelleaF/\nInstagram:   https://www.instagram.com/fabulous.50s/   \nTiktok: https://www.tiktok.com/@fabulous.50s\nTwitter: https://twitter.com/SchelleaF\nWebsite: https://fabulous50s.com/\n\n🦋 GET IN TOUCH\nPartnerships: pr@fabulous50s.com \nCustomer Support: support@fabulous50s.com\nMAIL: Po Box 12239 Clunes, NSW 2480 Australia 2480\n…………………………………………………………………………………………….\n\nDISCLAIMER: \n\nThis content is not sponsored, and all opinions are mine. I use affiliate links for products I endorse. Your support is appreciated. \n\nNote that this video provides entertainment and education, not medical advice. Consult your physician before changing your exercise/health routine. Making any changes to your exercise/health regime is done so at your own risk. \n#fabulous50s #dumbbellworkout  #fullbodyworkout",
  "channelTitle": "fabulous50s",
  "channelDescription": "Hi, I'm Schellea (Shelly), the founder and CEO of Fabulous50s. At 58, I live in Australia, and it brings me immense joy to help women over 50 feel confident, vibrant, and empowered. My passion is to inspire them to embrace who they are and look forward with excitement to the future.\"\n\nWith 40 years of experience as a small business entrepreneur, my journey has encompassed a wide range of fields, including creative design, health, fitness, fashion, and beauty. I am a certified fitness instructor and Neuroathletics coach, specializing in exercise and brain health for older adults. My focus is on helping women maintain vitality, creativity, longevity, and mental sharpness as they age.\n\nI am also a certified life and business coach, meditation and mindset coach, personal stylist, and color consultant. My mission is to help women over 50 thrive in every aspect of their lives, empowering them to live with confidence, purpose, and joy.\n\nI'm here to guide and support you on your journey. xx\n",
  "tags": [
    "fabulous50s",
    "Schellea Fowler",
    "fabulous 50s",
    "dumbbell workout",
    "full body dumbbell workout",
    "full body workout at home",
    "full body strength workout",
    "home workout with dumbbells",
    "30 minute full body dumbbell workout",
    "weight training for women over 50",
    "fabulous50s full body workout",
    "full body workout with dumbbells",
    "home dumbbell workout",
    "best exercise for 50+",
    "dumbbell workout at home",
    "women over 50",
    "30 Min FULL BODY DUMBBELL WORKOUT",
    "best Dumbbell Exercises for Ages 50+"
  ],
  "publishedAt": "2024-07-03T10:45:03Z",
  "duration": 1752,
  "durationFormatted": "29:12",
  "viewCount": 337785,
  "likeCount": 8663,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/mVlJ2-8C0BA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/mVlJ2-8C0BA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/mVlJ2-8C0BA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/mVlJ2-8C0BA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/mVlJ2-8C0BA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/mVlJ2-8C0BA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’m so excited with my weights! The first round of squats I used one 10 lb, second round 2 x 8 lbs for a total of 16 lbs, 3rd round 2 x 10 lbs for a total of 20 lbs! Yay! I’m in my fabulous 60’s!",
    "Thank you Shelly, I been following you since COVID but, not consistently... My female docter said I needed strength training with weights 3/week so, I have returned! (I&#39;m 70 years young!) THANK YOU",
    "Hi there from Adelaide Australia.  Im 73 year old woman who now fully understands the importance of weight bearing exercise. I’ve been meeting up with you every two days for the last couple of weeks. I use 2 x 4 kg weights (about 9lb). I’m enjoying every moment.  I love the way you present the show and I love love love your little dog.  I also love that I can do this in my own home with only my dog, Trevor to judge me.  Thank you so much.",
    "I&#39;m a huge fan of these 30 minute full body weighted workouts. Keep &#39;em coming! The squats with the upper body weights, phew, felt those! I used 8lb and 10lb weights but I&#39;m thinking I can go up a bit on a couple of exercises!  Thanks Schellea,  you are such a star and inspiration! ❤",
    "I loved it! I used 3, 5 and 8 lbs. I plan to do a 15min walk video after lunch. I know I need to do strength training,  so more 30min dumbbell workouts pls. Thank you!"
  ],
  "channelSubscriberCount": 1980000,
  "channelVideoCount": 722
}