{
  "video_id": "nD3JjLUHY4o",
  "title": "Guided Meditation for Sleep Relaxation | Let Go of Worries & Strengthen Health",
  "description": "Welcome to this guided meditation for sleep relaxation to help you let go of worries and strengthen your health, which is especially important during difficult or challenging times.\n\nThis guided relaxation experience is a form of sleep meditation with spoken suggestions for complete relaxation, accompanied with a soothing soundscape of gentle background sleeping music.\n\nThis sleep healing meditation session combines aspects of guided imagery and visualization, as well as a focus on chakra energy centres of the body, with powerful affirmations for boosting the immune system, for clearing the mind's thoughts, for letting go of negativity, for encouraging overall well being, and for balancing all emotions. \n\nJust listen along and allow yourself to relax deeply, as you learn how to let go of physical tensions, as well as melt away unwanted stresses or worries in the mind. Reduce the effects of overthinking, as you turn down any excessive noise of mind chatter by more easily floating and drifting into blissful sleep and soothing dreams, at every bedtime. \n\nI hope you relax and enjoy this sleep focused journey towards your positive health and wellness :) \n\nDownload this track MP3 for free here: ► https://michael-sealey.dpdcart.com/cart/add?product_id=194065&method_id=210458\n\n Subscribe for more meditation & hypnosis: ► http://www.youtube.com/subscription_center?add_user=MichaelSealey\n\nDownloads on iTunes: ► https://itunes.apple.com/au/artist/michael-sealey/id921827456\n\nDepression & Anxiety Recovery Pack 5 x MP3 Digital Audio Collection here:  ► https://michael-sealey.dpdcart.com/cart/add?product_id=121819&method_id=129715\n\nSleep Meditation 4 x MP3 Digital Audio Collection here: ► https://michael-sealey.dpdcart.com/cart/add?product_id=155119&method_id=165916\n\nThis session is suitable for repeated listening. Regular listening will help compound all positive suggestions for your own holistic healing results.  \n\nThe ending of this session will offer suggestions for drifting and dreaming into a peacefully deep, refreshing and rejuvenating sleep. This track may also be useful for relieving symptoms of insomnia, depression, anxiety and rumination. \n\n==================\n\nEnjoy some more of my recent releases: \n\nSleep Hypnosis for Floating Relaxation: https://youtu.be/CydzZTME9wM\n\nSleep Hypnosis for Celtic Healing Energy: https://youtu.be/94DylGBR86Y\n\nHypnosis for Calming Anxiety: https://youtu.be/rCGGIK0oPkQ\n\nHypnosis to Let Go of Negative Attachments: https://youtu.be/IrY_b_teSX8\n\n==================\n\n#guidedsleepmeditation #sleepmeditation #michaelsealey\n\nOriginal vocals by Michael Sealey © 2020 All rights reserved. \n\nImages via Shutterstock. \n\nMusic tracks credit: \n\"Daydreams\" - by Christopher Lloyd Clarke.\nhttps://www.christopherlloydclarke.com.\nLicensed by Enlightened Audio.",
  "channelTitle": "Michael Sealey",
  "channelDescription": "Hypnosis | Hypnotherapy | Sleep Hypnosis | Guided Meditation\n\nHi, my name is Michael and welcome to my channel, where I hope you can stop by to relax, listen in, and see for yourself the power of positive hypnosis.\n\nHypnosis is a completely natural state of often deeply felt relaxation and focused attention, where positive suggestions can be more easily accepted by our subconscious minds. Imagine a fantastic and tranquil state of daydreaming, and that is very close to hypnosis!  \n\nHypnosis can bring us improved self control, clearer and empowered behavioural choices, and allow us to listen to our best inner resources. Many people experience a deep sense of calmness and serenity during hypnotic meditation and are often pleasantly surprised to see the ongoing, life enhancing results. \n\nThank you greatly for your support, feel free to subscribe and comment on your great results, and I trust you will benefit from your time spent with positive hypnosis.\n\nPeace & Enjoy",
  "tags": [
    "guided meditation",
    "guided meditation sleep",
    "guided meditation for sleep",
    "sleep meditation",
    "sleep guided meditation",
    "meditation",
    "michael sealey",
    "let go of worries",
    "meditation healing",
    "sleep healing",
    "guided meditation health",
    "healing",
    "sleep",
    "deep sleep meditation",
    "sleep relaxation",
    "hypnosis michael sealey",
    "sleep hypnosis",
    "hypnosis",
    "sleep music",
    "music sleep",
    "fall asleep fast",
    "chakra meditation",
    "sleep meditation michael sealey",
    "health",
    "heal while you sleep",
    "insomnia",
    "overthinking",
    "relax"
  ],
  "publishedAt": "2020-03-23T03:11:29Z",
  "duration": 3014,
  "durationFormatted": "50:14",
  "viewCount": 2332231,
  "likeCount": 19236,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/nD3JjLUHY4o/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/nD3JjLUHY4o/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/nD3JjLUHY4o/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/nD3JjLUHY4o/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/nD3JjLUHY4o/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/nD3JjLUHY4o\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "You&#39;ve helped me in more ways you&#39;ll ever truly understand. I was homeless, sleeping in an abandoned car that was just the frame of the car. There weren&#39;t any windows, no windshield, no seats and no cushioning. In the middle of a brutal winter. It was simply metal and very very cold. I was depressed like never before but a big thanks to you! You gave me strength and hope and with that I was able to get through it. My life has since changed for the better. I have a good job, my own apartment , 3 beautiful children and an amazing wife who is the one that introduced me to you (Michael Sealey)  In the first place. I feel so blessed and grateful for the life I&#39;m living now. Without u i wouldn&#39;t have made it.  Thank u for all you&#39;ve done for me. The lives you&#39;ve touched shall nevr go unnoticed.<br>You&#39;re beyond talented. You&#39;re blessed with an amazing gift. God bless u 🙏🏼",
    "Hi all, I hope this message does find you relaxed and well. In response to the current challenges we&#39;ll all facing, over the next few days I will be uploading this sleep healing track to download for free to my various digital platforms, including my iTunes, Amazon, Google Play, Spotify and CDBaby accounts (will be live in about 2 - 3 days time). Feel free to share this track with others who may not be able to access the internet. I hope you all remain healthy and relaxed, and of course, safely assist those who you can who may be in difficulty. Keep well, my friends - Michael.<br><br>P.S. I&#39;d love for you to join me on my channel, you can subscribe right here: <br><a href=\"http://www.youtube.com/subscription_center?add_user=MichaelSealey\">http://www.youtube.com/subscription_center?add_user=MichaelSealey</a><br>And if you&#39;re looking for some more positive sleep healing and relaxation, you might enjoy this: <br> <a href=\"https://www.youtube.com/watch?v=plQEedTRtrM\">https://youtu.be/plQEedTRtrM</a><br>Happy dreams :)",
    "Ive been dealing with panic attacks every night and covid. All of Michael Sealey&#39;s videos have been incredibly useful to me and have helped calm 6 major panic attacks this week. Thank you so much",
    "In the present world filled with chaos and disease, your voice will always be my north star.",
    "Once again, thank you, Michael Sealey. You&#39;re like an old friend that shows up when we are most in need."
  ],
  "channelSubscriberCount": 1970000,
  "channelVideoCount": 229
}