{
  "video_id": "nQwKKCqkJxg",
  "title": "Gentle Seated Yoga For Beginners & All Levels | 30 Minute Practice",
  "description": "This is a slow and gentle 30-minute yoga practice of seated and floor stretches, perfect for every body, suitable for beginners and all levels. \nTake this time for yourself to move and stretch your entire body. Be present as you connect with your breath, watch your thoughts and observe the sensations that arise. After this yoga class, you will feel relaxed and rejuvenated.\n\nIf you enjoyed this video, check out a few other beginner friendly classes:\nhttps://bit.ly/2QTaC4R\n\n-\n\nMOBILE APP 📲🧘🏽‍♀️\nAccess exclusive classes on the Jess Yoga App! Available worldwide on iOS & Android. \nFREE to download:\nhttp://onelink.to/jessyogayt \n\n\nFAVORITES ✨ \nYoga Mat:\nLiforme (Use code 'JESSICARICHBURG' for 10% off)\nhttp://bit.ly/2uH0xNf​​​​​\n\nActivewear:\nStudio Kolektif Organic Yogawear (Use code 'JESSICARICHBURG' for 15% off)\nhttps://bit.ly/2WDxXtr\n\nJournal:\nWeekly Reset Planner + Artist of Life Workbook from Lavendaire\nhttps://shop.lavendaire.com/JESSICA10 (Use code 'JESSICA10' for 10% off)\n\n\nDONATE 🦋\nDonations to this channel allows me to keep creating new content + keeps yoga free & accessible to all.  \nIf you'd like to donate you can click the link below:\nhttps://bit.ly/31WdAZE\nThank you for supporting my work! \n\n\nCONNECT 🙏 \nBlog: https://jessicarichburgyoga.com​​​​​\nInstagram: https://instagram.com/Jessicarichburg​\nFacebook: https://www.facebook.com/jessicarichburgyoga/\n💌 Sign up for my newsletter:\nhttps://jessicarichburgyoga.com/newsletter/\n\n- \n\nDISCLAIMER\nThe information and practices on this website are not meant to diagnose, treat or cure any illness and and should not be used as a substitute for professional medical care. As with any exercise program, you take the risk of personal injury when you practice yoga. Please be mindful and listen to your body. By voluntarily participating in these practices, you acknowledge this risk and release Jessica Richburg from any liability. You are responsible for your own body's well being. Please consult with your physician prior to beginning exercise.\n\nMUSIC\nEpidemic Sound\nhttps://www.epidemicsound.com/referral/1dey13/\n\nMUSIC\nThe Dark Glow of the Mountains by Chris Zabriskie is licensed under a Creative Commons Attribution license (https://creativecommons.org/licenses/by/4.0/)\nSource: http://chriszabriskie.com/darkglow/\nArtist: http://chriszabriskie.com/\n\nSavasana Song: Floating Giraffes by Felix Sun\nhttps://bit.ly/3gNiU8A",
  "channelTitle": "Jess Yoga",
  "channelDescription": "Welcome to the channel! \n\nI'm Jessica, a 500-hr certified yoga instructor with a passion for health, wellness and sharing mindful movement. I'm here to support you on your yoga journey and give you the tools to live a more balanced and mindful life, both on and off the mat. \n\nOn this channel you will find a variety of classes with different styles, lengths and levels, along with the occasional vlog or sit-down chat.\n\nIf you enjoy practicing with me and want more exclusive yoga classes, meditations + courses then check out my app, Jess Yoga - available worldwide for iOS and Android (link below). \n\nThank you for practicing with me, and I’ll see you on the mat! \n\nFor business inquiries/collaborations please email richburg.jessica@gmail.com. ",
  "tags": [],
  "publishedAt": "2020-09-01T16:00:12Z",
  "duration": 1802,
  "durationFormatted": "30:02",
  "viewCount": 4932513,
  "likeCount": 66618,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/nQwKKCqkJxg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/nQwKKCqkJxg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/nQwKKCqkJxg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/nQwKKCqkJxg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/nQwKKCqkJxg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/nQwKKCqkJxg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I hope you enjoy this slow paced gentle practice. 🙏 it’s perfect to do any time of day! <br><br>If you‘re new to yoga check out a few other similar videos that are great for beginners: <br><a href=\"https://bit.ly/2QTaC4R\">https://bit.ly/2QTaC4R</a>",
    "as someone thats severely depressed, and unmotivated, i desperately want to do something to change my life, thanks for being my first step on that journey. this was wonderful",
    "The first beginners class that is actually suitable for beginners! I have limited mobility due to being plus size but this video was great",
    "Being a person with 120kg, I have started my diet and workout from this week. Doing this yoga in the morning helped me a lot to get comfortable with my body and I can do this without any difficulties. Yet, felt a lot of stretches in my body. Thank you so much for this beginner friendly yoga.",
    "I am 65 and completely out of shape. This is the first yoga class I’ve been able to do all the way through. I can’t tell you how thankful I am to you. I think I can continue this."
  ],
  "channelSubscriberCount": 837000,
  "channelVideoCount": 141
}