{
  "video_id": "NvCMWEWckw8",
  "title": "Beginner Hip Hop Indoor Cycling Class | 20 Minute",
  "description": "Welcome to my first themed beginner indoor cycling workout! It's all hip hop today for 20 minutes! \n\n\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spin class when I was 15. Since then I've been addicted to spin classes and indoor cycling. Now, as a certified Spin class Instructor, Stages Beats Instructor, and NASM certified fitness trainer, my goal is to share the most fun, motivating, and energizing indoor cycling workouts that will bring out your inner BUTT-KICKER!\n\nI'm so glad you decided to join my indoor cycling class today! Grab your water bottle, grab your towel, get on your bike and let's kick some butt! - Kaleigh Cohen Fitness\n_________________________________________________________________________________________________\n\n0:00 - 0261 Welcome\n0:27 - 3:29 WARM UP | Boast by S.O.\n3:30 - 6:26 ROLLING HILLS | Academy by Heyson\n6:27 - 10:33 JUMPS | On My Werk (feat AyoBeatz) by Diezmo\n10:34 - 13:58 SPEED | That's My Thang by ZBRAS\n13:59 - 16:50 CLIMBS | Big Time (GOOD Remix) by Skrxlla\n16:51 - 19:11 SPRINTS | Hawt by Marcus Meston\n19:12 - 21:36 COOL DOWN | Will You Dance with Me by Lalinea\n_________________________________________________________________________________________________\n\nNew to my indoor cycling workouts? START HERE! 👉  https://youtube.com/playlist?list=PLBJ0TIYiwZzihdgD643Q_JZ-kvakaybNG\n\nIf you are doing a Spin class on a stationary bike or exercise bike instead of a spin bike and prefer to stay in the saddle, DO THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance and try and keep the same cadence. \n_________________________________________________________________________________________________\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/kaleighcohenfitness\n\n⭐️ Want to maximize your workouts? Find awesome gear here? 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️ The best tablet mount for your spin bike!👉 https://bit.ly/2UeHHK1\n\n⭐️ Book a 1-hour Zoom meeting with me to help you reach your fitness goals!👉 https://www.buymeacoffee.com/kaleighcohen/e/25359\n\n🎶 Jam out anytime and anywhere! Here are all of my Spotify playlists, just for YOU! 👉  https://open.spotify.com/playlist/0ULpucBmI7ZARtkzmL4g54?si=RQlNDjaNREGtHZUNnORe7A\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ KCF fit wear, fitness tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\n⭐️ Want special KCF emojis and behind-the-scenes access? Become a Kaleigh Cohen Fitness channel member here! 👉 https://www.youtube.com/channel/UChY_9WJx0saa0St48lSdytQ/join\n\n⭐️ For those of you that asked how you can help support these indoor cycling workouts 👉 https://www.buymeacoffee.com/kaleighcohen\n\n⭐️ Share this cycling workout with a friend👉  https://youtu.be/NvCMWEWckw8\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n#HipHop #Beginner #IndoorCycling #StationaryBike #SpinClass",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "spin class",
    "free spin class",
    "free online spin class",
    "online spin class",
    "spin class for beginners",
    "best online spin classes",
    "hip hop spin class",
    "spinning class",
    "indoor cycling",
    "spin workout",
    "beginners spin class",
    "spin class workout",
    "spinning",
    "indoor cycling workout",
    "cycling",
    "online streaming spin class",
    "best spin class",
    "spin class workout video",
    "spinning workout",
    "exercise bike workout",
    "Kaleigh cohen",
    "kaleigh cohen spin",
    "cycling workout",
    "hip hop",
    "spin class videos for home"
  ],
  "publishedAt": "2021-05-26T10:03:55Z",
  "duration": 1296,
  "durationFormatted": "21:36",
  "viewCount": 998938,
  "likeCount": 17635,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/NvCMWEWckw8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/NvCMWEWckw8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/NvCMWEWckw8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/NvCMWEWckw8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/NvCMWEWckw8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/NvCMWEWckw8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "If you&#39;re like me and you&#39;re so out of shape that you can&#39;t do this entire workout, don&#39;t worry - it gets easier. Today was my second day and, while I still had to take a break and not have the resistance as high, it was easier than the first time. You got this!",
    "Every morning you kick my ass and I love it I’m down 20 lbs in a month with doing your cycling and changing my eating 👏🏾👏🏾",
    "I’m 66 years old and I finally did the whole work out. I got off my seat I increase my resistance I am so proud of myself. Thanks girlfriend",
    "I literally can&#39;t believe how quickly you&#39;re getting me into shape. I feel elated after the workout and that&#39;s something I haven&#39;t had in years!! You&#39;re a fantastic teacher!",
    "Your dog is the best ever!!!!!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}