{
  "video_id": "NwGtEMj54tI",
  "title": "15 Minute Guided Breathing For Calm and Restful Sleep",
  "description": "Experience deep, restorative sleep with this 15 minute guided breathwork session designed to help you fall asleep fast. With calming music and gentle breathing techniques, you’ll activate the parasympathetic nervous system, guiding your body into a state of relaxation and rest. Let the soothing rhythm of your breath quiet your mind and release any tension, allowing for a peaceful and restful night's sleep.\n\nWant longer videos? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite \nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBy engaging in longer and more intense sessions, breathers may access a deeper and more immersive state of self-discovery. This experience can lead to a greater level of insight, the emergence of new and enlightening thoughts, heightened awareness of one's emotional state, and improved clarity. If you are interested in diving further into your own being, longer sessions are available on my Patreon channel. https://www.patreon.com/breathewithsandy\n\nI personally make all aspects of creating this content, including the music, guided voice, and video editing. It brings me pleasure to create content that can benefit you, and my hope is that it can help you improve your life in various ways, such as fostering self-love and kindness, reducing stress and anxiety, decreasing inflammation, and increasing energy. Whatever improvements it may bring, I encourage you to take a moment to appreciate yourself for investing time in your personal growth.\n\nSafety Disclaimer:\nAll information provided by this channel is only for educational and entertainment purposes.  Breathe With Sandy LLC is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal. \n#sleepmusic #sleep #anxietyrelief",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "sleepbetter",
    "sleepmusic",
    "meditation",
    "deepsleep",
    "sleepmeditation",
    "fallasleepfast",
    "insomnia",
    "sleepbettertonight",
    "yoga",
    "breathwork",
    "relaxation",
    "relaxationtechniques",
    "breathingexercises",
    "guidedbreathwork",
    "eveningroutine",
    "bedtimebreathwork",
    "calmnight",
    "calmyourmind",
    "yogaforsleep",
    "sleepsounds",
    "sleepbetternaturally",
    "breathworkforanxiety"
  ],
  "publishedAt": "2024-09-16T15:00:23Z",
  "duration": 1388,
  "durationFormatted": "23:08",
  "viewCount": 198538,
  "likeCount": 3659,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/NwGtEMj54tI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/NwGtEMj54tI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/NwGtEMj54tI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/NwGtEMj54tI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/NwGtEMj54tI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/NwGtEMj54tI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "These breath work excesises are changing my whole perception of my life and filling my body and mind with love and gratitude. Your videos are truly transforming my life. Im an ex addict in recovery. Ive been sober for two years since april 1st 2021. But getting off drugs was just a step. I need to transform my whole being and perception. Breath work is a huge step in leading me to do this",
    "You always save my sleepless nights, Sandy ❤️‍🩹 The timing of this video is incredible as I struggle with this so much at the moment. Thank you from the bottom of my heart. And if anyone is reading this at a sleepless night or any other difficult moment, you are never alone. We&#39;re in this together. Lots of love for everyone 🤍",
    "I’ve been struggling for 10 years. Sick in body, sick in mind, sick in spirit. Wim Hof’s technique was awesome, but it never helped me reach the peace I find with the abundance of practices you offer. Thank you so much  sandy",
    "Thanking God and the Uni-Verse for Sandy&#39;s and anyone whose reading this existence. You are beautiful, you are unique, you are special and loved. Don&#39;t let the circumstances of life or anyone make you feel worthless or insignificant. Much love and respect to you out there. 🙏",
    "Enjoy this calming music and breathing routine I created with the intention of down-regulating our system after a long day, helping us fall asleep quickly and stay asleep. Of course, this can be done at any time of the day. <br>Much love to all,<br>Sandy"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}