{
  "video_id": "NxC4LhOrMFw",
  "title": "Yoga For Hands, Fingers, Wrists  |  11-Minute Yoga Quickie",
  "description": "This short session is the perfect moment to check-in and care for yourself! Today we focus on targeted areas that get stressed through everyday activity to combat carpal tunnel and weak wrists. This therapeutic sequence will reduce inflammation, increase range of motion in wrists, and improve flexibility in the small muscles of the hands, fingers, and forearms.\n\nBookmark this practice and repeat to release built-up stress in these targeted areas. Preventative care is the best care!\n\nLet me know how it goes in the comment section down below!\n\nNamaste.\n\n* * * WANT MORE YOGA FOR WRISTS? * * * \n\nTry these other YWA videos for the wrists:\n\nYoga Wrist Pain Practice: https://www.youtube.com/watch?v=RGEWpPHu69A\n\nYoga For Healthy Wrists: https://www.youtube.com/watch?v=gb3_oSAGoXs\n\n#yogawithadriene   #freeyoga   #fwfg\n \n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for wrists",
    "yoga for fingers",
    "yoga for hands and arms",
    "yoga for hands",
    "carpal tunnel syndrome",
    "yoga at home",
    "yoga for wrist pain",
    "morning yoga",
    "free yoga videos",
    "home yoga practice",
    "30 days of yoga",
    "yoga for weight loss",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga",
    "yoga (sport)",
    "online yoga videos",
    "total body yoga",
    "at home yoga"
  ],
  "publishedAt": "2019-02-03T06:00:05Z",
  "duration": 678,
  "durationFormatted": "11:18",
  "viewCount": 1468806,
  "likeCount": 30419,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/NxC4LhOrMFw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/NxC4LhOrMFw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/NxC4LhOrMFw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/NxC4LhOrMFw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/NxC4LhOrMFw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/NxC4LhOrMFw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Happy February, my friends! Today&#39;s short session is perfect for a little check in to transform your mood/energy! 11 minutes for CARE. Are you taking some time to care for YOU?",
    "I suffer from Carpal tunnel syndrome in both of my wrists and its not something with much of a &#39;cure&#39;, I wouldn&#39;t consider surgery so tend to just live with it, this session has truly helped me, it seems to be the only thing that brings pain relief, don&#39;t get me wrong, when I&#39;m in alot of pain with my wrists, everything hurts including Yoga, but this session is worth the slight discomfort because it works wonders, Thank you so much Adrian, you&#39;re my hero♡",
    "I am 70 years old and used my hands a lot as a Firefighter and as a Service Technician. I had troubles with &quot;Trigger Finger&quot;, stiffness and some arthritis with the fingers and early stages of carpel tunnel.  My daughter led me to your video &quot;Yoga For Hands, Fingers, Wrists&quot;.  I just want to say this video has helped me to enjoy retirement and out of surgery.  Thank you , Thank you, Thank you. Neal",
    "Explore day 2🎉 thank you, Adriene, perfect Sunday evening practice, my hands are ready for typing and editing on my laptop tomorrow, this will be an amazing practice for me to come back to regularly. 💖🧘🏼‍♀️🙏🏻",
    "I’m shocked how much I felt that in my shoulders today!"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}