{
  "video_id": "NyP_waVgL1w",
  "title": "25 MIN FULL BODY PILATES WORKOUT FOR BEGINNERS (No Equipment)",
  "description": "Hope you enjoy this 25 Minute Full Body Pilates Workout for Beginners. Whether you are new to Pilates or just want to slow things down, this workout is for you. No equipment needed, just you and your mat. :)\n\n🌸  Wearing Echt Apparel - https://echt.com.au/\n\n\n♡ INSTAGRAM: @movewithnicole\n♡ EMAIL: movewithnicole.yt@gmail.com\n\n\n♫ Music from https://www.epidemicsound.com/\n\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 25 minutes full body",
    "pilates workout 25 minutes",
    "25 minutes pilates workout",
    "25 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "25 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "pilates for beginners",
    "move with nicole",
    "beginner pilates",
    "nicole kastoun"
  ],
  "publishedAt": "2020-10-15T20:02:25Z",
  "duration": 1600,
  "durationFormatted": "26:40",
  "viewCount": 10728961,
  "likeCount": 242472,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/NyP_waVgL1w/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/NyP_waVgL1w/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/NyP_waVgL1w/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/NyP_waVgL1w/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/NyP_waVgL1w/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/NyP_waVgL1w\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "If this is beginner level I&#39;m going to have to repeat it quite a few times to get good enough to even qualify as a beginner!!",
    "The straight leg kicks forward we’re DEADLY. This is exactly what I needed to ease back into working out after the holiday season",
    "I did it! I can’t believe it. Please, Miss Nicole, keep talking. I am blind and many workout videos aren’t accessible to me. Please.",
    "This workout was actually so fun! It did not feel like 26 minutes, I’m so impressed! This is really a full experience. Also, this is my first time doing Pilates! It felt so good",
    "“find a little burn” <br>UM THE BURN FOUND ME 😩😫"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}