{
  "video_id": "o8u_xfJnLq0",
  "title": "20 MIN hourglass full body pilates workout // no equipment // beginner friendly",
  "description": "Hi guys! \n\nWelcome back to another workout, so happy you’re here! This is a perfect 20 min full body workout where we work all of our main muscles to achieve that amazing toned body\n\nLet me know in the comments other workouts you would like to see :)\n\nThank you all so much for watching!\nMwah!!\nLidia\n\n⇩MORE OF ME⇩\nTikTok | http://bit.ly/3jKm4Bo\nInstagram | http://bit.ly/3jLe4A4\nYoutube | http://bit.ly/3vvvCCP\nEmail | hi@lidiavmera.com",
  "channelTitle": "Lidia Mera",
  "channelDescription": "what a journey it is to understanding how to feel our best, so hey, lets do it together ♡ sharing my life as a 23 year-old living in London & my at-home workouts with you as a certified Pilates instructor (L3 pilates mat instructor) \nhope you stick around 🤍\nly all millions \n",
  "tags": [],
  "publishedAt": "2023-01-18T11:00:27Z",
  "duration": 1181,
  "durationFormatted": "19:41",
  "viewCount": 2440494,
  "likeCount": 84463,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/o8u_xfJnLq0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/o8u_xfJnLq0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/o8u_xfJnLq0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/o8u_xfJnLq0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/o8u_xfJnLq0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/o8u_xfJnLq0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I didn&#39;t even realised this is 20 minutes it went so fast and I&#39;m a beginner and I can do all of this exercises and it actually feels like it burns its one of the best workouts I&#39;ve ever tired.",
    "Instead of doing one of those day by days where people forget, I&#39;ll just skip to the results. Guys I&#39;ve been working out using YT videos since 2020 and been doing pilates for 4 of those years and trust me this video GIVES RESULTS. I&#39;m trying to lean down my body fat % and see more visible abs and it&#39;s giving me TONED BACK TONED LEGS TONED ABS SMALL WAIST, BEAUTIFUL NON BULKY OBLIQUES AND A FLAT STOMACH GUYS THIS IS AN ALL IN ONE AND ITS NOT TERRIBLE BC ITS BEGINNERS.<br><br>As a decently experienced YT pilates lover, this was a joy to do and I got results even after 2-3 days. I will continue doing this it contains hidden stretches in the workouts for both strengthening and leaning at the same time it&#39;s beautiful and I always feel amazing afterwards.<br><br>Thank you lidia mera for always being the best at making calming fun pulates videos with nice music!!",
    "I&#39;ve been doing pilates for 4-5 months now, but I always keep coming back to this video even though I&#39;m not a beginner anymore ❤️❤️",
    "i’ve been doing this workout for the last 2 weeks ( 3 times a week) and i can already see some results especially with my lower body!!! my booty looks plumper and my thighs look slimmer !! love this workout 💞",
    "I CAN FINALLY WEAR THE JEANS THAT I WANTED FOR SO LONG OH MY GOOOODDDD thank you so much 😭"
  ],
  "channelSubscriberCount": 1670000,
  "channelVideoCount": 286
}