{
  "video_id": "oc6bco9yPjc",
  "title": "Guided 100 Squat Workout!",
  "description": "Follow along Jordan Yeoh in his 100 Squats Workout series, designed to enhance your lower body fitness whether you're at home, in the gym, or anywhere else. If you find the pace challenging, be sure to try the alternative exercises provided. Also, don't forget to explore my app for a variety of additional workouts and programs that will help you progress toward your ultimate fitness goal: https://bit.ly/trainwithjordanapp\n\n▷Connect with Me\nInstagram: https://www.instagram.com/jordanyeohfitness\nFacebook: http://facebook.com/jordanyeohfitness\nTraining & Coaching App: https://bit.ly/trainwithjordanapp\n\nDISCLAIMER\n\nThe exercises and workouts provided in this video are for educational purposes only and are not to be interpreted as a recommendation for a specific treatment plan, product, or course of action. \n\nBefore beginning this or any exercise program, please consult a physician for appropriate exercise prescription and safety precautions. \n\nThe exercise instruction and advice presented are in no way intended as a substitute for medical consultation. As with any exercise program, \nif at any point during your workout you begin to feel faint, dizzy or have physical discomfort, \nyou should stop immediately and consult a physician.\n\n#fitness #workout #weightloss",
  "channelTitle": "Jordan Yeoh Fitness",
  "channelDescription": "Hey! Welcome to my Youtube channel! I got nothing much to say here, but one thing for sure is I hope you will get a lot of benefits from my content. Alright then, see you in my videos!",
  "tags": [],
  "publishedAt": "2023-12-12T04:02:12Z",
  "duration": 531,
  "durationFormatted": "8:51",
  "viewCount": 162591,
  "likeCount": 4362,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/oc6bco9yPjc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/oc6bco9yPjc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/oc6bco9yPjc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/oc6bco9yPjc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/oc6bco9yPjc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/oc6bco9yPjc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Jordan my brother from another mother; i really do love your sessions and do them almost everyday and it&#39;s been 3years now and counting.<br>Thank you for everything really enjoying them even though some ain&#39;t easy; like you always say &quot;the satisfaction is real&quot;",
    "Jordan you´re unique!!! Tranforming my body... every one noticing!!",
    "3 times of the workout...i am done for the rest of the week. Thanks Jordan😊👍",
    "Hey Jordan long time no see, I want you to upload long workouts(Lvl 6) more frequently because it is challenging both physically and mentally ❤",
    "This is what am talking about my kind of workout... keep them coming sir"
  ],
  "channelSubscriberCount": 4430000,
  "channelVideoCount": 396
}