{
  "video_id": "odADwWzHR24",
  "title": "Relieve Stress & Anxiety with Simple Breathing Techniques",
  "description": "Breathing exercises can be a great way to help relieve stress and anxiety. This video focuses on two relaxing breathing techniques: Square breathing (aka box breathing, 4x4 breathing, 4-part breath, etc.) and Pursed breathing. More breathing exercises: https://www.youtube.com/watch?v=-7-CAFhJn78\n\n\r\rI start off with Square breathing. It’s so good at helping to relieve stress and anxiety that it’s sometimes used in the military to help calm nerves before stressful situations.\n\nIt’s performed just how it sounds--using your breath to make a square. Use imagery as well and imagine making a square or following something with a square pattern with your breath. Each position is 4 seconds. Breathe in for 4 seconds, hold your breath for 4 seconds, breathe out for 4 seconds, and hold your breath again for 4 seconds. \n\n\r\rPursed breathing is another breathing technique that can help relieve stress and anxiety, and it can also help make your lungs stronger. For this one, use diaphragmatic or belly breathing. Breathe in for 4 seconds, and then breathe out with pursed lips for 8 seconds.\n\nRelated Videos:\n\nBreathing Exercises for Relaxation or COPD:\nhttps://youtu.be/-7-CAFhJn78\n\nBreathing Exercises for COPD, Asthma, Bronchitis & Emphysema:\nhttps://www.youtube.com/watch?v=dpTNUGwXbTU\n\n\r\r===========================================\n\nDr. Jo is a licensed Physical Therapist and Doctor of Physical Therapy.\n\nSUPPORT Ask Doctor Jo on Patreon for as little as $1 a month, and get cool rewards: http://www.patreon.com/askdoctorjo\n\n\r\r===========================================\r\n\nRelieve Stress & Anxiety with Simple Breathing Techniques\nhttps://www.youtube.com/watch?v=odADwWzHR24\nhttps://www.askdoctorjo.com/breathing-techniques-stress-relief\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless Ask Doctor Jo, LLC, its officers, employees, and contractors for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Ask Doctor Jo, LLC makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.",
  "channelTitle": "AskDoctorJo",
  "channelDescription": "Hi, I'm Doctor Jo, a Physical Therapist and Doctor of Physical Therapy. My videos demonstrate proper techniques for some of the best stretches & exercises to help relieve common pains like knee pain, neck pain, shoulder pain, back pain, arthritis, sciatica, fibromyalgia, and more.\n\nBe safe, have fun, and I hope you feel better soon!\n\nDISCLAIMER: This content is for informational purposes only. It is general in nature and is not intended to be medical advice, nor does using it create a physical therapist-patient relationship with you. Before starting, consult your own healthcare provider for a proper diagnosis and to ensure this content and any included products are safe and appropriate for your own medical and physical condition. Stop immediately if you experience pain. Ask Doctor Jo, LLC makes no representations about the accuracy or suitability of this content for you. By voluntarily using this content, you assume all risks for any resulting losses, injuries, or damages.",
  "tags": [
    "breathing exercises",
    "stress relief",
    "anxiety releif",
    "relieve stress",
    "relieve anxiety",
    "stress and anxiety",
    "breathing techniques",
    "breathing exercises for stress relief",
    "breathing exercises for anxiety relief",
    "inspiratory muscle training",
    "inspiratory muscles",
    "physical therapy",
    "physiotherapy",
    "physical therapy video",
    "askdoctorjo",
    "doctorjo",
    "ask doctor jo",
    "dr jo",
    "doctor joe",
    "ask doctor joe",
    "calm breathing",
    "relaxing breathing"
  ],
  "publishedAt": "2020-04-27T14:51:46Z",
  "duration": 350,
  "durationFormatted": "5:50",
  "viewCount": 2412447,
  "likeCount": 54492,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/odADwWzHR24/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/odADwWzHR24/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/odADwWzHR24/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/odADwWzHR24/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/odADwWzHR24/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/odADwWzHR24\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Buy a worksheet with these Breathing Techniques at: <a href=\"https://www.askdoctorjo.com/breathing-techniques-worksheet\">https://www.askdoctorjo.com/breathing-techniques-worksheet</a><br><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CO2PwsL109wCFQcQZAodprwPJQ\"></a>Don&#39;t forget to hit the 🔴 <b>SUBSCRIBE</b> 🔴 button above! <b>Find all of my videos at </b><b><a href=\"http://youtube.com/askdoctorjo\">youtube.com/askdoctorjo</a></b><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CO2PwsL109wCFQcQZAodprwPJQ\"></a>",
    "Anxiety happens when you think you have to figure out everything all at once. Breathe. You’re strong. You got this. Take it day by day.",
    "I’ve been having the worst panic attacks ever to the point where i wondered if i’d ever stop shaking. This video is genuinely saving me!!",
    "To whoever is having a panic attack, please understand that you are not alone, I had one tonight aswell, fast heartrate felt through my neck and chest, fuzziness,dizziness, feeling faint, nausea, feeling of doom, overthinking, feeling like you&#39;re going to die , please know you&#39;re not alone, I&#39;m here with you and so are people like this woman 🧡🙏namaste and greetings to all",
    "A lot of times I feel stressed for no reason, this definitely helped. It feels like the tension in my head is light and calmer."
  ],
  "channelSubscriberCount": 2310000,
  "channelVideoCount": 935
}