{
  "video_id": "OGFNuYvyzV0",
  "title": "Yoga for Vertigo  |  15-Minute Yoga",
  "description": "Join me for this 15-minute Yoga For Vertigo session. Begin this relaxing practice by improving blood circulation and balancing the hemispheres of the brain with breath work, or pranayama.\n\nThis gentle session is designed to activate and calm the parasympathetic nervous system.\nThis short practice could be beneficial for those who are recovering from injury, TBI (traumatic brain injury), or those who are working with Glaucoma.\n\nBe mindful, take it slow, and Find What Feels Good.\n\nNamaste.\n\nFor more videos like this, try this Yoga For Glaucoma and Vertigo Playllist: https://www.youtube.com/playlist?list=PLui6Eyny-UzyfTUQJWjiCn3Gdi8snJ5fW\n\n#yogawithadriene   #freeyoga   #fwfg\n  \n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for vertigo",
    "yoga for anxiety",
    "holistic health",
    "healing in yoga",
    "yoga for mental health",
    "15 minute yoga practice",
    "15 minute yoga",
    "free yoga videos",
    "yoga at home",
    "morning yoga",
    "home yoga practice",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga"
  ],
  "publishedAt": "2019-11-17T06:00:02Z",
  "duration": 913,
  "durationFormatted": "15:13",
  "viewCount": 777649,
  "likeCount": 11677,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/OGFNuYvyzV0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/OGFNuYvyzV0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/OGFNuYvyzV0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/OGFNuYvyzV0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/OGFNuYvyzV0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/OGFNuYvyzV0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is your reminder to slow down. What are you doing to fill your cup today?",
    "Explore day 6! Very grateful for this! Have a good day, guys!<br>Thank you, Adriene and YWA community💚💚💚",
    "EXPLORE - March 2025 Day 6. Had to do Day 5 as well to catch up but both practices were short. So now I&#39;m back on schedule. Sending love &amp; hugs to all and gratitude, as always, to Adriene &amp; Benji, for keeping us all on track!",
    "All of the love to those who live with Vertigo and similar disorders but tackle life like a boss 💪 (which is all of you! You’re doing great!) have a wonderful Sunday everyone ❤️ namaste Adriene and Benji 🙏",
    "I don&#39;t know why every time I do yoga I shed a few tears. It&#39;s like the way of my body to say thanks!"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}