{
  "video_id": "Oh5XSiZxyLs",
  "title": "30 MIN CARDIO PILATES || At-Home Full Body Workout",
  "description": "Break a sweat with this new 30 Minute Cardio Pilates Workout. This Full Body Workout will combine Pilates principles/movements with athletic cardio flows to increase your heart rate for a fun and sweaty session! Low impact and high impact options will be provided, so you pick the intensity! I hope you enjoy it and let me know how you go in the comments below. :)\n\n\n♡ INSTAGRAM: @movewithnicole\n♡ EMAIL: movewithnicole.yt@gmail.com\n\n\n♫ Music from https://www.epidemicsound.com/\n\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "pilates workout 30 minutes full body",
    "pilates workout 30 minutes",
    "30 minutes pilates workout",
    "30 minute pilates",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates",
    "pilates workout",
    "30 min pilates",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "cardio pilates",
    "30 min cardio pilates",
    "move with nicole",
    "pilates nicole",
    "cardio"
  ],
  "publishedAt": "2020-12-22T19:47:11Z",
  "duration": 2118,
  "durationFormatted": "35:18",
  "viewCount": 515995,
  "likeCount": 14726,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Oh5XSiZxyLs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Oh5XSiZxyLs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Oh5XSiZxyLs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Oh5XSiZxyLs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Oh5XSiZxyLs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Oh5XSiZxyLs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hope you enjoy this new Cardio Pilates Workout! Let me know how you go in the comments below. 😊 My cat Milo joined us up on the wall for the beginning of class today hehe. Wishing you all Happy Holidays and a wonderful New Year! ❤️",
    "Couldn&#39;t figure out why I was absolutely DYING for the first 10 minutes...until I realized the playback speed was at 1.25x 🙃 Thank you for setting the pace just right! I find following your flow and breathing is perfect. I&#39;m 5 days in to a month straight of Move with Nicole and am loving it!",
    "don&#39;t think I&#39;ve ever met a workout of yours I didn&#39;t love! Thank you!",
    "I&#39;ve been doing your classes for a few months now, and my body is responding so well to them. Just the short 30 min workouts, a few days a week, and I feel like I&#39;m finally getting the results I was chasing for so long",
    "I must say that I really don&#39;t like repetitive exercises but I am NEVER bored or unmotivated with you. That is something! &lt;3"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}