{
  "video_id": "oi5o3AXfFv4",
  "title": "45 MIN MILITARY MONDAY Killer HIIT Workout - Full Body, No Equipment, No Repeat",
  "description": "It's back again - Military Monday to start off the week! We will be targeting all the major muscle groups with this 45 min KILLER HIIT workout! Let's focus on building strength and improving our endurance. We've got each other's motivation to start the week the best way we know how! Let's do it team 💪🏼\n\nPlease remember that we all are different and that you can make this your OWN workout... take a longer break when you need to.\n\nWORKOUT DETAILS\n\n👉🏼 Duration: 40 mins plus 5 mins of cool-down stretches\n👉🏼 No Equipment\n👉🏼 50 Sec Work, 10 Sec Rest\n👉🏼 Level: Medium to Advanced\n👉🏼 No Repeat\n\nMusic: https://www.epidemicsound.com\n\n \n\n\n📷 GEAR I USE: \nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n💪🏼 MY HOME TRAINING GUIDE: http://growingannanas.com\n\n» Subscribe to my Channel for weekly workouts: http://bit.ly/2QLvpXn\n» Instagram: http://bit.ly/2ZSdHFR\n» Facebook: http://bit.ly/2SVkgpE\n✉ Contact (business inquiries):  anna@fyndafit.com\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "growingannanas",
    "crossfit",
    "hiit",
    "workout",
    "home workout",
    "abnehmen",
    "intense hiit",
    "diät",
    "fitness",
    "abs",
    "abs workout",
    "muscle",
    "schlank werden",
    "wod",
    "workout of the day",
    "core",
    "leg workout",
    "home workout crossfit",
    "abs core",
    "core workout",
    "core strength",
    "bauchworkout",
    "Bauch übungen",
    "sixpack",
    "sixpack workout",
    "how to Get a sixpack",
    "bauchmuskeln",
    "sichtbare bauchmuskeln",
    "fett verbrennen",
    "fett abbauen",
    "fett verlieren",
    "definieren",
    "hiit workout",
    "pamela reif",
    "military hiit",
    "military workout"
  ],
  "publishedAt": "2020-12-21T08:00:11Z",
  "duration": 2733,
  "durationFormatted": "45:33",
  "viewCount": 1278813,
  "likeCount": 21731,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/oi5o3AXfFv4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/oi5o3AXfFv4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/oi5o3AXfFv4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/oi5o3AXfFv4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/oi5o3AXfFv4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/oi5o3AXfFv4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Happy Monday team!! I hope you all have a great start with this killer workout - we love Military Monday&#39;s don&#39;t we?! 🔥Work hard, enjoy the sweat and hope you feel aaaamazing after :) Big love, Anna xx",
    "What a KILLER workout. I really enjoy how you push limits. These workouts are the best I have found so far, and I immensely enjoy them. No talking, just sweating. Please keep this up, it’s highly motivating. Cheers!",
    "I&#39;ve done almost all of your 30 and 45 minute HIIT workouts.  This one is by far the hardest to complete with fidelity.  The first 22 minutes, culminating with the lunge jumps, provide a tremendous thigh burn.",
    "Hi anna. Ive been doing your workouts for years now. since middle school &lt;3 I used to struggle with binge eating and depression really bad back when i was younger. Then i recovered and started doing your workouts &lt;3 you helped me get in the best shape i ever was. I was always a chubby kid, but then i was starting to feel stronger, healthier and more confident :). lately though with testing and other personal issues, ive been feeling hopeless. Stressed. I started binge eating again to cope with the stress. I stopped working out. Life lost passion. The only spark of hope was my boyfriend. But we drifted apart, and I lost him too. Ive been binge eating bad these past few days. Just eating and eating no matter how full i was. This morning i woke up and looked in the mirror and saw the same, sad, depressed, insecure girl that I was all of those years ago. And it broke my heart to see myself so broken. So let go. I sat in bed thinking. Now im determined to get back on track and regain my strength and my self esteem. We must continue on and pick ourselves up no matter how hard we are hit. No matter what life throws at us we must persevere and carry on. And with your videos, I am able to do that. The workouts, the clarity, the accomplished feeling. Thank you so much. &lt;3",
    "&quot;This was so easy&quot; - said no one after Anna&#39;s workouts! Thank you for your amazing work!"
  ],
  "channelSubscriberCount": 7390000,
  "channelVideoCount": 1073
}