{
  "video_id": "oIQ156r5udo",
  "title": "TONE WITH PILATES in 14 Days 🔥 Full Body Pilates Workout | 20 min",
  "description": "This full body pilates workout challenge will help tone with Pilates in 14 days. It's an intense 20 minute at home full body workout that helps lean, sculpt and fat burn. For the best full body fat loss results, do this with my longer fat burn workouts on the LEAN App and healthy nutrition.\n\n🍑 2 Week Full Body Pilates Sculpt & Fat Burn Guide 🍑 I have a brand new 14 day Pilates Sculpt & Fat Burn Challenge to help you get the results you want! Get your free 14 day guide here: https://leanwithlilly.com/pages/Lilly-Sabri-workout-guides?ref=lillysabri\n\n🔥 Join the LEAN Transformation Method! 🔥 Get access to a structured 8 week guide, personalised meal plans, hundreds of recipes, and so much more right at your fingertips! Get the best results on the LEAN App: https://leanwithlilly.page.link/download-the-app-today\n\n👩‍🎓 Students get 25% off the LEAN Transformation Method on the LEAN App: https://www.leanwithlilly.com/student?ref=lillysabri\n\n🥤 The supplements & protein bars I use to get results: https://leanwithlilly.com/collections/nutrition?ref=lillysabri\n\n💪 Get your Free Home Workout programs here: https://leanwithlilly.com/pages/Lilly-Sabri-workout-guides?ref=lillysabri\n\n💙 Gymshark Outfit: https://gym.sh/Shop-LillySabri-YT\n\n🤍 FOLLOW ME:\nInstagram:  https://instagram.com/lillysabri\nTikTok: https://www.tiktok.com/@lillysabri?lang=en\nPrivate Facebook Group- Lean with Lilly Guides\nhttps://www.facebook.com/groups/508730913266325/\nTwitter:  https://twitter.com/lillysabri\nFacebook:  https://www.facebook.com/lilly.sabri/\n\n🔔 DON'T FORGET to Subscribe for daily uploads xx\nHit that bell icon to get a notification when I upload.\n\nGet I.F.L.Y. by Bazzi and over 1M + mainstream tracks here https://app.lickd.co/r/@lillysabri\n\nLicense ID: wN5MBpp1Y4A https://lickd.lnk.to/Xtg5bwID!Lilly%20Sabri\n\n0:00 Full Body Pilates Workout\n0:20 Free 14 Day Pilates Guide\n0:47 Tone with Pilates Exercise\n20:50 Complete Mat Pilates Exercise\n\nDisclaimer: Please remember that we cannot spot reduce fat, meaning we can’t choose the areas on our body where we lose fat. However to get fat loss results I recommend the following:\n1. Being in calorie deficit\n2. Cardio/ HIIT workout (I often call these Fat Loss/Burn workouts on my channel)\n3. Resistance training and specific muscle targeted workouts. To strengthen and develop specific muscles.\nI have hundreds of other home workouts available on my channel, so you can pick and choose which workouts you want to do, to not only make you build a strong body, but also feel amazing.\nPlease remember every body is different and we all progress at different rates. The fact that you have shown up and completed this workout is incredible. You should be very proud of yourself for taking the steps to improve not only your physical, but also your mental health.\nThe key to achieving your fitness and health goals is consistency and healthy lifestyle changes, without restriction. I don’t believe in crazy fad diets. Simply eat nutritious food, move your body, smile and enjoy the journey! Love Lilly",
  "channelTitle": "Lilly Sabri",
  "channelDescription": "Subscribe for weekly Full Body Home Workouts and Pilates exercises!\n\nI’m Lilly Sabri, founder of LEAN with Lilly. I’ve been a Chartered Physiotherapist since 2010, APPI Pilates instructor, Fitness, Heath and Lifestyle Influencer.\n\nOver the years, I’ve educated and empowered hundreds of thousands of people around the world to live a healthier lifestyle in a way that encourages increased body confidence regardless of shape, size and fitness level. Their transformations have been my driving force.\n\nMy aim is to create a supportive community, accessible to anyone wanting to take control and make changes towards leading a healthier, happier lifestyle!\n\nI've now taken my years of physio experience and poured it into my guides, workout videos, and more to develop a fit, confident and healthy lifestyle for myself and others! Join the #LeanWithLilly family to take control, feel confident and live a healthier, happier lifestyle!\n\nSocials: @lillysabri\nWebsite: www.leanwithlilly.com",
  "tags": [
    "home workout",
    "home exercise",
    "workout program",
    "from home workout",
    "at home workout",
    "workout challenge",
    "pilates workout",
    "full body pilates workout",
    "full body workout",
    "full body pilates",
    "full body exercises",
    "pilates full body",
    "pilates exercises",
    "full body",
    "full body home workout",
    "pilates home workout",
    "pilates full body workout",
    "full body exercise",
    "fat burn",
    "pilates",
    "workout",
    "exercise",
    "full body fat burn",
    "fat loss",
    "mat pilates",
    "at home pilates",
    "pilates fat burn",
    "tone",
    "sculpt",
    "lean"
  ],
  "publishedAt": "2023-04-10T13:00:39Z",
  "duration": 1295,
  "durationFormatted": "21:35",
  "viewCount": 844694,
  "likeCount": 17877,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/oIQ156r5udo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/oIQ156r5udo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/oIQ156r5udo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/oIQ156r5udo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/oIQ156r5udo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/oIQ156r5udo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Are you wanting to achieve that lean, tight &amp; sculpted body? But not getting results? You need a structured, progressive method to get the results you deserve 🤩\r<br>The LEAN Transformation Method was designed to get results from home combining 3 core styles of training in a structured 8 week guide, which progressively gets harder 💪\r<br>\r<br>Try a 7 DAY FREE TRIAL right now 🔥 \r<br>Get access to the LEAN  Transformation Method that helped me &amp; tens of thousands of women get results:\r<br><a href=\"https://leanwithlilly.page.link/download-app-free-trial\">https://leanwithlilly.page.link/download-app-free-trial</a>",
    "wowza- I discovered Lilly a few weeks ago... I am 5 months postpartum, and hit my pre-pregnancy weight at 4 months. I&#39;ve lost an additional 4 pounds in the past month, and I&#39;ve noticed a huge difference in my waistline over the past few weeks! Literally, my pre-pregnancy jeans were tight one week and loose the next. I actually thought I would never lose that slight mommy pooch and just accepted it as part of my new reality...but its completely gone. Lilly&#39;s workouts are effective!  <b>*disclaimer*</b> 1) I gave myself 6 weeks postpartum to heal, with just walking, and rebuilt my core strength over the next few months with Lauren Tiffer&#39;s &quot;Lose your mommy pooch plan&quot;- this gave me the foundation I needed to do these regular type workouts again. 2) I am breastfeeding (helps some and hinders others to lose weight) 3) I also run for 30 mins 3-4 times/week, and walk for 40 mins at least twice a week. Anyhow, these workouts are MAGIC!! :)",
    "My hands are shaking after this workout😭the burn was wayyy too fire🔥 in the beginning..<br>Gotta love Lilly for providing us free amazing pilates workouts💞💖💖💖",
    "I&#39;ve never completed a pilates workout in my life this is the only one I could finish until the end I&#39;m so proud of myself rn I&#39;m keep doing it thank u so much for this amazing workout, ok so I&#39;m on my 2nd day and I&#39;ve seen changes in my abs they are more toned and my inner thigh  looked a bit slimmer too",
    "There is a total of 3 minutes of core in this, which at first was a little upsetting because my legs were toast from a previous days workout, so the lower body focus was like 😭 BUT those 3 minutes or core left me sore the next day. Lilly is a wizard 🪄 I&#39;m calling it🫶🏼♥️ my fiance said this morning, &quot;I see you do a workout with no weights and I&#39;m like, wtf. And then the next day you&#39;re sore.&quot; Body weight exercises are grossly underrated 🙌🏼"
  ],
  "channelSubscriberCount": 6080000,
  "channelVideoCount": 1352
}