{
  "video_id": "oiToJsf_SQ4",
  "title": "30 MIN PILATES WORKOUT || Upper Body Pilates For Strength & Better Posture (Moderate)",
  "description": "This 30 Minute Pilates Workout will help strengthen your upper body and improve your posture. This class will not only strengthen your upper body but also stretch your back to help release any tension. I hope you enjoy it! 😊\n\n🌸 Mat from Liforme - https://liforme.com/\nUse my code 'MOVEWITHNICOLEYOGA' for a discount.\n\n♡ INSTAGRAM: @movewithnicole\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout",
    "at-home pilates",
    "at-home pilates workout",
    "move with nicole",
    "mat pilates",
    "feel good pilates",
    "pilates back workout",
    "back workout at home",
    "back workout pilates",
    "pilates for back",
    "pilates for posture",
    "pilates for good posture",
    "pilates for better posture",
    "30 minute pilates workout",
    "30 min pilates",
    "30 minute pilates",
    "30 minutes pilates workout",
    "pilates workout 30 minutes",
    "upper body pilates",
    "pilates upper body workout",
    "pilates arm workout",
    "pilates arms and back"
  ],
  "publishedAt": "2024-04-18T11:16:53Z",
  "duration": 1910,
  "durationFormatted": "31:50",
  "viewCount": 991240,
  "likeCount": 31426,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/oiToJsf_SQ4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/oiToJsf_SQ4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/oiToJsf_SQ4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/oiToJsf_SQ4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/oiToJsf_SQ4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/oiToJsf_SQ4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I love Nicole coz you can just shut your eyes and follow her very clear instructions",
    "omg I’m just reading the comments as a 23yo and the amount of 60+ ladies doing this is impressive, inspiring and so cuteee, way to go ladiess I’m proud of y’all",
    "Coming from someone that turned to pilates to correct my posture, I have to say you outdid yourself with this routine! I already feel I am standing taller and my shoulders feel less heavy. You are the gift that keeps on giving to this community! Thank you Nicole! 🥰",
    "I really find that posture is one of the keys to looking younger, so thank you, Nicole! I’m about to turn 60 so I’m looking around at older women who look fabulous and they all have great posture. I’ve been following you for more than a year and I love all of your workouts!",
    "I am not an active person and not so frequent with workouts<br>But Nicole has taught me some kind of love to moving my body. I’m not doing okay these days, december is a hurtful month, after doing Nicole’s workouts I feel a little bit better. Thank you, you’re the best teacher and the joy of my days lately."
  ],
  "channelSubscriberCount": 4470000,
  "channelVideoCount": 229
}