{
  "video_id": "OJ1Dbv6YriQ",
  "title": "STRENGTH TRAINING for BEGINNERS | Build strength, get toned & speed up metabolism!",
  "description": "This is a beginner strength training workout created for seniors and beginners who have little-to-no experience.  Strength training is great to building strength (obviously!), to get toned and best of all, to speed up metabolism!  I explain each exercise as we go through them to ensure you understand proper form and technique.  Even though I teach the exercises while standing, most of the exercises can also be followed by sitting in a chair.  We'll cover all the major muscle groups today.  There will be no music in the background today since a lot of viewers have expressed they prefer no music when I am giving instructions. Please feel free to put your own music on in the background:)  \n\nI did not include a warm-up simply because I feel a lot of people will do a cardio workout before.  I will be uploading a 5 minute warm up soon which you can do prior to this workout.  Or, choose one of the short workouts I have uploaded already so you are properly warmed up before lifting heavier weights in this workout.  Please challenge yourself by using heavier weights than you might usually use (I've explained it all in this video so you'll understand what weight to use).  Feel free to message me on my website (www.improvedhealthforseniors.com) if you have any questions.  \n\nPlease subscribe and write a comment!  I'd love to hear from you!  Feedback is always welcome!\n\nWishing you improved health!\nJules\n\nDisclaimer:  You should always consult your physician before starting any 'Improved Health' fitness program or any other fitness program.  This content is not medical advice and is intended for general education and demonstration purposes only.  The use of the information provided in this video is solely at your own risk.\n\nIf you like the picture in the background, you can purchase it here: https://amzn.to/3iykrUs",
  "channelTitle": "Improved Health",
  "channelDescription": "Welcome to Improved Health!\nYour go-to channel for effective, low-impact workouts designed for 'every' body. You'll find three levels of workouts—Gentle, Beginner, and Intermediate—so you can find the level that suits you best. Once you know your level, head to the playlists to explore a variety of workouts, including cardio, strength, stretching, and all-in-one routines—with options for both talking and no-talking formats.\n\nAs a Recreation Therapist, Group Fitness Instructor, and Senior Fitness Instructor, my mission is to create fun, safe, and manageable workouts that help you feel your best—physically and mentally.\n\n💺 Love chair workouts?\nI have a second channel dedicated entirely to them! Check out new chair workouts every Thursday on:\n👉 youtube.com/@ImprovedHealthChairWorkouts\n(Older chair workouts will still be available here too!)\n\nThanks for being here—I hope you enjoy the workouts, and I wish you improved health!\nJules\n",
  "tags": [
    "strength training",
    "strength training for beginners",
    "strength training for seniors",
    "resistance training for seniors",
    "building strength in seniors",
    "senior exercise",
    "exercises for seniors",
    "exercise for seniors",
    "senior strength training",
    "complete beginner strength training",
    "strength training workout for seniors",
    "strength training workout",
    "plus size workout",
    "workout for seniors",
    "build strength seniors",
    "improved health for seniors",
    "improved health",
    "beginner strength training"
  ],
  "publishedAt": "2021-08-12T11:30:08Z",
  "duration": 1525,
  "durationFormatted": "25:25",
  "viewCount": 257707,
  "likeCount": 4996,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/OJ1Dbv6YriQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/OJ1Dbv6YriQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/OJ1Dbv6YriQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/OJ1Dbv6YriQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/OJ1Dbv6YriQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/OJ1Dbv6YriQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you so much! because of the simplicity of your work out I have continued with weights for three weeks, three times a week. That is the first time I have ever followed through! GodBless!",
    "Very grateful for these beginner sessions with an eye to form and heaps of useful tips and information.  Thank you form a 63 yr old :)",
    "I&#39;m 63 and need to start strength training to build more muscle . Your video was perfect for a beginner .Thank You !",
    "Jules, I am going to be doing these 4 strength training video workouts for the next 8 weeks, I think it will be beneficial to strengthening my muscles. You are such a great instructor for all of us seniors. This was a really good workout for my muscles along with a cardio, abs and stretching workout and then to relax with the 3 minute (7 minutes) breathing workout.....Thank you again for taking you time out to making these video workouts for us, you&#39;re an angel from heaven....God Bless....have an awesome day..... Anne",
    "I&#39;m glad that I found your video. I just tried a none beginner video on YouTube and almost fainted. It was too much. So I am glad you&#39;ve provided a more gentle option! Thank you."
  ],
  "channelSubscriberCount": 391000,
  "channelVideoCount": 433
}