{
  "video_id": "onLTHQ1KE50",
  "title": "10 min STANDING ARM WORKOUT | With Dumbbells | Biceps, Triceps and Shoulders | Zero Pushups",
  "description": "Join me for a 10 min STANDING ARM WORKOUT to sculpt and strengthen your upper body. All you need is a medium set of dumbbells. I'll be using 8 lb weights, but choose the weight that best suits your strength level. Each interval will be 45 seconds on and 15 seconds rest. This is an ALL STANDING wrist friendly workout, with zero planks or pushups! So grab your weights and let's get ready to feel the burn! 💞 xox Mik\n\nEQUIPMENT:\n- Medium set of dumbbells (5-12lb weights)\n\n\nNeed a personalized FITNESS and NUTRITION plan, totally custom to your goals? Apply for ONLINE 1:1 COACHING here: https://www.fitbymik.com/11-coaching\n\nWant to improve your flexibility? Check out my stretching guide here: \nhttps://www.fitbymik.com/trainwithme/p/a-yogis-guide-to-flexibility\n\nWEBSITE: www.fitbymik.com/\nINSTAGRAM: https://www.instagram.com/fitbymik/?hl=en\nFACEBOOK: https://www.facebook.com/fitbymik/\n\n\n#homefitness #nowrists #noplanks",
  "channelTitle": "fitbymik",
  "channelDescription": "Hey! My name is Mikala, but you might know me as fitbymik! I am a fitness instructor, personal trainer, dancer and aerialist born and raised in Toronto Canada. I have a passion for health and fitness that lead me to a Bachelors Degree in Kinesiology, and over a decade of teaching in the fitness industry. Some of the class genres I have taught include Barre Fitness, Strength and Conditioning, Yoga, Pilates, Zumba, Aquafit, dance and gymnastics. I also have years of expertise with one-on-one personal training and fitness coaching. One of my favourite things about this industry is the ability to help others achieve their goals and feel their best!\n\nIn between teaching and learning, I spent many years performing as a dancer and aerialist with Norwegian Cruise Line. I also performed as an aerialist at Tokyo Disney Resort in Japan!\n\nI can’t wait to continue bringing more workouts and challenges to help YOU reach your fitness and flexibility goals!\n",
  "tags": [
    "fitbymik",
    "quick at home workout",
    "talking workout",
    "10 minute workout",
    "arm workout",
    "standing workout",
    "standing arm workout",
    "10 min arm workout",
    "standing upper body workout",
    "upper body workout",
    "upper body workout with dumbbells",
    "arm workout with dumbbells",
    "arm workout no pushups",
    "arm workout standing",
    "arm workout no planks",
    "arm workout wrist friendly",
    "wrist friendly",
    "no planks",
    "no pushups",
    "no wrists",
    "all standing workout",
    "no planks arm workout",
    "arm workout medium dumbbells"
  ],
  "publishedAt": "2022-06-17T10:00:11Z",
  "duration": 640,
  "durationFormatted": "10:40",
  "viewCount": 6777598,
  "likeCount": 125966,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/onLTHQ1KE50/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/onLTHQ1KE50/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/onLTHQ1KE50/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/onLTHQ1KE50/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/onLTHQ1KE50/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/onLTHQ1KE50\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I keep coming back to this for arms. Not repetitive, not too hard, not too easy. No lying down. Straight to the point",
    "This is gonna sound silly, but I really wanted to tone my arms in time for Halloween so I have a kickass She-Ra cosplay. So I&#39;ll be writing down my progress here so that I can sorta journal my progress.<br><br>Day 1: I&#39;m not the buffest yet, so I&#39;m using three pound dumbells. My arms are aching and I definitely gotta work on my core ^-^&quot;<br><br>Day 2: Definitely gonna keep doing this before work, not after or else I&#39;ll be too tired<br><br>Day 3: I can feel the burn in my arms now. I almost didn&#39;t wanna do it today, but it&#39;s becoming part of my morning routine!<br><br>Day 4: Owie. But Day four is done! I also got a step tracker for my cardio. :&gt;<br><br>Day 5: Did day 5 a bit late due to late hours, but done!<br><br>Day 6: I found out we have a gym in my new work place, so I&#39;ll be using heavier weights.<br><br>Day 7: First week done!!! And I change my mind about the heavier weights ^-^&quot; Turns out I was doing the lateral raises and the one exercise at <a href=\"https://www.youtube.com/watch?v=onLTHQ1KE50&amp;t=267\">4:27</a> with poor posture. They&#39;re much more challenging now! Now this is becoming a habit, I should be golden in progress from now on.<br><br>Day 9: I missed Day 8. But that&#39;s fine, I came home after walking five miles, and I passed out the minute I got home!!! Doesn&#39;t make my progress any less valid. I could be imagining things, but I think I&#39;m starting to see a difference too? I think it&#39;ll be more pronounced by week 2.<br><br>Day 10: I instead decided to do this workout twice a day in the morning and then afternoon. Going good so far.<br><br>Day 14: Oh my gosh, I got so into routine, I forgot to actually update this! There&#39;s a difference in my muscle definition now, and now that I do this with correct posture, I upped the weight! Going from 3 to 5. It&#39;s not much, but its honest work.<br><br>Day 20: Week three has been achieved :] I&#39;m very proud of my progress, and working out has given me better habits elsewhere too! I stopped biting my nails finally after doing it chronically for years. And I&#39;m way less anxious nowadays.<br><br>Day 26: Week four! Guess who upped their weights again! Now Im finally up to eight so I can REALLY follow along with the video!!! It&#39;s not much, but damn does it feel good to literally FEEL myself be stronger now! I have so much more energy for the days :] Recently, I&#39;ve actually switched to another video, and I do a fifteen minute workout everyday from now on. Building momentum with just ten really helped. I might continue this lil journal thing here, but my workouts will be done elsewhere.",
    "I love doing this workout.I am a 67 year old woman and I make this part of my workout regimen every day. Thanks!",
    "Simple and to the point. I love it! I also liked that her tone of voice is soft and  encouraging, rather than loud and in her face. Thank you for sharing this with us!",
    "I LOVE that your videos are not interrupted by commercials like some of the others. I hate having to stop the workout to hit the Skip Ads button; so good job on not having them."
  ],
  "channelSubscriberCount": 897000,
  "channelVideoCount": 290
}