{
  "video_id": "ONsvMaytg_0",
  "title": "Breathwork To Help Support The Release Of DMT (3 Rounds Of Guided Breathing)",
  "description": "Want to deepen your practice? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite with T-Shirts and more:\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nWelcome to this  breathwork Journey. The breathing is a bit longer in today's session so be sure to get comfortable and be in a safe space. We will be doing 3 rounds of breathing for 2 Minutes 25 seconds followed by 1:30 breath retentions. \n\nA longer more intense session can open the mind to a more profound and immersive state of self-discovery, serving to bring about a greater degree of insight, stimulate new and enlightening thoughts, spark a greater awareness of oneself and one’s emotional state, and allow you to gain more clarity. Longer sessions available on my Patreon channel if you would like to dive deeper within your own being.\n\nWelcome to a glimpse of Psychedelic Breathwork where will will do 3 rounds of the Belly Chest Out breath and have breath holds of 1 minute 30 seconds. .  Normally in a Psychedelic Breathwork session it lasts up to 1 and a half hours with 25 minutes of breathing with a pre and post meditation. Activation and integration. \n\nPsychedelic Breathwork combines conscious connected breathing and longer breath holds. We are getting out of the thinking mind, and opening up to whatever needs to come up. This is not exactly a Psychedelic Breathwork session, but this breathing session is inspired by it. In a Psychedelic Breathwork session, breathers can experience ego death, emotional release, an open heart and much more. \n\nA longer more intense session can open the mind to a more profound and immersive state of self-discovery, serving to bring about a greater degree of insight, stimulate new and enlightening thoughts, spark a greater awareness of oneself and one’s emotional state, and allow you to gain more clarity.\n\n\nIt´s recommended to lay down, with a pillow under your knees for better back support. By laying down you´re able to relax your body more and take more profound inhales, more love to bring ;)\nI am always sitting upright for video purposes. So do what feels right, but if you want to go deeper I recommend laying down. \nI encourage you to, before any breath work, to get in a calm meditative state, set your intention and to make sure that you are comfortable. \n\nRegular practice of Breathwork can bring real change to your life Including boosted immune system, lowered stress and inflammation, better focus, more energy and the list goes on. My guiding voice mixed with the rhythmic music really helps to go deeper into a state of relaxation and bliss. So if you want the full experience, wear headphones and be in a quiet comfortable place !\n\nAll music, guided voice and video editing is done by me. I thoroughly enjoy creating this content for you all and hope that is can bring improvement into your life. Whether that be more self love, kindness, less stress and anxiety, lowered inflammation,  more energy etc whatever it brings, remember to say thank you to yourself for taking the time do improve your life.\n\nSafety/Disclaimer: \n\nAll information provided by this channel is only for educational and entertainment purposes.  Sandy is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n\nMuch Love,\nSandy\n\n#breathwork #wimhof #dmt\n00:00 Introduction\n01:30 Round 1/3\n04:00 1st Breath Retention\n06:17 Round 2/3\n08:40 2nd Breath Retention\n11:10 Round 3/3\n13:33 3rd Breath Retention\n16:10 Meditation",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "alkaline breathing",
    "breath of fire",
    "breathing technique",
    "breathing technique to release dmt",
    "breathing techniques",
    "breathwork",
    "dmt",
    "dmt breathing",
    "dmt breathing explained",
    "dmt breathing technique wim hof",
    "dmt breathwork meditation",
    "guided breathwork",
    "joe rogan",
    "natural dmt",
    "wim hof",
    "wim hof breathing",
    "wim hof follow along",
    "pranayama",
    "yoga",
    "dmt breathing 3 rounds",
    "holotropoic breathwork",
    "psychedelic music",
    "guided breathing 3 rounds"
  ],
  "publishedAt": "2022-07-12T13:00:15Z",
  "duration": 1145,
  "durationFormatted": "19:05",
  "viewCount": 1239044,
  "likeCount": 28631,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ONsvMaytg_0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ONsvMaytg_0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ONsvMaytg_0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ONsvMaytg_0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ONsvMaytg_0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ONsvMaytg_0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I am 32. At the end of this session I saw myself when I was 17 living alone in an apartment. I was scared, lonely and very depressed and life was hard for the subsequent years. I walked into that apartment and gave my 17 year old self a powerful hug and told him how proud I was of him for being so strong and pulling through everything. <br>Thanks for the guidance. Will start doing this regularly. <br>Much love.",
    "Im 41 yrs old ,I&#39;ve been doing this breathwork for 42 days in row  and it changed my life forever. I feel energic like when I was 20 yrs. Merci !!!",
    "It&#39;s difficult to put a DMT breakthrough into words because so much happens in such a short time, yet it feels like an eternity. It&#39;s really amazing.",
    "I am afraid a lot of people are not sensitive enough to feel this, but this so much better then drugs!",
    "Saw people repeatedly recommending book Depths of Manifestation, and eventually, I decided to give it a shot. All I can say is WOW—this book clarified everything I&#39;d been doing wrong, and my manifestations finally started becoming reality. Trust the hype; it really works."
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}