{
  "video_id": "oq5wA56F5oE",
  "title": "15 min Fat-Burning Elliptical Workout- Beginner",
  "description": "This is an Audio-Based Workout focused on the Fat-Burning zone \n\nThe fat-burning zone workouts on the Elliptical machine, in particular, is the range of heart-rate intensity in which you burn the most calories from fat.\n\nIt’s said to take place at around 60-70 percent of your maximum heart rate.\nFat Burning Zone Elliptical Machine Workouts allows your body to convert energy from fat because it is in a lower state of cardio—unlike the cardio zone, which requires instant fuel that your body more easily converts from glycogen (the energy from your food).\n\nIn lay terms, when you Elliptical Machine exercise at a higher intensity, your body goes for energy that is most easily accessible (energy from food). When your Elliptical Machine Workout is at a moderate intensity, your body doesn’t need energy as instantly and instead sources it primarily from fat.\n\nMost Trainers agree that including Fat Burning Zone workouts in your fitness regimen has enormous benefits to your overall well-being, weight loss, and cardiovascular health. Elliptical Machines are the perfect cardio machine to dial into your fat-burning zone while lowering your risk fo injury. Try an Elliptical Machine fat-burning zone today.",
  "channelTitle": "müüv",
  "channelDescription": "\n• SMART - We do the thinking. You do the moving. The müüv smart engine will personalize each workout routine to your goals, preferences, and prior performance to deliver results\n\n• FLEXIBLE - Support for hundreds of healthy activities from outdoor walking to indoor cycling to make moving fun\n\n• FITS INTO YOUR LIFE - Integrated music and media from your favorite media providers like iHeartRadio make it easy to work out while doing the things you love\n\n• UNLEASHES THE CREATOR IN YOU - Customize your experience from what music you want to hear to what coaching cues you want to hear for a truly unique workout experience\n\n• FUN - Real-time motivation from your coaches and friends to make moving more fun\n\n• CONNECTED - With müüv smart equipment, hundreds of officially supported pieces of equipment by Stamina, and integration with thousands of other pieces of exercise equipment, müüv coaching incorporates all your existing equipment into one seamless workout experience\n\n\n",
  "tags": [],
  "publishedAt": "2020-09-23T05:00:05Z",
  "duration": 911,
  "durationFormatted": "15:11",
  "viewCount": 5252,
  "likeCount": 0,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/oq5wA56F5oE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/oq5wA56F5oE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/oq5wA56F5oE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/oq5wA56F5oE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/oq5wA56F5oE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/oq5wA56F5oE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Enjoyed it I&#39;ll stick with it",
    "I use this program every day. It really works!"
  ],
  "channelSubscriberCount": 3220,
  "channelVideoCount": 139
}