{
  "video_id": "OW_6OlyJl6Q",
  "title": "30 MIN KILLER STRENGTH Workout - With Weights - Home Workout with Dumbbells",
  "description": "Hey Team, a new 30 min KILLER STRENGTH workout with dumbbells! The focus is on toning and strengthening your full body with this home workout. Grab your Dumbbells and let's do this! Let's go!\n\n♡📱 Sign up to my Grow with Anna APP for more workouts & challenges: https://growwithanna.com?utm_source=youtube&utm_medium=organic&utm_campaign=launch\n\n▸ Level: Intermediate\n▸ Time: 30 Min\n▸ Equipment: 2x 5kg and 2x 8kg Dumbbells\n\nWorkout:\n▸ Warm Up + Mobility 45 sec on, no rest\n▸ Full Body Burn 30 sec on, no rest\n▸ Upper Body Finisher 60 sec on, no rest\n▸ Lower Body Finisher 60 sec on, no rest\n▸ Cool Down 30 sec on, 10 sec off\n\nPlease remember that we are all different and that you can make this your own workout ♡ Take a longer break when you need to.\n\nJoin my channel to get early access to my workouts:\nhttps://www.youtube.com/channel/UCsLF0qPTpkYKq81HsjgzhwQ/join\n\n♡ Sign up to the Team Grow Newsletter: https://manage.kmail-lists.com/subscriptions/subscribe?a=VLsDDa&g=WikyFT\n\n♡ Join the OFFICIAL TEAM GROW Community Group: https://www.facebook.com/groups/teamgrowsupport/\n\n♡ My WITHINGS ScanWatch: Bit.ly/WITH-TEAM-GROW\n\n♡ My @KorodrogerieDe  DISCOUNT CODE: GROW\n\n♡ My Amazon Storefront: https://www.amazon.de/shop/growingannanas \n\n♡ The Gear I Use:\nCamera: https://amzn.to/3aticKD\nLens: https://amzn.to/3cCiujR\nTripod: https://amzn.to/2zontX9\nMicrophone: https://amzn.to/34VaKXH\n\n♡ SUBSCRIBE: http://bit.ly/2QLvpXn\n♡ My Vlog Channel: https://www.bit.ly/3TA3afs\n♡ Instagram: http://bit.ly/2ZSdHFR\n♡ Facebook: http://bit.ly/2SVkgpE\n\n♡ My Music: Try Lickd Music for free: https://go.lickd.co/growingannanas\nhttps://www.epidemicsound.com/referral/gw5avz\n\n#growingannanas #growwithanna #homeworkouts #hiitworkout\n\nD I S C L A I M E R\n\nIf you are a newbie start with a simple and easy exercise before attempting all advanced exercises. Performing exercises out of your capability might strain your muscles and you may get injured.\n\nThis channel offers health, fitness and nutritional information. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Growingannanas will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "growingannanas",
  "channelDescription": "Get strong, fit & confident with my at home workouts. Welcome to my channel!\nI used to be a certified CrossFit coach and now I inspire and motivate people all over the world on my Social Media Channels. \n\nWhat you'll find here : Full Length Workout Videos, HIIT and Strength Workouts, oh and lots of good, positive vibes ;)\n\nMake sure you subscribe + turn notifications on so you never miss a strong workout with me and my Team Grow.\nSee you on the mat! Anna xx\n",
  "tags": [
    "30 min killer strength workout",
    "home workout",
    "workout of the day",
    "dumbbell workout",
    "military monday workout",
    "hiit it hard",
    "grow with anna",
    "muskeln definieren",
    "super sweaty",
    "hiit workout for fat loss",
    "no repeat workout",
    "no talking workout",
    "calorie killer",
    "burn calories",
    "follow along workout",
    "workout for women",
    "build strength",
    "cardio and strength",
    "workout with weights",
    "dumbbell workout at home",
    "intense workout",
    "hiit workout growingannanas"
  ],
  "publishedAt": "2024-11-11T03:00:30Z",
  "duration": 2049,
  "durationFormatted": "34:09",
  "viewCount": 556235,
  "likeCount": 11973,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/OW_6OlyJl6Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/OW_6OlyJl6Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/OW_6OlyJl6Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/OW_6OlyJl6Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/OW_6OlyJl6Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/OW_6OlyJl6Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I started working out after some bad healt issues using your videos and I have been working out 4-5 times every week, almost 5 months in a row. Loved this one a lot! Today my 6 year old son did many things with me from your workout (I was suprised seeing him doing some things really well, like a pro 😅) and when he saw you having hard time, he was cheering you up! <br>I really wanted you to know that. You are helping so many other people around the world and so many are cheering up for you! ❤ All the best from Estonia! 🥰",
    "Anna, this one was my favorite one yet. Please load more of these. Your have been the only YouTube trainer that I workout with consistently for over 2 years. One day I challenged my husband to join me because he has a tendency to underestimate girls. He loves working with men with big muscles. He joined me a year ago and the first time he nearly threw up but he continued doing your videos with me 3-4/week. Let me tell you, he lost weight and he gets so many compliments and he can’t stop bragging about your videos. Thank you from Miami Florida. You have changed our lives and best of all you have videos for everything we want to do.",
    "That was a real killer challenge 😅. ❤The format, slow and steady building up pace and intensity. Worked every muscle.😁👏",
    "Thanks",
    "the word &quot;killer&quot; here perfectly suits this workout(in the end, I couldn&#39;t longer do squats with jumps, so settled on regular squats)😅. but this is not a disadvantage. I enjoyed the workout for 100% and feel that I am growing. thank you, Anna! it was incredible💗"
  ],
  "channelSubscriberCount": 7400000,
  "channelVideoCount": 1073
}