{
  "video_id": "PdnZTxKIe9g",
  "title": "12 Easy Exercises To Do In Bed To Reduce Fat",
  "description": "Did you know you can work out even in bed, and burn fat along the way? Fitness really has no limits and you can lose weight even from the comfort of your bed, doing these easy, 12 exercises in bed!\n\nAll the exercises in this video can be done in a sitting position either on your back or on your knees or tummy.\n\nThis home vide workout is perfect for you if you don't want to get out of bed but still want to exercise and reduce fat.\n\nYou can do it either in the morning after waking up, or in the evening after getting into bed.\n\nYou may also perform this exercises if you for a reason cannot leave your bed - but still need to burn calories.\n\nSo let's start the workout program and get some good fat burning results!\n\nBe sure to subscribe to the channel and you will receive new video workouts regularly everyday Monday through Friday!\n\nAlso leave me a comment below the video and tell me if you liked today's video training!\n\nGood luck and let's begin!❤️💪",
  "channelTitle": "Roberta's Gym",
  "channelDescription": "I'm here to help you look and feel great, with effective body weight workouts and exercises.\n\nBurn calories and extra fat with simple workout routines you can easily do at home. No equipment or gym necessary.\n\nNew video workouts Monday to Friday and then Sunday as well.",
  "tags": [
    "exercises to do in bed",
    "workout to do in bed",
    "workout to do in bed to reduce fat",
    "exercises to do in bed to reduce fat",
    "bed exercises",
    "bed workout",
    "exercises you can do in bed",
    "workout you can do in bed",
    "sitting workout",
    "sitting exercises",
    "how to reduce fat in bed",
    "how to burn fat in bed",
    "how to lose weight in bed",
    "can you lose weight in bed",
    "can you reduce fat in bed",
    "easy exercises to do in bed",
    "easy workout to do in bed",
    "simple exercises to do in bed",
    "roberta's gym"
  ],
  "publishedAt": "2018-10-11T07:20:34Z",
  "duration": 845,
  "durationFormatted": "14:05",
  "viewCount": 6880350,
  "likeCount": 119493,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/PdnZTxKIe9g/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/PdnZTxKIe9g/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/PdnZTxKIe9g/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/PdnZTxKIe9g/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/PdnZTxKIe9g/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/PdnZTxKIe9g\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "her: rest time<br><br>me: <b>happy crying</b>",
    "Me after 1 minuite: fitness is my passion",
    "I just finished it. I was too lazy to get out of bed and exercise but this workout felt great. I&#39;m going to do this every night. I felt the burn lmao.",
    "I have Vertigo, and exercising is very difficult. So today that I&#39;m feeling a little better I tried this and I&#39;ll be definitely be doing this every day.",
    "I&#39;ve been doing this for months now and honestly, it&#39;s amazing. I did lose some weight and my body became so much more active, I feel way healthier. I do this every morning in bed and I&#39;ve noticed changes in my body. Some tips though, you should take longer breaks, just pause the video, don&#39;t force yourself too much. And when they say repeat 20 times for each leg, you go 10 times this one, 10 times the other, come back to this one then 10 times the other to finish. Don&#39;t go 20 times a leg(in one go) if you can&#39;t! One important thing, I believe in you and you will make it!"
  ],
  "channelSubscriberCount": 6510000,
  "channelVideoCount": 2319
}