{
  "video_id": "phnE46lampw",
  "title": "15 Min Full Body Daily Stretch for Tight Muscles, Soreness & Flexibility",
  "description": "When you are sore, tired and just want to rest, its most likely the best idea for your body! Getting a stretch in can help you speed up your recovery process and help your muscles elongate so that when you are working out you are getting proper (and full) range of motion in your exercises\n\nStretching daily can also be a form of self care and can help increase mobility and decrease back, knee, and shoulder pain.\n\nIf you are experiencing intense pain, that is not normal, please consult your doctor or physiotherapist before proceeding with exercise or even stretches.\n\nDuring todays stretch, I want you to focus on breathing in confidence and breathing out doubt. Take nice deep breaths, and take your time with the stretches. This is a moment for you to recollect your thoughts, enjoy the music, and give your body the love it deserves.\n\nIf you have the extra time to do this before bed or first thing when you wake up in the morning, you will for see a noticeable difference in your energy levels, in your recovery time, and the effectiveness of your workouts!\n\nIf you read this description all the way through, let me know below in the comments how often you stretch, and what your stretching goal is for the coming week! \n\nThank-you for joining me today :) \n\nMake sure to follow my IG for my daily updates on what's happening in the growwithjo community, and how you can improve your life physically, mentally and spiritually https://www.instagram.com/growwithjo/?hl=en\n________________________________________________________________\n\nRESULTS\n\nSHARE YOUR WORKOUT VIDEOS on Tik Tok, YouTube or Instagram for a chance to be featured in my next video or on our community Youtube: @growwithjo unified\n\nRecord a video or take a picture of you doing the workout, tag me @growwithjo #growwithjo @growwithjo_unified\n\nTo get the BEST (AND QUICKER) RESULTS, follow a nutrition plan that supports your goals. Get a customized nutrition plan in my app. \n\nHit this link to try your customized plan FREE for 7 days: https://get.growwithjo.app/UVuo/myapp\n\n_______________________________________________________________\n\nSHOP\n\nGrow With Jo APP →https://get.growwithjo.app/UVuo/myapp\nWorkbooks & Video Programs → https://www.godaily.ca/\nBig Booty Tight Tummy Guided Video Program (BEST SELLER): https://www.godaily.ca/bbtt-go\n\n_________________________________________________________________\n\nKEEP UP WITH ME\n\nINSTAGRAM → https://www.instagram.com/growwithjo/?hl=en\nFACEBOOK → https://www.facebook.com/growwithjoofficial/\nPINTEREST → https://www.pinterest.ca/growwithjo/\nTIKTOK → https://www.tiktok.com/@growwithjo?lang=en\nCONTACT EMAIL → support@growwithjo.ca\n\n_________________________________________________________________\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.\n\ngrowwithjo beginner workouts abs workout walking all standing low impact fun fitness videos",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "fitness videos",
    "stretch",
    "daily stretch",
    "mady morrison",
    "mady stretch",
    "full body stretch",
    "reduce soreness",
    "stretch for sore muscles",
    "mobility",
    "flexibility stretch",
    "booty",
    "fitmitmady",
    "deep stretch",
    "weightloss",
    "homeworkout",
    "home workout",
    "norepeat",
    "no repeat",
    "hiit",
    "warmup",
    "cooldown",
    "release stress",
    "stretch to relax",
    "morning stretch",
    "stretching exercises",
    "stretching exercises for beginners",
    "beginner stretch",
    "stretching",
    "stretching after workout"
  ],
  "publishedAt": "2022-02-17T16:00:14Z",
  "duration": 901,
  "durationFormatted": "15:01",
  "viewCount": 644232,
  "likeCount": 13555,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/phnE46lampw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/phnE46lampw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/phnE46lampw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/phnE46lampw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/phnE46lampw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/phnE46lampw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "There&#39;s nothing better than a good stretch 🥳",
    "I faithfully do your workouts EVERYDAY and the changes I have seen in my body is literally everything!!!! So many different workouts and intensity levels I love it!!! I appreciate you for sharing and constantly posting new workouts!!❤️",
    "I saved this video about a month ago when I had a bit of pain but didn’t attempt it. I started the gym today and decided to do this stretch. I was slightly worried it wasn’t beginner or fat person friendly but decided to do it and skip anyone that felt too difficult. <br><br>15mins later and I’m happy to say I did it and only skipped two as I wasn’t flexible enough for them. <br><br>If you’re like me and worried it might be too much for you, just give it a go, do as much as you can and remember to smile and pace yourself. You’ve got this!",
    "Today was my first day doing your videos. Can I just say <b>especially</b> as a woman it was so refreshing to watch someone REAL workout. I loved seeing that you had to adjust your clothes occasionally, got off rhythm once and weren&#39;t doing every single rep perfectly. Other fitness videos always say you don&#39;t have to be perfect and then the instructor has a rock hard jiggle free body and never misses a beat. Thank you and I hope I can keep up with your weekly routines 😊",
    "36 yrs old, I do this daily along with your mobility stretches, for anti-aging, 25 min total daily, and now I&#39;m hooked on stretching and I&#39;m lucky to have met you on YouTube.  Life-changing.  We all use it (our bodies) or lose it (our health).  Thank you for being an inspiration. 💜"
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}