{
  "video_id": "PHXb_VAVpgY",
  "title": "Virtual Running Videos For Treadmill With Music | 30 Minute Virtual Run",
  "description": "Want to lose weight, perform better and live longer?\nI'm a family physician sharing science-backed insights inside my free weekly newsletter: Join here 👉 https://dradrian.carrd.co\nVirtual Running Videos For Treadmill With Music | 30 Minute Virtual Run\n\nThis is a virtual run down Portobello Road, near Dunedin, New Zealand. For a change I have left out metrics and added music. I hope you enjoy. Thanks for watching!\n\nWelcome to the Virtual Running Videos Channel! On this channel you'll find treadmill running videos, indoor running videos, indoor running, virtual running videos, New Zealand scenery, and virtual run videos. I started this channel out of gratitude for the beautiful place I live and a desire to share that with people. You can experience running and with a virtual run in the beautiful outdoors from the convenience of your home. I hope you enjoy! Please leave a comment, I read every one.\n\nImportant Disclaimer: This content is strictly the opinion of myself and is for educational and informational purposes only. It is not intended to provide medical advice or to take the place of medical advice or treatment from a personal physician or health professional. Consult your doctor or qualified health professional regarding specific health questions and before beginning any nutrition, supplement, exercise or lifestyle program. Neither myself nor the publisher of this content takes responsibility for possible health consequences of any person or persons reading or following the information in this educational content. Please take care when exercising. Neither myself nor the publisher of this content take any responsibility for any accident, injury or any health problems which occur while watching this video. As with all exercise programs, when using our videos, you need to use common sense.  Check with your doctor before beginning any fitness program. There may be camera views, movements or positions that may make people feel more unsteady or unsettled. By performing any fitness exercises, you are performing them at your own risk.  This channel will not be responsible or liable for any injury or harm you sustain as a result of our fitness program, videos, or information contained. Thanks for your understanding.\n\nLinks may be affiliate links from which I receive a small commission, but where the price is the same for you. Affiliate links are a way I help offset maintenance and running costs of video production.",
  "channelTitle": "Virtual Running Videos",
  "channelDescription": "Join for perks like early video access:\nhttps://www.youtube.com/channel/UCY95zbGK0vlAZ8Gk8OZqa1g/join\n\nOn Virtual Running Videos you'll find virtual running videos, virtual exercise running videos, indoor running, New Zealand scenery. I started this channel out of gratitude for the beautiful place I live and a desire to share that with people. Here you can find the perfect video for your indoor cycling or running workout. You can experience running and cycling in the beautiful outdoors from the convenience of your home. I hope you enjoy these treadmill running videos, indoor running videos, indoor running, virtual running videos, indoor cycling videos, treadmill tv, virtual running videos for treadmill, virtual scenery cycling, virtual running videos for treadmill, new zealand. #963393",
  "tags": [
    "treadmill running videos",
    "virtual running videos",
    "virtual run video",
    "Treadmill TV",
    "virtual jog",
    "virtual scenery",
    "new zealand",
    "virtual run",
    "POV",
    "jogging",
    "virtual running",
    "videos watch while running treadmill",
    "scenic running videos for treadmill",
    "trail running videos treadmill",
    "virtual running videos for treadmill",
    "virtual running videos for treadmill no music",
    "4K",
    "Virtual Exercise Video",
    "Virtual Treadmill Scenery",
    "scenery for treadmill",
    "music",
    "treadmill workout"
  ],
  "publishedAt": "2021-02-21T09:00:09Z",
  "duration": 1811,
  "durationFormatted": "30:11",
  "viewCount": 691556,
  "likeCount": 7891,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/PHXb_VAVpgY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/PHXb_VAVpgY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/PHXb_VAVpgY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/PHXb_VAVpgY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/PHXb_VAVpgY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/PHXb_VAVpgY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Nice video thanks.  It&#39;s amazing how unlittered and uncluttered the roads are in other developed countries vs. the USA.",
    "One of the best virtual running videos I’ve ever saw on YouTube - I’ve watched it hundred times for my indoor running sessions. The landscape and the music - absolutely on point. Please create more 😊 <br>Greetings from Germany 🇩🇪",
    "I always wanted something like this thank you",
    "My second comment but don&#39;t worry, I&#39;m not a comment stalker. I&#39;ve done this a few times now. I&#39;ve gone from being able to jog for 30 seconds non stop (no laughing please), to up to 3 minutes non stop!! I&#39;ve got the jogging bug now. I loves it I do. And a big thanks to you and your vids.",
    "The  runner is wearing a hat. Every time I see his shadow I think, “am I wearing a hat?” Great run."
  ],
  "channelSubscriberCount": 88500,
  "channelVideoCount": 153
}