{
  "video_id": "PJLN1kAzbyw",
  "title": "Beginners Gentle Pilates Flow Mat Workout - 20 minute",
  "description": "Warm up, stretch, and find your center with this gentle Pilates Mat Workout for Beginners. Join me now and take steps towards feeling your absolute best through balancing your body and mind.  💖 Get your BETTER POSTURE IN 5 DAYS program for free! https://bit.ly/FWM_Better_Posture\n\n*******\nDon't forget to Subscribe and hit the \"🔔\" so you don't miss out on our latest videos. http://bit.ly/FlowWithMiraYT\n\nFollow us!\nhttps://www.instagram.com/flow.with.mira\n\n*******\nFlow with Mira strongly recommends that you consult with your physician before beginning any exercise program. You should be in good physical condition and be able to participate in movement and exercise. You should understand that there is the possibility of physical injury when participating in any exercise or exercise program. If you engage in this exercise or exercise program, you agree that you do so at your own risk and voluntarily participate in these exercises.\n\n#flowwithmira #pilatesforbeginners #gentlepilates",
  "channelTitle": "Flow with Mira",
  "channelDescription": "My Pilates-based programs and classes will teach you how to reset your mind and begin a deeper connection to your body through movement. If you want to build balance, core strength, flexibility, and find freedom within your body – you've come to the right place. Join me now and take steps towards feeling our absolute best through balancing your body and mind. Trust yourself, listen to your body, and find what moves you. \n\nKeep moving and good things will happen,\nMira xxx\n\n",
  "tags": [
    "Beginners Gentle Pilates workout",
    "gentle pilates workout at home",
    "pilates",
    "flow with mira",
    "gentle workout",
    "pilates workout",
    "pilates for beginners",
    "beginner gentle workout",
    "gentle pilates",
    "beginner workout",
    "pilates flow workout",
    "soft pilates workout",
    "gentle pilates workout",
    "gentle pilates for beginners",
    "20 min pilates workout",
    "gentle pilates flow",
    "gentle pilates stretches",
    "gentle flow mat",
    "gentle flow mat pilates",
    "mat pilates for beginners",
    "evening workout",
    "at-home workout"
  ],
  "publishedAt": "2021-01-15T05:29:06Z",
  "duration": 1364,
  "durationFormatted": "22:44",
  "viewCount": 603462,
  "likeCount": 11704,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/PJLN1kAzbyw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/PJLN1kAzbyw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/PJLN1kAzbyw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/PJLN1kAzbyw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/PJLN1kAzbyw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/PJLN1kAzbyw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "The gentleness was actually true to form for me! Sometimes I encounter “gentle” or “beginner” workouts that feel inaccessible to me. This was such a great help!",
    "I started today, ill try doing Pilates more often. What I wanted to say is, this video is actually beginner-friendly, usually they make 20-min videos that make you question your existence.",
    "I know this video is from two-years ago, but I wanted to tell you thank you. I have a few autoimmune diseases that affect my bones, joints and tendons. Today is a hurting day, but I didn&#39;t want to skip doing Pilates as I&#39;m just newly beginning. I&#39;ve done a few of your beginner classes aside from this. Your descriptive teaching is amazing, and your calm voice is soothing making your classes relaxing yet a nice workout. This video/class felt great on my joints, and I can&#39;t thank you enough.",
    "Great instructions! I have trouble with a pelvic tilt and this helped me scoop in my core and improve my posture! Thanks!",
    "Omg this flow instantly lifted my mood! Very gentle yet effective. Thank you!"
  ],
  "channelSubscriberCount": 209000,
  "channelVideoCount": 226
}