{
  "video_id": "pJp08smdcFk",
  "title": "Strengthen Your Core - Just 6 Minutes A Day!",
  "description": "Strengthen your core in just 6 minutes a day with this simple, effective home workout! 9 great exercises to strengthen your complete core including your abs, obliques, lower back, and hips. Led by a physical therapist to help you increase core strength, decrease pain, and help you look and feel your best.\n\n==============================\n➡️ LINK TO JARED’S THICK EXERCISE MAT: https://urlgeni.us/amzn/drjaredexercisemat\n==============================\n\n============================================\n⭐️ SUPPORT TONE AND TIGHTEN BY BECOMING A CHANNEL MEMBER! Different levels of support and perks are available - click here to learn more: https://www.youtube.com/channel/UCJASBOyF4Fkd26SIwRhLuZw/join\n============================================\n\nI’ve said it before and I’ll say it again… a large number of my patients would never need to come see me for their pains if they just took part in some regular core strengthening.\n\nThe problem is, most people don’t know the right exercises they should be doing to increase strength in their core and most videos online are too long and too difficult.\n\nThose are the exact problems I wanted to help solve with this video!\n\nThis is a quick core workout that only takes 6 minutes to complete.\n\nYou’ll complete 9 different exercises to strengthen all the major muscle groups in your core and hips and there is zero equipment required.\n\nI’ll even personally guide you through the whole thing to ensure you’re doing them correctly to get maximum benefit.\n\nHOW OFTEN SHOULD I TRAIN MY CORE?\nAs opposed to other muscle groups in your body, your core muscles are actually very resilient to training. That means they can handle more training more consistently than other areas.\n\nWhile other muscle groups typically need 48-72 hours to recover, most people can train their core every day and be just fine.\n\nDAILY CORE WORKOUT\nWe’ll perform this workout in interval fashion - each exercise will be performed for 30 seconds with a 5-second “transition” period to prepare for the next exercise.\nSo I’m ready to get started when you are! Hope you enjoy this workout and hope it helps you to accomplish your goals. \n\nBRACE MARCHES\nREVERSE CRUNCHES\nHEEL TOUCHES\nSINGLE LEG BRIDGE R\nSINGLE LEG BRIDGE L\nSIDE PLANK L\nSIDE PLANK R\nSWIMMER\nLOW PLANK\nBIRD DOG\nBEAR HOLD\n\nHere is a 5 Minute Core Workout you can do everyday: https://www.youtube.com/watch?v=fcwh_79owDw\n\n💬 Did you complete this workout? What did you think of it? I LOVE hearing from you - leave your experience in a COMMENT and let me know how you feel! Also if you’d like to see more videos like this from T&T comment below and I’ll see what I can do.\n\n👍🏼 If you did like this video, hit the THUMBS UP button to LIKE this video above. That helps more people to find it here on YouTube so thanks so much for doing that!\n\n✅ Finally, if you haven’t SUBSCRIBED to Tone and Tighten yet I would love to see you back here for more videos in the future! Hit the SUBSCRIBE BUTTON above and be sure you hit that little “bell” to get notified of a new T&T video the moment it goes out.\n\n===================================\nOTHER GREAT VIDEOS YOU MIGHT ENJOY:\n\n✅ DAILY STRETCHING ROUTINE FOR PEOPLE WHO AREN'T FLEXIBLE: https://youtu.be/FI51zRzgIe4\n✅ COMPLETE CORE WORKOUT [7 MINUTES]: https://youtu.be/_TdWdFQ1Cms\n✅ NEXT LEVEL CORE: 10-MINUTE COMPLETE WORKOUT: https://youtu.be/b_TTLmmQmXU\n✅ MY TOP THREE CORE EXERCISES: https://youtu.be/IR0yV_3DfBo\n✅ TOTAL BODY MORNING STRETCHING ROUTINE: https://youtu.be/t2jel6q1GRk\n\n\n\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. T&T Digital Media, LLC makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.",
  "channelTitle": "Tone and Tighten",
  "channelDescription": "Hi - I'm Jared! I am a doctor of physical therapy who specializes in rehabilitating orthopedic (back, neck, shoulder, knee, etc) and postpartum (diastasis recti) conditions. I love being fit, healthy, strong, and active, and hope to help you accomplish your fitness goals. On this channel you'll learn best treatments for common injuries through exercising and stretching, and how to become a fitter, healthier version of yourself. Please consider subscribing!\n\nDISCLAIMER: The content on this channel is NOT medical advice and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Use of this content is at your sole risk.\n",
  "tags": [
    "how to increase core strength for beginners",
    "core strength exercises",
    "core exercises for women",
    "core strength workout",
    "core stability exercises",
    "core exercises for back pain",
    "core stability exercises for back pain",
    "how to increase core strength",
    "how to strengthen your core for beginners",
    "core workout",
    "core workout for beginners",
    "simple core workout",
    "how to strengthen your core",
    "follow along core workout",
    "Jared Beckstrand",
    "Tone and Tighten"
  ],
  "publishedAt": "2023-01-12T13:30:12Z",
  "duration": 455,
  "durationFormatted": "7:35",
  "viewCount": 1517734,
  "likeCount": 52419,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/pJp08smdcFk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/pJp08smdcFk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/pJp08smdcFk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/pJp08smdcFk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/pJp08smdcFk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/pJp08smdcFk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Did you try this workout? What did you think? Leave me your experience in a comment and when you&#39;re ready for more check out my 10-minute total core workout here: <a href=\"https://www.youtube.com/watch?v=b_TTLmmQmXU\">https://youtu.be/b_TTLmmQmXU</a> Hope this helps you; thanks so much for watching and supporting T&amp;T! 🙏🏼",
    "<a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=42\">0:42</a> Brace Marches<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=78\">1:18</a> Reverse Crunches<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=113\">1:53</a> Heel Touches<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=148\">2:28</a> Single Leg Bridges(Right)<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=183\">3:03</a> Single Leg Bridges(Left)<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=218\">3:38</a> Left Side Plank<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=254\">4:14</a> Right Side Plank<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=289\">4:49</a> Swimmer<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=323\">5:23</a> Low Plank<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=358\">5:58</a> Bird Dog<br><a href=\"https://www.youtube.com/watch?v=pJp08smdcFk&amp;t=393\">6:33</a> Bear Hold",
    "This book Muscles: Every Man’s Dream is the key to unlocking your potential! It transformed both my body and mindset.",
    "I am 53, I have arthritis in my feet, the inside of my knees are bone on bone and I have herniated disc&#39;s in my lower back. Not to mention a bit over weight. I have done construction my whole life and it has  been rough on my body. I started doing the core exercises after I came across one of your older videos. I have been doing them for about a week and already feel great improvement in my pain, range of motion and it is improving my posture. Thank you and I will definitely be checking out more of your videos, just what I needed.",
    "Thank you, sir! I’m 20 years old and I suffer from a back pain since I don’t sit properly. This video and your 8 minute stretching routine for beginers are a great way for me to finally start the change. Thank you."
  ],
  "channelSubscriberCount": 2750000,
  "channelVideoCount": 641
}