{
  "video_id": "Ptj-NEb5oB4",
  "title": "5 Minute Morning Stretches - Quick Routine for Stretching and Energy!",
  "description": "⭐️ Jessica Valant, physical therapist and Pilates Teacher, takes you through these 5 Minute Morning Stretches that anyone can do to start their day! These moves can help stretch tight muscles, loosen joints and improve energy. This quick routine for stretching and energy should be on everyone's morning to do list! ⭐️ \n\n⭐️ Join my online UNLIMITED community and membership with hundreds of home workouts, recipes, workout plans, women's health information, beginner programs, podcasts and more to support you in your body!  ➡️ http://www.jessicavalant.com/unlimited\n\n🎧 Find my podcast Meet Your Body anywhere you listen to podcasts! Or listen here http://www.jessicavalant.com/podcast\n\n💜 A week of free workouts and resources to your inbox: http://bit.ly/2EMBhsJ\n\n💥 Find the Jessica Valant app here!\nApple IOS - https://tinyurl.com/mry5ya8r\nGoogle - https://tinyurl.com/yh3ty5fp\n\n🎧 Podcast - https://meetyourbody.buzzsprout.com\n💪🏽 Four Week Beginner Workout Program: https://payhip.com/b/d3ARC\n🎥 Subscribe to my YouTube channel: http://bit.ly/2E3rNbs\n🙌🏻 Instagram: https://www.instagram.com/jessicasvalant\n🤸‍♀️ Shop my favorites and discount codes: https://jessicavalant.com/favorites-2\n\n⭐️ Join my UNLIMITED program to feel strong, safe and secure in your body in all seasons of life! Get immediate access to over 400 home workout videos, monthly workout plans, women's health info, free app, recipe library, perimenopausal and postmenopausal support and the most supportive online community available! Join here 👉🏼 http://www.jessicavalant.com/unlimited.\n\n\n🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀🌀\nJessica Valant and Jessica Valant Pilates, LLC, recommend you consult with a physician before starting any new exercise program. The information given here is not meant to treat or diagnose any medical condition. Please stop if you feel any pain or dizziness. You understand that physical activity can pose a risk and by watching this channel and these videos you assume all risk and release Jessica Valant and Jessica Valant Pilates, LLC, from all liability.",
  "channelTitle": "Jessica Valant",
  "channelDescription": "I’m Jessica, a licensed physical therapist, Pilates teacher and women's health expert with over 25 years of experience. I believe movement should be empowering, encouraging and fun! On my channel you’ll find workouts for everyone, regardless of skill level or experience. I also talk through various injuries and conditions, including my own experience with women’s health issues such as prolapse and hysterectomy. I want you to remember you are strong, you are powerful and you deserve to move your body and feel good while you do it. \n\nYou can find more of my tips and full length workout programs at http://www.jessicavalant.com.\n\n You can also find me and behind the scenes action on Instagram @jessicasvalant.\n\n🙌🏽 Do you like our free content? Consider donating to Jessica Valant Pilates to help support all our free resources: https://tinyurl.com/mvt56pfv\n",
  "tags": [
    "morning stretches",
    "morning workout",
    "morning yoga",
    "morning stretch",
    "morning pilates",
    "pilates for energy",
    "morning stretches for beginners",
    "pilates for beginners",
    "beginner pilates",
    "energizing morning pilates",
    "energizing pilates",
    "Jessica Valant pilates",
    "pilates with nicole",
    "Sara Beth yoga"
  ],
  "publishedAt": "2021-09-27T15:30:07Z",
  "duration": 391,
  "durationFormatted": "6:31",
  "viewCount": 1275180,
  "likeCount": 26092,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Ptj-NEb5oB4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Ptj-NEb5oB4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Ptj-NEb5oB4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Ptj-NEb5oB4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Ptj-NEb5oB4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Ptj-NEb5oB4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "💪🏽 Want my full length workouts, daily routines, women&#39;s health info and more? Get a full home workout library, monthly fitness plans, recipes, free app and more  <a href=\"http://www.jessicavalant.com/unlimited\">http://www.jessicavalant.com/unlimited</a>",
    "Nice variety of stretches demonstrated!  Those wanting to delve deeper into this topic might find StretchMania beneficial",
    "I love doing this workout every morning, honestly it gets me energised.",
    "Was short on time but wanted to do a quick stretch this morning to feel ground and get my day going. Glad I found this one. Thanks so much!",
    "bruh i came into this with few expectations (just wanted to quikcly stretch before a run) but your style of instruction is so amazing. I love how there are almost no pauses and everything flows into the next stretch rather than resetting to start the next stretch. Also the variety is great. You are definetly not boring. Thanks for the great stretch ill come again. (:"
  ],
  "channelSubscriberCount": 914000,
  "channelVideoCount": 510
}