{
  "video_id": "pU80BEm43JM",
  "title": "Guided Meditation for Anxiety | The Hourglass",
  "description": "Relieve anxiety with this guided meditation called The Hourglass. \n\nWritten and narrated by Priory Cognitive Analytic Therapy (CAT) Psychotherapist Adele Burdon-Bailey, this 8-minute guided meditation allows you to take a breath from the anxieties of the outside world and look after your wellbeing. \n\nThis meditation is designed to help people relieve symptoms of anxiety. For anyone struggling with their mental health, the Hourglass is the perfect way to unwind. \n\nSkip to 👇\n00:00 Intro\n00:09 Preparation\n01:30 Meditation begins\n\n#anxietymeditation #guidedmeditation #meditationforanxiety \n\n__\n\nFollow Priory on social media:\nhttps://www.instagram.com/priorygroup/\nhttps://www.facebook.com/PrioryGroup\nhttps://www.tiktok.com/@priorygroup\nhttps://www.linkedin.com/company/priory\n\nLooking after your mental health should be high on everyone's priority list. At Priory, we strive to help everyone take control of their mental health, building a brighter future for themselves and those around them. For more insight, explainers and, advice on managing your mental health, head to the Priory blog: https://www.priorygroup.com/blog\n\n__\n\nThis video is designed to be informational, but its content is not a substitute for professional advice, diagnosis, or treatment. If you or a loved one are experiencing difficulties with your mental health, please contact a medical professional or a licensed mental health provider for tailored advice for you.  \n\nIf you or a loved one are in crisis and need immediate support, call 999 or attend your nearest A&E department. For information on relevant crisis support lines, visit https://www.priorygroup.com/crisis-support\n\n__\n\nPriory is the leading independent provider of mental healthcare and adult social care in the UK. We have two divisions, which together support the needs of over 35,000 people every year. We currently treat more than 70 different conditions through a nationwide network of over 300 facilities. \n\nOur purpose is to empower each person in our care to take steps towards a healthy future and live their lives as positively and independently as possible.\n\nFor more information on how Priory can help you, head to our website or call us:\nhttps://www.priorygroup.com/\n0800 840 3219",
  "channelTitle": "Priory",
  "channelDescription": "Priory is the leading independent provider of mental healthcare and adult social care in the UK.\n\nWe are dedicated to helping people improve their health and wellbeing, not only at our network of hospitals and wellbeing centres, but also on the Priory YouTube channel.\n\nThis channel is dedicated to providing 100% free resources for improving your mental health. From short explainers to help you feel more in the known about mental health and addictions, practical self-help walk-throughs to help you boost your wellbeing,  and deep-dive, long-form discussions about the biggest topics in our industry - it is all here for free on the Priory YouTube channel.\n\nPriory is a long-established company, with a prestigious history, with some of the most renowned experts. All of that expertise we're bringing to our YouTube. We create all our content with the help of some of the UK's best psychiatrists, therapists, and other mental health experts. \n",
  "tags": [
    "meditation",
    "anxiety",
    "anxiety relief",
    "anxiety meditation",
    "guided meditation",
    "meditation guided",
    "guided meditation for anxiety",
    "mindfulness meditation for anxiety",
    "guided meditation anxiety",
    "anxiety meditation guided",
    "calming meditation for anxiety",
    "release anxiety meditation",
    "meditation to relieve anxiety",
    "short meditation for anxiety",
    "Priory"
  ],
  "publishedAt": "2023-02-27T09:00:25Z",
  "duration": 510,
  "durationFormatted": "8:30",
  "viewCount": 1241131,
  "likeCount": 12386,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/pU80BEm43JM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/pU80BEm43JM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/pU80BEm43JM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/pU80BEm43JM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/pU80BEm43JM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/pU80BEm43JM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "If you enjoyed this meditation then be sure to check out our meditation playlist, with more to be added in the future ❤🙏 <br><a href=\"https://www.youtube.com/playlist?list=PLEizM40pda32pByAIFEQuo5h6FfWUSlfa\">https://www.youtube.com/playlist?list=PLEizM40pda32pByAIFEQuo5h6FfWUSlfa</a>",
    "my daughters derelization has been affecting her lately, she has ptsd from a past episode she had and she has been struggling very badly, she’s 13 years old. I’ve been pushing her to try to be stronger for herself and giving her all of the support she needs, and I’ve realized meditation has helped her so much. It completely masks her anxiety, and she’s able to feel at ease even if It’s for 5 minutes, I’m so grateful to have people like us in the comments to know that we are not alone. I pray my daughter will realize she isn’t either, and that this anxiety is curable.",
    "The fact that you have a clock in the background aduibly ticking is brilliant. I dont know if it was on purpose or not but it gives the person listening something real to focus on while you&#39;re talking, in case we cant hear anything where we are.",
    "Anxiety is like a weight on your shoulder and never goes away never stops being heavy but with meditation and patience anything can happen I&#39;ve learned to accept my feelings me fears and let go and find some sort of of peace within myself and meditation and mindfulness has had a huge part in helping with that. I wish anyone reading this to have some peace and love and tranquility bestowed upon you and just know that you are okay and everything is gonna be okay and  god loves you and so do I",
    "My Mom has been causing a lot of anxiety for my wife and I. Stomach feels knotted, it feels like there&#39;s a beehive in my chest causing me to think and feel at 100mph. This is helping me to slow down and get some control over my body again. Thank you"
  ],
  "channelSubscriberCount": 16800,
  "channelVideoCount": 107
}