{
  "video_id": "PvEnWsPrL4w",
  "title": "Low impact, beginner, fat burning, home cardio workout. ALL standing!",
  "description": "http://teambodyproject.com \n\nIf you'd like to take part in more workouts just like this with Daniel and the team, come and join the Team Body Project site, where we have over 400 workouts and multiple plans for all fitness levels.\n\nToday's beginner cardio workout can be taken part at your own pace, pause whenever you have to and enjoy moving.",
  "channelTitle": "Body Project",
  "channelDescription": "High energy, motivating workouts to do from home. \n\nWe created Team Body Project to share our passion for exercise and excellent movement with others who want to feel good about their body and experience great health.\n\nhttps://teambodyproject.com\n\nOur holistic exercise programme includes HIIT cardio, resistance training, pilates and yoga.",
  "tags": [
    "body project",
    "team body project",
    "Daniel bartlett"
  ],
  "publishedAt": "2020-06-15T08:20:08Z",
  "duration": 1774,
  "durationFormatted": "29:34",
  "viewCount": 13490376,
  "likeCount": 151153,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/PvEnWsPrL4w/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/PvEnWsPrL4w/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/PvEnWsPrL4w/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/PvEnWsPrL4w/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/PvEnWsPrL4w/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/PvEnWsPrL4w\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I started with one of your beginner workouts one year ago, I was at 202 pounds 5’1. I barely made it each time!😩 but I kept it up every day with a 30 minute walk after. I can proudly say I am  currently 142 pounds! Thank you so much, I owe so much to your encouragement and workout! 👍",
    "I finished this no stopping no pauses....I am in tears this is a celebration and motivation...thanks",
    "Daniel makes me think of a phrase that I love so much I printed it on a shirt: exercise is a celebration of what your body can do, not punishment for what you ate.",
    "I lost 50 pounds over the course of 2020, and went from being clinically “overweight” to a healthy weight for my height and age range. I also went from being a complete couch potato, to completing 30-60 mins of yoga daily , 5-7 times a week. Now that I’m actively maintaining this healthy weight and lifestyle, I’ve found your videos as a way of introducing cardio into my life.<br><br>When you said that this workout isn’t about winning or losing, but “participating,” I had to pause the video and have a little cry. I rarely refer to my health and weight loss process as a “journey,” but I’m starting to appreciate it as just that; a journey that I’m still on. I can’t thank you enough for these videos, for the diversity of participants you show, for the clothes they wear (I can’t tell you how demotivating is is to follow along with a guide wearing a belly top and skin-toned leggings), and for the positive message you share. It’s so helpful to so many.",
    "He was right when he said &quot;starting is the hardest part&quot; and he is right, today I was like &quot;ugh, I dont wanna do this&quot; now that I&#39;m done I&#39;m like &quot;I&#39;m glad I did that&quot;"
  ],
  "channelSubscriberCount": 2420000,
  "channelVideoCount": 65
}