{
  "video_id": "pWFaTxNOGnI",
  "title": "Breathing Exercises to Stop Panic Attack | Guided Breath Bubble, No Music | TAKE A DEEP BREATH",
  "description": "10 minutes is all you need, A Simple and Calm Breathing Exercise, no music, just gentle guided breath sounds, and a breath bubble to help you calm down, you can focus on the bubble and match your speed to help you relax. When we breathe slower and extend our exhales this can help us relax into rest and digest and can help us when we have a panic attack.\n\nDownload this digital MP3 track here: ►https://takeadeepbreath.dpdcart.com/product/208961\n\nSometimes when people have a panic attack they tend to focus on inhaling and trying to get in even more air when their lungs are full, with an exercise like this we focus on extending the exhale to help us calm down and breathe normally.\n\nSubscribe so you never miss a new video: https://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=1\n\nAbout TAKE A DEEP BREATH: \nWelcome to TAKE A DEEP BREATH (TADB), here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. Here you will also find our dedicated breathing podcast (Breathcast), where you can watch interviews with the worlds top breathing experts https://youtube.com/playlist?list=PLoVrvn2_-QGbNwagnvQEEfVbCay3682De \n\nSafety Information: \nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell STOP. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in bodily harm. Deep breathing may cause tingling sensations, a ringing in the ears, and/or light-headedness. These are normal responses and are no cause for alarm. If you faint, however, you have gone too far and should take it more slowly next time. \n\nTop Books on Breathing and Breathwork:\n✅ Wim Hofs new book \"The Wim Hof Method\" https://geni.us/EBJR\n✅ James Nestor's Book 'Breath The New Science of a Lost Art' here: https://geni.us/c1CK\n✅ Anders Ollson Book: \"Conscious Breathing\" here: https://geni.us/9mjmz7\n✅ Belisa Vranich \"Breathing For Warriors\" here: https://geni.us/J7QjBc\n✅ Belisa Vranich \"Breathe\" here: https://geni.us/G5q8Be\n\nMy Equipment:\nI spent hours of my time researching the best camera, microphone, and lens for Podcasts and other filming-making needs. I love the kit I bought, and very happy with the performance:\n✅ Stunning Camera: Sony A6400: https://geni.us/wTOWW\n✅ Great Lens: 1.4 16mm Sigma: https://geni.us/etntF\n✅ Wonderful Microphone: https://geni.us/mnCi\n\nDisclaimer \nThe information provided in this video is provided for informational purposes only and is NOT to be used or relied on for any treatment purposes. All information provided by TAKE A DEEP BREATH is of a general nature, only for educational/entertainment purposes. No information is to be taken as medical or health advice. Follow this breathing exercise at your own risk. TAKE A DEEP BREATH or Mike Maher is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of your reliance on the information contained in this video. There is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself. We use affiliate links which means if you buy something, we'll receive a commission, we appreciate the support you give us and we hope to keep adding value to you.\n\nSubscribe so you never miss a new video: https://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=1",
  "channelTitle": "TAKE A DEEP BREATH",
  "channelDescription": "Welcome to TAKE A DEEP BREATH, My name is Mike Maher, I am a breathwork instructor, podcaster and researcher of the breath. I have studied many modalities and I am proud among other things to be an Oxygen Advantage Master Instructor.\n\nOn my channel here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. We also host #Breathcast which is a dedicated Breathwork Podcast where we interview the world's top breath and health experts.\n\nBreathwork is where you consciously alter your breathing pattern to achieve a set of results such as helping you to relax, raise your energy, increase your immune system, change your state of consciousness or calm your parasympathetic nervous system.\n\nBreathwork has been a key component in Yoga for centuries,  now with the help of people such as Joe Rogan & books such as the Oxygen Advantage, breathwork is part of mainstream society.\n\n\n",
  "tags": [
    "breathing exercises",
    "stress relief",
    "relieve anxiety",
    "stress and anxiety",
    "breathing techniques",
    "breathing exercises for stress relief",
    "breathing exercises for anxiety relief",
    "calm breathing",
    "3 Deep Breathing Exercises to Reduce Stress & Anxiety",
    "take a deep breath",
    "breathing techniques for anxiety",
    "how to stop a panic attack",
    "peace breath",
    "2.1 breathing",
    "mindful breathing",
    "stop a panic attack now",
    "peace breathing",
    "wim hof method",
    "james nestor breath",
    "do nothing for 10 minutes"
  ],
  "publishedAt": "2021-02-15T17:00:14Z",
  "duration": 601,
  "durationFormatted": "10:01",
  "viewCount": 45619,
  "likeCount": 607,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/pWFaTxNOGnI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/pWFaTxNOGnI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/pWFaTxNOGnI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/pWFaTxNOGnI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/pWFaTxNOGnI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/pWFaTxNOGnI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "You can now support this channel and Download this digital MP3 track here $4.99: ►<a href=\"https://takeadeepbreath.dpdcart.com/product/208961\">https://takeadeepbreath.dpdcart.com/product/208961</a>",
    "No music, no ads . Pure bliss and relaxation. <br>Thank you 🙏 😊",
    "Thanks 5 am ptsd episode enduced a panic attack via dream/night terror. Thanks for that, saved me a call to the crisis line been using it for yrs and lately panic attacks are legit getting worse. Thanks for the page and now following. Much love.",
    "If you have anxiety thinking you can&#39;t breathe fully in, you feel like your chest is tight and possibly you&#39;re yawning a lot-<br>Learn the difference between chest breathing and diaphragmatic breathing, you want to be doing diaphragmatic breathing.<br>I was struggling with this for days at a time before I figured it out, focusing on my breath made me feel more anxious because I felt like I couldn&#39;t take a full breath, thought something was wrong with my lungs but it was all a mental thing, it&#39;s a form of hyperventilation.<br><br>Learn to use your stomach muscles to control your breath, it&#39;s effortless and how you breath when you&#39;re not paying attention to it, learn to do it consciously. I hope this helps someone 💚",
    "Fantastic, just what i need to de-stress. Thank you so much, No long intro, straight to the point. Thats why i love your channel😊"
  ],
  "channelSubscriberCount": 295000,
  "channelVideoCount": 386
}