{
  "video_id": "Q2cMMnUuKYQ",
  "title": "20 Minute Full Body Strength Workout (No Equipment/No Repeat)",
  "description": "Tap in with us for a 20 minute FULL BODY strength building workout that requires no equipment! This workout focuses on 'time under tension'---meaning each exercises will be performed slow and controlled to ensure your muscles are fully engaged. This is a great workout for beginners who want to build good overall strength with basic bodyweight exercises. For the more advanced, feel free to add resistance using dumbbells, kettlebells, or weight vest to make it more challenging. Give the workout a go and let us know how you did in the comments! 🔥\n\nCheck Out Our Other Strength Workout: https://youtu.be/N4HbeyDChFw\n\nThe Home Equipment We Use:\nhttps://www.amazon.com/shop/juicetoya...​\n\nFollow Us On Instagram For More Fitness Related Content:\n\nJuice: @JuicetonTx\n\nToya: @ToyaCherrelle\n\nPersonal Training Business Page: @OneBodyLA",
  "channelTitle": "Juice & Toya",
  "channelDescription": "Workouts | Food | Motivation | Lifestyle | + More",
  "tags": [
    "bodyweight strength workout",
    "strength workout without equipment",
    "full body strength workout",
    "full body strength workout no equipment",
    "full body strength workout at home",
    "time under tension workout",
    "time under tension workout at home",
    "time under tension workout no equipment",
    "time under tension",
    "time under tension bodyweight workout",
    "workouts to build muscle no equipment",
    "build stregnth",
    "workouts to build muscle",
    "build muscle at home",
    "20 minute strength workout no equipment"
  ],
  "publishedAt": "2021-04-05T00:30:15Z",
  "duration": 1498,
  "durationFormatted": "24:58",
  "viewCount": 2523721,
  "likeCount": 59631,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Q2cMMnUuKYQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Q2cMMnUuKYQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Q2cMMnUuKYQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Q2cMMnUuKYQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Q2cMMnUuKYQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Q2cMMnUuKYQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Drop a comment and let us know how your workout went! 🔥",
    "I started out being the weakling of my class, now I&#39;m one of the strongest kids thanks to this workout! I&#39;m also a girl, so being able to win in arm wrestling against the boys in my class feels like I&#39;ve got some sorta superpower lol",
    "I love the fact that you guys use a sound to signify when you&#39;re switching sides during an exercise. You understand that we&#39;re not always looking at the screen. This is going to be my new go to workout for a while! Got my heart rate really up there and I feel like I really got a great workout in about 20 mins. AMAZING!!!",
    "I really like the “no repeat” routines and the warm up/cool downs!",
    "Thank you guys very much. I was in a motorcycle accident in 2018. Traumatic brain injury, lacerated my liver, fractured 3 ribs sternum and pelvis, broke my left collar bone, back, left  arm, right knee and leg and shattered both of my heels. Every one of those parts was repaired with perminant screws and rods. Suffered for years until my leg was amputated in April 2022. Wish I could post a Pic of the bag of titanium parts they gave me just from my knee down. Time for me to find myself. Hard to do when you cant stand in front of the mirror and not hate what your looking at or feel embarrassed in front of your wife after a shower and you have to take your leg off. So when I previously said thank you, I hope the phrase comes with a lot more meaning. Keep killing it guys. Imagine the help your putting out there. 🎉😅"
  ],
  "channelSubscriberCount": 2140000,
  "channelVideoCount": 312
}