{
  "video_id": "Q7Ht5RyMCN8",
  "title": "Pyramid Style HIIT Cardio Workout",
  "description": "We've got 40 minutes for a fat burning HIIT cardio workout, pyramid style! This cycling class has more than a few challenges to keep this ride fun and effective at helping you boost your metabolism and burn calories! \n\nThe pyramid structure we will follow will be based on RPM/speed and there will be 4 pyramid circuits in this workout. The pyramids will either be a fast, slow, fast structure or vice versa! Another big challenge I have for you is increasing your current resistance!! That means your current 7 will be your new 6, your current 8 will be your new 7, and so on! It is SO important to re-evaluate your resistance numbers because as you get stronger on the bike your resistance needs to increase too! This is to prevent a plateau and ensure that you continue to change and grow.\n\nI hope you enjoy this ride as much as I did! Thanks for working out with me! I also mentioned a few links during the ride, you can find those below!\n\nSign up for REVIVE here 👉  https://www.kaleighcohen.com/login-register/\n\n⭐️ Join the Discord here!  👉 https://www.buymeacoffee.com/kaleighcohen\n\n⭐️ SAVE 15% ON INDOOR CYCLING SHOES HERE! Use code KCF15 at checkout! 👉  http://shimanoindoor.com/discount/KCF15\n\n⭐️ Click here to become a member and get access to custom KCF emojis!👉 https://www.youtube.com/channel/UChY_9WJx0saa0St48lSdytQ/join\n\n⭐️ Fitness gear and my favorite things 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n🎶 This class playlist can be found here! 👉 https://open.spotify.com/playlist/1y7oqrdoFmqMfk1Ks9PA6a?si=0a2c0b5a7b95482e&pt=1c6df47b268f85facb504e8064ef0804\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n0:00 - 2:04 WARM UP | I Love It by Dazy Chain\n2:05 - 5:01 INVERTED SPRINTS | Move My Body by 2050\n5:02 - 7:38 JUMPS/FREEZES | Only Gold Rings by Ooyy\n7:39 - 10:17 INVERTED SPRINTS | Unstoppable by Nevada Wild\n10:18 - 14:45 SPRINTS | My Mind by NM\n14:46 - 17:26 CLIMBS | Keep Going Up by BHAVIOR\n17:27 - 20:02 SPRINTS | Academy by Heyson\n20:03 - 23:12 JUMPS | This Is What I Live For by Grafitti Ghosts\n23:13 - 25:15 INVERTED SPRINTS | Let's Get It by Bobby Saint\n25:16 - 28:25 FREEZES | In It to Win It by Damned Anthem\n28:26 - 31:10 CLIMBS | Born for This (William Morris Remix) by Royal Deluxe\n31:11 - 34:45 SPRINTS | Light Wave by DJ Eely\n34:46 - 37:07 SPEED OVER SADDLE | One of a kind by The N3W N3W & SYDNY\n37:08 - 40:25 COOL DOWN | Don't Want Anyone Else by Companion\n\n\nSome of the links listed above are affiliate links, such as Amazon, and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n#REVIVE #FATBURNING #HIIT",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "hiit",
    "fat burning",
    "spinning",
    "spin",
    "spinning class",
    "spin class",
    "indoor cycling",
    "cycling workout",
    "exercise bike",
    "stationary bike",
    "spin bike",
    "pyramids",
    "Kaleigh cohen",
    "burn fat",
    "lose weight",
    "weight loss"
  ],
  "publishedAt": "2022-05-30T04:00:16Z",
  "duration": 2425,
  "durationFormatted": "40:25",
  "viewCount": 53367,
  "likeCount": 2027,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Q7Ht5RyMCN8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Q7Ht5RyMCN8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Q7Ht5RyMCN8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Q7Ht5RyMCN8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Q7Ht5RyMCN8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Q7Ht5RyMCN8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Week 2 - A C &amp; S - Day 10 - Done. Awesome workout! So great to revisit again! Thank you Kaleigh! Thank you Jason!🏁WINNING🏁⚡🔥⚡🔥⚡🔥⚡",
    "Pyramid rides go by super fast!!! Yay for today<a href=\"UCkszU2WH9gy1mb0dV-11UJg/8gF1Xp_zK8jk8gSDrI2wCw\"></a>",
    "So awesome to do this again. Thank you ❤ xoxo and adding in your strength workouts were the game changer for me",
    "I really enjoyed this longer ride on a Wednesday! Feeling nice and sweaty. Now on to abs! 🎉",
    "I really think this ride gives The Hardest Ride Ever from a couple of weeks ago a run for its money!  What a challenging ride!!! Loved it!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}