{
  "video_id": "qbk0QAzw0Qc",
  "title": "Fastest Way to Lose Weight = This 40min HIIT Elliptical Workout (Burns 800 calories)",
  "description": "Adrian's Fat Loss System ➜ https://bit.ly/__CLICK__HERE ➜ Lose 30 Pounds (𝗼𝗳 𝗕𝗲𝗹𝗹𝘆 𝗙𝗮𝘁) EVERY 30 Days\n.\n.\n\"Adrian, I 𝗟𝗼𝘀𝘁 𝟮𝟮 𝗣𝗼𝘂𝗻𝗱𝘀 𝗶𝗻 𝟮𝟯 𝗗𝗮𝘆𝘀. Why Haven't I Lost 30 By Now!?\"  -𝙽𝚊𝚘𝚖𝚒 𝚆𝚒𝚕𝚎𝚢 ➜ https://bit.ly/__CLICK__HERE ➜ Adrian's Fat Loss System\n.\n.\n\nI’m not joking that doing this workout is one of the quickest ways possible for you to lose weight – Just read the highlights of some of these success stories (read some of the full success stories below at the end of this description)\n\n-My Elliptical workouts helped Alexa Lose 70 Pounds in 3 months.\n\n-Luis Lost 12 pounds his first week doing this HIIT elliptical workout\n\n-Travis now has a 34 inch waist after doing Elliptical interval workouts of mine &...\n\n-Sarah Lost 37 pounds in 5 weeks (and got into a sexy new dress) with my other elliptical workouts so...\n\nImagine how fast you will lose fat doing my 40 minute high intensity interval training elliptical workout above! That elliptical workout you see in the video above takes weight loss to whole new level and there is no doubt in my mind you will lose 5-15 pounds doing that tougher elliptical workout before the week is over!\n\nBut is this seriously overall the fastest way to lose weight? Well yes & no\n\nYes if you are using an elliptical as your only workout option but of course you will need to add a diet plan to lose weight even faster while doing any workout so see any of the diet plans, tips and tricks at https://www.youtube.com/playlist?list=PL5qWKDYV54nHChElgSThIjChWA7ctVopP\n\nI don’t want this video or the title of the video to sound like this is the absolutely ONLY best or the fastest way known to man to lose weight so no... What I'm actually saying when I say \"fastest way to lose weight\" is that I’m saying to lose weight as fast as possible you will need to get your ass kicked every time you work out whether you use an elliptical or not and to guarantee you are losing weight as fast as you possibly can whenever you work out I highly suggest you Look at the 10 rules to lose 15 pounds every 3 weeks here at https://www.youtube.com/watch?v=2RVFRb9p8CQ\n\nSo what is the fastest way to lose weight on an elliptical? The answer to that is to simply do Elliptical HIIT workouts and not elliptical cardio workouts and if the elliptical HIIT workout in the 40 minute workout video above was too hard then do one of my easier elliptical workouts so for example - if this HIIT workout was too hard for you then...\n\n-Do my 10 minute Elliptical workout here at https://www.youtube.com/watch?v=MjHaLu6QkdI\n-DO my 30 second Elliptical interval pyramid for HIIT at https://www.youtube.com/watch?v=5wi6kARs7Us\n-Do my 35 minute Elliptical interval pyramid for HIIT at https://www.youtube.com/watch?v=1esP3Zng8LQ\n\nYou can download all of these Elliptical workouts for weight loss at nowloss.com/elip where you can also download and print the actually layout of the workout plus the mp3 of m motivating you throughout the workout.\n\nLike I have already said in this YouTube description (if you read this far) is that the fastest way to lose weight is not necessarily with an elliptical so if you do not have an elliptical you can follow along and do this work out by doing jumping jacks, running or jogging in place, ski steps or on another machine like a bike or treadmill.\n\nThis workout burns on average 500-600 calories every 40 minutes or about 800 calories every hour or 1200 calories every 9 minutes (INSANE!) so every 4 hours total of doing this workout is a pound lost by itself and that is not even counting all the calories you burn or all the fat you lose while you are not working out doing nothing at all.\n\nHere is the basic layout of this workout...\n\n-You go all out for 20 seconds\n-Rest for 10 seconds\n-Repeat that for 20 times\n-Rest 1 minute\n-Repeat up to 4 times for a 40 minute workout \n\nIMPORTANT (always beat your last workout, set or the last 20 seconds)\n  \n\nNow here are the full testimonials of the people who used my easier elliptical workouts so keep in my how fast you will burn fat doing this ALL OUT kick ass 40 minute elliptical workout:\n\nFrom Alexa Who lost 70 pounds in 3 months:\n\nDear Mr adrian bryant.\n\nThank you so much for your workout videos. Everyday for at least the last week I have done your 30 minute killer bike workout, your 12 minute elliptical and your 30 minute elliptical and I have currently lost nearly 5 stone (or 70 pounds) in 3 months. I'm so happy especially as my birthday is this month. I bust my ass everyday in the gym.\n\nI am your fan for life\nAlexa G Luiza\n\nFrom Sarah who lost 37 pounds in 5 weeks:\n\nI haven't been able to fit into this black dress for a year. I follow a non-prescriptive routine of advanced jumping jacks and elliptical. I LOVE how toned my body has become!\n\nThanks again\nSarah M.",
  "channelTitle": "Adrian Bryant",
  "channelDescription": "Subscribe to LOOK BETTER (naked) EVERY 2 Weeks. \n",
  "tags": [
    "fastest way to lose weight",
    "quickest way to lose weight",
    "elliptical workout",
    "elliptical hiit",
    "elliptical weight loss",
    "hiit",
    "burn 800 calories",
    "elliptical workout to lose weight",
    "hiit elliptical workout",
    "elliptical interval workout nowloss",
    "inshape4u",
    "adrian bryant",
    "burn 1000 calories",
    "burn 500 calories",
    "interval workout",
    "hiit workout",
    "Elliptical Trainer",
    "adrian bryant elliptical",
    "adrian bryant workout",
    "adrian bryant weight loss"
  ],
  "publishedAt": "2015-02-16T10:00:01Z",
  "duration": 2648,
  "durationFormatted": "44:08",
  "viewCount": 514078,
  "likeCount": 5400,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/qbk0QAzw0Qc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/qbk0QAzw0Qc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/qbk0QAzw0Qc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/qbk0QAzw0Qc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/qbk0QAzw0Qc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/qbk0QAzw0Qc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Adrian&#39;s Fat Loss System ➜ <a href=\"http://bit.ly/___CLICK__HERE\">bit.ly/___CLICK__HERE</a> ➜ Lose 30 Pounds (𝗼𝗳 𝗕𝗲𝗹𝗹𝘆 𝗙𝗮𝘁) EVERY 30 Days  \r<br>.\r<br>.\r<br>&quot;Adrian, I 𝗟𝗼𝘀𝘁 𝟮𝟮 𝗣𝗼𝘂𝗻𝗱𝘀 𝗶𝗻 𝟮𝟯 𝗗𝗮𝘆𝘀. Why Haven&#39;t I Lost 30 By Now!?&quot;  -𝙽𝚊𝚘𝚖𝚒 𝚆𝚒𝚕𝚎𝚢 ➜ <a href=\"http://bit.ly/___CLICK__HERE\">bit.ly/___CLICK__HERE</a> ➜ Adrian&#39;s Fat Loss System\r<br>.\r<br>.",
    "Okay so I did this workout alone 4 times last week while intermittent fasting and I lost 6.1 lbs already! I’ve never been so motivated!",
    "Only bad thing about this workout is that half way in, sweat starts going into my eyes because there ain&#39;t no dry spots left on my shirt or arms hahah<br>Keep up the good work!",
    "&quot;don&#39;t let that serial killer catch ya.&quot;<br><br><br>LOLOLOL",
    "I lost 5 pounds in 4 days thank you "
  ],
  "channelSubscriberCount": 510000,
  "channelVideoCount": 250
}