{
  "video_id": "Qbv2edgrgvI",
  "title": "Weight Training for Beginners & Seniors // 20 Minute Workout to Build Strength",
  "description": "Thanks you for joining me for this 20 minute all standing strength training workout.  It's perfect for seniors and beginners.  All exercises in this strength building workout are osteoporosis friendly. There are no moves that involve twisting the spine or rounding the spine. Let's build some strong bones!\nThis workout program:\n30 seconds upper body exercise \n30 seconds lower body exercise\n30 seconds combination\nWe complete just 6 rounds in this pattern with 15 seconds rest between each segment.\n\nI'm using 5 pound weights in this workout. Please use whatever weights you have and are comfortable with. If you have light dumbbells you may go faster than me. Or if you are using heavier dumbbells you may go slower than me.\n\nI hope you enjoyed this workout! Please let me know what you think in the comments. I love hearing from my viewers!\n\nMy shoes:\nnew-balance-athletics-inc.sjv.io/9gkqD5\n\nProducts that I use and/or recommend:\nhttps://www.amazon.com/shop/seniorshapefitness\nas an Amazon associate/influencer I earn from qualifying purchases \n\nMy music is from Epidemic Sound\nhttps://www.epidemicsound.com/referral/s6f2p3\n\nSeniorShape is on Facebook:\nhttps://www.facebook.com/SeniorShapefitness/\n\nhttps://www.instagram.com/seniorshape/\n\n\nsenior fitness, strength training workout, dumbbell workout, exercises for seniors, weight training, workout with weights for seniors and beginners, 20 minute workout, total body workout, full body workout, exercises to get stronger, senior shape, strength building exercises, standing workouts workout with weights, dumbbell workout, weight training workout, beginner workout, osteoporosis exercises, workout for osteoporosis, weight training for women, beginner weight training workout",
  "channelTitle": "SeniorShape Fitness",
  "channelDescription": "Hello and welcome to SeniorShape with Lauren! I’m thrilled you have found my channel! I am an ACE (American Council on Exercise) certified fitness instructor. I also hold a specialization in senior fitness. \nIt is my passion to create fun, new exercises and routines that are never boring. \nMy videos are easy to follow and the exercises featured are specifically curated for beginners, and active older adults. The workouts are challenging and at a great pace that works well for anyone. \nPlease subscribe so you never miss a new workout.\n\nEquipment I use or recommend can be purchased on my Amazon store page www.amazon.com/shop/seniorshapefitness\n*as an Amazon associate/influencer I earn from qualifying purchases\n\nFor those who have graciously asked to donate so I can continue to provide free videos can contribute through \nVenmo: @SeniorShape\nI appreciate your support!\n\nThanks for working out with me!\nLauren\n\n",
  "tags": [
    "strength training workout",
    "dumbbell workout",
    "exercises for seniors",
    "weight training",
    "workout with weights for seniors and beginners",
    "20 minute workout",
    "total body workout",
    "full body workout",
    "exercises to get stronger",
    "senior shape",
    "strength building exercises",
    "standing workouts workout with weights",
    "weight training workout",
    "beginner workout",
    "osteoporosis exercises",
    "workout for osteoporosis",
    "senior fitness",
    "bone density exercises"
  ],
  "publishedAt": "2023-05-15T11:00:29Z",
  "duration": 1217,
  "durationFormatted": "20:17",
  "viewCount": 970488,
  "likeCount": 19866,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Qbv2edgrgvI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Qbv2edgrgvI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Qbv2edgrgvI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Qbv2edgrgvI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Qbv2edgrgvI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Qbv2edgrgvI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Your exercise routines are a work of art.  They are choreographed beautifully and your accompanying narrative is very precise and encouraging without being condescending.   Thank you for providing this type of excellence.",
    "This is such a sane calming workout. No constant hyperactive talking and a great controlled speed of exercises. Am really keen to follow this routine.",
    "I just want to thank you so much for your workouts.  I&#39;m 72 and was looking for someone that understood what the word senior meant.  You are a great teacher and you have helped me so much.  Thank you from the bottom of my heart.",
    "Hi Lauren I previously left a comment for you after regularly doing your 10 minute video. Thanks for your reply. Here I am again. Since then I have been almost daily mixing and matching your videos. I am 74 years of age from London and so much enjoying your compilation of exercises that are so doable and effective. My strength and stature have improved a great deal thanks to your videos delivered in calm, encouraging and such empathic way. I just can’t thank you enough. Feel so much better in myself",
    "Not only great for seniors, but also for people like me with chronic pain in my late 40’s. Thank you for this!"
  ],
  "channelSubscriberCount": 599000,
  "channelVideoCount": 290
}