{
  "video_id": "qJFTNAUWRRo",
  "title": "Sleep Easy Knowing Everything Is Going to be OK!  (Guided Meditation)",
  "description": "This 20-minute guided sleep meditation offers peace and reassurance knowing everything is going to be ok.  By surrendering to the soothing voice and calming music, you can release the weight of your concerns and trust in the inherent goodness of life.  Allow yourself to drift into a deep, restful sleep, knowing that whatever challenges may arise, you possess the strength and resilience to overcome them.  So, if you're seeking a deep restorative sleep, press play and let this guided meditation be your comforting companion through the night.  This is an Original guided  sleep meditation recorded by us.  \n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "sleep",
    "sleep meditation",
    "sleep meditation guided",
    "meditation sleep",
    "meditation sleep guided",
    "guided meditation sleep",
    "20 minute meditation",
    "meditation 20 minutes",
    "20 minute sleep meditaiton",
    "guided meditation 20 minutes",
    "sleep easy knowing everything will be ok"
  ],
  "publishedAt": "2024-04-11T01:00:16Z",
  "duration": 1200,
  "durationFormatted": "20:00",
  "viewCount": 201632,
  "likeCount": 2347,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/qJFTNAUWRRo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/qJFTNAUWRRo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/qJFTNAUWRRo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/qJFTNAUWRRo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/qJFTNAUWRRo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/qJFTNAUWRRo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Sweet dreams everyone! 🌙😌😴🛌",
    "this video put me into a sleep so good that my spirit has transcended out of my body, and I am typing this comment with my mind",
    "A bedtime treat 🙏🏾",
    "Hi!! I began Outpatient for depression and realized for the first time in my life I didn’t actually unwind ever. I’ve never lived in a calm brain. I began meditating every night before bed to practice mindfulness. Your meditations have played a part in my healing journey. Now I listen every day in my new routine. Thank you for posting these! They changed my life.",
    "I love these nighttime videos!"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}