{
  "video_id": "qjzTH5e7_iU",
  "title": "5 Minute Guided Meditation for Clearing Blockages & Negativity",
  "description": "This is an Original 5 minute guided  morning meditation recorded by us.  \n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "5 minute meditation",
    "meditation 5 minutes",
    "guided meditation 5 minutes",
    "clearing blockages"
  ],
  "publishedAt": "2024-11-25T10:00:50Z",
  "duration": 308,
  "durationFormatted": "5:08",
  "viewCount": 144844,
  "likeCount": 4537,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/qjzTH5e7_iU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/qjzTH5e7_iU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/qjzTH5e7_iU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/qjzTH5e7_iU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/qjzTH5e7_iU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/qjzTH5e7_iU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Felt so at ease after this, my higher energy is God and I felt like my angels were around me to help me. ❤️ thank you!",
    "I wish for peace and calm to fill your mind and heart, that you find clarity in the present moment, and may every breath bring you closer to inner balance and happiness. 🌿✨",
    "Negative experiences are a part of life. But I&#39;m prayin&#39; that everyone can look for the positives in your lives!<br><br>Cleanse that negative aura to light up every room you go in! 😃🙏🏽🙌🏽",
    "Listening December 31st, 2024. Powerful release received in perfect timing. Feeling lighter going into 2025. Blessings to you and thank you 🙏🏽 🤍✨",
    "Very nice meditation 🧘‍♂️ video 📹 and look forward to the next one 😀 👍."
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}