{
  "techniqueDifficulty": [
    {
      "level": "Beginner",
      "score": 0.8
    },
    {
      "level": "Intermediate",
      "score": 0.4
    }
  ],
  "techniqueDifficultyConfidence": 0.75,
  "techniqueDifficultyExplanation": "The workout is described as a strength workout with dumbbells specifically for pregnancy, indicating movements are likely basic but effective for prenatal fitness. The use of 10 lbs dumbbells suggests beginner-friendly resistance levels. The option to use water bottles or canned goods supports a beginner-friendly technique as these are accessible and manageable. The channel is dedicated to prenatal and postpartum exercise, implying that movements are tailored for expectant users, who may be less coordinated. However, the mention of a strength workout suggests a slight increase in complexity due to coordination with weights, warranting an intermediate consideration, but still primarily classified as beginner due to likely simplified movement patterns.",
  "effortDifficulty": [
    {
      "level": "Light",
      "score": 0.7
    },
    {
      "level": "Moderate",
      "score": 0.3
    }
  ],
  "effortDifficultyConfidence": 0.7,
  "effortDifficultyExplanation": "The video duration is just over 20 minutes, and it is categorized as a strength workout with dumbbells. The description suggests choosing appropriate weights, implying it can be adjusted to individual fitness levels, which is typical for light to moderate effort difficulty. The video's targeted audience, pregnant individuals at various stages, usually implies a less intense workout to safely accommodate different fitness levels and conditions. While strength exercises typically have some intensity, the inclusive indication ('strong pregnancy') and focus on prenatal users suggest a workout generally low in intensity, with potential adjustments doubling up to moderate.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.6
    },
    {
      "level": "Intermediate",
      "score": 0.4
    }
  ],
  "requiredFitnessLevelConfidence": 0.8,
  "requiredFitnessLevelExplanation": "The Required Fitness Level is derived from the workout's technique and effort difficulty being mostly beginner-friendly due to its prenatal focus, short duration, and adjustable intensity. The channel's focus on prenatal fitness, the video's title emphasizing pregnancy utility, and minimal coordination imply it is suitable for beginners, but because strength workouts can sometimes increase heart rate and muscular effort, intermediate users might also find it engaging and beneficial. The ability to modify the resistance used allows for inclusion of both very deconditioned users and those with marginal fitness experience, hence a primarily beginner level with a moderate consideration for intermediate users."
}