{
  "video_id": "qQJi9EA13ZQ",
  "title": "Intense Lower Abs Workout | Tabata Workout to Burn Lower Belly Fat | growwithjo",
  "description": "LOWER BELLY BURNER! \nAll standing\nLow Impact\nNo Equipment\nBeginner Friendly\nWorkout At Home in a Small Space!\n\nMake sure to have lots of water with you during this workout, it will challenge you to new levels!\n\nIf you are used to working out with me, you are used to a 40s exercise time and 20s \"rest\" of walking. In todays video we will be doing 30s exercise (pushing it to the LIMIT) then 10 seconds rest. This means that you have less time to recover, which will help you burn more fat during the workout and afterwards!\n\nIf any of the moves are too fast or too challenging for you just go back to a walk. Our goal is to keep our heart rate elevated so that the burn is at its MAX!\n\nMake sure to have a healthy nutrition plan to support this workout routine! And make sure not to overeat to overcompensate for the calories burned. Calories burned is just a reference for you to see how much energy you used to do the workout!\n\nApple Watch Setting: Indoor Walk\nCalories Burned: 235\nIntensity Level: 9/10\n\n0:00 INTRO\n1:28 WORKOUT\n29:57  NUTRITION HELP & TIPS\n\n\nShare this workout with a FRIEND!! \n\n\nKEEP UP WITH ME\n\nINSTAGRAM → https://www.instagram.com/growwithjo/?hl=en\nFACEBOOK → https://www.facebook.com/growwithjoofficial/\nPINTEREST → https://www.pinterest.ca/growwithjo/\nCONTACT EMAIL → mgmt@growwithjo.com\n\n_________________________________________________________________\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.\n\ngrowwithjo beginner workouts abs workout walking all standing low impact fun fitness videos",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "walking workouts",
    "all standing workouts",
    "all standing",
    "no jumping",
    "low impact",
    "low impact workouts",
    "women beginner workout",
    "fun fitness",
    "fitness videos",
    "abs",
    "absworkout"
  ],
  "publishedAt": "2021-07-06T15:00:11Z",
  "duration": 1851,
  "durationFormatted": "30:51",
  "viewCount": 3530611,
  "likeCount": 70231,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/qQJi9EA13ZQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/qQJi9EA13ZQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/qQJi9EA13ZQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/qQJi9EA13ZQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/qQJi9EA13ZQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/qQJi9EA13ZQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "THE MOSTTTT intense lower belly standing workout! <br><br>We are doing 30 seconds of the exercise and 10 seconds of &quot;walking rest&quot;! Get ready to be challenged but also to see awesome RESULTS. Make sure to track your progress in the comments below, and thanks for workout out with me today!<br><br><br>Remember to SUBSCRIBE, LIKE, and COMMENT :) This helps me incredibly and I am so grateful for your consistency working out with me! Love you! xo",
    "Breast cancer survivor here ❤️❤️❤️❤️ and I am rebuilding my body thank you for bringing joy to my workout! PEACE💝💝💝<br><b>*update::*</b><br>11/17/21 as of today, I am down 220 to 197.6! I feel lighter, I move different..and still going! Much LOVE to all!",
    "One of the reasons I love you so much is you don&#39;t push burpees on people. I HATE burpees. And for a very long time, they were like a main dish in the training world. Another reason I love you- and your workouts- is: I AM HAVING FUN. Who knew? Thank you for all you do. My body is changing and getting stronger without me hating the process.",
    "I&#39;ve been training with you for a month now and I have to show off the results! <br>I have lost 5 kg and 8 cm in the waist and I am very proud of myself. I also started eating healthier and drinking plenty of water. I eat a lot of protein and I haven&#39;t given up on what I like to eat and it feels sooooooo good! <br>Thank you Jo for inspiring me to lead a healthier life! &lt;3",
    "This very video made me drop weight from August 2021 (146.9Ibs) to October 2021 ( 138.5ib).  Seeing the results of my entire body AND my abs having definition now...…are all the motivation I need. Your a miracle Jo!!!! So great to have found your videos!!!!"
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}