{
  "video_id": "qULTwquOuT4",
  "title": "BEGINNER FLEXIBILITY ROUTINE (Stretches for the Inflexible)",
  "description": "Not flexible? Follow along with this 30 min stretch routine designed to help increase flexibility! Great for beginner's or anyone in need of a great stretch! \n👉🏼THE MAT I USE (Exercise 6X4): http://gorillamats.com?aff=19  (MADFIT10 for 10% off)\n⭐️SHOP MY COOKBOOKS! 100+ RECIPES: https://goo.gl/XHwUJg ⭐️\n\n\nSUBSCRIBE TO MY MAIN CHANNEL (what i eat, recipes, vlogs): https://goo.gl/WTpDQk\nOTHER VIDEOS:\n➤ PREVIOUS VIDEO (\"Liar\" Ab Workout): http://bit.ly/2klS0xs\n➤ AT HOME WORKOUTS: http://bit.ly/2klS0xs\n➤ MORE STRETCH ROUTINES:http://bit.ly/2kqnWkl\n\n📷 GEAR I USE: \nCAMERA: https://goo.gl/rVQzXd\n42.5mm LENS: https://goo.gl/oLRc2u\nTRIPOD: https://goo.gl/ihp5br\nMICROPHONE: https://goo.gl/fPzkRN\nGOPRO: https://goo.gl/D6eMwL\n\n✘ I N S T A G R A M: @madfit.ig\n✘ T W I T T E R: @maddielymburner\n✘ F A C E B O O K: facebook.com/madfit.ig\n✉ C O N T A C T (business inquiries): madfit95@gmail.com",
  "channelTitle": "MadFit",
  "channelDescription": "This is a place where I post REAL TIME, AT HOME workouts.\nMy goal is to help inspire everyone at all fitness levels to get up, get moving and reach their goals!",
  "tags": [
    "stretch",
    "flexibility",
    "beginner flexibility",
    "beginner flexibility routine",
    "not flexible",
    "stretches for the inflexible",
    "beginner stretch",
    "30 min stretch",
    "30 min stretch workout",
    "madfit",
    "madfit stretch",
    "madfit flexibility",
    "stretching",
    "follow along",
    "follow along stretch",
    "follow along stretch beginner",
    "flexible",
    "30 min stretch routine",
    "30 min flexibility",
    "increase flexibility",
    "stretch routine",
    "stretch routine flexibility",
    "stretch routine 30 min",
    "maddie",
    "maddie stretch"
  ],
  "publishedAt": "2019-09-19T19:46:31Z",
  "duration": 1958,
  "durationFormatted": "32:38",
  "viewCount": 17283636,
  "likeCount": 332825,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/qULTwquOuT4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/qULTwquOuT4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/qULTwquOuT4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/qULTwquOuT4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/qULTwquOuT4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/qULTwquOuT4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Let me know how you enjoyed this stretch routine! I am by no means a professional, but I do believe that doing these stretches on a regular basis will definitely increase your flexibility! Much love! See you soon Xx- Maddie",
    "“Keep that leg at a 90 degree angle”<br><br>Me: 45 degrees take it or leave it",
    "Anyone else trying to get flexible now that they&#39;re stuck in their house with nothing better to do?<br><br>Update #2: I missed a couple of days, but I have mostly been doing this for 3 weeks every night and I am SO much closer to being able to touch my toes. I&#39;ve never been able to do that or do the splits, but I tried going down into the splits position and I was the closest I&#39;ve ever been. I was still like 6 inches from the ground, but progress is what is important in this case. Once you make it a routine, you find yourself wanting to stay in the stretches even longer even though it hurts a little bit because you can feel the muscles stretching. How are you guys doing? Have you noticed any improvements?<br><br>Update! I have been doing this consistently for the past two weeks and I have seen a MAJOR difference. When I tell you that I am NOT flexible at all, I mean it. I&#39;m going to keep doing this every night before I go to sleep just to have a routine. My biggest piece of advice would be to focus on your breathing while you are stretching. Keep up the good work, guys! :)",
    "&quot;really allow yourself to sit into this pose&quot;<br><br>my brain: i allow you<br>my body: no",
    "This is definitely for beginners. I’m not a flexible person either but doing this everyday has made me very flexible. (This is after COMMITTING for several months. Not just a day then complaining about it) when I first started I couldn’t stretch anywhere near as much as she did but I stretched as much as I could without overdoing it/hurting myself. Being sore after it’s normal(not hurting but sore, like working out after not doing it for a good while) consistency is 100% key. Every week or even day if you can, push yourself to stretch deeper than the week/day before. Again, never overdo it, as you can end up actually hurting yourself. 💛 (also drinking plenty of water and keeping up with a healthy diet and lifestyle/Mindset is a huge help)"
  ],
  "channelSubscriberCount": 10400000,
  "channelVideoCount": 1205
}