{
  "video_id": "Qymarl8FyEk",
  "title": "30-Minute HOME WORKOUT | No Equipment Full Body Exercise | GunjanShouts",
  "description": "Burn 375 calories in just 30 minutes by doing this - No equipment Home Workout.\n\nHere is full body home workout video for beginners and intermediate.\nIts a no equipment workout and can be easily done anywhere. It will help you in strengthening, toning and weight loss. \n\nWorkout includes:\nArms exercises, \nlegs exercises, \nchest exercises, \nbelly exercises, \nlove handle exercises,\ncore exercises,\nbutt exercises\npre and post workout stretching\n\nI hope you will enjoy doing this as much as I enjoyed shooting this video for you. 🤗\n\n𝐄𝐧𝐫𝐨𝐥𝐥 𝐢𝐧 𝐦𝐲 𝐓𝐫𝐚𝐧𝐬𝐟𝐨𝐫𝐦𝐚𝐭𝐢𝐨𝐧 𝐩𝐫𝐨𝐠𝐫𝐚𝐦: https://bit.ly/35GPgPr\n𝐋𝐞𝐭'𝐬 𝐜𝐨𝐧𝐧𝐞𝐜𝐭 𝐨𝐧 𝐈𝐧𝐬𝐭𝐚𝐠𝐫𝐚𝐦: https://www.instagram.com/gunjanshouts/\n\n\n\n\n\n\n================================================================\n\nDISCLAIMER:\nAll information provided on this channel is furnished strictly for educational and entertainment purposes only. Through my videos I share my personal experience and learnings through my weight loss journey. \nI have also completed INFS Nutrition and Fitness course to expand my knowledge on the topic. However, no information shared in the videos is to be taken as medical or other health advice pertaining to any individual's specific health or medical condition. Please consult your healthcare professional before participating in or acting on any recommendation found in content provided on this channel.\nDiet plans shared under my transformation program are designed by my team of expert, qualified nutritionists. \nAll the products and brands I recommend in my videos are first used/ experienced by me, whether it works for you in the same way or not will solely be your responsibility.",
  "channelTitle": "GunjanShouts",
  "channelDescription": "I'm Gunjan, founder of I’MWOW Health & Fitness Company. I underwent my own transformation from being out of shape to achieving the level of fitness I never thought possible. This personal journey ignited a passion within me to share my experience and knowledge I gained along the way. \nJoin me every Sunday 11am for a dose of motivation and insights. I'm committed to bringing you high-quality, informative and accurate information, which is why all nutrition details shared in my videos are thoroughly vetted by our qualified dieticians. My team and I pour our hearts into each video.\nConnect with me on Instagram @GunjanShouts for short videos. While I'm open to collaborations with brands, my community always comes first. I only work with brands I trust, ensuring that it adds value to your experience. If you have an offer aligning with our mission, reach out at gunjanshouts@gmail.com. \n\nThank you for being part of this incredible journey. Together, let's embrace a healthier, happier life ❤️\n",
  "tags": [
    "full body workout",
    "home workout",
    "home exercises",
    "at home workout",
    "full body exercises",
    "exercises to burn fat",
    "exercises for weight loss",
    "home workout for women",
    "home workout without equipment",
    "home workout for weight loss",
    "gunjanshouts",
    "workout at home",
    "workout for beginners",
    "workout for weight loss"
  ],
  "publishedAt": "2021-06-20T05:30:01Z",
  "duration": 1918,
  "durationFormatted": "31:58",
  "viewCount": 654558,
  "likeCount": 19778,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Qymarl8FyEk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Qymarl8FyEk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Qymarl8FyEk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Qymarl8FyEk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Qymarl8FyEk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Qymarl8FyEk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Guys<br>If you do this workout then take a selfie, post it on Instagram and tag me @gunjanshouts <br>I will repost your stories 😊",
    "I LOVED YOUR ENENRGY, THE WAY YOU KEPT SAYING MOTIVATING THING IS AMAZING.",
    "I did it for the first time...could do only for 15 minutes, but I was sweating ...loved it...will do everyday and try to complete 30 minutes&#39; workout.❣️❣️",
    "Itss been 3 days i am doing your workout it iss amazing ,we really want these 30 minutes strengthening workouts ,keep helping us through your commendable job",
    "I have started taking exercise seriously from last 10 days. I try to do my best everyday but I must say this was the hardest till now<br>Would love to see more workout videos"
  ],
  "channelSubscriberCount": 2740000,
  "channelVideoCount": 1104
}