{
  "video_id": "r1Nw0vNWh1Q",
  "title": "Quick & INTENSE 10-minute Cycling Workout | THE JOURNEY ENCORE!",
  "description": "If you only have ten minutes for a workout, this is the one for you!!! This 10 minutes is going to take you on a journey! This ride will take you through the entire spectrum of resistance and speed so you can increase your muscular strength and endurance, plus improve your cardiovascular endurance! This is also the perfect workout finisher after any cycling or strength workout!\n\nThis song, The Journey, was created just for this ride!! One of our very own amazing butt-kickers, Peter Spero, along with his band Black Diamond Sessions wrote this just for us! \n\nMake sure to check out Peter: https://open.spotify.com/artist/2ohEtPcrG5VbGdZCeDWBk8?si=xZWNnSWwTBWaOX6vUycqwA\nand Black Diamond Sessions: https://open.spotify.com/artist/7heAiD37FywViSeH77Gvd0?si=ruEB7uaKRvKISxZfXll8rg\n\nIMPORTANT! The RPMs noted throughout the ride are just a range! Make sure to ride where you feel comfortable! That may be above or below the range indicated. \n\n🇮🇸 We're hosting a trip to ICELAND in JUNE 2024! Reserve your spot here! 👉 https://www.trovatrip.com/trip/europe/iceland/iceland-with-kaleigh-cohen-jun-2024\nCheck out what's included and the itinerary above! 👆\nSpots are limited | ONLY 15 SPOTS AVAILABLE! The first 10 people to sign up get an early bird rate and SAVE $100! Payment plan options are available! \n\nNeed a longer WARM-UP?  https://youtu.be/tOjKOmtPcqs\n\nMY LINKS:\nLooking for indoor cycling shoes?- https://ride.shimano.com/KCF15\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\nADD IT:\nDESSERT!- https://youtu.be/eumN5TrtnzI\n\nRESISTANCE for my classes\nYou always want to feel something under your feet, this will ensure you are doing the work, prevent you from bouncing in the saddle, and protect your knees!\n6 - Working your way up that hill | Moderately Light \n7 - Mid-hill already, you can definitely feel this! | Medium\n8 -  This is where heavy really starts to kick in | Moderately Heavy\n9 - We are really starting to climb now! This is a challenging resistance! | Heavy\n10 - Top of your hill! You should be able to keep a smooth pedal stroke. | VERY Heavy\nWatch this for more detail: https://youtu.be/8DbpBXGAB8Q\n\nMODIFICATIONS for seated options\n2nd position jogs and moves: Stay seated and increase speed a bit, really focus on the pull-up to activate the quadriceps.\n3rd position climbs and moves: Stay in the saddle and increase resistance a smidge, really focus on the push-down and pull-up of the pedal stroke to activate the glutes, hamstrings, and quadriceps maximizing power with the heavy resistance.\n\nSome of the links listed above are affiliate links, such as Amazon, and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for the harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [],
  "publishedAt": "2023-11-01T08:59:52Z",
  "duration": 585,
  "durationFormatted": "9:45",
  "viewCount": 76216,
  "likeCount": 2018,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/r1Nw0vNWh1Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/r1Nw0vNWh1Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/r1Nw0vNWh1Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/r1Nw0vNWh1Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/r1Nw0vNWh1Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/r1Nw0vNWh1Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To all my spin peeps, if you’re interested, here are some of the concepts that went through my brain as I composed the music for The Journey.  As I experienced The Journey tracks that we did in class, I started to think about what is was about the different types of music made it the best experience.  I felt that if the music could sort of hypnotize me, to keep me involved, without being too distracting, of course leaving room for the instructor monolog, and help the time move along, this was a big plus.  I wanted to create a track that would draw you in, and actually take you on a journey through what is of course, pretty intense exercise. My personal musical influences for this track were probably mostly some of my old favorites for this type of music, Tangerine Dream and Pink Floyd, although the 60 sprints were influenced by more contemporary sounds.  Most of the actual composing for this took place while I was solo camping in Shawnee National Forest in Southern IL. near Carbondale.  I was inspired by a variety of sensory input.  Watching the wind travel through the trees, smelling the forest around me, feeling the warm sun wash over me, and watching the birds and other wildlife go about their own journeys.  At night, it was stars and planets that helped me to visualize and create music that helped me along my own creative journey, and as I wrote this, I thought about our whole spin community, and how much fun it would be to help everyone in the group though a tough 10 min. See you all at the Sat. live rides, can&#39;t wait!",
    "Needed the JOURNEY today to remind me how far I’ve come and that we are never alone! We’ve got this BUTTKICKERS!! Thanks Kaleigh!! 🙏🏻🔥💜<a href=\"UChY_9WJx0saa0St48lSdytQ/ZJ_iYfnrBdOSgAfjlonQAQ\"></a><a href=\"UChY_9WJx0saa0St48lSdytQ/y1m3Z6bMEoy__9EP5IeViAU\"></a><a href=\"UChY_9WJx0saa0St48lSdytQ/y1m3Z87FEoy__9EP5IeViAU\"></a>",
    "I have NEVER pushed harder. Peter’s music was so motivating and perfectly timed. I AM INCREDIBLE!! AND SO IS BLACK DIAMOND SESSIONS.!!",
    "Doing this (again) January 1 2024 and found myself crying when the drumbeat kicked in at the six-minute mark during the sprint. Last year was such a tough year, doing The Journey with Kaleigh took on a whole new meaning. Despite the tears, I felt strong today, stronger than I was this time last year. Life can be a wild ride and I&#39;m grateful to be here for it. Heartfelt thank to the whole KC gang for all the encouragement along the way ❤",
    "I love to close my eyes during the build in the beginning. I can take a moment to connect with myself and the bike. The journey is more than just a ride. You have to strap in, embrace it, and enjoy the ride. Whatever comes your way, you know you&#39;ll be better on the other side."
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}