{
  "video_id": "R5MXpyO8rXc",
  "title": "20 minute Full Body NO REPEAT Workout | Tone and Define with Dumbbells",
  "description": "The MOST EFFECTIVE 20 minutes of your day!!! This full-body workout is packed with goodness!!! We are going to work the upper body, lower body, abs, and obliques in this quick, muscular definition building workout!! This workout is full standing and requires only moderately heavy dumbbells. Specific weight will be relative to you and each individual exercise. I will offer modifications on screen for the two variations of lunges in this workout if lunges bother your knees. We are also training peripheral heart action in this training session, which means we will alternate between upper and lower body, this is a great way to add intensity and burn into a workout! With these exercises and the structure, you will feel so ACCOMPLISHED and STRONG by the end of our training!\n\n20-MINUTE FULL BODY, FULL STANDING, NO REPEAT DUMBBELL WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 20lbs / 4.5 to 9kg When selecting a weight for this workout, you want to lift moderately heavy! \n\nSTRUCTURE\n18 TOTAL EXERCISES\nFULL STANDING WORKOUT\nNO REPEAT STRUCTURE\nUPPER/LOWER\nWORK: 60 SECONDS REST: 20 SECONDS\nABS/OBLIQUES FINISHER\nWORK: 30 SECONDS REST: 10 SECONDS\n\nEXERCISE LIST\nFULL BODY, FULL STANDING ROUND\n-ARNOLD PRESS\n- ROMANIAN DEADLIFT\n- PUMP CURLS\n- WALL SIT WITH ALTERNATING LEG EXTENSIONS\n- WIDE ROW\n- SUMO SQUAT\n- STANDING CHEST FLYS\n- ALTERNATING REVERSE LUNGES\n- TRICEP KICKBACKS\n- SQUAT TAPS\n- CLOSE GRIP ROW\n- ALTERNATING CURTSY LUNGE\nABS AND OBLIQUES FINISHER\n- PALLOF PRESS\n- EXTEND AND PULL\n- SWITCH SIDES\n- STANDING BICYCLE\n- SINGLE ARM ISO-HOLD PRESS WITH OPPOSITE LEG MARCH\n- SWITCH SIDES\n\n\n\nI am so glad you joined me for this workout! It's always better to workout with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2024-02-07T09:59:58Z",
  "duration": 1456,
  "durationFormatted": "24:16",
  "viewCount": 221546,
  "likeCount": 5535,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/R5MXpyO8rXc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/R5MXpyO8rXc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/R5MXpyO8rXc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/R5MXpyO8rXc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/R5MXpyO8rXc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/R5MXpyO8rXc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’ve been faithfully doing this routine four times a week for close to a month and it is producing awesome effects!! I can see some subtle and really  nice changes in my body!! Just in time for my 50th birthday! Thanks!!",
    "20 minutes, all standing, no repeats, with modifications! Just what I needed today!",
    "I am obsessed with your videos! You are so much fun and so relatable. I am 46 and for the first time ever, can see my biceps. These babies are growing! Thank youuuu!",
    "Love No Repeats! I did this one today and loved it!",
    "That flew by - I liked alternating from upper to lower work.  Thanks."
  ],
  "channelSubscriberCount": 323000,
  "channelVideoCount": 649
}