{
  "video_id": "r7gKGvjfyHg",
  "title": "10 MIN AB COMPLEX | Total Abs Workout - NO EQUIPMENT",
  "description": "This 10 min abs workout is a perfect finisher to any workout or great for active rest days along side cardio!\n\nPlease remember... ab specific workouts will not reduce fat from the tummy area. Ab and core workouts strengthen the entire core and allow for improved definition depending on body fat levels and where fat is stored.\n\nI know you have all heard abs are made in the kitchen...rather they are revealed relating to your body fat percentage and this can be different for everyone. In regards ‘the kitchen’ this relates to your calorie intake versus calories burned. To lose body fat, you must be burn more than you intake; this can be done through your nutritional intake and/or increasing cardio! \n\nIt is better to reduce calories very slightly so you have energy to continue to train... and cardio will increase your energy expenditure so I would definitely recommend considering how to implement for cardio into your day/week. It could be a walk daily, a run twice per week, cardio workout at home that is steady state (as apposed to stopping and starting), rather keeping that heart rate steady increased pace if you are aiming to reduce body fat. Paired with strength training to burn calories (heart rate is elevated during points and muscle increases your metabolism!) and HIIT (much higher spikes in heart rate). \n\nKeep up the super training everyone!! \n\nAll you will need for this ab workout is your mat!\n\nX20\nTABLE TOP CRUNCH\nCRUNCH PULSES\n\nX10\nHIP RAISE\nGAZE DOWN LEG LOWER\n\nX10\nON ELBOWS TUCK TO EXTENSION\nHANDS AT HEAD SIT UP\n\nX10\nSIDE PLANK OBLIQUE LIFTS\nSIDE PLANK OBLIQUE LIFTS\n\nI hope you enjoy this routine... perfect to incorporate anytime on its own or post main workout!\n\nEmbrace the burn!! \n\nCx\n\n▶ My Instagram: https://instagram.com/carolinegirvan\n▶ Subscribe to my Fitness Channel for FREE: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nExtras:\n\n▶ My 30 Min LISS Cardio Workout: https://youtu.be/ImI63BUUPwU\n▶ My 15 Min Rock Hard Abs Workout: https://youtu.be/cS-bIr-6hQM\n\nEquipment I use in my other workouts:\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\nEPIC Program:\n\n▶ Caroline Girvan FREE 10 Week Program Guide: https://carolinegirvan.com\n▶ Official EPIC Program Apparel: https://teespring.com/stores/carolinegirvan\n▶ The EPIC Program Playlist: https://www.youtube.com/playlist?list=PLhu1QCKrfgPW3VAMHM-wefcO4ZyXf6cwt\n▶ The EPIC Beginner Series: https://www.youtube.com/playlist?list=PLhu1QCKrfgPUZ7_HDxP8P_-0ffNoobSDH\n\nBusiness Enquiries:\n\n▶ Email: info@carolinegirvan.com\n\nCaroline Girvan \nPO BOX 115\n\nCounty Antrim \nNorthern Ireland \nBT38 8WB\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "caroline girvan",
    "abs workout",
    "abs",
    "workout",
    "ab complex",
    "core workout",
    "six pack abs",
    "six pack workout",
    "no equipment workout",
    "10 minute abs",
    "10 mins workout",
    "home workout",
    "reduce fat",
    "ab workout",
    "abs exercise",
    "lower abs",
    "upper abs",
    "total abs",
    "lose body fat",
    "flat belly workout",
    "6 pack abs",
    "lower abs workout",
    "caroline girvan abs",
    "fitness channel",
    "fbb",
    "no equipment",
    "10 min abs"
  ],
  "publishedAt": "2020-12-01T18:49:32Z",
  "duration": 839,
  "durationFormatted": "13:59",
  "viewCount": 2622206,
  "likeCount": 46141,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/r7gKGvjfyHg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/r7gKGvjfyHg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/r7gKGvjfyHg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/r7gKGvjfyHg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/r7gKGvjfyHg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/r7gKGvjfyHg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "It’s only been 4 days and abs are already starting to show, I definitely would recommend Caroline’s workout. Super effective!",
    "This is one of my personal favorites, though it’s been 3 years it’s absolute amazing and this is mine I’ll keep you all updated..<br>Day 1:✅ bit hard but gave it my all I really felt good(I’m am a 14 year old girl so plz don’t be to harsh)  couldn’t wait<br>Day 2:✅ easier only got 25 mins(I do 30 mins every day), also going to keep going<br>Day 3:❌ I had soccer practice, going to do it twice tomorrow<br>Day 4:✅ I did do it twice starting to see results!!<br>Day 5:✅ my mom complemented me said i was getting stronger,it was the weekend so got a hour!<br>Day 6:❌ had to go to a funeral(my grandma died), little unmotivated to continue but I pushed through<br>Day 7: ✅did it twice again, felt good, definitely recommend<br>I really hope this helps or motivates you to push through no matter what’s happening you got this😁😁😁!!",
    "The thing is... this is meant as an after workout &quot;finisher&quot; while I use it as a full workout session..",
    "I feel like Caroline is turning into some type of  guardian Angel 😅. Every time I need her workouts she is there 👌👌❤️❤️. I was looking at previous abs workouts we did during the epic program, and now here she is with a brand new one🤗🤗",
    "(Monday, 18th Jan 2021) I decided I am going to do this work out first thing in the morning for at least one week! I still have troubles with some of the exercises (especially from the 2nd set) and I want to get strong enough to do them properly!🔥 +it’s a great 10 min work out that will surely help me wake up :D So I am writing this here for accountability<br>Day1:✅<br>Day2:✅<br>Day3:✅<br>Day4:✅<br>Day5:✅ Today I woke up and I was pleasently surprised to see my abs quite more defined in the morning :o Not only that, but I wasn’t able to do a single hip lift on the 1st day. I was able to do 5 today!! (not all of 5 being super perfect but it’s still progress) After working out I had some healhty pancakes for breakfast! It was a beautiful morning,  thanks Caroline🥰<br>Day6:✅<br>Day7:✅<br><br>Done!! :D It was great! I want to keep doing 10 mins work outs in the morning, they make me feel great ^^"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}