{
  "video_id": "r7xJZoox4IE",
  "title": "Lazy Girl Full Body Fat Burn Workout | 10 Mins | No Jumping, Low Impact, At Home",
  "description": "CALLING ALL LAZY/LOW ENERGY HUNNIES! \n\nSometimes we barely have any energy to workout and that is totally okay! We need to listen to our bodies and either have a rest day, or do a workout that is more suited to our energy level. \n\nThis can sometimes prompt you to do even more, and will help you get your energy up even more...who knows you may feel motivated to do another workout after you complete this one.\n\nI just want to let you know that Im proud of you for even looking for a workout right now with your level of energy! I'm so proud of you and know that you are going to feel stronger and more confident tomorrow because you put the intentional effort in today!\n\nTodays Workout:\n1. Feet Slide  & Scissor Arms\n2. Glute Bridge Forward March\n3. Side Lying Knee Tap Extensions\n4. Hamstring Curl & Press\n5. Swimmers\n6. Hip Tappers\n7. Slow Leg Lifts\n8. Windsheild Wipers\n9. Scissor Kicks\n10. Lying Star Legs\n\nTo get the BEST (AND QUICKER) RESULTS, follow a nutrition plan that supports your goals. Get a customized nutrition plan in my app. \n\nHit this link to try your customized plan FREE for 7 days: https://get.growwithjo.app/UVuo/myapp\n\nRecord a video or take a picture of you doing the workout, tag me @growwithjo #growwithjo @growwithjo_united\n\n_______________________________________________________________\n\nSHOP\n\nGrow With Jo APP →https://get.growwithjo.app/UVuo/myapp\nWorkbooks & Video Programs → https://www.godaily.ca/\n\n_________________________________________________________________\n\nKEEP UP WITH ME\n\nINSTAGRAM → https://www.instagram.com/growwithjo/?hl=en\nFACEBOOK → https://www.facebook.com/growwithjoofficial/\nPINTEREST → https://www.pinterest.ca/growwithjo/\nCONTACT EMAIL → support@growwithjo.ca\n\n_________________________________________________________________\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.\n\ngrowwithjo beginner workouts abs workout walking all standing low impact fun fitness videos",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "johanna sophia",
    "growwithjo reviews",
    "Vicky Justiz",
    "Emi Wong",
    "home workout",
    "exercises",
    "summer",
    "body",
    "spring",
    "break",
    "tiny waist",
    "small waist",
    "low impact",
    "easy workout",
    "motivation",
    "fitness",
    "how to",
    "no jumping",
    "no jumping workout",
    "lazy girl workout",
    "kim kardashian",
    "toned legs",
    "lose weight",
    "inner thigh fat",
    "10 minutes",
    "10 minute workout",
    "fat burn",
    "apartment friendly workout",
    "full body workout",
    "apartment friendly cardio",
    "easy cardio",
    "Pamela reif",
    "Chloe ting easy workout"
  ],
  "publishedAt": "2021-04-05T15:00:14Z",
  "duration": 704,
  "durationFormatted": "11:44",
  "viewCount": 709996,
  "likeCount": 27302,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/r7xJZoox4IE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/r7xJZoox4IE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/r7xJZoox4IE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/r7xJZoox4IE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/r7xJZoox4IE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/r7xJZoox4IE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m not even gonna lie, I cried when I finished cuz I truly did not want to workout today but I did it. And I finished it. And I&#39;m so proud of myself. Thank you jo, you&#39;re genuinely my favorite fitness youtuber",
    "Depression is a hell of a disease, but people like you make us feel capable of taking care of ourselves. After the 10 min i was motivated enough and even did another one of your workouts. Thank you Jo, you truly save lifes &lt;3",
    "I like these short workouts it helps me be active even on my laziest day! You should do one every Saturday and Sunday.",
    "Hi guys, started my weight loss journey yesterday and going to use this channel as I&#39;ve been told it&#39;s amazing! I&#39;m currently a size 24, hoping to get to a size 12 again. Wish me luck. Sending everyone positive thoughts and vibes. We&#39;ve got this  💪❤",
    "There was nothing lazy about this workout! I’m glad I did it!"
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}