{
  "video_id": "RArMVYuWqw8",
  "title": "Physio Guided Lower Back Stretches for Beginners (15 Minute Routine)",
  "description": "These gentle lower back stretches reduce back stiffness and improve spinal flexibility. This Physiotherapist guided stretching routine includes stretches for the muscles and joints of the lower back along with hamstring, buttock and hip flexor muscles to also help prevent lower back pain. These safe stretching exercises are suitable for beginners- intermediate general flexibility training rather that treatment for a specific lower back condition.\n\n#lowerbackstretches #exercisesforbeginners #WithMe \n\nWebsite: https://www.pelvicexercises.com.au\n\nThese lower back exercises include static stretches and mobility exercises for improving lower back flexibility. These stretches are performed lying down on a firm surface. This beginners stretching routine commences with lumbar rotations and pelvic tilts for mobility warm up. \n\nThe exercise routine then progresses through the following stretches for the lower back and surrounding muscles:\n* knee to chest hugs\n* hamstring stretches\n* bridging exercises\n* piriformis (buttock) stretches\n* single leg lower back rotation\n* lumbar extension exercises\n* hip flexor stretch\n* child's pose\n* deep breathing exercises and relaxation\n\nStretching exercises are recommended for healthy individuals 2-3 days/week (minimum). Static stretches should each be maintained for 10-30 seconds (1). \n\nReference\n1. ACSM (1998) American College of Sports Medicine Position Stand. The recommended quantity and quality of exercise for developing and maintaining cardio respiratory and muscular fitness, and flexibility in healthy adults. Med Sci Sports Exerc 1998; 30: 975–991\n\nMusic: Aiden Kenway https://www.youtube.com/channel/UCEeJxhzyKSTllNNBMlRaHHQ\n\nDisclaimer \nThe information provided in this video is intended as general information and not a substitute for individual medical advice regarding your medical condition. To the extent permitted by law, neither Healthy Fit Solutions Pty Ltd, as trustee for the P & M Kenway Family Trust (“we”), nor any of our officers, employees, agents or related bodies corporate will be liable in any way (including for negligence) for any loss, damage, costs or expenses suffered by you or claims made against you through your use of, or in connection with, this video or information supplied or offered to be supplied on this video. Although we use our best efforts to provide accurate information and other materials on this video, the video is provided “as-is”. To the extent permitted by law, all warranties, conditions and representations provided about",
  "channelTitle": "Michelle Kenway",
  "channelDescription": "Welcome to Michelle Kenway's Physiotherapy and Safe Exercise Channel! As a highly experienced physiotherapist, I specialize in pelvic floor health and helping you achieve your health and wellness goals. By subscribing and clicking the notifications bell, you'll receive a new video every week filled with valuable exercises and information to improve your wellbeing.\n\nMy channel is perfect for beginners, individuals recovering from injuries or illnesses, and those challenged by chronic health problems such as neck and back pain, and poor core control. You'll also find a wealth of Pelvic Floor Physiotherapy exercises and information videos to help with pelvic floor strengthening, prolapse management, pelvic pain, bowel problems, and constipation.\n\nVisit https://www.pelvicexercises.com.au for even more resources, including pelvic exercise videos, safe exercise books, and videos to download. Join me on your health, fitness, and recovery journey!\n",
  "tags": [
    "lower back exercises",
    "lower back stretches",
    "lower back flexibility",
    "low back stiffness",
    "deep breathing exercises",
    "relaxation exercises",
    "home workout",
    "home exercise",
    "stretching routine",
    "Physiotherapy",
    "Physical Therapy",
    "exercises for beginners",
    "stretching exercises for beginners",
    "lower back pain"
  ],
  "publishedAt": "2020-04-16T20:00:05Z",
  "duration": 886,
  "durationFormatted": "14:46",
  "viewCount": 322189,
  "likeCount": 4978,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/RArMVYuWqw8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/RArMVYuWqw8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/RArMVYuWqw8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/RArMVYuWqw8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/RArMVYuWqw8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/RArMVYuWqw8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m working hard to counteract decades of sitting now that I&#39;ve retired by working out every day and your video really helps when I overdo it.  Thanks!",
    "I carry around a toddler all days and I’ve been doing this daily for over a week and already feel so much better. Thanks so much",
    "Just did these back stretches this morning for the first time and really felt the benefit of them. Thank-you Michelle for taking the time to do these videos. 🙏🏼",
    "I am 220+ pounds 5 Foot 3 inches and I was looking for some stretches to do just to get started on my journey and this was so helpful. My lower back hurts so bad I know his leg stretches really helped. Thank you for keeping it simple and giving me a place to start I plan on doing this every day until it is easier and it’s crazy that this would be hard. Lol but it is pray for me.",
    "Thank you so much for these videos. I am finding your presentation so beneficial, not only for the exercises themselves but for your calming voice. I always feel much more relaxed and calm once I have finished your video."
  ],
  "channelSubscriberCount": 911000,
  "channelVideoCount": 306
}