{
  "video_id": "RcLz_atcq8w",
  "title": "BURN 500 CALORIES with this 20 Minute Cardio HIIT Workout (No Equipment, No Repeats)",
  "description": "Do this 20 Min Cardio HIIT workout and burn 500 calories. Follow along from home without the need for any equipment. This is a full body workout to burn lots of calories and is great if you are trying to lose weight. \n\n👉 Free Community & Guides: https://nobadaddiction.com/free\n💪 Online Coaching & Workout Programs: https://nobadaddiction.com/premium \n\nTHE WORKOUT\n👉🏼 Duration: 20 Min  \n👉🏼 Muscles: Full Body\n👉🏼 Intensity: High Intensity \n👉🏼  Focus: Fat Burn & Cardio  \n👉🏼 30s Work, 15s Rest\n👉🏼 No Equipment & No Repeat\n\nFor more workouts with Oliver subscribe to his Channel | https://www.youtube.com/c/OliverSjostrom \n\nIG: https://www.instagram.com/nobadaddiction/ \nOliver's IG: https://www.instagram.com/olisjostrom/\nJulias’s IG: https://www.instagram.com/julia__kareush/ \nBusiness Inquiries: hello@nobadaddiction.com\nMusic: https://www.epidemicsound.com/referral/vvekd0",
  "channelTitle": "Nobadaddiction",
  "channelDescription": "The ultimate destination for effective, no-talking workouts you can do anywhere—at home or in the gym. Get stronger, burn fat, and stay consistent with simple, efficient routines!\n",
  "tags": [
    "HIIT",
    "High intensity",
    "interval training",
    "training",
    "workout",
    "at home",
    "full body",
    "follow along",
    "no equipment",
    "women",
    "fat burn",
    "fitness",
    "no bad addiction",
    "nobadaddiction",
    "cardio",
    "fat loss",
    "lose weight",
    "burn fat",
    "intense",
    "no repeat",
    "lots of calories",
    "calories",
    "calorie",
    "burn fat fast",
    "home workout",
    "workout at home",
    "fat burning workout",
    "fat burning",
    "cardio hiit",
    "500 calorie workout",
    "hiit workout for fat loss",
    "burn 500 calories workout",
    "partner workout"
  ],
  "publishedAt": "2022-10-17T11:00:16Z",
  "duration": 1343,
  "durationFormatted": "22:23",
  "viewCount": 3278630,
  "likeCount": 43999,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/RcLz_atcq8w/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/RcLz_atcq8w/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/RcLz_atcq8w/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/RcLz_atcq8w/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/RcLz_atcq8w/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/RcLz_atcq8w\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "If you like this workouts, you&#39;ll like our fitness community even more! Inside you will find structured workout programs, healthy recipes, and a motivating crew that will help you stay on track with your fitness goals. Click the link in the description and join us! 👊",
    "This workout is HIIT. Basically you are not going to burn the 500 calories WHILE doing the workout but you continue to burn calories even after the workout. Since this workout boosts your metabolism you can factor in the after burn effect and you burn 500 calories in TOTAL. (During workout + after workout) They aren’t lying, they just don’t explain how it works in the title. I have been doing their HIIT workouts for a month and I have lost 8 pounds.",
    "If Anyone Needs Motivation, I’m Here! Take 20 minutes out of your day and feel good for 24 hours! You can do it. Always remember that if you’re trying to loose weight, do it healthily and slow. You are all beautiful and handsome and I am so proud of you. Keep on pushing yourself to the limits and it will pay off❤",
    "For anyone confused about why their watch only calculated about 200-300 calories burned instead of 500, this is why: Just as a little knowledge, I&#39;m not 100% sure if it adds up to 500 calories in total, BUT what is actually happening after any exercise is what we call Excess postexercise oxygen consumption, or EPOC. In normal words = the body is balancing itself and in turn continues to burn more oxygen and calories after exercise (ofc the more energy you deplete, the more this effect could carry). So while during the exercise you may have only burned 200-300 kcal, the EPOC would in total actually make that amount more over time (anywhere from 30mins to several hours). So if you are worried you didn&#39;t burn enough calories to meet your goal or requirement, you actually might have. Keep up the good work ya&#39;ll!!",
    "Was only able to get upto <a href=\"https://www.youtube.com/watch?v=RcLz_atcq8w&amp;t=750\">12:30</a> before my body gave out. I think its because i only did 10 minutes Hiit workout until now so im going to slowly increase my body limit everyday Inn Sha Allah<br>Edit: 3 weeks later and I&#39;m now able to complete this workout with only two water breaks in between ❤ Alhamdulillah consistency pays out."
  ],
  "channelSubscriberCount": 1410000,
  "channelVideoCount": 572
}