{
  "video_id": "rEqRmKAQ5xM",
  "title": "Stationary Bike Workout for Beginners | 20 Minute",
  "description": "This ride is all about the saddle! If you're a beginner or just got a stationary bike or exercise bike, this 20 minute beginner stationary bike workout is for YOU! \n\n🟣 New to my indoor cycling workouts? START HERE! 👉  https://www.youtube.com/playlist?list=PLBJ0TIYiwZzjLnd3RU_J2y-dm9a34Ggw3\n\n\nI'm so glad you decided to join my stationary bike workout today, let's go for a ride! Grab your water bottle, grab your towel, get on your bike and let's get these pedals spinning! - Kaleigh Cohen Fitness\n\n0:00 - 1:12 Welcome!\n1:13 - 4:14 Warm Up | Come Together by Spirit City\n4:15 - 7:06 Rolling Hills | Summer Night by Daxten\n7:07 - 10:34 Endurance | American Gothic by IRONTOM\n10:35 - 13:16 Climbs | Bring the Heat by Bagsy\n13:17 - 16:44 Sprints | Out on the Roof by Lvly\n16:45 - 20:07 Cool Down | Red by Beagan James\n\n⭐️ Want to maximize your workouts? Find awesome gear here? 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n🟣 Check out our website here! 👉 https://www.kaleighcohen.com\n\n🟣 Become a Kaleigh Cohen Fitness channel member for exclusive access and member perks! 👉 https://www.youtube.com/channel/UChY_9WJx0saa0St48lSdytQ/join\n\n🟣 New to my indoor cycling workouts? START HERE! 👉  https://www.youtube.com/playlist?list=PLBJ0TIYiwZzjLnd3RU_J2y-dm9a34Ggw3\n\n🟣 For those of you that asked how you can help support these indoor cycling workouts 👉 https://www.buymeacoffee.com/kaleighcohen\n\n🟣 Finish your cycling workout with this lower body workout! 👉 https://youtu.be/p4Qy4HyXCC8\n\n🚴‍♀‍ If you are doing this on a stationary bike or exercise bike instead of a spin bike and cannot go into the standing positions (2nd and 3rd) and would like an added challenge during these, TRY THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance here but try and keep the same cadence. \n\n🎶 This playlist can be found at my Spotify 👉  https://open.spotify.com/playlist/58l1CzsorFON2RaYjVicD9?si=FoUAXBQ1S-uHU2VWydOSNQ\n\n💁🏼‍♀‍ Get to know me here 👉 https://youtu.be/la6BwPsvo9k\n\n🟣 Let’s connect!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n🟣 Subscribe for more indoor cycling workouts 👉  https://www.youtube.com/kaleighcohenfitness\n\n🟣 Share this cycling workout with a friend:\nhttps://youtu.be/IjJOOCr2ro0\n\n🟣 Next cycling workout! 👉  https://youtu.be/YKCy0HlH55M\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spinning class when I was 15. Since then I've been addicted to spin classes and indoor cycling workouts. Now, as a certified Spin class Instructor and certified fitness trainer, my goal is to provide you with fun, motivating, and energizing cycling and strength workouts that motivate you to be YOUR BEST YOU! This is cycling motivation! Thanks for cycling with me!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n#20Minute #Beginner #StationaryBike",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "stationary bike",
    "stationary bike workout",
    "for beginners",
    "spin class beginner",
    "kaleigh cohen spin",
    "spinning class beginner",
    "indoor cycling for beginners",
    "beginner spin class",
    "exercise bike",
    "exercise bike workout",
    "kaleigh cohen",
    "20 minute",
    "indoor cycling",
    "indoor cycling workouts",
    "beginner spin workout",
    "covid workout",
    "cycling",
    "spin",
    "spinning",
    "fitness",
    "beginner"
  ],
  "publishedAt": "2021-01-20T10:00:30Z",
  "duration": 1207,
  "durationFormatted": "20:07",
  "viewCount": 1837100,
  "likeCount": 27981,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/rEqRmKAQ5xM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/rEqRmKAQ5xM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/rEqRmKAQ5xM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/rEqRmKAQ5xM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/rEqRmKAQ5xM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/rEqRmKAQ5xM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "What type of indoor bike are you on? A stationary bike, recumbent bike, upright bike, or spin bike? Let me know in the comments!",
    "Shout out to that dog for unapologetically doing what we all want to do 🤣...great video! Thanks",
    "Being an introvert, I don&#39;t like being in crowded places so I prefer to do exercises at home. My brother and I bought a stationary bike last year, I just started using it last month with your beginner videos as my guide. This one is my favorite because it&#39;s all about the saddle. Thank you, Kaleigh, for sharing your knowledge. Your videos has helped me find the best workout for myself. I wake up at 5:30am every workweek to do this workout and have just decided to have &quot;dessert&quot; starting tomorrow. I have depression so I have to workout to help with my mental health. Thank you once again. Sending much love and support from the Philippines. &lt;3",
    "Stationary bike. You are helping save my Dad and I want to sincerely thank you for posting this. I used to always be in great shape from high school up until I was about 35. The past 5 years I fell out of working out and eating right. My Dad was diagnosed with hemochromatosis this past year and needs a liver transplant. I changed my diet completely, have been hitting the gym hard and running on a treadmill to be sure I’m eligible to donate part of my liver for him. Running is hard because of knee injuries in football. Cycling seems to be easier on my knees and your videos was perfect to start this journey. Anyone reading this comment, I’m asking for prayers that I get in the shape I need to donate and my Dad is able to get the transplant he needs. No need to reply, just pray 🙏🏻",
    "A beginner’s workout that’s actually for beginners and doesn’t involve standing up every 2 minutes - perfect! Just what I needed. Thanks for putting this up."
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}