{
  "video_id": "RI5gOBeTqyE",
  "title": "Yoga for Bedtime for More Restful Sleep",
  "description": "A gentle Breathe and Flow yoga routine for better sleep - yoga for sleep. After a long day of sitting at your desk or driving it feels nice to loosen up a bit and stretch before you go lay in bed. Yoga and stretching can also help to calm you down and improve your sleep. This yoga class is for you to follow along. No props or anything required, just 15 minutes out of your day. This is a great yoga class for beginners, when you don't have much time, after a workout, to calm down or as the main intention was before bed for better sleep.\n\n🧘Truly deepen your practice with our Breathe and Flow wolfpack platform (free 7 day trial!): https://practice.breatheandflow.yoga\n🌈 Daily yoga 30 day calendars: https://www.breatheandflow.yoga/ritual\n✉️ Join the newsletter: https://newsletter.breatheandflow.yoga/\n🐺 More of the wolfpack:\nhttps://www.instagram.com/breatheandflow\nhttps://www.tiktok.com/@breatheandflow\nhttps://www.youtube.com/breatheandflow\nhttps://twitter.com/breatheandflow\n\n📚 Book and equipment suggestions: https://bit.ly/bnfkits\n🛜 Website: https://www.breatheandflow.yoga\n💬 Join the discussion: https://bit.ly/3z8P1JU\n🎧 Music for yoga: https://spoti.fi/3gpV2c6\n🍄 Mushroom supplements (use code BREATHEFLOW): https://bit.ly/3xjrIOI\n🔥 Our medicine family and shamans: https://bit.ly/2Ufi4fW\n☯️ Structural integration bodywork with Flo: https://bit.ly/FLO-SI\n\n***\n\nBreathe and Flow is a yoga and lifestyle channel owned by Bre and Flo Niedhammer. Knowing that the body benefits from movement while the mind benefits from stillness, we share our philosophy of mental stillness through the fluidity of a strong practice. Bre and Flo are Registered Yoga Teachers (RYT) with Yoga Alliance® holding the highest certifications as E-RYT500, and are also Yoga Alliance Continuing Education Providers (YACEP). Combined they are trained in Vinyasa yoga, Hatha yoga, Yin yoga, Myofascial Release (MFR), pre- and postnatal yoga, Functional Movement, Animal Flow, Kinstretch, Functional Range Conditioning (FRC) mobility training, Functional Range Assessment (FRA) and Anatomy Trains Structural. Bre and Flo have taught at several premium yoga studios for many years and are teaching their teacher trainings, retreats, and workshops around the world. They currently live in Las Vegas, Nevada, USA. Learn more about them and their certifications on their website: https://www.breatheandflow.yoga/about\n\nOur disclaimer: https://www.breatheandflow.yoga/disclaimer\n\n#breatheandflow #yoga #yogawithbnf",
  "channelTitle": "Breathe and Flow",
  "channelDescription": "We teach yoga retreats, teacher trainings and online classes to help you live your most authentic life. Learn more https://www.bnf.yoga ❤️🙏\n",
  "tags": [
    "yoga for sleep",
    "breathe and flow",
    "yoga for beginners",
    "yoga teacher",
    "yoga sleep",
    "better sleep",
    "night time yoga",
    "stretching before bed",
    "stretching yoga",
    "gentle yoga",
    "beginner yoga",
    "yoga for sleep and relaxation",
    "yoga for sleep in bed",
    "yoga for sleep apnea",
    "yoga for sleeping well",
    "yoga for sleeplessness",
    "yoga for sleep and anxiety",
    "yoga for sleep beginner",
    "yoga for bedtime",
    "Bedtime yoga"
  ],
  "publishedAt": "2019-07-10T12:00:08Z",
  "duration": 848,
  "durationFormatted": "14:08",
  "viewCount": 2909685,
  "likeCount": 43291,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/RI5gOBeTqyE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/RI5gOBeTqyE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/RI5gOBeTqyE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/RI5gOBeTqyE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/RI5gOBeTqyE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/RI5gOBeTqyE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "🧘Truly deepen your practice with our Breathe and Flow wolfpack platform: <a href=\"https://practice.breatheandflow.yoga/\">https://practice.breatheandflow.yoga</a>",
    "Thank you for everything, I was in a dark hole smoking pot and drinking non stop. For the last 5 months I have reshaped my body and mind and you&#39; ve played a huge role in that. I don&#39; t know you but you are a true friend. Thank you!",
    "I don&#39;t know if you guys check comments on old videos. But I wanted to let you know this video has been my almost nightly companion for the last four years. Flo your calming voice and this gentle routine have created the perfect atmosphere for winding down and is an essential component of my night routine. I truly believe this video has significantly improved my sleep on countless occasions, and I can&#39;t imagine my nights without it. I would be truly heartbroken if it was ever taken down from the platform. Thank you so much for creating such a valuable resource. Namaste.",
    "This video is AMAZING, my dad can&#39;t stop talking about how much it helps him with his back pain !!",
    "¡Gracias!"
  ],
  "channelSubscriberCount": 4270000,
  "channelVideoCount": 837
}