{
  "video_id": "RKYhcPV2dbA",
  "title": "7 ESSENTIAL STRETCHES YOU NEED TO DO DAILY! (12 min Stretch for Flexibility & Mobility)",
  "description": "We all know how important stretching is! I wanted to put together some MUST DO stretches that you can throw into your everyday routine. This is a FULL BODY stretch and only takes about 12 minutes to complete! No equipment needed.\n#fitness #homeworkout #stretching \n\n👉🏼 DOWNLOAD THE MADFIT APP HERE: https://madfit.app.link/e/store\n\n⭐️ DO THIS WARM UP FIRST: shorturl.at/gsTX5\n⭐️ APARTMENT FRIENDLY WARM UP: https://youtu.be/CSrBaHX3HxQ\n⭐️ DO THIS COOL DOWN AFTER (5 min): shorturl.at/jswT3\n\n👉🏼THE MAT I USE (Exercise 6X4): http://gorillamats.com?aff=19  (MADFIT10 for 10% off)\n\n✘ I N S T A G R A M: @madfit.ig\n✘ T W I T T E R: @maddielymburner\n✘ F A C E B O O K: facebook.com/madfit.ig\n✉ C O N T A C T (business inquiries): madfit95@gmail.com",
  "channelTitle": "MadFit",
  "channelDescription": "This is a place where I post REAL TIME, AT HOME workouts.\nMy goal is to help inspire everyone at all fitness levels to get up, get moving and reach their goals!",
  "tags": [
    "full body stretch",
    "full body stretching routine",
    "full body stretch routine",
    "stretching routine",
    "quick stretch routine",
    "quick stretch workout",
    "essential stretches",
    "full body stretches",
    "12 min stretch",
    "stretch for flexibility",
    "quick daily stretch",
    "quick stretch for flexibility",
    "stretch for mobility",
    "daily stretches",
    "madfit stretch",
    "madfit stretch routine",
    "madfit 12 min stretch",
    "12 min stretch madfit",
    "stretches you need to do daily",
    "stretches you need to do everyday"
  ],
  "publishedAt": "2022-10-19T14:19:19Z",
  "duration": 818,
  "durationFormatted": "13:38",
  "viewCount": 3233347,
  "likeCount": 65102,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/RKYhcPV2dbA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/RKYhcPV2dbA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/RKYhcPV2dbA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/RKYhcPV2dbA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/RKYhcPV2dbA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/RKYhcPV2dbA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m challenging you to follow this video EVERYDAY for 30 days and then come back to this comment section and give us an update on how you&#39;re feeling!! 👏🏼❤ Are you up for the challenge?",
    "I&#39;m on my 30th day of doing these stretches and I&#39;m feeling great!<br>My posture has greatly improved, kneeling no longer hurts, stretching has become easier for me, I am more flexible, and I feel better in my body. Maddie, thank you so much. I wholeheartedly recommend taking on the 30-day challenge. Keep at it even if you miss a few days.",
    "As a 59 y.o. male who is prone to throwing out his back, I began this challenge to limber up and after 30 days have become a devout zealot of this daily core routine. Your guidance is spot on which helped me to really isolate, &#39;feel&#39; and stretch the core joints and muscles which I was previously doing ALL WRONG. From barely touching my knees to now grabbing my feet - I feel SO MUCH BETTER and healthier. You really helped me to get my groove back and I can&#39;t thank you enough!",
    "Only on day two and can feel the difference! I was in an deep depression last year and barely got out of bed, so to say the least trying to get my body to move like it did before has been a challenge. <br>My body was so tight and stiff yesterday,  and couldn’t bend to do some of the moves. But today I noticed I was able to hold and relax into stretches for longer, and feel young again. <br>Definitely going to try my best to keep it up !",
    "I&#39;m only on day 3 of 30 and I notice a huge difference already, especially in my hamstring stretch! I feel like I can push myself to do it for a longer period of time with a flat back and my legs straight. Anyone can do these stretches so don&#39;t give up!"
  ],
  "channelSubscriberCount": 10400000,
  "channelVideoCount": 1205
}