{
  "video_id": "rldnNao8kRA",
  "title": "Virtual Run 5k | Virtual Running Videos For Treadmill | Mount Cook Hooker Valley New Zealand",
  "description": "Want to lose weight, perform better and live longer?\nI'm a family physician sharing science-backed insights inside my free weekly newsletter: Join here 👉 https://dradrian.carrd.co\nVirtual Run 5k | Virtual Running Videos For Treadmill | Mount Cook Hooker Valley New Zealand\nGet your free finishers certificate and discount on the finishers t-shirt:\n👉 https://mailchi.mp/youarerunning/treadmilltips/56d753426e\n\nWe're back at Mount Cook in early autumn! I hope you enjoy this sunny 5K along the Hooker Valley Track, up to the glacial lake with Mount Cook - New Zealand's highest peak, in the background. Thanks for watching!\n\nWant to lose weight, perform better and live longer?\nI'm a family physician sharing science-backed insights inside my free weekly newsletter: Join here 👉 https://dradrian.carrd.co\n\nWelcome to the Virtual Running Videos Channel! On this channel you'll find treadmill running videos, indoor running videos, indoor running, virtual running videos, New Zealand scenery, and virtual run videos. I started this channel out of gratitude for the beautiful place I live and a desire to share that with people. You can experience running and with a virtual run in the beautiful outdoors from the convenience of your home. I hope you enjoy! Please leave a comment, I read every one.\n\nImportant Disclaimer: This content is strictly the opinion of myself and is for educational and informational purposes only. It is not intended to provide medical advice or to take the place of medical advice or treatment from a personal physician or health professional. Consult your doctor or qualified health professional regarding specific health questions and before beginning any nutrition, supplement, exercise or lifestyle program. Neither myself nor the publisher of this content takes responsibility for possible health consequences of any person or persons reading or following the information in this educational content. Please take care when exercising. Neither myself nor the publisher of this content take any responsibility for any accident, injury or any health problems which occur while watching this video. As with all exercise programs, when using our videos, you need to use common sense.  Check with your doctor before beginning any fitness program. There may be camera views, movements or positions that may make people feel more unsteady or unsettled. By performing any fitness exercises, you are performing them at your own risk.  This channel will not be responsible or liable for any injury or harm you sustain as a result of our fitness program, videos, or information contained. Thanks for your understanding.\n\nLinks may be affiliate links from which I receive a small commission, but where the price is the same for you. Affiliate links are a way I help offset maintenance and running costs of video production.",
  "channelTitle": "Virtual Running Videos",
  "channelDescription": "Join for perks like early video access:\nhttps://www.youtube.com/channel/UCY95zbGK0vlAZ8Gk8OZqa1g/join\n\nOn Virtual Running Videos you'll find virtual running videos, virtual exercise running videos, indoor running, New Zealand scenery. I started this channel out of gratitude for the beautiful place I live and a desire to share that with people. Here you can find the perfect video for your indoor cycling or running workout. You can experience running and cycling in the beautiful outdoors from the convenience of your home. I hope you enjoy these treadmill running videos, indoor running videos, indoor running, virtual running videos, indoor cycling videos, treadmill tv, virtual running videos for treadmill, virtual scenery cycling, virtual running videos for treadmill, new zealand. #963393",
  "tags": [
    "treadmill running videos",
    "virtual running videos",
    "virtual run video",
    "Treadmill TV",
    "virtual jog",
    "virtual scenery",
    "new zealand",
    "virtual run",
    "POV",
    "jogging",
    "treadmill",
    "virtual running",
    "videos watch while running treadmill",
    "scenic running videos for treadmill",
    "trail running videos treadmill",
    "treadmill running scenery videos",
    "virtual running videos for treadmill",
    "virtual running videos for treadmill no music",
    "4K",
    "Virtual Exercise Video",
    "Virtual Treadmill Scenery",
    "5k"
  ],
  "publishedAt": "2021-03-19T20:29:06Z",
  "duration": 2134,
  "durationFormatted": "35:34",
  "viewCount": 125662,
  "likeCount": 2103,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/rldnNao8kRA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/rldnNao8kRA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/rldnNao8kRA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/rldnNao8kRA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/rldnNao8kRA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/rldnNao8kRA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "14 years ago, I hiked that trek with my two best friends. We hiked all over New Zealand, but this hike was the most memorable as we attempted to climb the mountain after the end and spent the night wild camping. I didn&#39;t realize I had chosen this path to run along on my treadmill, but 10 minutes in, I started to recognize the surroundings, and all the memories returned. Amazing video of such fantastic scenery. Thanks a lot!",
    "Thank you for the video! The view was amazing and the natural sounds of running made it perfect 🍺",
    "Awesome my Friend Although i Just on the spot Walk Along , i honestly believe these Videos are Saving My Life Thank You🙏",
    "Watching for the first time on my 85” tv and is so damn real!! I love it! <br><br>It even had me yelling “Move B! Get out the way! At <a href=\"https://www.youtube.com/watch?v=rldnNao8kRA&amp;t=593\">9:53</a>",
    "I find myself saying excuse me loudly and leaning into the curves. I am running on a Woodway Curve and am amazed at how I respond to visual cues - so pleased with these - thank you"
  ],
  "channelSubscriberCount": 88500,
  "channelVideoCount": 153
}