{
  "video_id": "rMeNfC_Alzw",
  "title": "Powerful Nose Breathing Exercises | 3x 60 Breaths | TAKE A DEEP BREATH",
  "description": "3 Rounds x 60 Breaths Per Round | 2 Minute Holds | Guided & Rhythmic + Meditation Time @ end\nMake sure you are subscribed so you don't forget to breathe:\nhttps://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=\n\n0:00 Intro\n0:59 Round 1\n8:00 Round 2\n14:56 Round 3\n21:52 Meditation\n\nIf you like my breathing exercise be sure to check out our friends @SOMA Breathwork here:\nhttps://lp.somabreath.com/soma-breath-mini-course/#a_aid=takeadeepbreath&a_bid=d561ea2d\n\nHow to do this breathing exercise:\nLie down on your bed or the floor, or sit back in a comfortable chair, this exercise is best on an empty stomach, have a sip of water and take some gentle breaths first through the nose to warm up.\n\nThis exercise is best done when breathing in through the nose and out through the nose.\nThe breath noises are just an anchor and guide, go at your own pace and don’t push yourself too much.\nTo get the most from this type of breathing, ensure that the other 99.00% of your time during your day you are nasal (nose) breathing – even during physical exercise.\nAfter this exercise, take enough time with nasal breathing to relax and get back to a calm level.\n\nSubscribe so you never miss a new video: https://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=1\n\nAbout TAKE A DEEP BREATH: \nWelcome to TAKE A DEEP BREATH (TADB), here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. Here you will also find our dedicated breathing podcast (Breathcast), where you can watch interviews with the worlds top breathing experts https://youtube.com/playlist?list=PLoVrvn2_-QGbNwagnvQEEfVbCay3682De \n\nSafety Information: \nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell STOP. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in bodily harm. Deep breathing may cause tingling sensations, a ringing in the ears, and/or light-headedness. These are normal responses and are no cause for alarm. If you faint, however, you have gone too far and should take it more slowly next time. \n\nTop Books on Breathing and Breathwork:\n✅ Wim Hofs new book \"The Wim Hof Method\" https://geni.us/EBJR\n✅ James Nestor's Book 'Breath The New Science of a Lost Art' here: https://geni.us/c1CK\n✅ Anders Ollson Book: \"Conscious Breathing\" here: https://geni.us/9mjmz7\n✅ Belisa Vranich \"Breathing For Warriors\" here: https://geni.us/J7QjBc\n✅ Belisa Vranich \"Breathe\" here: https://geni.us/G5q8Be\n\nMy Equipment:\nI spent hours of my time researching the best camera, microphone, and lens for Podcasts and other filming-making needs. I love the kit I bought, and very happy with the performance:\n✅ Stunning Camera: Sony A6400: https://geni.us/wTOWW\n✅ Great Lens: 1.4 16mm Sigma: https://geni.us/etntF\n✅ Wonderful Microphone: https://geni.us/mnCi\n\nDisclaimer \nThe information provided in this video is provided for informational purposes only and is NOT to be used or relied on for any treatment purposes. All information provided by TAKE A DEEP BREATH is of a general nature, only for educational/entertainment purposes. No information is to be taken as medical or health advice. Follow this breathing exercise at your own risk. TAKE A DEEP BREATH or Mike Maher is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of your reliance on the information contained in this video. There is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself. We use affiliate links which means if you buy something, we'll receive a commission, we appreciate the support you give us and we hope to keep adding value to you.\n\nSubscribe so you never miss a new video: https://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=1",
  "channelTitle": "TAKE A DEEP BREATH",
  "channelDescription": "Welcome to TAKE A DEEP BREATH, My name is Mike Maher, I am a breathwork instructor, podcaster and researcher of the breath. I have studied many modalities and I am proud among other things to be an Oxygen Advantage Master Instructor.\n\nOn my channel here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. We also host #Breathcast which is a dedicated Breathwork Podcast where we interview the world's top breath and health experts.\n\nBreathwork is where you consciously alter your breathing pattern to achieve a set of results such as helping you to relax, raise your energy, increase your immune system, change your state of consciousness or calm your parasympathetic nervous system.\n\nBreathwork has been a key component in Yoga for centuries,  now with the help of people such as Joe Rogan & books such as the Oxygen Advantage, breathwork is part of mainstream society.\n\n\n",
  "tags": [
    "wim hof",
    "wim hof breathing technique",
    "wim hof breathing",
    "breathwork",
    "psychedelic",
    "breathing",
    "breathing technique",
    "hyperventliation",
    "extreme breathing",
    "pranayama",
    "breath of fire",
    "breathing exercise",
    "wim hof method",
    "transcendental meditation",
    "dmt breathing",
    "pineal gland activation",
    "take a deep breath",
    "dmt breathing exercise",
    "breathing exercises",
    "holotropic breathing music",
    "tadb",
    "nose breathing",
    "nose breath",
    "improve your mood",
    "inner peace",
    "60 breaths",
    "dmt breathwork"
  ],
  "publishedAt": "2020-10-19T09:30:08Z",
  "duration": 1794,
  "durationFormatted": "29:54",
  "viewCount": 105262,
  "likeCount": 1066,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/rMeNfC_Alzw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/rMeNfC_Alzw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/rMeNfC_Alzw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/rMeNfC_Alzw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/rMeNfC_Alzw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/rMeNfC_Alzw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I deal with severe anxiety, that caused blood pressure to get to 180/90 . Did this Exercise and blood pressure went back to 123/70! Thank you!",
    "i do the exercise,then i take a cold shower and then i dry myself doing again the breathing.BEAUTIFUL.",
    "Great video! We are both in our 80&#39;s and are all about healthy aging.  Need to maintain a strong body, a calm mind, &amp; a positive outlook. We&#39;re doing some research for our new healthy-aging advice YouTube channel and hope to inspire others. Learned from you. TY",
    "I just hit my record breath hold of <a href=\"https://www.youtube.com/watch?v=rMeNfC_Alzw&amp;t=132\">2:12</a> , aiming to hit 3 minutes eventually;)",
    "60 Breaths X3  yes! Finally this is what I wanted"
  ],
  "channelSubscriberCount": 295000,
  "channelVideoCount": 386
}