{
  "video_id": "rO0MT1oPPK4",
  "title": "A Deep Relaxation Meditation That Will Take You to a New Reality",
  "description": "This is an Original guided meditation recorded by us.  This is a 35 minute guided meditation designed for deep relaxation in a way that transitions you to shift into a new reality.  Today, let us dare to envision a reality that transcends the boundaries of what we perceive as possible, let us carry this vision in our hearts where it may guide our actions, inspire our choices, and ripple outwards, touching the lives of others.  Together, let us weave the fabric of this new reality, one small act of kindness at a time.\n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "deep relaxation meditation",
    "meditation deep relaxation",
    "30 minute meditation",
    "meditation 30 minutes",
    "guided meditation 30 minutes",
    "a new reality",
    "guided meditation new reality",
    "shifting",
    "shifting reality"
  ],
  "publishedAt": "2023-07-11T09:00:26Z",
  "duration": 2158,
  "durationFormatted": "35:58",
  "viewCount": 1053943,
  "likeCount": 13269,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/rO0MT1oPPK4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/rO0MT1oPPK4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/rO0MT1oPPK4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/rO0MT1oPPK4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/rO0MT1oPPK4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/rO0MT1oPPK4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I was on the cusp of a SERIOUS Anxiety attack. My chest was tight! My breaths were short. My mind was racing bad! Head felt like it was going to explode 🤯 and I was going to lose it!!! I did this meditation, and it all went away! It felt like I traveled out of my body, and then returned after the count down! I’ve been through LOTS of trauma! And at 33 years of age! I’m BEYOND tired of carrying it!!! I thank you for this channel, and will continue using these meditations, for years to come!",
    "If your reading this please see this as a sign that you deserve peace, and rest, and most importantly if you are reading this it means YES to everything you want in your life ❤know your worth, and know you are worth it. Believe that, feel that, and allow that ❤🙏🏾",
    "I struggle with major anxiety and lately it’s prevented me from being able to calm my mind enough to sleep. I’d wake up thinking I was having a heart attack. I grabbed my phone one night and searched YouTube for a meditation, thinking there was no way it would work. It’s been a week and I’ve fallen asleep before making it to the 10 minute mark. It has been life changing. Thank you so much for giving ppl like me an option to reach for in dark moments.",
    "Very nice video description and music ❤ thank you. I choose your video more than others.",
    "This was my first time meditating, and it was unbelievable. I turned to complete mush. Even though I have ADD, I had no problem becoming attuned to this beautiful, relaxing, and beautiful voice. Now, I find myself coming back to this session over, and over again. Thank you so much."
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}