{
  "video_id": "RocudKlpQeI",
  "title": "Beginner Bodyweight Workout in 5 Min",
  "description": "This video is a 5 min beginner bodyweight workout routine. Exercises included in this video are:\nBody weight squats\nCalf raises\nHamstring curls\nSeated straight leg raises\nPush ups\nGlute bridges\nPlank\n\nMuscle strengthening has incredible benefits to the body and improves our overall health. Do this routine once a day to build a foundation and then progress to more advanced exercises and longer routines. You can even do this routine twice or three times back to back for a better workout.\n\n►  Things my patients have found helpful:\nPlease note that I get a lot of requests and questions about what equipment is ‘best’ for treating a variety of conditions. The following is not meant to be an exhaustive or definitive list. Please use it as a starting point. If you have questions, please discuss with your healthcare provider. With that said, I have tried a number of the products below, but not all. I have included some based on positive feedback from many of my patients. As an Amazon Associate, Dr Peng earns from qualifying purchases. If you purchase any product using the below affiliate links, you are helping Dr Peng maintain this channel. \n\n*Supplements*\nThe following are Thorne supplements which are NSF certified. NSF independently assesses products without being affiliated with the companies that produce them. Not only do they certify that what’s on the label is in the bottle, they also do toxicology review to certify product formulation and contaminant review to ensure the product contains no undeclared ingredients or unacceptable levels of contaminants.\n\nBoswellia Extract: https://amzn.to/3L00rYn\nTurmeric & Curcumin: ​​https://amzn.to/47NacD9\nGlucosamine & Chondroitin: https://amzn.to/44AVoow\nCreatine Monohydrate: https://amzn.to/45JW9wq\nOmega 3 and 6: https://amzn.to/45LTBh7\nVitamin D 5000: https://amzn.to/47T8MHs\nVitamin B complex: https://amzn.to/3L0Bdcm\nMagnesium: https://amzn.to/3snHuZc\n\n*Soft Tissue & Rehab*\nTheragun: https://amzn.to/4363zJG\nMassage ball: https://amzn.to/40BUC9f\nFoam roller: https://amzn.to/4324E5c\nStretching strap: https://amzn.to/3U9a2iQ\nTENS unit: https://amzn.to/3mcCqnI\nHeating pad: https://amzn.to/40VidSc\nResistance bands: https://amzn.to/3nFyb4C\n\n*Braces & Supports*\nHinged knee brace: https://amzn.to/3U6oyrH\nNeoprene knee sleeve: https://amzn.to/3Zzhsgt\nVolar wrist brace: https://amzn.to/3KawW55\nThumb spica brace: https://amzn.to/3nHj9vl\nAnkle lace up brace: https://amzn.to/3m6iR0u\nTennis/Golfer’s elbow brace: https://amzn.to/3ZEGgE1\nSuperfeet orthotic inserts: https://amzn.to/436tRf5\n\n*Recommended Textbooks & Resources*\nThe Trigger Point Manual: https://amzn.to/4340cTt\nTrigger Point Wall Charts: https://amzn.to/3zrinVR\n\n►  Be Active. Live Healthy. Subscribe for more free videos like this: https://www.youtube.com/channel/UCL5eiGK1f0A-DecaBqq5emg/featured?sub_confirmation=1\n\n►  ABOUT ME \n\nJeffrey Peng MD is a nonoperative orthopedist and sports medicine specialist. He created a YouTube channel and blog to translate cutting edge medical knowledge and clinical research to benefit all those looking to live an active and healthy lifestyle. He focuses on maximizing non-surgical treatments for sports injuries and orthopedic conditions. He specializes in using orthobiologics and ultrasound guided minimally invasive techniques to treat osteoarthritis, tendinopathies, and musculoskeletal disorders.\n\nDr. Peng is board certified in sports medicine and family medicine. He completed residency with the Stanford family medicine residency program and completed his sports medicine training with the Stanford primary care sports medicine fellowship in San Jose. He is an active faculty member for both programs and is excited about training the next generation of physicians. \n\nDr. Peng’s sports medicine clinic is located in Campbell, California.\nTwitter: @JeffreyPengMD; https://twitter.com/JeffreyPengMD\nWebsite: https://www.jeffreypengmd.com/ \n\n►  Disclaimer\n\nMy content reflects my own opinion and does not represent the views or opinions of my employers or hospital systems I am affiliated with. They are meant for educational purposes only. They do not substitute for the medical advice of a physician. Always seek the advice of your physician with any questions you may have regarding your health.",
  "channelTitle": "Jeffrey Peng MD",
  "channelDescription": "Jeffrey Peng MD is a nonoperative orthopedist and sports medicine specialist. He created a YouTube channel to translate cutting edge medical knowledge and clinical research to benefit all those looking to live an active and healthy lifestyle. He focuses on maximizing non-surgical treatments for sports injuries and orthopedic conditions. He specializes in using orthobiologics and ultrasound guided minimally invasive techniques to treat osteoarthritis, tendinopathies, and musculoskeletal disorders.\n\nDr. Peng is board certified in sports medicine and family medicine. He completed residency with the Stanford family medicine residency program and completed his sports medicine training with the Stanford-O'Connor sports medicine fellowship in San Jose. He is a faculty member for both programs and is excited about training the next generation of physicians. \n\nDr. Peng currently practices in the San Francisco bay area.\n\nTwitter: https://twitter.com/JeffreyPengMD\nWebsite: www.JeffreyPengMD.com\n",
  "tags": [],
  "publishedAt": "2022-06-09T12:00:20Z",
  "duration": 398,
  "durationFormatted": "6:38",
  "viewCount": 237984,
  "likeCount": 5358,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/RocudKlpQeI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/RocudKlpQeI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/RocudKlpQeI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/RocudKlpQeI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/RocudKlpQeI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/RocudKlpQeI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m a severe asthmatic and I&#39;ve been trying to find a beginner friendly full body routine to get back into the swing of things and this is perfect",
    "Wow! This doesn&#39;t seem like enough, but I always overdo it and don&#39;t come back the next day. This is perfect just to get motion back into my everyday routine!! This was day 2. I feel so good after this, I love it!",
    "This is great for people with busy schedules you can always find 5 minutes and it&#39;s nice you have the timer right there",
    "I swear it feels like the clock is going backwards on planks",
    "Thank you for these 5 mins workouts. I have been doing your shoulder and neck videos for 4 days now and am feeling the difference already. Your way of presenting and performing the exercises yourself is motivating. Looking forward to more workout videos😊"
  ],
  "channelSubscriberCount": 317000,
  "channelVideoCount": 224
}