{
  "video_id": "Rx5X-fo_fEI",
  "title": "Guided Mindfulness Meditation - Go Easy on Yourself - Self-care and Self-Love (15 Minutes)",
  "description": "This is a new guided mindfulness meditation focused on caring for yourself and showing love for yourself - GO EASY on yourself! I'll bet you are the kind of person who takes on big challenges and puts a lot of pressure on yourself. As the saying goes, we are often our own worst critics. Meditating and being mindful of what pressures cause us stress and anxiety can lead to a healthier mental state. Although it can be healthy to hold ourselves to a high standard, we don't want to work ourselves into a loss of personal well-being.\n\nLet the dialogue and ambient music soundtrack guide you. The calm and peaceful guided meditation dialogue lasts for about 12 minutes, followed by a few minutes of ambient music to bring you back out of meditation - 15 minutes total. You really can take it EASY on yourself!\n\n----\n\nI strive to create some of the most calming and relaxing online guided meditations on YouTube - I hope you find them to be some of the best out there! Some of the most popular topics are better sleep, morning sessions, and healing anxiety. The ambient music sessions can be great for either non-verbal meditation or yoga. If you enjoyed these sessions, please subscribe and visit my website for a meditation guide and more information: http://www.mindfulpeacejourney.com​\n\nSUPPORT THIS CHANNEL ON PATREON and get SoundCloud streaming:\n🙏https://www.patreon.com/mindfulpeace/​ \n------------\nSEE ALL OF THE MEDITATION VIDEO SESSIONS AND SUBSCRIBE: \n💛http://www.youtube.com/c/mindfulpeace/​\n------------\nLIKE THE MINDFUL PEACE JOURNEY FACEBOOK PAGE:\n🤝https://www.facebook.com/mindfulpeacejourney/\n\nPlease note that this content is for educational/entertainment purposes only. No information is to be taken as medical advice. Do not drive or operate machinery while listening to this or any meditation session.\n\n----\n\nMeditation can help with mental health and wellness, but it may not be a complete solution alone. Don't hesitate to use these important resources depending on your situation:\n\nSubstance Abuse and Mental Health Services Administration\n1-800-662-HELP (4357)\nhttps://www.samhsa.gov/find-help/\n\nSuicide and Crisis Lifeline: Dial 988\nhttps://www.samhsa.gov/find-help/988\n\nLearn about choosing online therapy like BetterHelp or TalkSpace (not sponsored in this video):\nhttps://www.apa.org/topics/telehealth/online-therapy\n\n----\n\nAll dialogue and music is original by Mindful Peace Journey. The lovely video has been licensed - thank you edb3_16 from Pond5. Meditation silhouette by Smashicons from www.flaticon.com. Used with Creative Commons license. Thank you also to my wonderful Patreon supporters. And lastly, thank YOU for watching and please subscribe!\n\n#meditation #selflove  #selfcare",
  "channelTitle": "MindfulPeace",
  "channelDescription": "Original deep, calming meditation videos to promote mindfulness and inner peace for any spiritual belief. Have less anxiety, get better sleep, and experience more joy through mindfulness and meditation!",
  "tags": [
    "mediation",
    "zen",
    "buddhism",
    "buddhist",
    "yourself",
    "yourselves",
    "mindfulness",
    "journey",
    "calm"
  ],
  "publishedAt": "2022-11-28T13:30:14Z",
  "duration": 901,
  "durationFormatted": "15:01",
  "viewCount": 757681,
  "likeCount": 10935,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Rx5X-fo_fEI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Rx5X-fo_fEI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Rx5X-fo_fEI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Rx5X-fo_fEI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Rx5X-fo_fEI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Rx5X-fo_fEI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To the person reading this, know that you are amazing. You can do this, you will succeed. No matter what difficulties you might be facing right now, you can overcome them! You are strong and worthy of wonderful things ❤🙏",
    "To everyone who’s reading this, I’m proud of you for bettering yourself ❤️",
    "As a person who fights mental illness this really helps me. It helps to bring myself back into focus and care for myself first.",
    "I was stressing myself out about classes and didn’t realize how much I needed this. I often forget to afford myself the same love and understanding that I try to give other people. Cried a little. Thank you",
    "You are not alone in your feelings. So many of us are so filled with anxiety these days. Take a moment, take a breath, and remind yourself that it will pass. It’s true."
  ],
  "channelSubscriberCount": 229000,
  "channelVideoCount": 217
}