{
  "video_id": "rzGB7UxB9ws",
  "title": "YOGA FOR LOWER BACK PAIN + TIGHTNESS ~Gentle Beginner Friendly Yoga Stretches For Back Pain(10 mins)",
  "description": "Hello Yogis! this gentle, beginner friendly lower back focused practice will help you ease some of the tension/ tightness you might  experiencing as we slowly lengthen our spine & hips. You can always come back to this simple practice whenever you need. If your'e sitting a lot this is also a great practice to come back to in the evenings. Hope this helps let me know how you go! \n\n✨Join Tana Studio https://tanastudio.online/ today and enjoy 45/ 60 min yoga flows, pilates workouts, regular challenges, handstand flows, honey flows, breathwork & meditation and so much more ✨ \nstart your 7 DAY FREE TRAIL today https://tanastudio.online/\n\n\n✨ My Instagram https://www.instagram.com/tanatrzebin...\n\n✨ Shop the yoga mat that I use \nhttps://amzn.to/3AoIm3P\n\n✨The BEST microphone ever\nhttps://amzn.to/3M6FZFv\n\nThis is an affiliate link were I will receive a commission if you purchase any of the items.\n\n\n\n\n\nHope you enjoy this  YOGA FOR LOWER BACK PAIN + TIGHTNESS ~Gentle Beginner Friendly Yoga Stretches For Back Pain(10 mins)10 minute yoga, yoga, yoga for low back pain, yoga for back pain, low back pain, low back pain yoga\nyoga for lower back and hips, yoga for hips, yoga for spine, yoga for back pain relief beginner\nyoga for back pain relief.yoga for sciatica, tana yoga, lower back stretch, lower back pain, 10 min yoga, yoga 10 mins, lower back flow, yoga flow spine, yoga spine, lower back tightness, yoga lower back release, vinyasa yoga, gentle yoga lower back, slow yoga lower back, yoga for weightloss, yin yoga, gentle yoga, 10 minute yoga.\n\n\n\n\nDISCLAIMER\nPlease consult with your physician before beginning any exercise program. By participating in this exercise/ exercise routine you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself, and agree to release and discharge Tana Yoga from any and all claims or causes of action, known or unknown, arising out of Tana Yoga with Tana’s negligence.",
  "channelTitle": "Tana Yoga",
  "channelDescription": "Playful Yoga flows | Pilates Workouts \n\n\n\n\n\n\n\n\n\nYou'll find power yoga workouts, slow vinyasa flows, yoga for anxiety classes, yoga for weightloss, yoga for energy, yoga for flexibility, morning yoga, bed time yoga, total body yoga and more. \n\n\n\n",
  "tags": [
    "yoga",
    "yoga for low back pain",
    "yoga for back pain",
    "low back pain",
    "low back pain yoga",
    "yoga for lower back and hips",
    "30 min yoga",
    "yoga for back pain relief beginner",
    "yoga for back pain relief",
    "sarah beth yoga",
    "yoga for sciatica",
    "tana yoga",
    "lower back stretch",
    "lower back pain",
    "10 min yoga",
    "yoga 10 mins",
    "lower back flow",
    "yoga flow spine",
    "yoga spine",
    "lower back tightness",
    "yoga lower back release",
    "vinyasa yoga",
    "gentle yoga lower back",
    "slow yoga lower back"
  ],
  "publishedAt": "2021-02-15T13:13:07Z",
  "duration": 636,
  "durationFormatted": "10:36",
  "viewCount": 646933,
  "likeCount": 15902,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/rzGB7UxB9ws/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/rzGB7UxB9ws/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/rzGB7UxB9ws/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/rzGB7UxB9ws/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/rzGB7UxB9ws/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/rzGB7UxB9ws\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hey guys this came as a request, hope this lower back focused practice helps! Also THANK YOU for 1000 subs!  I love creating for you guys :) Let&#39;s chat more in the comments below I&#39;d love to hear from you!  Please consider subscribing if you havent already 🥰<br><br><br><br><br><br><br>YOGA FOR LOWER BACK PAIN + TIGHTNESS ~Gentle Beginner Friendly Yoga Stretches For Back Pain(10 mins)<br><a href=\"https://www.youtube.com/watch?v=rzGB7UxB9ws\">https://www.youtube.com/watch?v=rzGB7UxB9ws</a>",
    "My mom has a back pain for 7 months and it is getting worse when the pain runs to her legs. I sent her your video and after 3 days, doing this twice per day, she told me the pain had been released and it really worked.",
    "I have the worst lower back pain I’ve ever had, and this gave me so much relief. Second day doing it, thank you",
    "im only 17 but dealing with some unbearable back pain and this made me finally feel well, thanks!",
    "I&#39;m 23...I never really thought I was out of shape or my body was aging beyond my years, but good GOD I&#39;m more out of shape than I thought. This was harder and more painful than any workout I could do at the gym. I have such terrible tightness in my hamstrings and groin-pelvic muscles, I couldn&#39;t even go half as far as you did in the video. Looks like I&#39;ll need to keep this up for a while, lol."
  ],
  "channelSubscriberCount": 99700,
  "channelVideoCount": 355
}