{
  "video_id": "sAf67xFS-qE",
  "title": "5 Min. Morning Stretch | Full Body Flexibility Routine for Beginner",
  "description": "Welcome to your Yoga inspired 5 Minute Morning Stretch for Beginner. This is a great way to start your day and create a mindful, but active morning routine.Get your daily dose of flexibility & mobility and have an amazing start into the day!\n\n\n\nIn addition to my German voice-over-videos, I will be producing more music-only stretching and fitness content in the future, so everybody can join! If you have any video requests, please let me know in the comments.\n\nThank you for practising with me!\nMady\n\n\nNO ADS!\nAs in all of my sessions, I do not put any ads within the video. So you won’t be interrupted in the middle of your workout.\n\n\nNO ADS!\nWie in allen meinen Einheiten, schalte ich innerhalb der Videos keine Werbung! Ihr werdet also nicht mitten im Workout unterbrochen.\n\n\nDiese Yoga-Einheit könnt ihr ganz prima im Anschluss absolvieren:\nhttps://youtu.be/8jzBjFd-8YE\n\n\nPS: Keine Sorge ihr Lieben, natürlich wird es auch weiterhin „gesprochene“ Videos geben. Das eine schließt das andere ja nicht aus und der nächste Yoga-Flow ist sogar schon in Planung ;-) \n\n\n\n********************************\n\n\n\nDas ist meine Matte: http://amzn.to/2mo8NNr​ *\n(und mit Abstand meine absolute Nummer 1)\n\nDu magst die Matte lieber in einem komplett nachhaltigen Shop kaufen?\nSchau mal hier:\nhttps://tidd.ly/3i33gXO *​\n\nMein Meditationskissen:\nhttps://tidd.ly/3aGk84n *​\n\n\n\n********************************\n\n\n\nMORE MUSIC-ONLY SESSIONS:\n\n15 MIN DAILY STRETCH:\nhttps://youtu.be/g_tea8ZNk5A​\n\n\nNECK & SHOULDER STRETCH:\nhttps://youtu.be/s-7lyvblFNI\n\n\nBACK PAIN RELIEF STRETCHES:\nhttps://youtu.be/2eA2Koq6pTI\n\n\n\n\n********************************\n\n\n\nEQUIPMENT:\n\nMeine liebste Matte: \nhttp://amzn.to/2mo8NNr​ *\n\nMeine Vlogging Cam: \nhttp://amzn.to/1GsIWWo​ *\n\nMein Make Up 100% Bio- bzw Naturkosmetik\nhttp://amzn.to/1LtYY89​ *\n\nMein neuer Mixer (macht die besten Smoothies ever!)\nhttp://amzn.to/2n4BayW​ *\n\n\n\n\n\n********************************\n\n\nMUSIK: www.epidemicsound.com\n\n\n********************************\n\n\n\n\nFür tägliche Inspiration YOGA, TRAVEL & FOOD :\n\nInstagram : https://instagram.com/madymorrison/​\nFacebook: https://www.facebook.com/morrison.mady​\nBlog: http://www.madymorrison.com​\n\n\n\n* das ist ein Affiliate Link. Wenn du über diesen Link etwas kaufst, erhalte ich eine kleine Provision. Am Preis verändert sich für dich rein gar nichts!! So kannst du diesen Kanal unterstützen und hilfst mir weiterhin kostenlose Aktionen und Videos für euch zu erstellen. Vielen Dank für deinen Support!",
  "channelTitle": "Mady Morrison",
  "channelDescription": "Hallo ihr Lieben,\nich bin Mady Morrison, zertifizierte Yogalehrerin und freue mich, dass ihr auf meinem Youtube-Kanal gelandet seid!\nHier teile ich meine größte Leidenschaft - YOGA!\n\nYoga begleitet mich schon seit über 10 Jahren und hat mir in den verschiedensten Bereichen und Phasen meines Lebens geholfen! Neben den Körperlichen Benefits (Muskelaufbau, Balance, Fettabbau (je nach Yogastil)) bin ich achtsamer und vor allem zufriedener geworden. Ich bin super ausgeglichen, glücklich und habe immer ein Strahlen im Gesicht! \nDiese Freude und Leidenschaft möchte ich an euch weitergeben! \nIch liebe was ich tue und freue mich Yoga hier auf Youtube für ALLE zugänglich zu machen! Für Anfänger und Fortgeschrittene ist alles mit dabei!\n\nHabt viel Spaß!\nEure Mady\n",
  "tags": [
    "morning stretch",
    "Mady Morrison",
    "morning routine",
    "5 minute",
    "5 min stretch",
    "full body stretch",
    "daily stretch",
    "dehnen",
    "morgenroutine",
    "yoga beginner",
    "yogamitmady",
    "mobility",
    "flexibility",
    "cool down",
    "deep stretch",
    "no equipment",
    "weightloss",
    "relaxation",
    "beginner",
    "stretch",
    "relax",
    "no repeat",
    "music only",
    "full body",
    "back pain relief"
  ],
  "publishedAt": "2021-05-27T05:00:15Z",
  "duration": 358,
  "durationFormatted": "5:58",
  "viewCount": 7453904,
  "likeCount": 103298,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/sAf67xFS-qE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/sAf67xFS-qE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/sAf67xFS-qE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/sAf67xFS-qE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/sAf67xFS-qE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/sAf67xFS-qE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Not sure why, but since I started doing this I want to do it every morning. It feels peaceful and like a good start into the day. Love the music!",
    "I’m still shocked and pleased by how well this quick morning routine makes me feel. After this, I feel looser, livelier, and warmed up for my day. Moreover, it gets my day off to a good start because I feel like I’ve accomplished something and honored my body, if only in a small way. Thanks!",
    "I just did this during my 5-minute break of a study session, and it gets me feel lively to go back on studying. This is the definition of productive break!",
    "Today was day 1 of me doing this routine.  Some of the stretches were a tough pull, mainly because my body is not very flexible, yet. I enjoy your routines and the music choice(s). They seem simple and engaging enough to make me want to keep at it. Thank you for sharing your stretches!!",
    "Thank you for this quick session! It fitted perfectly before going to work. German and English are not my first language, so it’s very relaxing only to music."
  ],
  "channelSubscriberCount": 3840000,
  "channelVideoCount": 210
}