{
  "video_id": "sAY-dua1XJ8",
  "title": "Insane 15 Minute Elliptical Workout - HIIT Workout",
  "description": "Are you looking for a quick 15 minute elliptical workout? Try this insane elliptical workout today, it's quick, effective, and exactly what you're looking for!  #EllipticalWorkout #HIITWorkout #Elliptical\n\nAn elliptical workout machine with handles is one of the few cardio machines that can provide you with both an upper- and lower-body workout. The key to maximizing the upper-body benefits is to distribute your weight and resistance evenly by pumping your arms just as fast as you’re moving your legs.\n\nThe elliptical is known for putting less stress on your joints. Studies show that it can significantly reduce weight bearing compared to running, jogging, and similar workouts. This means its the perfect choice to continue training your body without the wear and tear that comes with high-impact exercises. I love working out on an elliptical machine!\n\nMost people use an elliptical to get their steady-state cardio workouts in. I however, recommend it for more high-intensity interval training like this workout I provided! This will maximize the fat burning effects in a shorter amount of time.\n\nPlease feel free to increase your elliptical resistance or incline, to target specific leg muscles and make your HIIT workout more challenging. The higher the pitch the more butt activation you will get. I recommend increasing the pitch as the rounds move forward. \n\nRemember, HIIT workouts and elliptical workout machines are amazing for you fitness and health! However, they should not be overused and be the only exercises you do. You need different muscle activation, progressive load changes, and variations with all your workout routines.  #EllipticalWorkout #Elliptical #HIITWorkout\n\nI recommend to perform a 10-30 minute HIIT workout 2-3 times a week, with 24 hour rest in between HIIT workouts, in addition to other variety of fitness activities like weight-training.  \n\nThis elliptical workout video is 15  minutes of sprint training, going as hard as you can for 6 rounds of 30 seconds, spaced with 90 seconds of low intensity. It's important to catch your breath FULLY before each round so you can really push it to the max!\n\n-- LINKS --\n📕  Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕\n►https://www.abundantyou.com/7-hiit-se...\nYou'll learn how to make your HIIT workout more effective towards weight loss and avoid the common mistakes people when doing HIIT workouts!\n\nTo learn more visit:\nhttps://www.abundantyouchiro.com/ - Holistic Wellness Center Columbus, Ohio\nhttps://abundantyou.com/ - Natural Health Made Easy Blog\nhttps://askdrkevin.com/ - Ask Dr. Kevin a question!\n\n\nWe start the ALL elliptical workouts with a 5 minute warm-up and finish with a 3 minute cool-down. Please make sure you do both to reduce risk or injury!\n\n#EllipticalWorkout \n#HIITWorkout\n#Fitness\n#IntervalTraining\n#15MinuteWorkout\n#15MinuteEllipticalWorkout\n#FatBurningWorkout",
  "channelTitle": "AbundantYou with Dr Kevin",
  "channelDescription": "Abundant You is a natural health website dedicated to all aspect of health and wellness as it relates to you! Helping people accomplish higher overall health and better well-being.\n\nOur YouTube channel is a great shortcut to stay connected with us and help others online! The Abundant You team will upload new natural health made easy videos, natural  articles, workouts and of course delicious recipes!\n\nPlease subscribe and share our channel!  Let's make a positive impact in the natural health & wellness community! \n\nFeel free to leave constructive comments or ask questions! We appreciate you, thanks for watching. You can learn more about our natural health made easy website by visiting https://www.abundantyou.com/\n\nP.S. Do you live around Columbus Ohio? Or know someone that does? We have a natural holistic wellness center you can visit and get personal 1 on 1 help to reach your specific health goals. You can learn more about our clinic at https://abundantyouchiro.com/",
  "tags": [
    "Elliptical workout",
    "15 min elliptical workout",
    "hiit elliptical workout",
    "elliptical workout weight loss",
    "15 minute workout",
    "15 minute elliptical workout",
    "HIIT Workout",
    "Interval training elliptical"
  ],
  "publishedAt": "2020-03-01T16:27:55Z",
  "duration": 1163,
  "durationFormatted": "19:23",
  "viewCount": 174387,
  "likeCount": 2682,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/sAY-dua1XJ8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/sAY-dua1XJ8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/sAY-dua1XJ8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/sAY-dua1XJ8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/sAY-dua1XJ8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/sAY-dua1XJ8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Dude I have to say you&#39;re like the realist representation of how a normal fit person looks. So many fitness videos show guys who are really buff teaching us different workouts. I dont really like those videos because it makes me feel self conscious. I always wanted to see a regular skinny/fit person do the workouts because I feel like I&#39;d get into it more and be more relatable. So thank you for making me feel motivated to workout more!!",
    "Love this! Doesn’t take up much room. I ride every two hours for 15 minutes and get my 10,000 steps done!",
    "I have followed others but you are who I’m sticking with!! Thank you for helping so many of us!",
    "Been looking for some good HIIT workouts to get better use out of my elliptical, to help me lose weight! I hate going to the gym because I’m a shy person and hate working out in front of people! LOL. I do all of my workouts at home. These are fantastic!!! So glad I found them! 😁",
    "So happy I found this video, I am just getting back to exercising from illness. Haven&#39;t been able to stay on elliptical for 10 minutes you kept me going for 20 minutes. Thank-you so much. Hope I can walk tomorrow so I&#39;ll continue!! You are a great inspiration."
  ],
  "channelSubscriberCount": 58900,
  "channelVideoCount": 45
}