{
  "video_id": "ScInpT_5dIQ",
  "title": "30 Min MIGHTY Full Body Workout - Dumbbells | Caroline Girvan",
  "description": "A full body workout hitting all of the major muscle groups in the upper body, and using static lunges as a staple to target the entire lower body with some RDLs for more hamstring specific! Finishing with an absolute abdominal burnout! \n\nThe timer will be on for 60 seconds per exercise with 20 seconds rest in between! \n\nAll you will need is a pair of dumbbells and your mat! \n\nThe dumbbells I am using for your reference are 17.5kg for most of the workout! I will reduce to 9kg each for shoulder press and holding during abs section!\n\nThese are straight forward compound movements with full range movement and standard tempo to allow you to perhaps lift that little bit heavier compared to if consisting of isometrics, tempo or partial reps!\n\nCHEST PRESS\nCHEST PRESS\nSTATIC LUNGE (one side)\nSWITCH SIDE!\nSHOULDER PRESS\nSHOULDER PRESS\nSTATIC LUNGE (one side)\nSWITCH SIDE!\nBENT OVER ROW (one side)\nSWITCH SIDE\nSWITCH SIDE\nSWITCH SIDE\nSTATIC LUNGE (one side)\nSWITCH SIDE!\nPULLOVER\nPULLOVER\nSTATIC LUNGE (one side)\nSWITCH SIDE!\nSTAGGERED RDL (one side)\nSWITCH SIDE\nSWITCH SIDE\nSWITCH SIDE\n\nFinisher: \n3 minutes non stop! \nDUMBBELL CRUNCH HOLD LEG LOWER\nDUMBBELL TOE REACH\nDUMBBELL CRUNCH HOLD LEG LOWER\n\n\nThe biceps are worked within the rows and triceps during chest press & shoulder press! There are no specific arms exercises due to this and compound movements such as chest press and rows recruit a lot more muscles over isolation so perfect for shorter workouts! \n\nWe finish with some ab specific exercises! Let’s focus on really holding that crunch during the leg lowers, pushing the lower back well into the mat and during toe reaches, how high can you crunch and reach whilst controlling the lowering back to mat? 😁\n\nPerfect workout when you want a full body resistance workout in 30 minutes!\n\nHave fun!! I sure did!! 🔥🤩\n\nCx\n\nAlways ensure you warm up before any workout. Here’s my 5 Min Warm Up Routine: https://youtu.be/c0VxUFHdYzs\n\nToday’s Optional Add-on: https://youtu.be/kZDvg92tTMc\n\nJoin The Caroline Girvan Community\n\n▶ Instagram: https://instagram.com/carolinegirvan\n▶ Private Facebook Group: https://facebook.com/groups/carolinegirvan\n\nMy Amazon Stores\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\n▶ Business Enquiries Email: info@carolinegirvan.com\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "full body workout",
    "full body",
    "workout",
    "caroline girvan",
    "full body workout at home",
    "dumbbell workout",
    "strength workout",
    "full body dumbbell workout",
    "total body workout",
    "full body workout with weights",
    "30 minute workout",
    "30 minute full body workout",
    "hypertrophy",
    "build muscle",
    "chest press",
    "chest workout",
    "dumbbell chest workout",
    "back workout",
    "abs workout",
    "6 pack abs",
    "six pack abs",
    "resistance training",
    "home workout"
  ],
  "publishedAt": "2021-11-19T04:00:06Z",
  "duration": 2289,
  "durationFormatted": "38:09",
  "viewCount": 3320789,
  "likeCount": 46454,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ScInpT_5dIQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ScInpT_5dIQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ScInpT_5dIQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ScInpT_5dIQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ScInpT_5dIQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ScInpT_5dIQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Good morning everyone!!! I am so happy to workout again! Today is my graduation ceremony, so I will save it for tomorrow! Have a nice day!!!🥳🥳🥳",
    "After 9 months, I doubled my dumbbells! What a burn! Loved it! Thanks, Caroline!",
    "Crunches at the end killed me 😂",
    "I&#39;ve been doing her regular full body workout routine and just did this one today....This lady is trying to kill us 😭😭😭",
    "I&#39;m 62, my husband is 64. We love your workouts. He calls you a &quot;beast&quot; 🥰 Thank you for providing us a way to stay fit!"
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}