{
  "video_id": "SDNnCSlD_E0",
  "title": "Babywearing Postpartum Workout (Exercise With Baby) 20-Minute Postnatal Workout",
  "description": "Join me for this 20-minute babywearing workout/postpartum workout (Exercise with baby)! You can get a good postnatal workout in while baby enjoys (or even falls asleep). \nDiastasis Recti Healing Guide: https://bit.ly/3fSE4lO\nPost Pregnancy Weight Loss Course (includes 4 meal plans by Dietitian): http://bit.ly/2mjlsF5\nGuide to postpartum weight loss while increasing breastmilk supply: http://bit.ly/3gST0C9\nPostpartum Monthly Workout Plan: https://bit.ly/2zZxQkI\nFoods to increase milk supply: https://bit.ly/37nnoBy\n\nPOSTPARTUM COOL DOWN STRETCH: https://youtu.be/-JODkvrLzhI\n\nSome other videos you may enjoy: \n15 minute postpartum workout: https://youtu.be/zCd1mB2EETw\nAfter c-section exercises: https://youtu.be/HDuJXvfuQCI\nPostnatal Pilates and Core Healing: https://youtu.be/p4BP4CU4_8M\n\n\nDiastasis Recti Exercises Playlist: https://www.youtube.com/playlist?list=PLRuFBUMIEg8BibcDkZNyq9spZcjOLeDSa\nDiaphragmatic Breathing Video: https://youtu.be/ThKahimNQP0\nHow to engage your core correctly: https://youtu.be/2ZJQgqOYNZ0\n\n*Check with your doctor before starting this or any exercise routine. Wait until you get clearance (usually 4-6 weeks or 6-8 weeks after a c-section). Don't do anything that feels painful or unsafe. Don't do any movement that causes you pain, discomfort or doming of your stomach. You are responsible for your own safety. Full disclaimer at the bottom.\n\nMore free resources: \n\n---- \"THE BEST 4 SCIENTIFIC-BASED DIETS (LIFESTYLES) TO LOSE WEIGHT\" with all 4 types of meal plans (KETO, PLANT-BASED, MEDITERRANEAN AND CALORIE COUNTING)\nhttps://www.pregnancyandchildhoodnutrition.com/weightloss\n\n---- \"HOW TO LOSE WEIGHT AND INCREASE BREAST MILK SUPPLY\"\nhttps://www.pregnancyandchildhoodnutrition.com/milksupply\n\n---- \"THE COMPLETE GUIDE TO COPE WITH PAIN IN LABOR\" \nhttps://www.pregnancyandchildhoodnutrition.com/labor-e-book\n\n----Pregnancy Yoga Cards\nhttps://www.pregnancyandchildhoodnutrition.com/yoga-cards\n\n----Pregnancy Meal Plan\nhttps://www.pregnancyandchildhoodnutrition.com/meal-plan\n\nJessica Pumple is a certified bariatric and diabetes educator, dietitian, and pre & postnatal fitness instructor.  She helps pregnant women stay fit, have healthy babies, and easier labors. She helps new moms with postpartum recovery, to heal and strengthen their core and lose the baby weight.\n\n\nIf you enjoy our content subscribe to our channel, hit the bell button, leave a comment and share with your friends so I can make you more of the videos you enjoy!\n\nDisclaimer: This is general postnatal fitness only. Please check with your doctor or health care provider to see if this video is safe for you. You are responsible for your own safety. Don’t do anything that feels unsafe for you or baby. Stop if you have any pain or discomfort, bleeding, chest pain or shortness of breath, dizziness or if you feel unwell. P&P Health Inc., Pregnancy and Postpartum TV and Jessica Pumple are not liable in any way for any injury, loss, damages, costs or expenses suffered by you in relation to this video or its content. \n\nMusic: Epidemic Sound\n\nCopyright 2021 P&P Health Inc. All rights reserved\n\n#babywearing #postpartumworkout #exercisewithbaby",
  "channelTitle": "Pregnancy and Postpartum TV",
  "channelDescription": "Passionate about spreading positivity, confidence and encouragement for a healthy and fit pregnancy, an easier delivery and fast recovery postpartum!\n\nI have 400+ free pregnancy and postpartum workouts in many different styles: Yoga, HIIT, Pilates, Dance, Diastasis Recti Safe & More.\n\n*Check out my Birth Education Playlist to create your positive and empowering birth experience.\n\n*Heal and flatten your core after birth using my DIASTASIS RECTI Playlist.\n\nI hope you find something helpful here on the channel and I’m so grateful to be able to share my passion and life with you!\n\nJessica Pumple\nRegistered Dietitian\nYoga & Fitness Instructor\nCertified Pregnancy and Postpartum Core Exercise Specialist\n\nContact: support@pregnancyandpostpartumtv.com\n\n",
  "tags": [
    "postpartum workout",
    "postnatal workout",
    "mommy and me workout",
    "babywearing workout",
    "mom and baby workout",
    "workout with baby",
    "baby workout",
    "baby wearing workout",
    "baby carrier workout",
    "carifit",
    "ergo baby carrier",
    "ergobaby",
    "baby bjorn",
    "baby bjorn carrier",
    "mommy baby workout",
    "postpartum workout with baby",
    "babywearing",
    "baby wearing",
    "babywearing exercises",
    "total body postnatal workout",
    "postnatal exercise",
    "mom and baby exercise",
    "postnatal workout with baby",
    "postnatal",
    "exercise with baby"
  ],
  "publishedAt": "2021-10-06T12:47:55Z",
  "duration": 1246,
  "durationFormatted": "20:46",
  "viewCount": 211205,
  "likeCount": 3445,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/SDNnCSlD_E0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/SDNnCSlD_E0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/SDNnCSlD_E0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/SDNnCSlD_E0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/SDNnCSlD_E0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/SDNnCSlD_E0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I love these! I would love to see more babywearing workouts since it&#39;s the only way I can do workouts at the moment lol.",
    "great workout! Baby won&#39;t let me put him down most days. Babywearing workouts take away my excuses and help me show up for myself :) thanks!",
    "If you weren’t already the reason I had such a beautiful pregnancy and easy birth. I didn’t think I would be desperate enough to YouTube “baby wearing workout” and Lowe and behold, you pop up. Thank you so much for creating this content to benefit mums throughout pregnancy, birth and postpartum. I really appreciate you 👏🏼",
    "My sweet boy is almost three weeks old and it is a life saver for me! He hates to be put down anywhere he will scream unless he’s in my arms, this allows me to move around the house and actually get a few things done which is super helpful, he typically falls asleep in there as well, I highly recommend this!",
    "My restless 10 weeks-old-baby fells asleep halfway trough.. so nice! I never heard of ‘kangatraining’ nut this was a fantastic first exercise. I did it in the kitchen with three other kids around:) And the little one wakes up when I complete…"
  ],
  "channelSubscriberCount": 2140000,
  "channelVideoCount": 1015
}