{
  "video_id": "Sl6q1igrxpk",
  "title": "30 Minute Full Body Stretching Exercises - How to Stretch to Improve Flexibility & Mobility Routine",
  "description": "Download the FREE HASfit app: \nAndroid http://bit.ly/HASfitAndroid -- iPhone http://bit.ly/HASfitiOS\nInstructions for 30 Minute Full Body Stretching Exercises - How to Stretch to Improve Flexibility & Mobility Routine: http://hasfit.com/workouts/warm-up-cool-down-stretches-stretching/30-minute-full-body-stretching-exercises/\n\nDonate on Patreon: https://www.patreon.com/hasfit\nShop the HASfit Tribe store: https://hasfit.myshopify.com/\n\nBuy Coach Kozak's book, Stay Fit For Life: http://amzn.to/2uSUJPN\n\nGet up to 2x Faster Results by following a Fitness Program Calendar:\nWhich program is right for me? http://bit.ly/2E16cng\nFoundation Beginner Program: http://bit.ly/2AnjffQ\n30 Day Muscle Building: http://bit.ly/2RqYBoO\n30 Day Torch (weight loss): http://bit.ly/2VjavR5\nMotive Home Athlete’s Plan (intermediate): http://bit.ly/2s09waU\nWarrior 90 2.0 (advanced): http://bit.ly/2QX3IxQ\nMore programs to choose from here: http://bit.ly/2E16cng\n\nHere are the Adjustable Dumbbells we use: https://amzn.to/328sAWD\nHere are the Color Coded Dumbbells we use: https://amzn.to/3wP0g9D\n\nGet our Diet Guide:\nEating For Life https://goo.gl/7qnHn4\n\nPersonal Training Services: http://hasfitpersonaltrainer.com\n\nFollow us for more!\nFacebook: https://www.facebook.com/HASFitness/\nInstagram: https://www.instagram.com/hasfit_official/\nSnapchat: @hasfit\nTwitter: https://twitter.com/HeartSoulFit\n\nDisclaimer:\nYou should consult your physician or other health care professional before starting a HASfit program or any other fitness program to determine if it is right for your needs. This is particularly true if you (or your family) have a history of high blood pressure or heart disease, or if you have ever experienced chest pain when exercising or have experienced chest pain in the past month when not engaged in physical activity, smoke, have high cholesterol, are obese, or have a bone or joint problem that could be made worse by a change in physical activity. Do not start this fitness program if your physician or health care provider advises against it. If you experience faintness, dizziness, pain or shortness of breath at any time while exercising you should stop immediately.\n \nHASfit offers health, fitness and nutritional information and is designed for educational purposes only. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. If you have any concerns or questions about your health, you should always consult with a physician or other health-care professional. Do not disregard, avoid or delay obtaining medical or health related advice from your health-care professional because of something you may have read on this site. The use of any information provided on this site is solely at your own risk.\n \nHASfit makes no warrants, promises, or claims regarding accuracy of the calories burned estimate. It is provided only as a general reference and each person should use an indirect calorimetry system for a more accurate estimate.\n \nDevelopments in medical research may impact the health, fitness and nutritional advice that appears here. No assurance can be given that the advice contained on HASfit will always include the most recent findings or developments with respect to the particular material.",
  "channelTitle": "HASfit",
  "channelDescription": "Join Coach Kozak and Claudia through over 1,000 on-demand home workout routines and exercise plans for all goals.\n\n• Named “Top Fitness App” for 10 years straight\n• 99% approval rating on over 1 Billion completed workouts\n\nBecome the best version of you with the free HASfit app:\n\n• Home workout routines for all fitness levels (limited mobility, senior, beginner, intermediate, advanced)\n• Get up to 2x faster results by following a complete fitness plan\n• Stream your workouts to your TV using your Chromecast, Roku, Amazon Fire, or AppleTV\n• Search to find your perfect workout from 3 – 60 minutes\n• Modifications to help you customize the workout for your specific needs\n• Save your favorite routines for easy access later\n• Exercise with dumbbells or no equipment\n\nDiscover new workouts added each week:\n• Fat Burning\n• HIIT & Tabata\n• Muscle Building\n• Cardio\n• Strength Training\n• Low Impact\n• Kickboxing and MMA\n• Kettlebell\n• Flexibility and Yoga\n\nFind Complete Workout Plans and Programs!\n",
  "tags": [
    "stretching exercises",
    "how to stretch",
    "mobility training",
    "mobility routine",
    "full body stretching",
    "full body stretch",
    "full body stretching routine",
    "total body stretching routine",
    "total body stretching",
    "total body stretch",
    "stretching exercises for beginners",
    "stretching",
    "stretches",
    "stretching exercise",
    "stretch exercises",
    "flexibility exercises",
    "flexibility exercise",
    "improve flexibility",
    "stretching routine",
    "stretch routine",
    "stretch workout",
    "flexibility stretches",
    "stretching workout"
  ],
  "publishedAt": "2018-01-16T12:00:02Z",
  "duration": 2102,
  "durationFormatted": "35:02",
  "viewCount": 1162061,
  "likeCount": 14990,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Sl6q1igrxpk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Sl6q1igrxpk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Sl6q1igrxpk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Sl6q1igrxpk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Sl6q1igrxpk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Sl6q1igrxpk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I am still loving all the HASfit exercise videos! It is because of these videos, plus a better diet that I, as of today, have shed 200 pounds! And that was my goal!",
    "It&#39;s crazy that this is one of the only true and healthy full body stretch videos on YouTube. Everything else is for lazy people who want to get things done in 3-5 minutes, they&#39;re more interested in convenience than health.",
    "This was such a great stretch thank you Claudia and Coach Kozak.",
    "📲For an ad-free experience, download the HASfit app: Android <a href=\"http://bit.ly/HASfitAndroid\">http://bit.ly/HASfitAndroid</a> -- iPhone <a href=\"http://bit.ly/HASfitiOS\">http://bit.ly/HASfitiOS</a><br> 🙏Please help us spread the word by telling your friends and family about us! <br> 👍Don&#39;t forget to hit the LIKE button and SUBSCRIBE",
    "Excellent instruction! Just what I&#39;ve been looking for. Thank you for videos that aren&#39;t annoying."
  ],
  "channelSubscriberCount": 2110000,
  "channelVideoCount": 1789
}