{
  "video_id": "sOuKeVuej9E",
  "title": "How To Unlock Your Mobility in 5 Minutes (DAILY STRETCH)",
  "description": "If we don’t regularly use the full range of motion of our joints through mobility training, we quickly lose our ability to do so. This hurts our full body mobility; the shoulders, hips, back, and ankles just don’t move like they may have used to. So, today, I’ll show you how by focusing on the right areas and the right mobility exercises, you can significantly improve your mobility through just a 5 min stretch routine. Implement this daily stretch routine and you’ll feel better, your lifts will improve, and you’ll likely soon notice an unlocking of tight and sleepy muscles that you may have never even known existed.\n\nFirst, what makes this 5 min stretch routine so effective? Well, the shorter a stretching routine is, the more likely you’ll be able to stick to it. And second, because this routine is only 5 minutes, we need to make sure it focuses on areas that need the most help. That’s why we picked 3 key areas: the hips, the upper back, and the ankles. \n\nThe first move of our daily stretch routine will be used to loosen up the spine and our back muscles in preparation for our next exercises. To perform it, get onto all fours with your knees under your hips and hands under your shoulders. From here, in a gentle motion, round your back up towards the ceiling. As you do this, take a deep breath in while tucking your head down. Then, exhale as you reverse this motion. \n\nThe next of our mobility exercises is called the “World’s Greatest Stretch”. Get into a plank position with your hands under your shoulders and feet together. From here, lunge forward by bringing your right foot up as high as you can. Next, take your right hand, place it on your knee and push your knee out and back and then forward and back a few times. Then, try to drop your right elbow as far towards the ground as you can while rotating your upper body down towards the ground. To really open up the mid and upper back, rotate your entire upper body up and to the right and reach your right arm as far overhead as you can. Then, reach back down and repeat this for 5 reps or about 30 seconds in total before switching to the next side. \n\nUp next on our mobility training, the modified Asian squat. First, get a rolled up towel and place your heels on it. From here, using a squat stance which is typically just outside shoulder width, squat down into however deep is comfortable for you. Keep your chest up and try to keep your heels down. From here, place your arms on the inside of your legs and use your elbows to push your knees out. Sit in this position for 30 seconds. For the next 30 seconds, move side to side to stretch out each ankle one at a time. \n\nNext, we’re going to really focus on mobilizing the upper back. Get into a half kneeling position with your right leg bent as close to the wall as you can get it, and your left leg planted forward in a lunge position. Place both arms directly in front of you with your right arm making contact with the wall. From here, push your right hand into the wall as you rotate your upper body to the left, trying to reach your left arm to the other side of the wall. Return to the starting position and then repeat for 30 seconds before switching sides.\n\nThe exercise we’ll use are wall slides. To perform it, stand with your back against a wall and contract your abs to flatten your lower back on the wall. Then, slide your arms up and down the wall. To make this easier when starting out, place your feet further away from the wall. Then over time, try to get your feet closer and closer to the wall while trying your best to keep your lower back flat against the wall. \n\nHere is the full 5 minute routine that’ll help with full body mobility: \n\nExercise 1: Cat Cow (60 seconds)\nExercise 2: World’s Greatest Stretch (30 seconds per side)\nExercise 3: Asian Squat (30 seconds hold, 30 seconds rock side to side)\nExercise 4: Half Kneeling Thoracic Rotations (30 seconds) \nExercise 5: Wall Slides\n\nFocus on doing as many high-quality reps as you can within the 1 minute you have for each exercise. Implement this daily, make an effort to move more, and supplement this with exercises in the gym like split squats and overhead presses that help you actually use your new mobility, and you’ll very quickly notice a massive improvement in how you move and feel. And for a step-by-step program that takes a holistic, science-based approach to transforming your body by focusing not just on your workouts but also on your nutrition, your mobility, and your recovery, simply take our analysis quiz to discover which of our programs are best for you and your body below:\nhttps://builtwithscience.com/your-potential-realized/?utm_source=YouTube&utm_medium=Video&utm_campaign=The+5+Minute+Daily+Stretch+To+Unlock+Your+Muscles+%285+Exercises%21%29&utm_term=27%2F02%2F2022\n\nMOBILITY ROUTINE PDF DOWNLOAD:\nhttps://builtwithscience.com/dailystretch/\n\nSubscribe to my channel here:\nhttps://www.youtube.com/jeremyethier/?sub_confirmation=1",
  "channelTitle": "Jeremy Ethier",
  "channelDescription": "This channel is focused on providing science-backed training and nutritional videos in order to help you become the best version of yourself. I'm certified by NASM and FMS (functional movement screening), and a Kinesiology graduate based in Vancouver, Canada. I focus on providing unbiased information to help you optimize your training and nutrition.",
  "tags": [
    "mobility training",
    "full body mobility",
    "5 min stretch",
    "daily stretch routine",
    "mobility exercises stretching",
    "flexibility routine",
    "mobility routines",
    "stretching routines",
    "daily stretch",
    "mobility workout",
    "mobility stretches",
    "stretching exercises",
    "builtwithscience",
    "jeremyethier",
    "perfect posture routine",
    "10 minute mobility routine",
    "best posture routine",
    "how to fix posture",
    "how to fix bad posture",
    "daily stretches"
  ],
  "publishedAt": "2022-02-27T16:19:38Z",
  "duration": 629,
  "durationFormatted": "10:29",
  "viewCount": 5889690,
  "likeCount": 235238,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/sOuKeVuej9E/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/sOuKeVuej9E/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/sOuKeVuej9E/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/sOuKeVuej9E/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/sOuKeVuej9E/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/sOuKeVuej9E\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Here&#39;s the mobile friendly downloadable guide with the full routine and tutorials: <a href=\"https://builtwithscience.com/dailystretch\">https://builtwithscience.com/dailystretch</a> . Comment below how you feel after trying the stretches out and comment how you&#39;re progressing overtime as you stay consistent with it! Would love to hear about the results! Hope this helps!",
    "1- <a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=161\">2:41</a> Cat Cow ( 60 Seconds - 7-8 Cycles )<br>2- <a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=220\">3:40</a> Worlds Greatest Strech ( 30 Seconds per sides )<br>3- <a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=320\">5:20</a> Asian Squat ( 30 Seconds Hold, 30 Seconds side-to-side )<br>4- <a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=431\">7:11</a> Half Kneeling Thoracic Rotation ( 30 Seconds )<br>5- <a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=515\">8:35</a> Wall Slides ( 60 Seconds )<br><br>( Reference )",
    "<a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=162\">2:42</a> cat cow (1min)<br><a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=220\">3:40</a> world&#39;s greatest stretch (30sec each side)<br><a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=319\">5:19</a> asian squat (30sec hold, 30sec rock side to side)<br><a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=426\">7:06</a> half kneeling thoracic rotation (30sec each side)<br><a href=\"https://www.youtube.com/watch?v=sOuKeVuej9E&amp;t=513\">8:33</a> wall slides (1min)",
    "PT student here and long time follower. Your evidence based content is so appreciated and reliable. It&#39;s great when you even back it up with citations. This guy seriously knows his stuff",
    "Can&#39;t thank you enough, I&#39;m pretty fit for 60....but now I&#39;m developing the flexibility of someone half my age!! Health is wealth...keep up the great works."
  ],
  "channelSubscriberCount": 7100000,
  "channelVideoCount": 301
}