{
  "video_id": "ssss7V1_eyA",
  "title": "5 Minute Mindfulness Meditation",
  "description": "Here you can listen to one of our original 5 minute guided mindfulness meditations, recorded by us...  for you to use when you are short on time, but still want to get into a mindful state of mind.  Even five minutes can produce major benefits, give it a try... Enjoy!\n\nSpoken Voice: Original Commentary recorded by us.\nBackground Music: Composed by a member of this channel.\nBackground Image: is an original derivative created by us, Transformed from, and licensed by images from Shutterstock.com and other royalty free licenses where attributions are not required.",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "meditation",
    "5 minute meditation",
    "guided meditation",
    "morning meditation",
    "mindfulness meditation",
    "meditation guided",
    "meditation 5 minutes",
    "meditation morning",
    "meditation mindfulness",
    "guided meditation 5 minutes",
    "guided meditation mindfulness",
    "guided meditation morning"
  ],
  "publishedAt": "2021-03-07T10:00:16Z",
  "duration": 315,
  "durationFormatted": "5:15",
  "viewCount": 5295720,
  "likeCount": 83098,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ssss7V1_eyA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ssss7V1_eyA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ssss7V1_eyA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ssss7V1_eyA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ssss7V1_eyA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ssss7V1_eyA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "If you are reading this right now, may God heal your broken heart, remove your pain, stress, depression, anxiety, worries and problems. May He replace them with good health, peace, happiness and joy.💖",
    "Quite possibly the fastest 5 minutes of my life, very relaxing",
    "Everything has been hitting me all at once lately. Financial stress, work-life stress, emotional stress, etc. But I decided to try this meditation during my lunch instead of sitting and not doing anything (because I don&#39;t have money for lunch). It helped improve my mood drastically.<br><br>Edit to update: Things have gotten better. I quit my old job and started another one closer to home. My boyfriend also works there, so we are saving money on gas, plus this job pays more since it is overnight. Things are really starting to work out for us. Now we are looking for land to move out trailer on and build the house we want.<br><br>Edit 2 (08/08/2022): We did it! We got a house! We had to move and therefore move jobs, but we did it. Now we have a cat room and a guest room in addition to our own bedroom. We don&#39;t have a washer and or dryer yet, but that will come in time. Depression and anxiety still kick my butt though, especially lately.. probably just buyers remorse or something.",
    "Anyone else trying to make this a daily habit for 2025?",
    "I promise you’re saving lives, thank you ❤️"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}