{
  "video_id": "SvPKFsCiMsw",
  "title": "10 Minute Yoga Full Body Stretch for Stiff Bodies",
  "description": "Do this gentle 10 minute yoga class to release tension and stiffness from the entire body. This yoga for stiff bodies class is perfect to do every morning or anytime you need a bit of movement. You can even use this practice as a warm up before a longer yoga class or right before or after your workout or run. Join me in this quick 10 minute morning yoga full body stretch to feel your best!\n\n#Yoga #10MinuteYoga #YogaWithBird\n\nThe Katia Bodysuit  i am wearing is gifted to me by Babelicious Wear which i am absolutely in love with! As you may know i hate wearing alot of clothing to practice yoga in because wearing less is less restricting and freeing for me personally. Babelicious body suits truly feel like a second skin and allows you to focus on the practice rather than pulling and tugging on your leggings.\n\nYou are able to purchase your own now through to December 10th and after that you may sign up to be on the wait list.\n\nWebsite: https://www.babeliciouswear.com/\nWaitlist: https://lnk.bio/babeliciouswear\nInstagram: https://www.instagram.com/babeliciouswear/\n#badassZenBabes\n\n & support.\n\n________________________________________\n\nJoin Yoga With Bird's Email List: https://mailchi.mp/34e952e0ed28/yoga-with-bird-email-list\n\nIMPORTANT LINKS: https://linktr.ee/yogawithbird\n\nYoga Essentials:\nYoga Mat: https://amzn.to/31wXrLM\nYoga Blocks (Cork): https://amzn.to/3inS083\nYoga Blocks (Foam): https://amzn.to/3ngkJ2e\nYoga Strap: https://amzn.to/36tk8nW\nPranamat: https://amzn.to/31z0aEj\nYogaWheel: https://amzn.to/3ilXrEx\n\nVisit My Amazon Store For All My Must Haves!:\n\n\nMusic: https://www.epidemicsound.com/referral/qnrd89/\n\nJoin Honey to SAVE money while shopping online: https://www.joinhoney.com/ref/45p0vps\n\nNOTE: Some links may be affiliate links that Yoga With Bird earns a small percentage of however each affiliate product is something she genuinely loves and has used herself.\n\n________________________________________\n\nYOGA CHALLENGES:\n\n30 Day Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlybJmrSb19MiVWnve5slKTJ\n\n30 Day Restorative Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwr-X3VF2CrZdf7rDrWH1aB\n\n7 Day Yoga For Overall Health: https://www.youtube.com/playlist?list=PLCIrre1vyDlyTB8gu7I99XQkw9M85YdTk\n\n5 Day Morning Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlyjr87XsR6j4QGzyKKxwsTH\n\n5 Day Hip Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwAnZvLflZM-e5WWedHTBpo\n\n________________________________________\n\nABOUT THIS YOUTUBE YOGA CHANNEL\n\nFrancine Cipollone also known as her childhood nickname Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation. She created this YouTube Yoga Channel to offer a space where yoga is accessible to all. This channel is all about feeling good and reconnecting to self. Yoga is for every-BODY, Join the journey by Subscribing today: https://www.youtube.com/yogawithbird\n\n________________________________________\n\nDISCLAIMER: \nPlease consult your physician before joining in on this practice. By participating in this activity you acknowledge that yoga is a physical discipline that requires a certain amount of mental concentration and physical strength and endurance. You agree to work according to your own limitations and take full responsibility for your own safety and well-being. Listen to your body at all times and never do anything that causes pain. You acknowledge that participation in this activity exposes you to a possible risk of personal injury. You are fully aware of this risk and hereby release Yoga With Bird/Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "yoga",
    "10 minute yoga full body stretch",
    "10 minute yoga",
    "10 minute morning yoga",
    "morning yoga",
    "full body stretch",
    "10 min yoga",
    "10 minute yoga stretch",
    "yoga stretch",
    "yoga for stiff bodies",
    "10 minute yoga for stiff bodies",
    "yoga class",
    "free yoga",
    "yoga with bird",
    "10 minute yoga with bird",
    "full body stretch yoga with bird",
    "yoga with bird full body stretch",
    "yoga for muscle stiffness",
    "stretches for stiff body",
    "10 minute morning yoga full body stretch",
    "full body yoga"
  ],
  "publishedAt": "2020-12-01T17:51:37Z",
  "duration": 617,
  "durationFormatted": "10:17",
  "viewCount": 6563712,
  "likeCount": 141996,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/SvPKFsCiMsw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/SvPKFsCiMsw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/SvPKFsCiMsw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/SvPKFsCiMsw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/SvPKFsCiMsw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/SvPKFsCiMsw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "One thing I appreciate is your moments of quiet. Lots of other yoga leaders talk about calm, but they talk so much that it&#39;s hard to find it.",
    "As a 20-something who has a full systemic autoimmune disease and history of ovarian cancer my body is STIFF all the time! This has helped so much. I even got my fiancee to start doing this with me and it&#39;s been so helpful for the both of us. Thank you so much!",
    "Does anyone else feel an emotional release during this practice? This brought on such a feeling of gratitude and love for my body, it made me cry 😅 Thank you for the peaceful and uplifting video, it was just what I needed today",
    "Before i did this, i felt like a slug, i could not get out of bed and my legs and head were KILLING ME so i thought to my self, &quot;maybe if i do a 10 minute yoga session i will feel a bit better?&quot; So i searched up &quot;yoga 10 minutes, and this was the first thing that popped up, i decided to try it, and within half of it, I felt SO much better my legs almost completely stopped hurting and i felt less overwhelmed and i felt like i was back to my normal self again. Thank you."
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}