{
  "video_id": "sWrgKDzM0LU",
  "title": "Guided Mindfulness Meditation for the Morning: Starting the Day (15 minutes)",
  "description": "I just created a 12-page meditation guide that I want to be yours for FREE! Just visit my new website at http://www.mindfulpeacejourney.com and it's yours. I put a lot of work into it to make it a great resource for you, so I hope that you enjoy and find great benefit. Thanks for listening! \n\nSUPPORT US ON PATREON and get SoundCloud streaming:\n🙏https://www.patreon.com/mindfulpeace/\n\nThis is a meditation session that will help you start off your day feeling positive and uplifted, and to have a sense of calm and contentedness all throughout your entire day. You will be able to better connect with yourself, and your surroundings, and be able to deal with any situation that comes your way. Calm, aware, and present.\n\nI recommend listening on headphones, first thing when you wake up in the morning. I hope this guided session helps you to reduce anxiety, have more energy, and just be happy and healthy!\n\nSEE ALL OF THE MEDITATION VIDEO SESSIONS AND SUBSCRIBE: \n💛http://www.youtube.com/c/mindfulpeace/\n------------\nJOIN OUR FACEBOOK PAGE:\n🤝https://www.facebook.com/mindfulpeacejourney/\n\n\nThis content is for educational/entertainment purposes only. No information is to be taken as medical advice. All dialogue, music, and imagery is original by Mindful Peace Journey. Thank you for watching and please subscribe!\n\n#meditation #mindfulness #morning",
  "channelTitle": "MindfulPeace",
  "channelDescription": "Original deep, calming meditation videos to promote mindfulness and inner peace for any spiritual belief. Have less anxiety, get better sleep, and experience more joy through mindfulness and meditation!",
  "tags": [
    "meditation",
    "peace",
    "guided",
    "mindful",
    "calm",
    "morning",
    "mindfulness",
    "zen",
    "transcendental",
    "relax",
    "yoga",
    "soundscape",
    "ambient"
  ],
  "publishedAt": "2016-06-06T18:14:31Z",
  "duration": 901,
  "durationFormatted": "15:01",
  "viewCount": 1917014,
  "likeCount": 24148,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/sWrgKDzM0LU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/sWrgKDzM0LU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/sWrgKDzM0LU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/sWrgKDzM0LU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/sWrgKDzM0LU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/sWrgKDzM0LU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This meditation and hours of others are available as audio streams via SoundCloud to Patreon supporters! <a href=\"https://www.patreon.com/mindfulpeace\">https://www.patreon.com/mindfulpeace</a><br>I hope you have a wonderful day :)",
    "Remember that feeling you&#39;d get when your whole life was ahead of you? As you listen to this hold that feeling. Then know that you are still young no matter how old you are and that your inner being will always be young as it continues on, into life after life. Knowing this will aid you to manifest on as this life&#39;s inevitable challenges and sorrows try and beak your spirit. All is well. Be well. All conditions are temporary. Nothing matters.",
    "When he said: &quot;good morning&quot; at the end of the video i smiled from the heart. Thank you 🙏",
    "5. I am embrace today <br>4. I am aware of my energy. <br>3. I am aware of the energy around me. <br>2. I remain calm. <br>1. I am at peace. <br><br>Thank you. This meditation is beautiful.",
    "I couldn’t do all of it without crying, but I’m proud of myself. Shits been really hard lately but this will hopefully be a step in the right direction. at least I’m trying now."
  ],
  "channelSubscriberCount": 229000,
  "channelVideoCount": 217
}