{
  "video_id": "Sxddnugwu-8",
  "title": "Yoga For Depression - Yoga With Adriene",
  "description": "Yoga For Depression is a 15 min yoga practice to help balance and restore both the physical and emotional body. Tend to your nervous system through mindful yoga to tend to the brain and body connect in a powerful way. With a focus on the breath, this yoga practice invites you to be kind, be accepting, practice regularly, and heal naturally.\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga (sport)",
    "yoga for depression",
    "depression (symptom)",
    "yoga for stress relief",
    "yoga for anxiety",
    "wellness",
    "yoga at home",
    "yoga for happiness",
    "austin yoga instructor",
    "yoga for healing",
    "yoga for health",
    "morning yoga",
    "yoga for beginners",
    "yoga with adrienne",
    "yoga practice",
    "free yoga",
    "yoga workout",
    "online yoga",
    "online yoga class",
    "yoga therapy"
  ],
  "publishedAt": "2017-07-16T08:00:01Z",
  "duration": 945,
  "durationFormatted": "15:45",
  "viewCount": 2121323,
  "likeCount": 42188,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Sxddnugwu-8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Sxddnugwu-8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Sxddnugwu-8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Sxddnugwu-8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Sxddnugwu-8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Sxddnugwu-8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I wanted to say that this morning I was looking at my phone feeling so alone and wishing that someone would call or text, got a notification email and thought it was just some sale advertisement, but it was yours. It may sound stupid but with you and your wonderful spirit I do not feel so lonely, and I feel very special after this practice. This really brought me out of a dark place tonight. I hope you know how much of a blessing these free yoga videos are and how you&#39;ve really changed my life for the better through your channel. I love you Adriene!",
    "To everyone struggling with this issue. You&#39;re strong and you will get through it. One moment at a time. You&#39;re awesome!",
    "When she said “trust yourself” I started to cry. Thank you Adriene. For anyone who see this comment, you are amazing.",
    "Not sure who needs to hear this - if things are rough for you right now, hang in there. This storm will pass. Just keep putting one foot in front of the other. Baby steps, my dear. As long as you don’t quit, you will reach the summit. Remember, baby steps are all it takes. Take a brief moment to rest, refuel, and come back stronger. You can do this. And when you reach the top, you’ll be glad you didn’t stop. Slowly, but surely, you’ll get there. Don’t give up. You can do this. ❤️",
    "Just 5 min before I decided to do this video, I was crying so much that my body was starting to hurt. I am not yoga person so i just searched some depression yoga and clicked. I was afraid of some difficult poses and what I&#39;ve got was literally a cure for my pain. I think I&#39;m gonna do your videos daily so I can start to feel like myself again and push away all the dark thoughts. Thank you. (Sorry for my english, it&#39;s not my first language)"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}