{
  "video_id": "SXS6kLqPYAY",
  "title": "Saturday Sweat Session | 45 Min Rhythm Ride Indoor Cycling Workout",
  "description": "We're ending this week with a good rhythm ride indoor cycling sweat session on your exercise bike! Bring two towels for this indoor cycling workout!\n\nTHE AFTER PARTY! 🔥🔥 WANT MORE?! Make the most of your workout with this quick Tabata Burner! https://youtu.be/zus6t02H8oM\n\nI'm so glad you decided to join my cycling class today, let's go for a ride! Grab your water bottle, grab your towel, get on your bike and let's get these pedals spinning! - Kaleigh Cohen Fitness\n\nCheck out our website here! 👉 https://www.kaleighcohen.com\n\nBecome a Kaleigh Cohen Fitness channel member here! 👉 https://www.youtube.com/channel/UChY_9WJx0saa0St48lSdytQ/join\n\n⭐️ Check out my Amazon Store here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️ Save 15% on indoor cycling shoes here! Use code KCF15 at checkout! 👉  http://shimanoindoor.com/discount/KCF15\n\n⭐️ The best tablet mount for your spin bike!👉 https://bit.ly/2UeHHK1\n\nEmail your success story here! 👉 kaleighcfitness@gmail.com\n\n For those of you that asked how you can help support these indoor cycling workouts 👉 https://www.buymeacoffee.com/kaleighcohen\n\nNew to my indoor cycling workouts? START HERE! 👉  https://www.youtube.com/playlist?list=PLBJ0TIYiwZzjLnd3RU_J2y-dm9a34Ggw3\n\nIf you are doing this class on a stationary bike or exercise bike instead of a traditional spin bike and cannot go into the standing positions (2nd and 3rd) and would like an added challenge during these, TRY THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance here but try and keep the same cadence. \n\n🎶 This playlist can be found at my Spotify 👉  https://open.spotify.com/playlist/5wPrTJVzNXqlXjDmqAUxFQ?si=V1hwgeamTh604u9RNiK9dQ\n\nLet’s connect!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\nSubscribe for more cycling workouts👉  https://www.youtube.com/kaleighcohenfitness\n\nShare this cycling workout with a friend👉  https://youtu.be/braeYJ7NZzc\n\nNext cycling workout!👉  https://youtu.be/edsm9m_fbnU\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spinning class when I was 15. Since then I've been addicted to spin classes and indoor cycling workouts. Now, as a certified Spin class Instructor and certified fitness trainer, my goal is to provide you with fun, motivating, and energizing cycling and strength workouts that motivate you to be YOUR BEST YOU! This is cycling motivation! Thanks for cycling with me!\n\n\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n#LIVE #KaleighCohen #IndoorCyclingWorkout #SpinClass #SpinningClass",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "rhythm ride",
    "rhythm ride spin class",
    "exercise bike",
    "exercise bike workout",
    "cycling",
    "cycling workout",
    "indoor cycling",
    "kaleigh cohen",
    "kaleigh cohen spin",
    "rhythm spin class",
    "rhythm spin class workout",
    "rhythm ride cycling",
    "kaleigh cohen spin class",
    "bike workout to lose weight",
    "stationary bike",
    "spin class",
    "spinning class",
    "indoor cycling workouts",
    "kaleigh cohen fitness"
  ],
  "publishedAt": "2021-03-06T15:33:17Z",
  "duration": 3011,
  "durationFormatted": "50:11",
  "viewCount": 25820,
  "likeCount": 1171,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/SXS6kLqPYAY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/SXS6kLqPYAY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/SXS6kLqPYAY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/SXS6kLqPYAY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/SXS6kLqPYAY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/SXS6kLqPYAY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "The BEST class I have ever done including even the in person class studio ones!!!!! You guys rock and always create an atmosphere that makes us feel we are riding right along with you!! So appreciate all the HARD WORK AND PLANNING you put into every class!!!! We are so lucky to have you guys!!!!! : )",
    "This takes me back, before the Stella barks, reading comments during and the special effects; though, it still has the blown horn!  Been a fan for years!",
    "Wohoooo!!! Thank you Kaleigh. This was a great one 🎉 as usual. I love your variety, that’s why I keep showing up. Attendance for Wednesday! ❤❤❤❤❤❤❤",
    "That was so fantastically fun and sweaty!!😅Loved it love you Kayleigh and Jason.. ❤sweet Stella too!! I am sure she was having a nightmare that she was spinning 😂",
    "Old live rides has been the mood this week💜 this is a fun one!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}