{
  "video_id": "syx3a1_LeFo",
  "title": "Daily Calm | 10 Minute Mindfulness Meditation | Letting Go",
  "description": "Stress less, live more. → https://cal.mn/40off\n\nTamara Levitt guides this 10 minute Daily Calm mindfulness meditation on letting go.\n\nThe Daily Calm is a unique mix of meditation and inspiration everyday. A daily meditation practice helps with lessening anxiety, worry and stress, while enhancing   self-esteem and self-acceptance. It also improves resilience against uncertainty and adversity.",
  "channelTitle": "Calm",
  "channelDescription": "Our mission is to make the world healthier and happier through the super power of calm. \n\nThere are lots of benefits to meditation, such as decreasing anxiety, worry and stress.\n\nIt enhances self-awareness, self-acceptance and patience. And it strengthens our resilience amidst uncertainty and adversity. Who wouldn’t benefit from a little bit of that?\n \nCalm is all about mindfulness, the practice of paying attention to our thoughts, emotions and experiences without judgement.\n\nWhen we’re able to maintain moment-to-moment awareness, we can make the choices that best serve us in life. If you’re like us, you were drawn to mindfulness and meditation to live a happier, more peaceful, authentic life.",
  "tags": [
    "meditation",
    "anxiety",
    "self-esteem",
    "inspiration",
    "calm",
    "relaxation",
    "mind",
    "resilience"
  ],
  "publishedAt": "2016-09-10T00:08:04Z",
  "duration": 635,
  "durationFormatted": "10:35",
  "viewCount": 9382131,
  "likeCount": 99596,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/syx3a1_LeFo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/syx3a1_LeFo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/syx3a1_LeFo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/syx3a1_LeFo/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/syx3a1_LeFo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "i&#39;m still a teenager and lost my mom 2 weeks ago unexpectedly,  this is the first time i&#39;ve been truly able to find peace within myself since finding her. thank you.",
    "I wish everyone the happiest lives they could live. You deserve it. You’re worth something, don’t ever doubt it.",
    "I have learned through mindfulness that a thought is just a thought. Not to attach myself to it. I like hearing that. Its  wonderful!",
    "30 years old. Lost 8 years of my life surrendering to mental illness then to substance addiction. Have cut back on addictions a lot, but am withdrawing from extreme stimulation, namely dopamine. I have been zoning out a lot even being socially awkward because my brain chemistry is readjusting. I gotta do this, gotta change and become the person to have the life I want. We all here are worth that. <br><br>I did this just now for first time. First few minutes were boring, middle few minutes agonizing thoughts of toxic self defeat and bitter sadness, last few were serenity and hope. I&#39;m a man who never cries and I honestly feel like it right now. <br><br>Sending love and energy to you all.",
    "I was in the middle of having the biggest emotional breakdown of my life, this video calmed me down and let me be in a neutral place. I can&#39;t thank you enough. I now release all the negativity I have been clinging onto. I allow love and peace to enter."
  ],
  "channelSubscriberCount": 1130000,
  "channelVideoCount": 844
}