{
  "video_id": "t2jel6q1GRk",
  "title": "Quick Morning Stretching Routine For Flexibility, Mobility, And Stiffness!",
  "description": "8-Minute total-body stretching routine to alleviate tight muscles, stiff joints, and body aches and pains! Improve flexibility and mobility by following along with this complete total-body routine first thing every morning. Led by a doctor of physical therapy to stretch every major muscle across every major joint in your body so you feel loose and limber in no time!\n\n===================================\n\n🔗 LINK TO JARED’S THICK EXERCISE MAT: https://urlgeni.us/amzn/drjaredexercisemat\n\n===================================\n\nWHY DOES MY BODY ACHE IN THE MORNING?\nYour muscles and joints thrive on movement. It’s this movement that keeps your body loose and your joints moving freely.\n\nAs we sleep through the night and no motion is occurring, it causes stiffness to increase in our muscles and joints. One of the best ways to get rid of this is with a simple, quick stretching routine performed first thing in the morning.\n\nWELCOME TO YOUR PAIN-FREE MORNING\nThis 8-minute morning stretch routine can transform your mornings! Say goodbye to discomfort and stiffness as we guide you through gentle yet effective stretches that will leave you feeling ready to conquer the day. Yes - you can actually feel younger as range of motion in creases and the quality of your motion improves.\n\nWHY MORNING STRETCHES MATTER\nLearn about the importance of morning stretches and how they can make a significant impact on your overall well-being. We'll explain why muscles and joints tend to stiffen up overnight and how our routine can help you maintain flexibility and reduce daily discomfort.\n\nTHE POWER OF A MORNING STRETCH ROUTINE\nJoin us in this revitalizing journey as we introduce you to a series of targeted stretches designed to alleviate aches and pains in the areas that need them the most. Discover the benefits of each stretch and how they contribute to a more active and pain-free lifestyle.\n\nTOTAL-BODY MORNING STRETCHING ROUTINE:\nLumbar Rotation Stretch\nThoracic Rotation Stretch\nUpper Trap Stretch\nCat/Cow\nHip Flexor Stretch R\nHamstring Stretch L\nAdductor Stretch L\nAdductor Stretch R\nHip Flexor Stretch L\nHamstring Stretch R\nChest Opener Stretch\nOverhead and W Stretch\n\n💬 Did you try the stretches in this video? Did they help you start your day feeling refreshed and pain-free? Share your experience in a COMMENT, and let us know how you feel!\n\n👍🏼 If you enjoyed this video, please hit the THUMBS UP button to LIKE it. Your support helps more people find our content on YouTube, and we appreciate it!\n\n✅ For more energizing routines and helpful tips, be sure to SUBSCRIBE to our channel. Click the SUBSCRIBE BUTTON and hit the notification \"bell\" to stay updated on our latest videos.\n\n===============================\n⭐️ BE SURE TO WATCH THESE OTHER VIDEOS FROM T&T:\n🔗 6-MIN WORKOUT TO IMPROVE CORE STRENGTH: https://youtu.be/pJp08smdcFk\n🔗 STRETCHING ROUTINE FOR PEOPLE WHO AREN’T FLEXIBLE: https://youtu.be/FI51zRzgIe4\n🔗 NIGHTTIME STRETCHING ROUTINE TO SLEEP BETTER: https://youtu.be/4XX6AHSYgHA\n🔗 TOTAL SPINE STRETCHING ROUTINE [FOLLOW ALONG]: https://youtu.be/GMKt9cDPVO8\n===============================\n\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. T&T Digital Media, LLC makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.",
  "channelTitle": "Tone and Tighten",
  "channelDescription": "Hi - I'm Jared! I am a doctor of physical therapy who specializes in rehabilitating orthopedic (back, neck, shoulder, knee, etc) and postpartum (diastasis recti) conditions. I love being fit, healthy, strong, and active, and hope to help you accomplish your fitness goals. On this channel you'll learn best treatments for common injuries through exercising and stretching, and how to become a fitter, healthier version of yourself. Please consider subscribing!\n\nDISCLAIMER: The content on this channel is NOT medical advice and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Use of this content is at your sole risk.\n",
  "tags": [
    "morning stretching exercises",
    "morning stretching",
    "morning stretching exercises for beginners",
    "morning stretching routines",
    "morning stretching routines for flexibility",
    "morning stretching in bed",
    "mornin stretching exercises for men",
    "morning stretching for beginners",
    "stretching routine",
    "stretching routine for flexibility",
    "stretching routine for pain",
    "Jared Beckstrand",
    "Tone and Tighten",
    "stretching",
    "morning stretch",
    "full body stretch"
  ],
  "publishedAt": "2023-09-07T12:15:07Z",
  "duration": 551,
  "durationFormatted": "9:11",
  "viewCount": 3134503,
  "likeCount": 58075,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/t2jel6q1GRk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/t2jel6q1GRk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/t2jel6q1GRk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/t2jel6q1GRk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/t2jel6q1GRk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/t2jel6q1GRk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Did you try this routine? What did you think? COMMENT your experience down below and remember to come back and do it consistently for maximum benefit! Also, I always supplement my stretching with strengthening - here&#39;s a quick 6-minute core workout you should do every day: <a href=\"https://www.youtube.com/watch?v=pJp08smdcFk\">https://youtu.be/pJp08smdcFk</a> Thanks so much for watching! 🙏🏼",
    "<a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk\">0:00</a> intro<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=51\">0:51</a> lumbar rotation stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=110\">1:50</a> thoracic rotation stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=170\">2:50</a> upper trapezius stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=230\">3:50</a> cat/cow<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=290\">4:50</a> right hip flexor stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=320\">5:20</a> left hamstring stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=350\">5:50</a> left adductor stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=380\">6:20</a> right adductor stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=410\">6:50</a> left hip flexor stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=440\">7:20</a> right hamstring stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=470\">7:50</a> chest open stretch<br><a href=\"https://www.youtube.com/watch?v=t2jel6q1GRk&amp;t=500\">8:20</a> over head w stretch",
    "I just did them, just rolled off the bed and got on the floor. Thank you for the morning stretches",
    "Thank you so so much for this!! It’s been a lifesaver. I have been having lower back pain for the past two days, tried various lower back stretches only to feel worse… but then I remembered how helpful this stretch routine is. Already feel so much better. Easy to follow and very effective. I will make sure to do it every morning henceforth. 🧘🏻‍♀️",
    "I’ve been doing the stretches for a week, I feel and move A lot better in my splits  have been getting even closer to being all the way down! Thank you so much!"
  ],
  "channelSubscriberCount": 2750000,
  "channelVideoCount": 641
}