{
  "video_id": "t3kL5gswXAc",
  "title": "30 min Full Body Resistance Training with Dumbbells",
  "description": "FULL BODY FIRM!!! We are working through a well-rounded total body resistance training session to strengthen and shape! This workout includes loads of exercise that build a strong core and a solid foundation to improve your overall total body strength!\n\nThis workout includes several compound moves as well as a few isolation moves and this combo creates a tough but rewarding 30-minute muscle-building routine!\n\nWhile we will still focus on going heavy, for this workout in particular, because we have lots of combination moves, choose moderately heavy dumbbells for your exercises to ensure that you can keep proper form throughout! \n\nFULL BODY STRENGTH TRAINING DUMBBELL WORKOUT STRUCTURE AND EXERCISES\nMUSCLES TARGETED: We work it all with an emphasis on moves that incorporate your core!\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 45lbs / 4.5 - 20kg\n- EXERCISE MAT\n\nSTRUCTURE\n3 ROUNDS\n4 EXERCISES PER ROUND\nREPEAT EACH ROUND 2\nWORK: 50 SECONDS REST: 20 SECONDS\nROUND REST: 45 SECONDS\n\nEXERCISE LIST\nROUND 1\n- SQUAT TO SHOULDER PRESS\n- REVERSE LUNGE WITH LATERAL RAISE\n- TRICEP OVERHEAD EXTENSION\n- CLOSE GRIP CHEST PRESS WITH GLUTE BRIDGE ISOMETRIC HOLD\nROUND 2\n- SUMO SQUAT WITH HAMMER CURL\n- SUMO DEADLIFT\n- SINGLE-LEG KICKSTAND ROMANIAN DEADLIFT WITH SINGLE-ARM ROW\n- SWITCH SIDES\nROUND 3\n- KNEELING BENT OVER ALTERNATING ROW\n- PUSHUPS\n- DEAD BUG\n- REVERSE CRUNCH\n\nThanks for working out with me! It's always better to work out with a friend!\n\nKaleigh\n\n⭐️ Don't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\n⭐️ Find tips, recipes, and more here! 👉  https://www.kaleighcohen.com \n\n⭐️ Find all of the equipment used for these workouts here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ Tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2023-01-05T09:59:24Z",
  "duration": 1935,
  "durationFormatted": "32:15",
  "viewCount": 643450,
  "likeCount": 13072,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/t3kL5gswXAc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/t3kL5gswXAc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/t3kL5gswXAc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/t3kL5gswXAc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/t3kL5gswXAc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/t3kL5gswXAc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Your puppy!!!  ❤😅 He’s like “watch me, this is how I work out!” 😂😂😂",
    "Whatever muscle that wasn’t sore from Tuesday’s workout will be sore today!!! Thank you for another great workout!",
    "My pugs and I look forward to doing this frequently.  Thank you for offering a lunge modification.  I have dislocated my knee 10 times.  Even when I am good shape my knee does not bend properly.  Everyone pushes lunges without modifications.",
    "Oh myyyyy!!! I am obsessed with you!!! I never thought I could find a trainer I would LOVE!! Everything you do works for me! 🎉❤ Thank you!!!!",
    "Thank you for the encouragement to lift heavier! I am feeling more and more strong since doing your workouts ❤"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}