{
  "video_id": "tbMK48EoaBA",
  "title": "10 Minute Balancing Breathwork",
  "description": "A ten minute breathwork session holds powerful potential for balancing and healing. I will guide you through a series of breaths, sequenced together to create a feeling of balanced energy in the body. This session is backed by science and a good one to save, favorite - or just have in your back pocket. Made with love and designed for those who seek emotional balance, mental clarity, or focus in transition. \n\n*This practice is also just a beautiful way to fit in a little time to connect with yourself, fit this into your daily routine if you are feeling stuck, and let me know what you notice by replying in the comment section below! \n\n\nFor more videos like this, check out:\n\nUjjayi Breathing\nhttps://www.youtube.com/watch?v=IQrsJ-yZWV8\n\nBreath of Fire - Pranayama Series\nhttps://www.youtube.com/watch?v=jbtLH-3DfLc\n\nYogic Breath Technique - Alternate Nostril Breathing\nhttps://www.youtube.com/watch?v=8VwufJrUhic\n\nLions Breath\nhttps://www.youtube.com/watch?v=xdUyHPa66A4\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "morning yoga",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne",
    "30 days of yoga",
    "30 Day yoga journey",
    "30 Day yoga challenge",
    "20 minute yoga practice"
  ],
  "publishedAt": "2023-08-14T05:00:12Z",
  "duration": 808,
  "durationFormatted": "13:28",
  "viewCount": 618046,
  "likeCount": 12406,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/tbMK48EoaBA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/tbMK48EoaBA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/tbMK48EoaBA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/tbMK48EoaBA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/tbMK48EoaBA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/tbMK48EoaBA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "A little cry at the end makes me feel how necessary this was. Adriene, you’re a life changer. Everyday.",
    "I just want to say I’m so happy that you’ve kept the same introductory music and video to lead into your practice after so many years. I began following your videos in 2013 and it’s like home to hear that beginning song and the shot of young Adriene in siddhasana. Thank you for keeping this the same!",
    "Exhale day 21🎉 a little bit of breath work to start the day in the best way, thank you, Adriene, for this practice. 💖🧘🏼‍♀️🙏🏻",
    "Discovering the breath has been an amazing addition !! Ps Benji is so ZEN - our quick breath activity had my pup doing circls lol ! Thank you Adriene for your continual efforts and blessings, May you be blessed today!",
    "Blessed Beloved Beauties! Exhale Day -  21 is an ideal return to the practice after a brief hiatus. I began to feel uneasy last Friday and couldn&#39;t keep anything on my stomach not even ginger ale or crackers. Thankfully, the following day the nausea subsided and I successfully kept down ginger ale, soup 🍲 broth, and crackers. I spoke with a nurse on Saturday and we ruled out many things that aren&#39;t with the  symptom of nausea only; no stomach virus, or any other virus, and no ear ache. Well, I&#39;m getting better every day, and my stomach began to feel tight with subtle cramps off and on the next day, so hubby will go with me to the doctor&#39;s office Saturday to have my vitals checked. I&#39;m grateful for the final return to the yoga mat. This session is healing and therapeutic. How has everyone else been? Best wishes, everyone! 🦋❤️🦋"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}