{
  "video_id": "tw7XBKhZJh4",
  "title": "Waking Up with Sam Harris - Mindfulness Meditation (9 minutes)",
  "description": "This is a 9-minute mindfulness meditation, led by Sam Harris. In 2018, Sam created the Waking Up app to be the resource he would’ve wanted when he started meditating three decades ago.\n\nTo learn more about Waking Up and start a free trial, visit: https://wakingup.com.\n\nWaking Up is free for anyone who can't afford it—so, if you'd like to listen to more meditations like this one, there's no reason not to try out the app.\n\nWaking Up not only teaches the theory and practice of mindfulness—in a way that’s completely free of New Age fluff or religious dogma—but also acts a guide to living a better, more fulfilling, more examined life.\n\nConnect with us: \nFacebook: https://www.facebook.com/wakingupapp/ \nTwitter: https://twitter.com/wakingup \nInstagram: https://www.instagram.com/wakingupapp/",
  "channelTitle": "Sam Harris",
  "channelDescription": "This is the official YouTube channel of author Sam Harris. Subscribe for full episodes of 'The Making Sense' podcast.\n\nJoin neuroscientist, philosopher, and best-selling author Sam Harris as he explores important and controversial questions about the human mind, society, and current events. The Making Sense podcast was selected by Apple as one of iTunes Best of 2015.\n\nSam Harris is the author of the bestselling books, The End of Faith, Letter to a Christian Nation, The Moral Landscape, Lying, Free Will, and Waking Up. The End of Faith won the 2005 PEN Award for Nonfiction.\n\nMr. Harris's writing has been published in more than 20 languages. He and his work have been discussed in The New York Times, Time, Scientific American, Nature, Newsweek, Rolling Stone, and many other journals. His writing has appeared in The New York Times, The Los Angeles Times, The Economist, Newsweek, The Times (London), The Boston Globe, The Atlantic, The Annals of Neurology, and elsewhere.",
  "tags": [
    "meditation",
    "meditation video",
    "mindfulness meditation",
    "sam harris meditation",
    "meditation podcast",
    "9 minute meditation",
    "short meditation video",
    "quick meditation",
    "short meditation",
    "sam harris 2015",
    "sam harris debate",
    "sam harris podcast",
    "waking up with sam harris",
    "sam harris waking up",
    "waking up",
    "sam harris",
    "sam harris (author)",
    "sam harris book",
    "sam harris mindfulness",
    "mindfulness"
  ],
  "publishedAt": "2015-08-12T03:45:21Z",
  "duration": 535,
  "durationFormatted": "8:55",
  "viewCount": 1669493,
  "likeCount": 17664,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/tw7XBKhZJh4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/tw7XBKhZJh4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/tw7XBKhZJh4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/tw7XBKhZJh4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/tw7XBKhZJh4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/tw7XBKhZJh4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "He didn&#39;t tell me when to stop. I&#39;ve been here for 5 hours",
    "That clever bastard, making us meditate longer without realising it had ended.",
    "this one guided mediation is the one that ALWAYS does it for me. Love that theres no music, no crazy fantasy visualizations.. just super simple and you fade away and don&#39;t even realize he stopped talking.",
    "Notice the tinnitus ringing in your ears, let the hiss from your damaged hearing remind you of peaceful ocean waves...",
    "I didn&#39;t even realize the meditation was done, lol. Thanks Sam. :)"
  ],
  "channelSubscriberCount": 770000,
  "channelVideoCount": 414
}