{
  "video_id": "TWnpqGpAnTQ",
  "title": "20 MIN NO JUMPING CARDIO - BURN CALORIES WITHOUT HURTING YOUR JOINTS",
  "description": "Here is another quick workout you can do at home to burn fats and lose weight! Today's workout is a highly requested no jumping workout that's safe to do when you have knee injuries and joint pains.\n\nDo this workout daily if you can :) It's a quick workout session so I'm sure that you can easily do this everyday but if not, you can also do this 3-4x a week.\n\nGood luck and have fun working out!!❤️💪\n\n**If you want to be notified when I upload a new video, make sure to subscribe to our channel. I upload new videos everyday from Sunday to Friday!\n\nTIMECODES:\n\n00:00 Introduction\n00:13 Knee Raises\n00:55 Rest\n01:17 Punches\n02:08 Rest\n02:30 Leg Kicks\n03:18 Rest\n03:40 Step Jacks\n04:26 Rest\n04:48 Body Rotations\n05:54 Rest\n06:16 Lateral Taps\n06:59 Rest\n07:21 Walk Downs\n09:31 Rest\n09:53 Standing Side Crunch Left\n11:00 Rest\n11:22 Standing Side Crunch Right\n12:30 Rest\n12:52 Butt Kicks\n13:24 Rest\n13:46 Downward Punches\n14:50 Rest\n15:12 Arm Stretch Left\n16:43 Arm Stretch Right",
  "channelTitle": "Roberta's Gym",
  "channelDescription": "I'm here to help you look and feel great, with effective body weight workouts and exercises.\n\nBurn calories and extra fat with simple workout routines you can easily do at home. No equipment or gym necessary.\n\nNew video workouts Monday to Friday and then Sunday as well.",
  "tags": [
    "lose weight",
    "lose weight fast",
    "burn fat",
    "burn fat workout",
    "fat burn exercise",
    "fat burn workout",
    "lose weight at home",
    "burn fat at home",
    "beach body exercise",
    "roberta's gym",
    "beginner lose weight",
    "HIIT exercise to lose weight",
    "beginner workout",
    "home workout lose weight",
    "beginner exercise",
    "beginner at home workout",
    "easy to do workout",
    "workout for beginners",
    "no jumping workout",
    "no jumping exercise",
    "no jumping routine",
    "no jumping",
    "no jumping cardio",
    "quick workout"
  ],
  "publishedAt": "2022-04-12T10:11:35Z",
  "duration": 1114,
  "durationFormatted": "18:34",
  "viewCount": 1176250,
  "likeCount": 17429,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/TWnpqGpAnTQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/TWnpqGpAnTQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/TWnpqGpAnTQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/TWnpqGpAnTQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/TWnpqGpAnTQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/TWnpqGpAnTQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "So here is the final one month feedback everyone is searching for: <br><br>Well after 6 months of my baby’s birth I started this workout when I was 86 kg and today after one month I am 79 kg. I skipped for 2 to 3 days in the whole month. I also stopped unnecessary eating with a little bit control on soda intake. That’s it. This workout is working for me n I actually reduced weight Alhamdulillah. Thanks Roberta 🎉",
    "I was dealing with depression and anxiety started following your channel lost weight from 62kgs to 52 kgs in 6 months . Thankyou roberta ❤️",
    "I&#39;m here to do this workout for 20 days pls remind me by liking this comment :-<br>Day 1 - I cant jump so i did this workout........great and actually effective but a beginner workout......great for someone just startin their workouts. will do it tomorrow too:)<br>Day 2 - Felt pain in my arms from yesterday but rest was like yesterday. <br>Day 3 - <br>Day 4 -<br>Day 5 - <br>Day 6 - <br>Day 7 - <br>Day 8 -<br>Day 9 - <br>Day 10 - <br>Day 11 - <br>Day 12 - <br>Day 13 - <br>Day 14 - <br>Day 15 - <br>Day 16 - <br>Day 17 - <br>Day 18 - <br>Day 19 - <br>Day 20 -",
    "This no-jumping workout is gentle but effective. Thanks, Roberta!",
    "Today is April 17, 2022<br><br>Day 1 I successfully completed the first day of doing this workout. Let me just say that this workout will push you to the limit. This is the kinda workout that I have been looking for in a while. I am tired. I am hot. The total amount of calories that I burnt for this workout was 120 cal. My average heart rate range anywhere between 111 to 156 bpm. I am really tired I’ve drank almost my whole entire 40 ounce water bottle. I am looking forward to this challenge for the next 13 days I cannot wait to see how my body reacts in the next couple days as well as my mindset but I’m ready for it I can tell this is going to be a challenge but I’m ready for it to be a challenge just for it to be easy by the end of the week or the next couple days.<br><br>Day 2 I have successfully completed the second day of doing this work out. What I can say about this workout is that I noticed that my right side of my stomach was a little bit of pain but that was really about it. I feel a lot relaxed doing this work out. Maybe because I did it yesterday so I kind of got a feeling. This workout went by really fast I was not expecting that at all today. The total amount of calories did I burn for this workout is 119 cal. My average heart rate range anywhere between 87 to 148 bpm. Overall so far is off to a great start.<br><br>Day 3 I have successfully completed the third day I don’t wanna work out. Today I feel a little lively wobbly meaning my feet are just tingling and so is my lower back. Nothing much really to add on to that for today the total amount of calories that I burnt for this workout was 149 cal really good really good see you tomorrow<br><br>Day 4 unfortunately I forgot to work out yesterday because I was just really not in it I really physically immensely felt as though I could not do it so I apologize for not being able to work out yesterday but I picked it back up today. Overall today I found the punches I can tail because I missed one but I did well I feel a little hot hello round up not too bad nothing too crazy my total amount of calories that a bird were 93 cal so after a great start to catch myself back up to where I was doing this workout every day but I apologize for not doing it yesterday but at least I continue to jump right back into it like nothing happened I’ll see you tomorrow<br><br>Day 5 The fifth day has been successfully completed. I am poof and tired the right side of my side hurts just a little bit not too much but it does irritate me but besides that it was fine I told him how calories that I burned for this work out was 110 cal my average heart rate ranged anywhere between 111 to 147 bpm. See you tomorrow<br><br>Day 6 The six has been successfully completed. My thighs are a little tight a little sore the sides of my stomach are a little bit tight but besides that everything else went smoothly I’m a little lightheaded but that’s OK but we’re not at the fine it was well I enjoyed it always puts me up to a good challenge. They told him I calories did I burn for this workout was 108 cal the average heart rate range anywhere between 115 to 146 bpm. See you tomorrow<br><br>Day 7 I have successfully completed this work out for a whole week. Or at least for seven days. Overall this workout felt pretty easy I will see that today the sides of my stomach around my rib shoulder thighs if you have this soreness the tennis to it it’s a little bit uncomfortable but obviously that means I’ve been working out that particular area while doing this work out so I can see that that’s the area where it’s going to really do the most that I really work at so it was interesting that I finally feel some sort of tightness or soreness around there but ordinate this first week has been good.<br><br>Day 8 complete it. The total amount of calories that I burnt for this workout was 119 very excited. I feel a lot better my side don’t hurt as much as they did yesterday they are just a little thighs my thighs feel so heavy it’s almost like I’m carrying like a ton of weight every time I would do work out then of all me live in my legs and bending my thies but besides that I feel great<br><br>Day 9 successfully completed. The total amount of calories that I burned  is 102 cal. My average heart rate ranged anywhere between 88 to 147 beach per minute. There really is not much to say for today for it went very well and smoothly I didn’t notice that my sides felt a little irritated but nothing that I could not handle. I’ll see you tomorrow<br><br>Day 10  done! I am really tired. My sides and my legs hurt it was hard today. I did  not have my watch on sadly. I am not able to tell my heart rate or not calories for today<br><br>Day 11 today is the 11th day of doing this work out. I unfortunately did not work out yesterday well I did but it was not this particular work out so I didn’t account that since that’s not what this is for. But I did work out today I will say that my thighs and my arms they were feeling the workout and I was like a little nice feeling to half after a while. Overall I would say that for today total amount of calories did I burn for this workout was 114 so that’s a lot. I do feel weak now that I’ve done this workout I just didn’t do the workout yesterday because I mentally and emotionally just wasn’t in the right mind for it I did try but I knew personally that I had to have that day off and that something I’m trying to teach myself while working out is that I don’t have to work out every single day and constantly throughout the whole day it’s OK to not work out for one day and then take a right back up the next day so I need it that day for myself so I’m glad I did because I was able to get right back onto it and give it my all but I’ll see you tomorrow<br><br>Day 12 I have successfully completed this day. Overall I told him the calories that I burned was 114 cal. My average heart rate range anywhere between 105 to 146 bpm. Today I feel really good I got some good stretches it to the point where her certain parts of my body crack but it felt very nice and relaxing. It wasn’t hard today my body wasn’t in any kind of pain it was a pretty simple and easy day for me.<br><br>Day 13 I have successfully completed day 13. I was a little bit hot and a little bit frustrated but other than that I did fine and well I will say that it’s a lot easier that’s great I’m not sore anymore anywhere and it does not give me a hard of a time or a little bit of a challenge for the most part. My overall total amount of calories I have burned for today was 118 cal my average heart rate range anywhere between 97 and 146 bpm.<br><br>Day 14 I have finished. It was not easy I almost forgot to do it because I had a exam to take. But it’s done. Overall what I can say about this workout is the it’s definitely pretty simple not really too difficult or anything of that sort it it kind of sort off with a banger and then it just started changing from that point on but it wasn’t too bad."
  ],
  "channelSubscriberCount": 6510000,
  "channelVideoCount": 2319
}