{
  "video_id": "TWVxA9JqP5M",
  "title": "How to BURN FAT with Weight Training for WEIGHT LOSS | How to lose fat with weights | Lifting",
  "description": "🔥 FREE 6 Week Shred: https://GravityTransformation.com\n\n📲 Fat Loss Calculator: http://bit.ly/2N6XKZq\n\n👦🏻 If you want to train with me directly to transform your body as fast as possible, fill out a training application and see if you qualify here(𝐔𝐒𝐀 𝐎𝐍𝐋𝐘): http://bit.ly/2Z7gAFq \n\nFirst I'd like to say that any kind of exercising will burn fat as long as you wind up creating a calorie deficit through a combination of diet and exercise. You cannot burn fat just by weight training if you have a poor diet. However, I know a lot of people that are under the impression that weight training can only be used to build muscle, but the truth is that there are ways for you to weight train in which you will burn way more fat than you ever could just by doing tons of cardio. \n\nWhen you do cardio you get to burn calories for the duration of your cardio session. So if you're running on the treadmill for half an hour you will burn calories during that half hour and maybe a few more calories for the next half hour while you're body returns to homeostasis. On the other hand with weight training you'll burn calories throughout the entire day. This is because your body will use what you eat to replenish glycogen stores in your muscles, it will also rebuild the muscles with amino acids from broken down proteins, and you'll experience epoc which is excess post exercise oxygen consumption. Or otherwise known as the after-burn effect. Another benefit of weight training is that by building muscle your metabolism will go up.   \n\nNow even though you will experience all of these positive effects with traditional weight training. There are plenty of ways to take it up a notch and make your weight training workouts way more effective at burn fat. \n\nThe first way is through a method know as peripheral heart action training. The goal of this type of training is to keep the blood circulating throughout the whole body. Usually this is accomplished by mixing upper body and lower body exercises back and forth within a circuit. An example of this would be to do an upper body exercise like bench press, then right away do Barbell squats, then follow that up with Bent over rows, and finish with walking lunges. There I would be doing upper, lower, upper, lower. By cycling between upper and lower your heart has to work harder to push blood back and forth between the muscles being worked. This means you're going to burn way way more calories than somebody that is doing traditional weight training. The other supposed benefit is that it prevents you from feeling too much burn in one muscle group. However, i think if you do this correctly you will definitely feel the burn. \n\nYou don't have to limit yourself to upper and lower splits for peripheral heart action training. I think it's very important to work on building muscle when you're goal is to burn fat because building muscle will help with that by elevating your resting metabolism. To build muscle you have to go heavy. It's tough to go heavy when you're doing upper an lower exercises back to back because you're going to get really winded. So to help you build muscle while still burning more fat you can do a purely upper or lower body PHA Split. An example of an upper body PHA split would be to do a set of Inclined Dumbbell presses, followed by a superset for chest with dumbbell flies, followed by a Bent over dumbbell row, and finished with a superset for the back like reverse flies. You can do the same thing with your legs, just switch back and forth between working the front and the back of your hips and thighs.\n\nAnother Amazing way that you can burn a ton more fat with weight training is by doing something that you all may have heard of, high intensity interval training. But I'm going to give you a way to structure your HIIT program to make it even more effective. Instead of just doing the more aerobic based exercises back to back for example burpees, plyometric lunges, rope slams, and squats jumps are all more aerobic exercises. Instead of just doing that, the more effective structure for burning fat would be to do a heavy weight training exercise, followed immediately by your more aerobic exercise. If you combine 3 of each into a 6 exercise circuit where you go back forth between an aerobic exercise, and a heavy anaerobic weight training exercise you will burn a ton of calories. A good example of this would be to do Barbell clean and presses, followed by burpees, followed by deep Barbell squats, followed by squat jumps, followed by T Bar rows, and finished with 45 seconds of mountain climbers. Besides the mountain climbers everything else you would do for 10 reps. If you do 3 sets of that circuit, I promise you'll be dead. And you'll burn a ton more calories then you ever could with a cardio based workout plan.\n\n🔥 FREE 6 Week Shred: https://GravityTransformation.com",
  "channelTitle": "Gravity Transformation - Fat Loss Experts",
  "channelDescription": "Discover the TRUTH about losing weight, burning fat, getting rid of that stubborn lower belly fat, and building muscle naturally. You'll find weight loss motivation, six pack abs workouts, and fat loss meal prep videos. Watch enough of my weight loss and muscle building tips and you'll figure out the best way to lose weight for yourself. After all you're a unique individual. If you're looking to get lean, ripped, jacked, swole, shredded, cut, and totally swoltastic NATURALLY then you will benefit from this channel. Most of the content is about burning fat and gaining muscle mass fast and efficiently. There are also intermittent fasting, ketogenic, and all types of other meal prep plans. Entire weight loss diet plans are done for you for free. Also if you're a skinny guy trying to bulk up, build muscle, and gain mass naturally my videos can help.\n\n🙌40,000+ BODY TRANSFORMATIONS🙌\n\n👇Free 6 Week Shred\nhttp://bit.ly/2Bv8CL4\n\n📲 FREE Diet/Workout Planner Tool\nhttp://bit.ly/2N41lTX\n",
  "tags": [
    "how to burn fat",
    "weight training for weight loss",
    "weight lifting for weight loss",
    "weight training for fat loss",
    "how to lose fat with weights",
    "weight training for women",
    "weight lifting for women",
    "weight loss training",
    "aerobics for weight loss",
    "weight training to lose weight",
    "weight loss exercises for women",
    "weight lifting to lose weight",
    "weight lifting for fat loss",
    "cardio for weight loss",
    "cardio and weight training",
    "weight lifting vs cardio"
  ],
  "publishedAt": "2016-06-14T02:17:27Z",
  "duration": 366,
  "durationFormatted": "6:06",
  "viewCount": 1233824,
  "likeCount": 30492,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/TWVxA9JqP5M/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/TWVxA9JqP5M/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/TWVxA9JqP5M/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/TWVxA9JqP5M/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/TWVxA9JqP5M/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/TWVxA9JqP5M\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "1. Bench press<br>2. Bar squats<br>3. Bent over rows<br>4.Weighted walking lunges",
    "peripheral heart action training<br>1. Bench press<br>2. Barbell squats<br>3. Bent over barbell rows<br>4. Weighted walking lunges<br><br>Upper body PHA <br>1. Dumbbell presses<br>2. Inclined dumbell flyes<br>3. Bent over dumbbell rows<br>4. Bent over reverse flyes<br><br>HIIT :<br>1. Barbell clean and presses<br>2. Burpees<br>3. Deep barbell squats<br>4. Squat jumps<br>5. Bent over t-bar rows<br>6. 45s mountain climbers<br><br>10 reps, 3-4 sets",
    "I lost 35 pounds in 3 months doing this, this guy is legit!",
    "This info is legit. Proven with my own eyes. I went from 220 to 165 in 3 months and didn&#39;t even watch my diet that close. Now I am hooked and lift daily and want them gainnzzzzzzzz",
    "This guy is no bullshit. Straight to the point. Just the way i like it"
  ],
  "channelSubscriberCount": 5980000,
  "channelVideoCount": 609
}