{
  "video_id": "TXNECaIJPDI",
  "title": "5 Minute Breathing Exercise - Guided Mindfulness Meditation 4K - Calming anxiety reduction",
  "description": "This is a simple 5-minute calming breathing exercise for anxiety reduction - It will help you quickly feel more calm, focused, and centered. You can come back to this session any time you feel overwhelmed or anxious.\n\nGet access to streaming audio meditations via SoundCloud! Available exclusively to my SoundCloud tier Patreon supporters. See my Patreon page to learn more: http://www.patreon.com/mindfulpeace\n\nAlso, I just created a 12-page meditation guide that I want to be yours for FREE! Just visit my new website at http://www.mindfulpeacejourney.com and it's yours. I put a lot of work into it to make it a great resource for you, so I hope that you enjoy and find great benefit. Thanks for listening! \n\nSEE ALL OF THE MEDITATION VIDEO SESSIONS AND SUBSCRIBE: \n💛http://www.youtube.com/c/mindfulpeace/\n------------\nSUPPORT US ON PATREON:\n🙏https://www.patreon.com/mindfulpeace/\n------------\nJOIN OUR FACEBOOK PAGE:\n🤝https://www.facebook.com/mindfulpeacejourney/\n\nRelease tension and anxiety so that you can go about your day with a renewed focus. Whenever you feel an anxious unease start to creep in, just use your breath to slowly pull yourself back into the present. Awake, aware, and centered. \n\nAll music and dialogue is original by Mindful Peace Journey. Visuals used with commercial license. This content is for educational/entertainment purposes only. No information is to be taken as medical advice.\n\n\n#meditation #anxietyreduction #breathing",
  "channelTitle": "MindfulPeace",
  "channelDescription": "Original deep, calming meditation videos to promote mindfulness and inner peace for any spiritual belief. Have less anxiety, get better sleep, and experience more joy through mindfulness and meditation!",
  "tags": [
    "breathing",
    "mindfulness",
    "meditation",
    "calm",
    "relaxed",
    "relax",
    "slow breathing",
    "guided"
  ],
  "publishedAt": "2020-05-13T18:13:59Z",
  "duration": 349,
  "durationFormatted": "5:49",
  "viewCount": 492415,
  "likeCount": 8314,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/TXNECaIJPDI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/TXNECaIJPDI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/TXNECaIJPDI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/TXNECaIJPDI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/TXNECaIJPDI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/TXNECaIJPDI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’ve never done these or anything like this. I was having a horrible panic attack one night and just searched for breathing exercises for anxiety on YouTube. This was the one I clicked and now I come back to it several times a week. The whole “imagine your lungs have a glow when you breathe in” really resonates with me and I imagine it and breathe anytime I feel anxious now. This helps me more than anyone will ever know. My battle with debilitating anxiety that no ones knows about got a little easier after finding this.",
    "I am THANKFULL for these people who is doing videos like this. God and Angles Bless You 🙏🙏😇😇",
    "Thank you. I was feeling so much anxiety this morning.  Started to feel a pain on my hips that I know eventually expands to the rest of my body. I texted a group of friends and one sent me this video. First time it made me cry more. Second time i felt more relaxed and sleepy by end of it. I went into your page and clicked on snother video and i felt numbness all over my body and mind. It relaxed me so so so much in less than 30 minutes. <br>Thank you thank you thank you!",
    "I always refer to this meditation whenever I feel awful and depressed. I am so glad I did. Earlier, I was having a breakdown and with terrible thoughts in my head so I just referred back to this meditation. It definitely helps me sleep before going about my day. Thank you so much for this.",
    "This was lovely. I like that there was no pressure to breathe in for X number of counts, hold, etc. but just to be mindful, aware, present, and steady. Thank you."
  ],
  "channelSubscriberCount": 229000,
  "channelVideoCount": 217
}