{
  "video_id": "tybOi4hjZFQ",
  "title": "Guided Wim Hof Method Breathing",
  "description": "!! Don't do the breathing exercises in a swimming pool, before going underwater, beneath the shower, or piloting any vehicle. Always practice sitting or lying down in a safe environment. Tinnitus symptoms may appear as a result of pushing too forcefully during the breathing exercise. If this happens, take a step back in your future practice, it’s important to increase gradually, not forcefully !!\n\nSafety: Read about Shallow Water Blackout:\nhttps://www.wimhofmethod.com/what-is-shallow-water-blackout\n\nThis Breathing Bubble is an audiovisual guide that helps you maintain rhythm and pace during your breathing sessions. Simply watch the bubble as it expands and contracts, and follow with your breath. You'll hear Wim breathe alongside you, and entrancing background sounds help tune out your surroundings, allowing you to focus on nothing but your breath.\n\nFor more info on the Wim Hof Breathing and its benefits, check out the link below:\nhttps://www.wimhofmethod.com/breathing-exercises\n\nIf you prefer Wim Hof to explain in person - https://www.youtube.com/watch?v=nzCaZQqAs9I\n\nCheck out our FREE mobile app:\nhttps://www.wimhofmethod.com/wim-hof-method-mobile-app\n\nGo deeper into the Wim Hof Method practice with our online video courses:\nhttps://www.wimhofmethod.com/elearning\n\nIf you enjoyed the MUSIC (By Enahm Hof and Niraj Naik) in this video, you can find more of it at the links below:\nhttps://www.wimhofmethod.com/products/music/set-you-free\n\n=====\n\nWant to discover & learn more about the Wim Hof Method?\n\nJOIN THE FREE MINI CLASS:\nhttps://www.wimhofmethod.com/free-mini-class\n\nVISIT THE WEBSITE:\nhttps://www.wimhofmethod.com/\n\nCONNECT WITH WIM:\nYouTube: https://www.youtube.com/subscription_center?add_user=wimhof1\nFacebook: https://facebook.com/icemanwimhof/\nInstagram: https://instagram.com/iceman_hof\nTwitter: https://twitter.com/iceman_hof\n\nFREE E-BOOK:\nhttps://www.wimhofmethod.com/ebook-journey-of-the-iceman\n\nFOR WORKSHOPS/SEMINARS/TRAVELS:\nhttps://www.wimhofmethod.com/activities\n\n\n=====\nABOUT WIM HOF\n=====\n\n“The Iceman” Wim Hof is a Dutch athlete and multiple Guiness World Record holder known for his ability to withstand extreme cold and his extraordinary achievements.\n\nWim believes that EVERYONE is capable of doing the same exceptional things his body allows him to do. That’s why he developed the Wim Hof Method - a combination of breathing exercises, cold therapy and commitment - to give YOU the tools to take control over your body.\n\nHe’s on a mission to share the potential health benefits of his method, working with scientists around the world to prove that his techniques work.\n\nDiscover more at wimhofmethod.com",
  "channelTitle": "Wim Hof",
  "channelDescription": "\"There is nothing superhuman about me. I am just a man who loves fulfilling human potential.\"\n\nWim Hof (\"The Iceman\") is the creator of the Wim Hof Method. Through more than thirty years of training in nature, he has developed a method that combines specific breathing techniques, cold exposure and mindset. This method has been the first to scientifically prove the ability to actively influence the innate immune system and the autonomic nervous system.\n\nWim holds 26 world records, and has numerous other feats under his belt. He ran a marathon under the Polar Circle in nothing but shorts, holds the world record for sitting in ice —at almost two hours— and has climbed Mt. Everest to the Death Zone point, also in shorts.\n\n*FREE WIM HOF METHOD MINI CLASS*:\nhttps://wimhofmethod.com/free-mini-class\n\n",
  "tags": [
    "breathwork",
    "breathing",
    "breathing exercises",
    "breathing techniques",
    "boost immune system",
    "brown fat",
    "cold shower",
    "cold therapy",
    "cold training",
    "deep breathing",
    "ice bath",
    "ice man",
    "iceman",
    "immune system",
    "in"
  ],
  "publishedAt": "2019-11-26T15:10:00Z",
  "duration": 660,
  "durationFormatted": "11:00",
  "viewCount": 98982759,
  "likeCount": 1020247,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/tybOi4hjZFQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/tybOi4hjZFQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/tybOi4hjZFQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/tybOi4hjZFQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/tybOi4hjZFQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/tybOi4hjZFQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "WOW this just reached over 50 million views!! Thank you all for making this possible ❤Next stop: 1 billion 🎉<br><br>This video is also available in 35 different languages that you can find here: <a href=\"https://www.youtube.com/watch?v=R3crTzM70R0&amp;list=PL2WKxL9enbZRWkyRNWqu9-G65-aIG4Dr1&amp;index=37\">https://www.youtube.com/watch?v=R3crTzM70R0&amp;list=PL2WKxL9enbZRWkyRNWqu9-G65-aIG4Dr1&amp;index=37</a><br><br>If your language isn’t listed in the playlist above and you’d like to help us with a good quality voice over, please send an email to peter@<a href=\"http://wimhofmethod.com/\">wimhofmethod.com</a>",
    "Have a good day, or a good night. I love you.",
    "Today is my 5th day without nicotine from any delivery system. No vape, cigarettes, chew, gum, or patches. Nothing. I 100% couldn&#39;t have made it this far without Wims method. Oh and I&#39;m quitting mid divorce while extremely financially strained. I&#39;ve literally never been this stressed and I&#39;m still doing OK. All the love, all the power!<br><br>Btw, thank you to everyone for supporting me in this. Getting the reaction this did really helped me keep going.",
    "I’m getting married in 1 hour and it wouldn’t be possible without people like y’all and this video.  Thank you, truly.",
    "140 days sober and doing this 2-3 times a day, sometimes 7 just depends. I pray on the holds."
  ],
  "channelSubscriberCount": 2940000,
  "channelVideoCount": 446
}