{
  "video_id": "U0bhE67HuDY",
  "title": "15 Minute Beginner Weight Training - Easy Exercises - HASfit Beginners Workout Routine - Strength",
  "description": "Download the FREE HASfit app: \nAndroid http://bit.ly/HASfitAndroid -- iPhone http://bit.ly/HASfitiOS\n\nEveryone has to start somewhere and this 15 minute beginner weight training routine is perfect if you're just getting started! Let Coach Kozak motivate and inspire you through this easy exercise beginner workout routine. Visit http://hasfit.com/workouts/home/easy-beginner/beginner-weight-training/ for the easy workout instructions.\n\n\n\nDonate with Patreon: https://www.patreon.com/hasfit\nShop HASfit Tribe store: https://hasfit.myshopify.com/\n\nGet up to 2x Faster Results by following a Fitness Program Calendar:\nWhich program is right for me? http://bit.ly/2E16cng\nFoundation Beginner Program: http://bit.ly/2AnjffQ\n30 Day Muscle Building: http://bit.ly/2RqYBoO\n30 Day Torch (weight loss): http://bit.ly/2VjavR5\nMotive Home Athlete’s Plan (intermediate): http://bit.ly/2s09waU\nWarrior 90 2.0 (advanced): http://bit.ly/2QX3IxQ\nMore programs to choose from here: http://bit.ly/2E16cng\n\nGet our Diet Guide:\nEating For Life https://goo.gl/7qnHn4\n\nPersonal Training Services: http://hasfitpersonaltrainer.com\n\nFollow us for more!\nFacebook: https://www.facebook.com/HASFitness/\nInstagram: https://www.instagram.com/hasfit_official/\nSnapchat: @hasfit\nTwitter: https://twitter.com/HeartSoulFit\n\nDisclaimer:\nYou should consult your physician or other health care professional before starting a HASfit program or any other fitness program to determine if it is right for your needs. This is particularly true if you (or your family) have a history of high blood pressure or heart disease, or if you have ever experienced chest pain when exercising or have experienced chest pain in the past month when not engaged in physical activity, smoke, have high cholesterol, are obese, or have a bone or joint problem that could be made worse by a change in physical activity. Do not start this fitness program if your physician or health care provider advises against it. If you experience faintness, dizziness, pain or shortness of breath at any time while exercising you should stop immediately.\n \nHASfit offers health, fitness and nutritional information and is designed for educational purposes only. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. If you have any concerns or questions about your health, you should always consult with a physician or other health-care professional. Do not disregard, avoid or delay obtaining medical or health related advice from your health-care professional because of something you may have read on this site. The use of any information provided on this site is solely at your own risk.\n \nHASfit makes no warrants, promises, or claims regarding accuracy of the calories burned estimate. It is provided only as a general reference and each person should use an indirect calorimetry system for a more accurate estimate.\n \nDevelopments in medical research may impact the health, fitness and nutritional advice that appears here. No assurance can be given that the advice contained on HASfit will always include the most recent findings or developments with respect to the particular material.\n\neasy exercises,easy workouts,beginner exercises,beginner workout,beginners workout,beginner workout exercises,easy fitness,beginner exercise workouts,easy work out,beginner workout routine,easy exercises at home,beginner exercise routine,beginner weight training,weight lifting beginners,weight training beginners,beginner strength training,strength training beginners,beginner weight workout,beginners weight workout, weight workout, weight workouts",
  "channelTitle": "HASfit",
  "channelDescription": "Join Coach Kozak and Claudia through over 1,000 on-demand home workout routines and exercise plans for all goals.\n\n• Named “Top Fitness App” for 10 years straight\n• 99% approval rating on over 1 Billion completed workouts\n\nBecome the best version of you with the free HASfit app:\n\n• Home workout routines for all fitness levels (limited mobility, senior, beginner, intermediate, advanced)\n• Get up to 2x faster results by following a complete fitness plan\n• Stream your workouts to your TV using your Chromecast, Roku, Amazon Fire, or AppleTV\n• Search to find your perfect workout from 3 – 60 minutes\n• Modifications to help you customize the workout for your specific needs\n• Save your favorite routines for easy access later\n• Exercise with dumbbells or no equipment\n\nDiscover new workouts added each week:\n• Fat Burning\n• HIIT & Tabata\n• Muscle Building\n• Cardio\n• Strength Training\n• Low Impact\n• Kickboxing and MMA\n• Kettlebell\n• Flexibility and Yoga\n\nFind Complete Workout Plans and Programs!\n",
  "tags": [
    "easy exercises",
    "easy workouts",
    "beginner exercises",
    "beginner workout",
    "beginners workout",
    "beginner workout exercises",
    "beginner exercise workouts",
    "easy work out",
    "beginner workout routine",
    "beginner exercise routine",
    "beginner weight training",
    "weight lifting beginners",
    "weight training beginners",
    "beginner strength training",
    "strength training beginners",
    "beginner weight workout",
    "beginners weight workout",
    "weight workout",
    "weight workouts",
    "men",
    "women",
    "weight training for beginners"
  ],
  "publishedAt": "2012-10-07T07:17:53Z",
  "duration": 1040,
  "durationFormatted": "17:20",
  "viewCount": 8390134,
  "likeCount": 89362,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/U0bhE67HuDY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/U0bhE67HuDY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/U0bhE67HuDY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/U0bhE67HuDY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/U0bhE67HuDY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/U0bhE67HuDY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "1 tip im going to give to the begginers out there:<br>Do not,never think that you will be ashamed if someone sees you doing this or u feel cringy doing it,just dont if someone sees u(brother sister...) just ignore them its not worth it to stop making ur whole life better cuz someone laughed,its okay dw all people who were fat had to go through the same just let ur mind free and u will realize how enjoyable it is to workout.",
    "I did this for a year 3x a week! Results were incredible. I actually saw the outline of my abs for the first time. Such a fun easy workout.",
    "&quot;You&#39;re doing great!&quot;<br><br>me lying on the floor with my three toes destroyed after a dumbbell fell on my foot: 👌",
    "This is extremely legit guys, I hav done this workout circuit for 2 months and can see my muscles developing so fast. Major health sites say that one should do 2-3 reps of a workout for 15-20 mins, and this provides it ..just blindly follow this and see the results, amazing!",
    "&quot;It&#39;s gonna be along fifteen minutes if you forget to breathe&quot;.   Can&#39;t argue with that."
  ],
  "channelSubscriberCount": 2110000,
  "channelVideoCount": 1788
}