{
  "video_id": "U1d4gHJtOFk",
  "title": "45 Min Tabata HIIT Workouts for Weight Loss & Strength - Full Body Workout at Home with Weights",
  "description": "Download the FREE HASfit app: \nAndroid http://bit.ly/HASfitAndroid -- iPhone http://bit.ly/HASfitiOS\nInstructions for 45 Min Tabata HIIT Workouts for Weight Loss & Strength - Full Body Workout at Home with Weights: https://hasfit.com/workouts/home/advanced-high-intensity/45-min-tabata-hiit-workouts/\n\nDonate on Patreon: https://www.patreon.com/hasfit\nShop HASfit Tribe store: https://hasfit.myshopify.com/\n\nGet up to 2x Faster Results by following a Fitness Program Calendar:\nWhich program is right for me? http://bit.ly/2E16cng\nFoundation Beginner Program: http://bit.ly/2AnjffQ\n30 Day Muscle Building: http://bit.ly/2RqYBoO\n30 Day Torch (weight loss): http://bit.ly/2VjavR5\nMotive Home Athlete’s Plan (intermediate): http://bit.ly/2s09waU\nWarrior 90 2.0 (advanced): http://bit.ly/2QX3IxQ\nMore programs to choose from here: http://bit.ly/2E16cng\n\nBuy Coach Kozak's book, Stay Fit For Life: http://amzn.to/2uSUJPN\n\nHere are the Adjustable Dumbbells we use: https://amzn.to/328sAWD\nHere are the Color Coded Dumbbells we use: https://amzn.to/3wP0g9D\n\nGet our Diet Guide:\nEating For Life https://goo.gl/7qnHn4\n\nPersonal Training Services: http://hasfitpersonaltrainer.com\n\nFollow us for more!\nFacebook: https://www.facebook.com/HASFitness/\nInstagram: https://www.instagram.com/hasfit_official/\nSnapchat: @hasfit\nTwitter: https://twitter.com/HeartSoulFit\n\nDisclaimer:\nYou should consult your physician or other health care professional before starting a HASfit program or any other fitness program to determine if it is right for your needs. This is particularly true if you (or your family) have a history of high blood pressure or heart disease, or if you have ever experienced chest pain when exercising or have experienced chest pain in the past month when not engaged in physical activity, smoke, have high cholesterol, are obese, or have a bone or joint problem that could be made worse by a change in physical activity. Do not start this fitness program if your physician or health care provider advises against it. If you experience faintness, dizziness, pain or shortness of breath at any time while exercising you should stop immediately.\n \nHASfit offers health, fitness and nutritional information and is designed for educational purposes only. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. If you have any concerns or questions about your health, you should always consult with a physician or other health-care professional. Do not disregard, avoid or delay obtaining medical or health related advice from your health-care professional because of something you may have read on this site. The use of any information provided on this site is solely at your own risk.\n \nHASfit makes no warrants, promises, or claims regarding accuracy of the calories burned estimate. It is provided only as a general reference and each person should use an indirect calorimetry system for a more accurate estimate.\n \nDevelopments in medical research may impact the health, fitness and nutritional advice that appears here. No assurance can be given that the advice contained on HASfit will always include the most recent findings or developments with respect to the particular material.",
  "channelTitle": "HASfit",
  "channelDescription": "Join Coach Kozak and Claudia through over 1,000 on-demand home workout routines and exercise plans for all goals.\n\n• Named “Top Fitness App” for 10 years straight\n• 99% approval rating on over 1 Billion completed workouts\n\nBecome the best version of you with the free HASfit app:\n\n• Home workout routines for all fitness levels (limited mobility, senior, beginner, intermediate, advanced)\n• Get up to 2x faster results by following a complete fitness plan\n• Stream your workouts to your TV using your Chromecast, Roku, Amazon Fire, or AppleTV\n• Search to find your perfect workout from 3 – 60 minutes\n• Modifications to help you customize the workout for your specific needs\n• Save your favorite routines for easy access later\n• Exercise with dumbbells or no equipment\n\nDiscover new workouts added each week:\n• Fat Burning\n• HIIT & Tabata\n• Muscle Building\n• Cardio\n• Strength Training\n• Low Impact\n• Kickboxing and MMA\n• Kettlebell\n• Flexibility and Yoga\n\nFind Complete Workout Plans and Programs!\n",
  "tags": [
    "hiit",
    "hiit workouts",
    "hiit workouts for weight loss",
    "full body workout",
    "full body workout at home",
    "full body workout at home with weights",
    "tabata hit",
    "hiit tabata",
    "hiit with weights",
    "tabata workouts",
    "hiit workout with weights",
    "workout with weights",
    "hiit workout at home",
    "tabata workout",
    "tabata workout at home",
    "hiit workouts at home",
    "hiit workout",
    "full body hiit",
    "tabata workouts with weights",
    "tabata workouts for weight loss",
    "full body workout with weights",
    "at home hiit"
  ],
  "publishedAt": "2019-05-06T10:00:06Z",
  "duration": 2910,
  "durationFormatted": "48:30",
  "viewCount": 472327,
  "likeCount": 7301,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/U1d4gHJtOFk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/U1d4gHJtOFk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/U1d4gHJtOFk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/U1d4gHJtOFk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/U1d4gHJtOFk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/U1d4gHJtOFk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I just finished this workout. I&#39;m 60 years old. If I can do it anyone can. I&#39;ve been working out for many years.",
    "Claudia is so positive and encouraging. Hasfit won&#39;t be the same without her. What a great team Coach Kozak and Claudia make. Thank you guys 😊",
    "This is my favorite go-to workout! I started WW in February of 2018 and have been using HASFIT workouts consistently throughout my weight loss journey. I’ve lost 68 lbs and in the best shape of my life. Thank you for the awesome workouts and motivation!",
    "I absolutely love these workouts. I’ll be 54 next month and I’m beginning to negatively feel my super high intensity workouts. They just don’t cut it anymore. Instead of finishing and feeling strong, I’m suffering from foot and joint issues.  But what I find with these workouts is that they are still very challenging and my body is in better shape than with just jogging or running myself crazy on an elliptical for an hour. Definitely see a significant change in my body composition. I’ve been telling everyone about Hasfit. I also love the encouraging words spoken throughout the workouts. I’m a fan for life!",
    "Thank you for getting each day started right in both mental and physical shape! Your workouts are so easy to follow but challenging and motivating. Thank you!"
  ],
  "channelSubscriberCount": 2110000,
  "channelVideoCount": 1788
}