{
  "video_id": "u3UjeyPOjoU",
  "title": "10MIN everyday full body hourglass pilates workout // no equipment // beginner friendly",
  "description": "some mornings i dont have time for more so this full body is perfect for those days! love love looove working out outside \n\nHope you have fun doing this workout! \n\nLove u all\nLidi\n\n⇩MORE OF ME⇩\nTikTok | http://bit.ly/3jKm4Bo\nInstagram | http://bit.ly/3jLe4A4\nYoutube | http://bit.ly/3vvvCCP\nEmail | hi@lidiavmera.com",
  "channelTitle": "Lidia Mera",
  "channelDescription": "what a journey it is to understanding how to feel our best, so hey, lets do it together ♡ sharing my life as a 23 year-old living in London & my at-home workouts with you as a certified Pilates instructor (L3 pilates mat instructor) \nhope you stick around 🤍\nly all millions \n",
  "tags": [],
  "publishedAt": "2023-05-07T10:00:42Z",
  "duration": 654,
  "durationFormatted": "10:54",
  "viewCount": 10607165,
  "likeCount": 281991,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/u3UjeyPOjoU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/u3UjeyPOjoU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/u3UjeyPOjoU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/u3UjeyPOjoU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/u3UjeyPOjoU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/u3UjeyPOjoU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "doing this ten min routine everyday! (so this year i can have that summer bodddd)<br>day 1: done!<br>day 2: done!<br>(switched to mornings so i am more energized throughout the day) <br>day 3: done! i feel a lot less bloated after these- started eating healthier too<br>day 4: done!<br>day 5: doneeee!!<br>day 6: done!! <br>day 7:done! (took a small break bc cramps were baddd)<br>day 9: done!<br>forgot to update but day 10 &amp; 11 are done!<br>day 12: done!<br>day 13: done!<br>day 14: done!<br>day 15: doneeee!<br><del>on a school trip</del><br>back! day 16: done!<br>day 17: done!<br>day 18: done!<br>day 19: done!<br>day 20: done! (had to take a small break due to covid, but all better now and back to normal!)<br>day 21: done!<br>day 22: done!<br>day 23: doneeee!<br>day 24: done and done<br>day 25: done!<br>day 26: done!<br>day 27: done!<br>day 28 done!<br>day 29: done!<br>day 30: done!<br>day 31: done!<br>OFFICIALLY ONE MONTH!! differences ive seen: slimming of stomach and less bloating, thigs have a more noticeable gap. ive been drinking a celery and spinach drink 4x a week as well! lost 3 pounds (111-&gt;108!)<br>day 32: done!<br>day 33: done! added weights<br><br>like to remind me!",
    "I love how calm her workout videos are while I&#39;m crying doing it in my room",
    "That was my first go at a Pilates workout! It was pretty difficult for me as I don’t have a lot of strength and am overweight but I tried to just go slow and focus on my breathing because I heard it’s more about small controlled movements not how fast you can do them! Great workout!👏🏻",
    "Here&#39;s a tip:<br>When you feel like giving up, close your eye and just focus on the music (pretend to sleep, it helps)<br>BREATHE! Please remember to breathe! <br>It&#39;s ok to pause the video and take a break 💖💖",
    "trying this 10min routine:<br><br>august 4: ✓ done! <br>august 5: ✓ hard! but done. <br>august 6: ✓ done! and getting just a bit better at it, feeling great! <br>august 7: ✓ omg i´m soo so happy it&#39;s getting easier for me, day four done!<br>august 8: ✓ everyday more proud of myself, day five done &lt;3 <br>august 9: ✘ very tired today im sorry everyone but day six is not done :(, tomorrow i will get back with more energy!<br>august 10: ✓ done! today it wans&#39;t hard but at the same time it wasn&#39;t easy either haha, im gonna try this for one month and then im gonna try with other video of Lidia Mera<br>august 11: ✓ day eight done! im very tired today tho 🤧😴<br>august 12: ✓ i don´t know why it felt so hard today to do some of the exercises, but day nine DONE! yayy<br>august 13: ✓ so today i tried something different, i made a routine a few weeks ago (using elliptical &amp; weight machines) started with 20-30min of elliptical, then weight machines mostly arms exercises and then i would do this 10min video. today i started doing the video and felt stronger, today i felt proud of how i executed every move, i guess now this is my new routine. DAY TEN DONE!<br>august 14: ✘ started uni today and feel very tired. I will rest for today, and tomorrow I will be back with my routine😊<br>august 15: ✓ rest day was amazing and today came back recharged, it felt so easy! im so happy. day 12 done!<br>august 16: ✓ easyyy! day 13 done &lt;3 &lt;3 &lt;3<br>august 17: spend the day with friends playing just dance the entire afternoon so i didn&#39;t do my workout routine:( day 14 not done)<br>august 18: ✓ started very early today! i woke up and went straight to do this 10 min vid. day 15 done!<br>august 19: ✓ it felt really easy today, day 16 done♡♡♡<br>august 20: ✓ DAY 17 DONE, i always feel so amazing after doing this video i looooove it♡<br>⋆˙⟡♡ ⋆˙⟡♡ ⋆˙ UPDATE ⋆˙⟡♡ ⋆˙⟡♡ ⋆˙ the changes im seeing are mostly in my waist(getting smaller) cause for me everytime i start doing a workout is the same( i start with my stomach getting smaller MOST than my legs and other body parts). but the thing i love the most is that i feel with more energy through the day, i can move better (like walk faster or longer without getting tired). but like i said before, im not only doing this 10min video alone. im complimenting with 20minutes of elliptical and some weight machines for my arms. I noticed that im losing size but not weight.. (even tho im fasting since 7pm to 9am). ⋆˙⟡♡ ⋆˙⟡♡⋆˙ UPDATE ⋆˙⟡♡ ⋆˙⟡♡ ⋆˙<br>august 21: ✘ day 18 not done :(<br>august 22: ✓ DAY 19 DONE! i&#39;ve been SO BUSY with uni, yesterday all day, (literally the entire day so i got pretty tired). today mostly afternoon but wouldn&#39;t let pass another day without working out, is so fun now, it makes me feel like a brand new person physically and mentally ♡♡♡<br>august 23: ✓ Day 20 doneeee! ♡<br>august 24: ✓ Day 21 done 😊started early today♡<br>august 25: ✘ Day 22 not done, i&#39;ve been asked to participate in two amazing little projects! (im an artist) and im so excited AND BUSY, had to rest yesterday (friday).<br>august 26: ✓ Day 23 done ! im so strong now, felt extremely easy today. if you´re reading this today i hope u have a good and beautiful saturday💗<br>august 27: ✓ Day 24 doneeeee! <br>august 28: ✘ day 25 not done (I&#39;VE BEEN BUSY)<br>august 29: ✓ day 26 done ⋆˙⟡♡ ⋆˙<br>august 30: ✘ day 27 not done :( :( very tired very sleepy<br>august 31: ✓  day 28 donnnnneeeeee &lt;3<br>september 1: ✘<br>september 2: ✘<br>september 3: ✘<br>september 4: ✓  im back!<br>september 10: ✓ Hi, it&#39;s been a while and felt like i wanted to do this again.. (it has been a little harder for me to keep working out bc of uni, and art projects.  i think that my career is going great cause i´ve been getting some offers and i am very happy.) Just wanted to say that life is about up and downs but everyone can start over. i have missed this, cause it makes me feel so great.<br>we&#39;ll see if i keep doing this routine or if im going to try another video. thank u to every single person that left me a comment ! 💗 and to the ones that reached me out on insta too!! 💗<br>september 11: ✓<br>september 12: ✓<br>september 17: ✓<br>september 18: ✓ i started with this one today (i added it to my routine) <a href=\"https://www.youtube.com/watch?v=5Ld6Jdcd_oU\">https://youtu.be/5Ld6Jdcd_oU?si=9qD7_kEUi_-4varo</a><br>september 20: ✓<br><br>hii, just came here to start over hehe<br>october 06: ✓<br>october 07: ✘<br>october 08: ✓<br>october 09: ✘\r<br>october 10: ✓<br>october 11: ✘\r<br>october 12: ✓<br><br><br>🎅🎄🎁☃🦌HELLO, today is Wednesday (December 27) and i came here to say that i&#39;ve been struggling to start over.. for a bunch of stuff from my personal life but i&#39;ve never stopped wanting to, the biggest inspiration has been you ladies, every comment has my heart💗💗 i cannot thank you enough, i would love to chat with every single one of you and im very sorry to the ones that i never wrote back (i went trough a lot of mental stuff) so i didn&#39;t had the strenght. mentally and physically. LOVE YOU ALL!  HERE I COME AGAIN🦌☃🎁🎄🎅<br><br>🎅december 27: ✓ (did this one too <a href=\"https://www.youtube.com/watch?v=354ezj2UHdM\">https://www.youtube.com/watch?v=354ezj2UHdM&amp;list=PL4g_3SUm7A263NYukZMZtY9jydc2Ndby9)\r</a><br>🎅december 28: ✓<br>🎅december 29: ✘ break cause im destroyed<br>🎅december 30: ✘ got stomach issues <br>🎅december 31: ✘ <br><br>Goodbye to 2023, it was a great year for me and my career 💗<br><br>I hope that everyone live their best life in 2024, happy new year🥳🥂💃🏻<br><br>⭐January 1: ✘ <br>⭐January 2: ✓ I saw a project named &quot;75 hard&quot; and im gonna try it, TODAY DAY ONE.<br><br>sorry, i swear im not a liar. i just got the worse pain ever in my stomach since Tuesday, Jan 2. I&#39;ve tried everything and won&#39;t stop, so im gonna have to do exams.. I&#39;ll come back as soon as i get better 😔 i really wanted to start good this year :( today is January 6.<br>love ya🫶🏻<br>xoxo<br><br>January 17: ✓ finally back!<br>January 18: ✓ <br>January 19: ✓ <br>January 20: ✘ <br>January 21: ✓ <br>January 22: ✓  i was watching some comments and im so happy to see that some of you are tracking your process as well! i love this space of support for each other, cause as we all know is not easy... love you all! to every person that has seen this or left a comment, it means a lot❤ we can make it!<br>January 23 : ✓\r<br>January 24 : ✓\r<br>January 25 : ✘\r<br>January 26 : ✓<br>January 27 : ✘<br>January 28 : ✓<br>January 29 : ✓<br>January 30 : hi girls today i made 13,005 steps so I&#39;ll take that as my workout for today hehe xoxo🤍🎀<br>January 31 : ✓<br><br>february let&#39;s goooo!<br><br>February 1 : ✓<br>February 2 : ✓<br>February 3 : ✓<br>February 4 : ✘ <br>February 5 : ✘ <br>February 6 : ✘ <br>February 7 : ✓ <br>February 8 : ✘ \r<br>February 9 : ✓ <br>February 10 : ✘ \r<br>February 11 : ✘ <br>February 12 : ✘ \r<br>February 13 : ✘ <br>February 14 : ✘ \r<br>February 15 : ✘ <br>February 16 : ✘   \r<br>February 17 : ✓ BACK! (heeello, today is saturday, and it&#39;s been a whole week... last saturday i went hiking and i ended up complaining the entire week cause my entire body was hurting, i never would&#39;ve thought that it was going to be so bad hahaha. still want to keep hiking, it was a pretty intense first time but i loved it!)\r<br>February 18 : ✘<br>February 19 : ✘<br>February 20 : ✘<br>February 21 : ✘<br>February 22 : ✓<br>February 23 : ✘<br>February 24 : ✓<br>February 25 : ✘<br>February 26 : ✓<br>February 27 : ✓<br>February 28 : ✘<br>February 29 : ✘<br><br>March 1: ✘<br>March 2: ✘<br>March 3: ✘<br>March 4: ✓<br>March 5: ✓<br><br>April 22: ✓ hi everyoneee im back! 🤍<br>April 23: ✘<br>April 24: ✓<br><br>November 20: ✓<br>November 21: ✓<br>November 22: ✓<br>November 23: ✓<br>November 24: ✓<br>November 25: ✓<br>November 26: ✘<br>November 27: ✓<br>November 28: ✓<br>November 29: ✘<br>November 30: ✓<br>December 1: ✓<br>December 2: ✘<br>December 3: ✓<br><br>November 22, 2024.<br>I haven&#39;t had the motivation to share my process, i guess that all this attention is a little overwhelming so that&#39;s why i stopped giving updates even tho i have come back to this video like I&#39;ve had said it before...<br>But no one knows me so it really shouldn&#39;t affect that much..<br>truth is, starting the month of april i went to therapy for the first time in my life, i thought that i was doing so much work and then some other stuff happened in my life so i had to stop going, bc i don&#39;t want to be a burden. I have learned so much this year, is been harsh. I&#39;ll try to keep up with updates cause it used to make me happy, specially connecting and helping with you!<br><br>hey! is a new year🎉 i haven&#39;t updated you, but i started in january 2025 again!!<br>i did two weeks and the i stopped, so i began all over again in february<br><br>Just wanted to say that i always come back to this video cause when i started doing this routine i noticed that for the first time in my life.. finally found something that helped me losing weight.<br>That&#39;s why all of the updates. And with consistency my body changed a lot (aug-sept 2023). this past months i haven&#39;t been that consistent but still has helped to make me feel comfortable in my own skin. <br><br>thank u to every person that is leaving me comments, you all are so sweet 💗 makes me want to keep going! 💗<br><br>if u want to ask me anything about this beautiful process, here is my instagram⭐@michuuuh⭐"
  ],
  "channelSubscriberCount": 1670000,
  "channelVideoCount": 286
}