{
  "video_id": "u5COdcb6M7w",
  "title": "HIIT Workout - Insane 15 Minute Spin Bike Workout",
  "description": "Try this insane 15 minute spin bike workout today! \n\nYou don't have to spend countless hours busting your butt and sweating buckets to obtain benefits like weight loss, muscle growth, and improved overall health and well-being.\n\n15 Minute Spin Bike HIIT workouts like this one save you time without sacrificing any fitness benefits! \n\n#HIITWorkout #SpinBikeWorkout #BikeWorkout",
  "channelTitle": "AbundantYou with Dr Kevin",
  "channelDescription": "Abundant You is a natural health website dedicated to all aspect of health and wellness as it relates to you! Helping people accomplish higher overall health and better well-being.\n\nOur YouTube channel is a great shortcut to stay connected with us and help others online! The Abundant You team will upload new natural health made easy videos, natural  articles, workouts and of course delicious recipes!\n\nPlease subscribe and share our channel!  Let's make a positive impact in the natural health & wellness community! \n\nFeel free to leave constructive comments or ask questions! We appreciate you, thanks for watching. You can learn more about our natural health made easy website by visiting https://www.abundantyou.com/\n\nP.S. Do you live around Columbus Ohio? Or know someone that does? We have a natural holistic wellness center you can visit and get personal 1 on 1 help to reach your specific health goals. You can learn more about our clinic at https://abundantyouchiro.com/",
  "tags": [
    "15 minute spin bike workout",
    "15 minute bike workout",
    "hiit workout",
    "spin bike workouts",
    "bike workouts",
    "interval training workouts",
    "weight loss workout"
  ],
  "publishedAt": "2019-10-27T23:10:38Z",
  "duration": 1161,
  "durationFormatted": "19:21",
  "viewCount": 147710,
  "likeCount": 2070,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/u5COdcb6M7w/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/u5COdcb6M7w/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/u5COdcb6M7w/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/u5COdcb6M7w/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/u5COdcb6M7w/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/u5COdcb6M7w\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "✅ Don&#39;t forget to hit the LIKE button and SUBSCRIBE 👍\r<br>📕 Download the FREE eBook: Top 7 HIIT Workout Secrets For Weight Loss 📕 ►<a href=\"https://www.abundantyou.com/7-hiit-secrets-ebook/\">https://www.abundantyou.com/7-hiit-secrets-ebook/</a>",
    "I&#39;m loving these workouts!! Why anyone would waste money on Pelaton is beyond me! Keep fit stay happy",
    "Dr., I am finding that this type of exercise is proving to be the best for my bad knee. I just made it through my first week with this video and am looking forward to using it every week. Thank you.",
    "My favorite workout so far! Doing this (along with lifting weights) 3x a week &amp; I feel so good! You are so appreciated Dr. Kevin!😊",
    "This bike was really easy to assemble <a href=\"https://www.youtube.com/post/UgkxMesz3KOGEmwmvyKQfLfrRSUXLFzfVHZA\">https://www.youtube.com/post/UgkxMesz3KOGEmwmvyKQfLfrRSUXLFzfVHZA</a> and required very few adjustments out of the box. The wheels did not require any truing/adjustments. The frame had some small scratches, but nothing major.I did replace the seat though - the seat it came with was very uncomfortable. The tires need to be re-inflated every 4-5 days, but this appears to be quite common for the narrow 700x25 tires.Overall, in my opinion, this bike looks and rides like a much more expensive bike."
  ],
  "channelSubscriberCount": 58900,
  "channelVideoCount": 45
}