{
  "video_id": "UAA3E5MLqrM",
  "title": "Relaxing Full Body Stretching Routine for Stress & Anxiety Relief, Seated",
  "description": "Simple stretches like these can often help provide relief from stress & anxiety because gentle stretching can help the body relax. These seated stretches are performed in real time so it's easy to follow along. More full body stretches: https://www.youtube.com/watch?v=JJAHGpe0AVU\n\nThis relaxing stretching routine starts with a gentle warm up. Knee extensions or long arc quads (LAQ), hip flexion, and upper arm jumping jacks and horizontal Ts will help get your muscles warm and ready to stretch.\r\r\n\nTo start off with the neck area where we hold a lot of our stress, upper trapezius and levator scapulae stretches are great to help relax those muscles.\r\r\n\nScapular squeezes, seated trunk rotation, and quadratus lumborum (QL) stretches will help work the upper, middle, and low back.\r\r\n\nMoving down to the hips and legs, a seated knee to chest, seated hamstring stretch, and an active calf stretch will help relax the lower body.\n\nRelated Videos:\r\r\n\nShoulder Pain Relief Stretches – 5 Minute Real Time Routine:\nhttps://www.youtube.com/watch?v=6jHsraw2NIk\n\nBack Pain Relief Stretches – 5 Minute Real Time Routine:\r\nhttps://www.youtube.com/watch?v=UYMmtEFhuxA\n\n===========================================\n\n\r\rDr. Jo is a licensed Physical Therapist and Doctor of Physical Therapy.\r\r\n\nSUPPORT Ask Doctor Jo on Patreon for as little as $1 a month, and get cool rewards: http://www.patreon.com/askdoctorjo\n\n\r\r===========================================\n\n\r\rRelaxing Full Body Stretching Routine for Stress & Anxiety Relief, Seated:\n\rhttps://www.youtube.com/watch?v=UAA3E5MLqrM\nhttps://www.askdoctorjo.com/full-body-stretch-seated\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless Ask Doctor Jo, LLC, its officers, employees, and contractors for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Ask Doctor Jo, LLC makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.",
  "channelTitle": "AskDoctorJo",
  "channelDescription": "Hi, I'm Doctor Jo, a Physical Therapist and Doctor of Physical Therapy. My videos demonstrate proper techniques for some of the best stretches & exercises to help relieve common pains like knee pain, neck pain, shoulder pain, back pain, arthritis, sciatica, fibromyalgia, and more.\n\nBe safe, have fun, and I hope you feel better soon!\n\nDISCLAIMER: This content is for informational purposes only. It is general in nature and is not intended to be medical advice, nor does using it create a physical therapist-patient relationship with you. Before starting, consult your own healthcare provider for a proper diagnosis and to ensure this content and any included products are safe and appropriate for your own medical and physical condition. Stop immediately if you experience pain. Ask Doctor Jo, LLC makes no representations about the accuracy or suitability of this content for you. By voluntarily using this content, you assume all risks for any resulting losses, injuries, or damages.",
  "tags": [
    "stretching exercises",
    "seated stretching routine",
    "stretching routine seated",
    "stress relief",
    "anxiety relief",
    "stress anxiety relief",
    "full body stretch",
    "whole body stretch",
    "stretching routine",
    "full body stretching routine",
    "whole body stretching routine",
    "stretching routine for beginners",
    "real time stretching routine",
    "follow along stretching routine",
    "real time full body stretch",
    "physical therapy",
    "physiotherapy",
    "askdoctorjo",
    "doctorjo",
    "ask doctor jo",
    "dr jo",
    "doctor joe",
    "ask doctor joe"
  ],
  "publishedAt": "2020-04-20T15:10:08Z",
  "duration": 775,
  "durationFormatted": "12:55",
  "viewCount": 283011,
  "likeCount": 5477,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UAA3E5MLqrM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UAA3E5MLqrM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UAA3E5MLqrM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UAA3E5MLqrM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UAA3E5MLqrM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UAA3E5MLqrM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "<a href=\"UCjdxelARHGq3-3dN_neMOAQ/CPaQtcD209wCFQtxmAodyRgJFg\"></a><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CJ6E7o_109wCFYFemAod7OQNyw\"></a><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CO2PwsL109wCFQcQZAodprwPJQ\"></a>Don&#39;t forget to hit the 🔴 <b>SUBSCRIBE</b> 🔴 button above! <b>Find all of my videos at </b><b><a href=\"http://youtube.com/askdoctorjo\">youtube.com/askdoctorjo</a></b><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CPaQtcD209wCFQtxmAodyRgJFg\"></a><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CJ6E7o_109wCFYFemAod7OQNyw\"></a><a href=\"UCjdxelARHGq3-3dN_neMOAQ/CO2PwsL109wCFQcQZAodprwPJQ\"></a>",
    "My 96yr old mom loves your chair routines! She&#39;s a retired PE teacher and still benefits from movement. Chair routines are best for her. We love your pups and how clearly you present the routine. Well done!! Thank you from Florida!!",
    "Whomever is reading this remember to spread as much LOVE AS POSSIBLE, don&#39;t litter, help out the homeless and take care of nature please it&#39;s really important we gotta take care of eachother and mother earth. thank you and have a blessed life ❤",
    "Love the fact that you can do so much just sitting..thank you for this. Great exercises",
    "That reach up and over stretch felt so nice!"
  ],
  "channelSubscriberCount": 2310000,
  "channelVideoCount": 935
}