{
  "video_id": "ufhM_9eLU-s",
  "title": "Beginner Interval Treadmill Workout | 20 Minutes",
  "description": "Welcome to this 20-Minute Beginner Interval Treadmill Workout, designed to kickstart your fitness journey. In this workout, certified trainer Sam Candler will guide you through a series of walk, jog, and run intervals, helping you find your comfort zone and push it just a little bit. Get ready to boost your cardiovascular endurance and burn calories in just 20 minutes!\n\nWorkout Length: 20 minutes\nWorkout Level: Beginner\nProducts Used: SF-T7917\nTrainer: Sam Candler\n\n00:00 Warm Up\nStart your workout with a proper warm-up to prepare your body for the upcoming exercises.\n\n1:04 Comfortable Walking Pace\nBegin with a comfortable walking pace, allowing your body to gradually transition into the workout.\n\n1:45 Jog Intervals \nIncrease the intensity by incorporating short jogging intervals. Jog for 20 seconds, challenging your muscles and elevating your heart rate. Repeat this pattern twice.\n\nWorkout\nNow it's time to dive into the main workout segment. Follow Sam Candler's instructions and push yourself to get the most out of this 20-minute session.\n\nJog and Speed Push Intervals \n5:44 Jog for 20 seconds: Increase your pace slightly from the warm-up phase.\n6:05 Speed push for 10 seconds: Push yourself by increasing the speed for a short burst.\n7:15 Jog for 20 seconds: Return to a comfortable jogging pace.\n7:35 Speed push for 10 seconds: Challenge yourself with another burst of increased speed.\n8:44 Jog for 20 seconds: Allow yourself to recover.\n9:04 Speed push for 20 seconds: Push your limits with a longer burst of increased speed.\n10:23 Jog for 20 seconds: Regain your breath and prepare for the next interval.\n10:44 Speed push for 20 seconds: Push yourself even harder with an extended burst of increased speed.\n\nRun Intervals \n12:45 Run for 30 seconds: Increase the speed and transition from jogging to a faster running pace.\n14:14 Run for 30 seconds: Maintain your increased speed.\n15:45 Run for 40 seconds: Push yourself further by extending the running interval.\n17:22 Run for 40 seconds: Continue challenging your endurance by maintaining the increased speed.\n\nCool Down:\nAfter an intense workout, it's crucial to cool down and stretch to promote recovery and reduce post-workout muscle soreness.\n\n19:30 Hamstring Stretch \nPerform a hamstring stretch by extending one leg forward and leaning forward from your hips, feeling a gentle stretch in the back of your thigh. Hold the stretch for 15 seconds per leg.\n\nCongratulations! You've completed this 20-Minute Beginner Interval Treadmill Workout. Remember to stay consistent and gradually increase the intensity of your workouts to achieve your fitness goals. Stay hydrated, listen to your body, and have fun on your fitness journey!\n\nSubscribe to get free workouts, challenges, fitness community, latest in-home fitness equipment and more! \n\nStay connected with your fitness and download SunnyFit App below:\nApple - App Store : https://apple.co/3JixdjS\nAndroid - Play Store: https://bit.ly/android-sunnyfit\n\n--------------------------------------------\n\nFITNESS EQUIPMENT USED\n✔️: Performance Incline Treadmill - SF-T7917\n🛒: https://bit.ly/3txEtDp\n\nRECOMMENDED WORKOUT PLAYLIST: \n▶️ New Workouts: https://bit.ly/yt-new-workouts-playlist\n▶️ Treadmills Workout: https://bit.ly/SHF-Treadmill-Workouts\n\nFREE RESOURCES\n💡 Free Workouts: https://sunnyhealthfitness.com/pages/workouts\n💡 Articles: https://sunnyhealthfitness.com/blogs/index\n\nFOLLOW US ON SOCIAL\n👍 Website: https://sunnyhealthfitness.com\n👍 Facebook: sunnyhealthandfitness\n👍 Instagram and Tiktok: @sunnyhealthfitness\n#sunnyhealthfitness  #treadmillwalk #treadmill #treadmillrunning #treadmillworkout #intervalworkout #intermediate  #workout #fitness",
  "channelTitle": "Sunny Health & Fitness",
  "channelDescription": "Fit for Everyone | At Sunny Health & Fitness, we believe a quality workout experience and healthy lifestyle should be within reach of anyone who wants it. Our mission is to make fitness accessible to everyone, including you!\n\nSunny Health & Fitness is dedicated to helping you reach your goals. We have provided the equipment to everyday households for over a decade and now we are branching out to provide videos on technique, assistance, and customized workouts for each category in our line of premier fitness equipment. \n\nSubscribe to our channel to discover the latest in home fitness, weekly exercises, and product troubleshooting guides. Visit our website to discover articles and workouts and take a trip to our social media for daily updates on all things health and fitness.\n\nPlease send up an email with any questions or troubleshooting needs. Use the link below.",
  "tags": [
    "Beginner Interval Treadmill Workout",
    "Sunny Health And Fitness",
    "sunny health and fitness treadmill",
    "treadmill workout",
    "beginner treadmill workout",
    "treadmill walking workout",
    "beginner running on treadmill",
    "beginner running on a treadmill",
    "walking workout for beginners",
    "interval walking treadmill workout",
    "walking treadmill interval workout",
    "walking treadmill workout",
    "20 minute treadmill walking workout",
    "treadmill workout for beginners",
    "beginner treadmill workout no incline"
  ],
  "publishedAt": "2023-05-10T20:00:25Z",
  "duration": 1264,
  "durationFormatted": "21:04",
  "viewCount": 454794,
  "likeCount": 10392,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ufhM_9eLU-s/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ufhM_9eLU-s/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ufhM_9eLU-s/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ufhM_9eLU-s/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ufhM_9eLU-s\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I run everyday but i only run a mile because i really hate running. So I’ve decided to start doing guided run workouts to find some thing to love and get rid of the daunting feeling that i always have before running . So thank you Sunny for this workout 🙏🏾",
    "I workout alone I use to have an gym partner I no longer workout with Long story short ion need a partner to help reach my Weight loss journey I pray everyone who is serve overweight or just want to be In healthy shape have the most beautiful workout journey &amp; story to tell letssssssss Gooooo 🎉🎉🎉🎉🎉❤❤❤❤ Imma clap for all of y’all &amp; imma clap 👏🏾 for myself",
    "I&#39;ve searched, and I searched all over YouTube for a good begginers run until finally I found you. Thank you for giving me my motivation to run again 😊",
    "As a person who is coming back to working out after a really long break, and being a former athlete I get easily bored running on treadmills, I will say time few by in a blink! The 20 min of workout felt like 5! Thank you so much for the workout!!!!",
    "STROKE SURVIVOR 35YRS.. Just done this after purchasing a treadmill yesterday😅😅 I wanted to give up half way through but I kept pushing myself and I did it 💪 🙏  lol.. might nit seem much to some people but it was massive for me! Thanks for the video 👏"
  ],
  "channelSubscriberCount": 164000,
  "channelVideoCount": 2004
}