{
  "video_id": "UG5PHsg4riM",
  "title": "Communicate With Your Spirit Guide 📖 ✨ Guided Meditation ❤️",
  "description": "Welcome to the guided meditation on connecting with your spirit guide. In this meditation, you will be guided to open up the channels of communication and strengthen the bond between you and your spiritual guide. Take a few moments to relax and create a peaceful space for yourself. As you listen to the soothing music and gentle guidance, allow yourself to let go of any distractions and focus on the present moment. Through this meditation, you will learn to trust your intuition, receive guidance and support from your spirit guide, and deepen your spiritual connection. Join me on this transformative journey and start communicating with your spirit guide today. Remember to subscribe to our channel for more guided meditations and spiritual content. Thank you for tuning in! 🙌✨ \n\nDownload Pura Rasa Meditation App: \nAndroid Link: https://play.google.com/store/apps/details?id=breakthroughapps.com.purarasa\nApple Link: https://apps.apple.com/us/app/pura-rasa/id1665649108?platform=iphone\n\n#spiritguide #guidedmeditation #meditation #spiritual #trustyourintuition \n\nSubscribe for better sleep, healing and to attract abundance:  https://www.youtube.com/channel/UCICMa3NDLe2pxaeIXHw9a7A\n\n🙌 TRY ONLINE COUNSELLING: http://www.tryonlinetherapy.com/rasa\nPlease make THIS year the year you change your life. If you are struggling with anxiety, depression or any other mental illness, consider online counselling with a licensed professional at BetterHelp. It’s far cheaper than in-person counselling. \n🙌 TRY ONLINE COUNSELLING: http://www.tryonlinetherapy.com/rasa\nFTC: By using my BetterHelp referral link, you are supporting this channel. I receive commissions on any sales, but I only promote products I believe in.\n\nConnect with Pura Rasa on:\nInstagram: https://www.instagram.com/pura.rasa/\nhttps://www.facebook.com/rasamindfulness/\nTikTok - @purarasa_rasalukosiute",
  "channelTitle": "Pura Rasa - Guided Meditations",
  "channelDescription": "Welcome to the channel, beautiful soul 💛\n\nThis is a safe space where you will find various types of meditations; ranging from physical healing, sleep aid, law of attraction, deep relaxation, meditations to help strengthen your sixth sense and more. You will also find music, sounds of nature for sleep, relaxation and for your personal meditations. \n\nBy using this meditation library you will find your centre, quiet your thoughts, relax deeply and feel grounded. This is the space where you will delve deeper into your subconscious to achieve lasting results. \n\nThrough regular video uploads, I will provide you with as many effective tools as possible to live peacefully in the modern world.\n\nSubscribe and I will meet you in the next meditation!\n\nWith appreciation,\nRasa",
  "tags": [
    "guided meditation",
    "guided meditation rasa",
    "guided meditation spirit guide",
    "intuition meditation",
    "meditation",
    "meditation guided",
    "meditation guided spirit guide",
    "psychic meditation",
    "pura rasa",
    "pura rasa guided meditation",
    "pura rasa meditation",
    "rasa guided meditation",
    "rasa lukosiute meditation",
    "rasa meditation",
    "spirit guide contact meditation",
    "spirit guide meditation",
    "spirit guide sleep meditation",
    "spirit guide messenger",
    "communicate with spirits",
    "communicate with spirit guide"
  ],
  "publishedAt": "2024-02-25T15:00:22Z",
  "duration": 2225,
  "durationFormatted": "37:05",
  "viewCount": 171740,
  "likeCount": 5127,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UG5PHsg4riM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UG5PHsg4riM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UG5PHsg4riM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UG5PHsg4riM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UG5PHsg4riM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UG5PHsg4riM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "❤ *Download Pura Rasa Meditation App for exclusive meditations, challenges and courses: <a href=\"https://onelink.to/ym5uae\">https://onelink.to/ym5uae</a> We would love to have you as part of our Sweet Soul community* 🥰❤",
    "Morning Prayer: Divine spirit within me, move me in the direction of my highest good this day and make me aware of every opportunity to bring a good energy to those around me.&quot;",
    "Gratitude for freely gifting us with your magic. I feel closer to my spirit guides. I trust them. I trust that I can hear their divine messages. I feel them. I know them. I know that they love me and I love them unconditionally.  Namaste and I love us all.<br>🕉🔥💜✨️🕉",
    "Bless &amp; praise you in all ways, Abundant Divine Love Light 🙏🏽♥️🙏🏾✨️🙏🏿🌸🙏⛲️",
    "🙏❤ ... wow! that was a beautiful experience -- as always is with your meditations. thank you for sharing your beautiful soul and healing spirit with us rasa. be well, dear friend 🙌🕊🦋🌟🌈😇"
  ],
  "channelSubscriberCount": 432000,
  "channelVideoCount": 434
}