{
  "video_id": "UGWR5Bu8A6Q",
  "title": "🎧 Guided Sleep Meditation - Pure Deep Relaxation",
  "description": "This guided sleep meditation focuses on relaxing the body and mind. (details below) Join our community/see our products: https://www.thehonestguys.co.uk/products\n\nUsing this guided meditation will help you experience a pure deep relaxation, with the option to gently ease you into sleep.\n\n___________________________________\n\nTHE HONEST GUYS\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, meditation and sleep, without ever having to try.  In particular, we cater to anyone who is turned-off by the idea of \"meditation\", but still want to reap the massive health benefits, that meditation can bring. We offer this through high-quality audio productions, called 'guided visualisations'. These include sleep talk-downs, meditations, wonderful fantasy imagery and stories. \n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nIf you enjoy our work and would like to support the channel, please consider purchasing one of our high-quality products: https://www.thehonestguys.co.uk/products\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n____________________________________\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n\nMusic accreditation:\n(Ascension) by Christopher Lloyd Clarke. http://www.christopherlloydclarke.com\n\n\n\n#deeprelaxing #deeprelaxation #deepsleepguidedmeditation #guidedmeditation #thehonestguys",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "guided sleep meditation",
    "guided meditation",
    "pure deep",
    "relaxation",
    "deep relaxation",
    "guided sleep talkdown",
    "talk down",
    "insomnia",
    "guided relaxation",
    "law",
    "of",
    "attraction",
    "meditations",
    "affirmations",
    "ocean waves",
    "i'm stressed",
    "can't sleep"
  ],
  "publishedAt": "2018-03-20T16:59:50Z",
  "duration": 1881,
  "durationFormatted": "31:21",
  "viewCount": 3133200,
  "likeCount": 12026,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UGWR5Bu8A6Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UGWR5Bu8A6Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UGWR5Bu8A6Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UGWR5Bu8A6Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UGWR5Bu8A6Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UGWR5Bu8A6Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I am sick &amp; the cough is so relentless at night - I was SHOCKED when I fell asleep to this last night !! Nothing else has worked😭 thank you, God bless !! 🙏🏼",
    "Love reading the comments. Hearing about people getting sleep makes me feel so happy 💕💕 hope everyone sleeps well tonight xx",
    "You two probably have no idea how big of an impact you are making on peoples lives. I do not think I would have survived graduate school without these videos, and I certainly won&#39;t make it through medical school without them. Thank you both so very much for taking the time to make these, and then putting them in this medium so everyone can use them. If they had not been free I never would have tried them, and they have helped me so damn much over the last three years. Thank you, thank you, thank you, and god bless you both.",
    "I suffered a brain injury in an auto accident in 2019, and I&#39;ve often had  difficulty with sleep. I found this video in the fall of 2019 and have listened to it countless times since. I&#39;ve also recommended it to friends. I can&#39;t thank you enough!",
    "I was having an anxiety attack last night from so much stress and I put this video on. I started the breathing technique and it helped me relax and fall asleep. I woke up this morning a little anxious and I played this video again. I feel completely relaxed now and ready to start the day. Thank you so much for these awesome videos and for changing people&#39;s lives. ❤ 🙏"
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}