{
  "video_id": "UK3evBQkeEU",
  "title": "Buteyko Breathing - Breathe Light, Slow & Deep | Guided Exercise for Anxiety & Brain Fog",
  "description": "🫁 Learn Buteyko Breathing with Neil on Zoom: https://www.thebuteykomethod.com/\n\nThis is a guided Buteyko breathing exercise in which we will be breathing Light, Slow and Deep (Diaphragmatic Breathing).    It is also known as Breathe Light - Cadence Breathing.\n\nThis is a science backed breathing exercise, which when practiced regularly, can reduce symptoms of anxiety, brainfog, long covid and a whole host of chronic health conditions. \n\n00:00 Intro\n00:33 How it works\n02:08 Guided exercise - Breathe Light, Slow and Deep\n\nIn this exercise we will be bringing together the 3 most important elements breathwork:\n\nWe breathe light: breathing softly and quietly through the nose.  This subtly increase levels of CO2 in the body which actually improves oxygen delivery the brain. Ideally you feel a  mild air hunger.  A feeling like you aren’t getting quite enough air.  \n\nWe also breathe slow: Breathing in for 5 seconds and out for 5 seconds:  This stimulates the vagus nerve and activates the calming parasympathetic branch of the nervous system.\n\nAnd we breath deep: Now This doesn’t mean taking big deep breaths, but rather it means breathing diaphragmatically: Focusing our awareness around the side of the lower 2 ribs as they gently move out to the side on the in breath, and then move back in again on the out breath.  \n\nThe recommended posture for this exercise is lying on your back with your feet flat on the floor and your knees pointing upwards.  \n\nIf you find it helpful you can place your hands at either side of the lower two ribs to help you feel the movements of the diaphragm as you breathe.\n\nI’ll guide you with both my voice and also some bell sounds and that means you can keep your eyes closed if you wish.  \n\nSafety:\n\nBreathwork is powerful.  It can change your heart rate, your blood pressure and even the PH of your blood.  Although this exercise is suitable for most people, please don’t use it if you are pregnant or have any serious health conditions without first consulting your doctor or therapist.  Most importantly, listen to your body and take a break or stop if you need to.  Also, please don't listen to this recording while driving or operating machinery. \n\nAbout Neil:\n\nWork with Neil on a 1-2-1 basis from anywhere in the world over Zoom:\nhttps://www.thebuteykomethod.com/one-to-one-buteyko-breathing\n\nDisclaimer: \n\nThe content of this video does not constitute medical or professional advice or services. The primary purpose of this video is to educate and inform. Before making changes to your lifestyle, diet, exercise, drug or supplement routines you must first discuss the changes with your doctor. To reduce the risk of injury, never force or strain during exercises and never listen or watch this video when driving or operating machinery. If you experience pain or discomfort, stop immediately and consult your doctor.  Other special cautions may apply to individuals with specific health issues, please consult your doctor if you are uncertain whether the exercises or advice is suitable for you. Any liability, loss or damage in connection with any use of this video, including but not limited to any liability, loss or damage resulting from the performance of the exercises or advice and information given here, is expressly disclaimed. This video is available for private, non-commercial use only. You may not edit, modify or redistribute this video.\n\nMusic:\nAmber Glow / Calm / courtesy of www.epidemicsound.com\n\n#buteykobreathing #breathwork #diaphragmaticbreathing #breathingexcercises #guidedbreathing  #breathingtechnique",
  "channelTitle": "The Buteyko Method",
  "channelDescription": "Hi, I'm Neil, and I'm a Buteyko Breathing,  mindfulness and deep relaxation teacher.  I offer Buteyko Breathing courses and one-to-ones on Zoom.\n\nI specialise in helping clients to heal from anxiety, brain fog, burnout and chronic illnesses such as Asthma, CFS/ME and Long COVID. I also offer mindfulness and breathing workshops for corporate clients.  If you are interested in working with me, you can contact me via my website: www.thebuteykomethod.com.\n\n\n\n",
  "tags": [
    "belly breathing",
    "breath in breath out",
    "breathing exercises",
    "breathing exercises for anxiety",
    "breathing exercises for anxiety relief",
    "breathing exercises for stress relief",
    "breathing slowly",
    "buteyko",
    "buteyko breathing",
    "buteyko breathing exercises",
    "buteyko breathing guided",
    "buteyko method",
    "deep breathing exercises",
    "diaphragmatic breathing",
    "guided breathing"
  ],
  "publishedAt": "2022-09-13T11:15:40Z",
  "duration": 556,
  "durationFormatted": "9:16",
  "viewCount": 434241,
  "likeCount": 11972,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UK3evBQkeEU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UK3evBQkeEU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UK3evBQkeEU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UK3evBQkeEU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UK3evBQkeEU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UK3evBQkeEU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Its interesting how many names there are  around the world for every one breath ratio. The 5.1.5 Breath is the number 1 nervous system reset method  in yoga and a 5 count breath is also akin to buddhist breath work . The 5 count breath through the nose  is also called the Earth Breath because it is for grounding and centering. The subtle breath opens up the breath inside of the breath, and activates spiritual centers. The cathartic body breathing opens up the primal and instinctual centers and is excellent for ridding off unused and often times misused stored energy. Its good to take into consideration  one&#39;s temperament and emotional constitution to recommend which ratio and level of energy output their life-force  will most resonate with.",
    "Was a bad asthmatic for years. Ended up in hospital a couple of times. Did a 6 week Buteyko course and have not wheezed since or needed Ventolin. That was 20 years ago.",
    "It definitely makes a difference. My consciousness slows down. The dizziness and faintness goes down a notch. I feel calmer and more centred. It doesn&#39;t quite make the brain fog subside all in one go, but it aids in the recovery. Thank you!",
    "thank you for taking the time to put together this helpful breathwork videos",
    "Time passes so quickly with your videos.  How enjoyable your voice is with this beautiful healing practice.  Bless you 🙏"
  ],
  "channelSubscriberCount": 77900,
  "channelVideoCount": 41
}