{
  "video_id": "UNqAsbupP6o",
  "title": "Free 45 Minute Spin Class |  Burn up to 600 Calories with Tabata Drills & Power Surges",
  "description": "Burn calories fast and build endurance in this 45 Min Spinning Workout with power surges, Tabata drills, and strength climbs.\n\nLiked this class? Great! We've got more amazing sample workouts right here on our YouTube channel or better yet...\n\nSTART YOUR FREE TRIAL - NO CREDIT CARD REQUIRED!!!\n\nGet the full, ad-free Studio SWEAT onDemand Experience, with a FREE TRIAL to get instant access to our entire library of workouts, including non-stop new releases! \n\nJust download the Studio SWEAT onDemand app (Google Play Store, iOS app store, ROKU, Apple TV, Fire TV, etc!) or go to: \nhttps://www.studiosweatondemand.com/freetrial-youtube\n\nALREADY COMPLETED YOUR FREE TRIAL?\nWell, that’s cool. Thank you!! \n\nThe next step is to become an official SSoD member by picking your plan using the link below. We promise you will not regret it. \n\nYou will then be a certified sister or brother in sweat!\nPick Your Plan Here: https://bit.ly/2H9lPt8   \n\nABOUT US. ABOUT YOU.\nAt Studio SWEAT onDemand, our mission is to help people just like you fall in love (and stay in love) with fitness. \n\nIt’s not about us, it’s about YOU. \n\nAnd, we recognize that fit comes in lots of shapes and sizes.\n\nWe aren’t here to put on a show – our authentic, genuine, amazing, world-class (we could go on and on) trainers are here to give you the BEST WORKOUTS to help you get real results.   \n\nHeck yes, let’s go!!!\n\nYours in SWEAT,\n\nThe Entire Studio SWEAT Crew\n\n#workoutmotivation #fitnessmotivation #fitnessjourney #fitnessworkout #homeworkout #homegymworkout #spinningclass #spinclass #indoorcycling #indoorcyclingclass #indoorcyclingvideo #workoutdiscipline #workoutendorphins #tabata #tabatatraining #tabataworkout",
  "channelTitle": "Studio SWEAT onDemand",
  "channelDescription": "Welcome to StudioSweat onDemand (SSoD) where you come to work out with REAL PEOPLE and get REAL RESULTS. No models, no B.S., we're here to help YOU become the BEST version of yourself. \n\nOur channel features a ton of workout videos including spin indoor cycling classes, HIIT, Strength, Kettlebell, Pilates, Yoga, TRX, and more. We're adding more variety of workout lengths and classes for different levels. \n\nIf you loved our free classes, check out our ENTIRE video library of 1000+ fat-torching workouts that you can stream anytime, anywhere.\n\nAccess ALL workouts FREE for 7 days: https://www.studiosweatondemand.com/freetrial-youtube/\n\nABOUT Studio SWEAT onDemand:\nStudio SWEAT onDemand is an online app and platform that provides full hour and express specialty Spin®, TRX® and other amazing Total Body workouts, available to stream and download at your convenience. New workouts and spin workout classes with fresh tunes are released all the time! www.studiosweatondemand.com\n\nLet's go!\n~Cat",
  "tags": [
    "indoor cycling",
    "spin class",
    "cycling workout",
    "spinning class",
    "global cycling network",
    "indoor cycling workouts",
    "cycling motivation",
    "endurance training",
    "45 minute spin class",
    "spinning workout for beginners",
    "45 min spin class",
    "45 minute cycling workout",
    "45 minute spin workout",
    "45 min spinning class",
    "45 min cycling class",
    "spin class 45 min",
    "spin workout 45 min",
    "45 min spin workout",
    "45 min cycling workout",
    "45 minute cycling class",
    "45-minute spin class",
    "tabata",
    "tabata workout"
  ],
  "publishedAt": "2022-12-26T14:00:11Z",
  "duration": 2749,
  "durationFormatted": "45:49",
  "viewCount": 213953,
  "likeCount": 2745,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UNqAsbupP6o/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UNqAsbupP6o/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UNqAsbupP6o/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UNqAsbupP6o/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UNqAsbupP6o/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UNqAsbupP6o\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Get instant access to tons of workouts just like this with a 7-Day Free Trial of Studio SWEAT onDemand @ <a href=\"https://www.studiosweatondemand.com/freetrial-youtube\">https://www.studiosweatondemand.com/freetrial-youtube</a> now!!",
    "Fred,<br>I want to thank you for pushing me every time I get onto my bike to ride.   I was 200 lbs in July 2023, high blood pressure and some personal stuff that was weighing heavily on me.  I’m a soccer player and have been playing since I was 5.  I haven’t been playing because my knees are old 😂 and riding instead.  Currently I’ve lost about 20 lbs of the 50 I need to lose and my blood pressure is back to normal.  <br>Thank you for being the sunshine and positivity I needed in my darkest days. Sincerely, a grateful rider ❤",
    "Fred keeps you energized and motivated just when you wanna give up. He’s got a great attitude and his music is upbeat and uplifting. ⭐",
    "Fred’s classes are the only classes I’ll take! He’s the absolute best! 😊",
    "Best class I have found.  Good music, just enough talking but not too much and it’s help hints not just babbling."
  ],
  "channelSubscriberCount": 169000,
  "channelVideoCount": 1299
}