{
  "video_id": "UoHk0DHHGyQ",
  "title": "Morning Energy Yoga | 20 Minutes | All levels",
  "description": "👉🏼 Last few days to register for our 21-Day Yoga Program: https://yoga.satvicmovement.org/?utm_source=sy_yt&utm_medium=video_desc&utm_campaign=morningenergyyoga\n ✨ \nTo practice many asanas, meditations and learn the yoga philosophy.\n\nThis beautiful morning yoga flow is the perfect substitute for your coffee or tea. Only, it will not dump you after a few hours ;) During this yoga practice, you'll experience the benefits of deep breathing techniques, which oxygenate the body, increase mental clarity, and improve overall vitality. You'll also flow through a sequence of postures specifically chosen to awaken your muscles, increase circulation, and stimulate your energy centers, leaving you feeling refreshed and ready to take on the day.\n\nWhether you're a beginner or an experienced yogi, this routine is suitable for all levels. Our instructor will provide modifications and variations throughout the practice, allowing you to adapt the poses to your individual needs and abilities.\n\nMake self-care a priority and carve out just 20 minutes each morning to dedicate to yourself. With consistent practice, you'll notice a significant improvement in your energy levels, focus, and overall well-being.\n\nSubscribe to our channel for more yoga videos, wellness tips, and inspiration. Hit the notification bell to never miss an update! Start your mornings right with our Yoga for High Morning Energy routine and get ready to embrace the day with vitality and enthusiasm!\n\nThings to remember \n1. Practice on an empty stomach. Always keep a gap of at least 3 hours between your meal and practice. If you have had a fruit, 2 hours is good enough.\n2. Wear loose cotton clothes while practising. Please do NOT wear tight, polyester, dry fit clothing while practising yoga. Your skin needs fresh air as you get in and out of asanas. \n3. Practice only as much as you comfortably can. Never try to force yourself into poses. Please remember to be gentle with yourself.\n4. If you’re a complete beginner, it would be wise to keep a mirror next to you. This will help you observe yourself as you get in and out of asanas and allow to self-correct\n\nStay consistent with your practice with this yoga camp. It’s okay to miss one day but never miss twice! Happy Practising 🥳\n\nStay connected with us on Instagram for daily yoga knowledge - https://www.instagram.com/satvic.yoga/\n\nFor food and lifestyle related guidance subscribe to our channel @SatvicMovement \n______________________________________________________________\n\nDisclaimer: Satvic Movement recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise program, there is the possibility of physical injury. If you engage in this exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities and assume all risk of injury to yourself.",
  "channelTitle": "Satvic Yoga",
  "channelDescription": "Yoga Wing of Satvic Movement \nThis channel aims to share yogic practices to reach our highest physical, mental and spiritual health. Satvic Movement, a holistic health education platform, was founded in August 2017 by Subah and Harshvardhan Saraf, and today it has become a rapidly growing organisation that has transformed the lives of millions of people. Through this channel, we intend to make the knowledge of yoga available to every person who wants to learn and practice Yoga.\n\nWhat can you expect?\nWe will have the following playlists:\n- 21 Day Satvic Yoga Beginners camp\n- 20 minute asana videos for physical health like weight loss, high energy and strength \n- 20 minute asana videos for mental health for problems like anxiety, depression and stress\n- 15 minute guided Kriyas for clarity of mind and joyful living!\n\n\n\n",
  "tags": [
    "Morning yoga routine",
    "Yoga for energy",
    "20-minute yoga",
    "Beginner yoga flow",
    "Morning yoga for beginners",
    "Yoga for all levels",
    "Energizing yoga practice",
    "Quick yoga workout",
    "Morning stretch yoga",
    "Yoga to start the day",
    "Short yoga routine",
    "Quick morning yoga",
    "Yoga to wake up your body"
  ],
  "publishedAt": "2023-06-02T13:00:19Z",
  "duration": 1265,
  "durationFormatted": "21:05",
  "viewCount": 1170575,
  "likeCount": 20951,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UoHk0DHHGyQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UoHk0DHHGyQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UoHk0DHHGyQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UoHk0DHHGyQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UoHk0DHHGyQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UoHk0DHHGyQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Join our Beginner Yoga Sadhana Program Starting on 17th March. 🧘<br><br>Click here to learn more: <a href=\"https://yoga.satvicmovement.org/?utm_source=sy_yt&amp;utm_medium=video_desc&amp;utm_campaign=commentsection\">https://yoga.satvicmovement.org/?utm_source=sy_yt&amp;utm_medium=video_desc&amp;utm_campaign=commentsection</a>",
    "I&#39;m preparing for an exam, I study pretty much all day, doing these for 20 minutes in the morning makes me energetic and fresh all day. Great investment of my 20 minutes a day",
    "I just did the beginners asana practice for the first time with Satvic Yoga-- I LOVED doing this practice with teachers from India! Their choice of words and explanation of what opening each chakra can do for us was very empowering.",
    "Deep gratitude ❤ first day of self care and truly enjoyed the practice with you 🙏🏻 thank you",
    "I have watched and followed all of your Yoga videos, but this one is my absolute favorite and I like to do this 20 mins practice more so than the other ones. This is the best video for a working person like me. Give me a burst of energy whilst and once I am done doing this flow."
  ],
  "channelSubscriberCount": 1990000,
  "channelVideoCount": 269
}