{
  "video_id": "uQgE2KkKqAE",
  "title": "5 Minute Guided Box Breathing For Stress & Anxiety I Alt Version (Pranayama)",
  "description": "Feeling stressed or anxious? Try this simple breathing routine to instantly feel calm \nWant to deepen your practice? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite with T-Shirts and more:\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBy engaging in longer and more intense sessions, breathers may access a deeper and more immersive state of self-discovery. This experience can lead to a greater level of insight, the emergence of new and enlightening thoughts, heightened awareness of one's emotional state, and improved clarity. If you are interested in diving further into your own being, longer sessions are available on my Patreon channel.\n\nI personally make all aspects of creating this content, including the music, guided voice, and video editing. It brings me pleasure to create content that can benefit you, and my hope is that it can help you improve your life in various ways, such as fostering self-love and kindness, reducing stress and anxiety, decreasing inflammation, and increasing energy. Whatever improvements it may bring, I encourage you to take a moment to appreciate yourself for investing time in your personal growth.\n\nIncorporating regular Breathwork practice into your life can yield tangible benefits such as an improved immune system, less anxiety, an overall happiness for life, reduced stress and inflammation, enhanced focus, increased energy, and more. My guidance and the rhythmic music can facilitate a deeper state of relaxation and bliss. For the full experience, it is recommended to wear headphones and find a quiet, comfortable environment.\n\nSafety Disclaimer\nAll information provided by this channel is only for educational and entertainment purposes.  Sandy is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal.  If you faint, however, you have gone too far and should take it more slowly next time.\n\n#breathwork #pranayama #meditation",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "box breathing meditation",
    "box breathing 5 minutes",
    "box breathing technique",
    "pranayama breathing",
    "pranayama yoga",
    "sama vritti breathing",
    "breathwork for anxiety",
    "breathwork for sleep",
    "guided breathing",
    "wim hof breathing technique",
    "wim hof breathing",
    "yoga breathing exercises",
    "calming breathing exercises",
    "how to alleviate stress and anxiety",
    "guided breathwork",
    "guided breathing meditation"
  ],
  "publishedAt": "2023-06-12T15:00:11Z",
  "duration": 487,
  "durationFormatted": "8:07",
  "viewCount": 197173,
  "likeCount": 4171,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/uQgE2KkKqAE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/uQgE2KkKqAE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/uQgE2KkKqAE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/uQgE2KkKqAE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/uQgE2KkKqAE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/uQgE2KkKqAE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "READ FIRST: If using only your left nostril is too difficult, use both nostrils for this exercise. And if your nose is blocked, use your mouth. There’s no right way, listen to your body and enjoy 🙏🏼",
    "Good morning, I was diagnosed with Pots syndrome 6 months ago.  At first, when I found this breathing exercise video i was doing the exercises beacuse i was told i had anxiety. The breathing alone got me a long way with my POTS symptoms without me realizing it. I wish i could do this breathing exercises all day long to keep my nervous system relax, thank you so much for sharing this video with those of us that need it the most 🙏",
    "For the person experiencing menstruation, i find that it really helps me with pain management ! I did it with both nostrils in the inhale and exhaled with the mouth. I also recommend using a hot water bottle on the belly, raspberry leaf tea and doing light yoga and/or walking. Hoping this can help someone 🤍 I really love your videos Sandy, keep up the good work :)",
    "Thank you for your help. I have had anxiety since I was a child . Started meditating and prayer along with your breathing exercises and my anxiety is almost gone! I consider this a miracle. I wish I had known this when I was a practicing nurse I could have helped so many. God bless you and your work.",
    "Morning beautiful breathwork brothers and sisters ❤ <br>I was just watching another Breathe with Sandy Breathwork video when this popped up.<br>Much love everyone ❤"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}