{
  "video_id": "uTo2m16eJqI",
  "title": "INTENSE 10 MINUTE FAT MELTING HIIT CARDIO WORKOUT [10 SECOND BREAKS]",
  "description": "Let's burn some calories and MELT some FAT with this at home 10 min hiit cardio workout. SPEED EDITION!! As always, I will be working out along with you as your virtual trainer, to not only show you each of these exercises, but to also push you to keep going! Don't quit on me!\n\nIf you need to take an extra rest break, or drink some water, feel free to pause the video, and pick back up where you left off. Eventually you will get to the point where you can push your self to finishing the entire 10 minute session for the gains! IF YOU STAY CONSISTENT! \n\nThere will be 50 seconds on and 10 seconds off. 10 different exercises! No repeating movements[with the exception of jumping jacks! Whether your goal is to lose weight, get shredded, or build muscle you can benefit from this video!\n\nThis workout will get you sweating more than ever within just a few minutes of it beginning. Make sure you bring water, and maybe a towel if you're at home on a hardwood floor surface! \n---------------------------------- \n4-8 Week Push-up Progression Training Program: https://bit.ly/3Cea5Ql\n\n8-16 Week Gym Training Program: https://bit.ly/3z81HQF\n\nYOGA Mats: https://bit.ly/3AdcnPi\n\nSunday Live sessions!!!! \n\nBecome a member!!! https://bit.ly/399zdvm\n ---------------------------------",
  "channelTitle": "BullyJuice",
  "channelDescription": "I'm here to provide Information, Entertainment, & Motivation. Please subscribe, & follow my journey. I promise you won't regret it..",
  "tags": [
    "bullyjuice",
    "bullyjuice workout",
    "cardio",
    "hiit cardio workouit",
    "hiit cardio",
    "45 min workout",
    "hiit",
    "cardio workout",
    "lose weight",
    "burn fat",
    "losing weight",
    "burn calories",
    "fat lose",
    "lose fat",
    "weight loss",
    "weight loss exercises at home",
    "at home workout",
    "at home",
    "workout",
    "workouts",
    "no repeat exercise",
    "movements",
    "get shredded",
    "shreds",
    "weight lost",
    "lose weight fast",
    "10 MIN",
    "speed",
    "fast"
  ],
  "publishedAt": "2022-09-17T15:00:11Z",
  "duration": 632,
  "durationFormatted": "10:32",
  "viewCount": 3147402,
  "likeCount": 59377,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/uTo2m16eJqI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/uTo2m16eJqI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/uTo2m16eJqI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/uTo2m16eJqI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/uTo2m16eJqI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/uTo2m16eJqI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m down 12 pounds in 1 months good balance diet with cardio and strength training. If you are aiming to lose weight always remember it&#39;s calories out vs calories In!! Good luck on your journey everyone!!",
    "I’m 27 years old just got out a 6 year relationship and came out with 2 kids on top of it. I used every an excuse everyday for last 5 years not to stay in shape and now I’m the worst shape I’ve been in my life, now working my Ass off to get to new form of myself new mindset, new health, new body.! Thats why I started following you after doing research and reading comments this community behind you is very uplifting. Today starts day 1 for me in getting newer me. it was a rough start gonna get use to it💪",
    "77y o just completed 10 min all the away through first time . Have been working on it for 3 weeks I want you to know that you inspire people and change lives .Thank You RD Lee.",
    "Just did this during Ramadan as I have no intention of spending half an hour on the treadmill while fasting. Thank you, it was a great session!",
    "i can honestly say i did this workout pretty consistently and lost 40+ lbs over a few months"
  ],
  "channelSubscriberCount": 9740000,
  "channelVideoCount": 450
}