{
  "video_id": "uttz-TKTQF4",
  "title": "10 Minute Morning Breathwork Routine To Start Your Day Anxiety Free",
  "description": "Breathe away all anxiety and worry about your day in just 10 minutes. This guided breathwork session is designed to help you start your day anxiety-free and full of energy. Whether you're a beginner or a seasoned breathworker, this simple breathing technique will enhance your mental clarity, reduce stress, and improve your overall well being. Perfect for anyone looking to transform their morning routine into a source of calm and vitality. \n\nWant longer videos? Come join us on Patreon\nhttps://www.patreon.com/breathewithsandy\nWebsite & Newsletter\nhttps://breathewithsandy.com/\nSubscribe for more content like this:\nhttps://www.youtube.com/c/breathewithsandy\nIf you want to share some love and create good Karma you can buy me some coffee below. \nhttps://www.buymeacoffee.com/BreatheWsandy\nFind me on instagram: \nhttps://www.instagram.com/breathewithsandy/\n\nBy engaging in longer and more intense sessions, breathers may access a deeper and more immersive state of self-discovery. This experience can lead to a greater level of insight, the emergence of new and enlightening thoughts, heightened awareness of one's emotional state, and improved clarity. If you are interested in diving further into your own being, longer sessions are available on my Patreon channel. https://www.patreon.com/breathewithsandy\n\nI personally make all aspects of creating this content, including the music, guided voice, and video editing. It brings me pleasure to create content that can benefit you, and my hope is that it can help you improve your life in various ways, such as fostering self-love and kindness, reducing stress and anxiety, decreasing inflammation, and increasing energy. Whatever improvements it may bring, I encourage you to take a moment to appreciate yourself for investing time in your personal growth.\n\nSafety Disclaimer:\nAll information provided by this channel is only for educational and entertainment purposes.  Breathe With Sandy LLC is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of the information or advice given in these videos. . If you partake in this breathing session, you agree that you do so at your own risk, are voluntarily participating in these sessions, assume all risk of injury to yourself.\nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell stop. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in physical injury. These breathing techniques  may cause tingling sensations, a ringing in the ears, and/or dizziness in the head. If you feel any of these responses, don't panic it is completely normal. \n#anxietyrelief  #breathwork #stressrelief \n00:00 Intro \n02:00 Breathwork Starts",
  "channelTitle": "Breathe With Sandy",
  "channelDescription": "Sharing the power of the breath with weekly guided exercises \n \n\nFrom world traveler to breathwork facilitator and content creator, I'm here putting a 21st century spin on ancient breathing techniques infused with rhythmic music that I produce myself. So the music, video editing, voice over and all else is done by me, with a heart intention behind it all.  I greatly appreciate all of the support helping me continue to improve. \n\nI create these videos and music with love, aiming to uplift and bring positivity. Longer sessions offer a variety of benefits, including heart opening,manifestation, dissolving of the ego and self limiting beliefs, releasing trauma, and accessing altered states of consciousness. For an enhanced experience, I recommend wearing headphones.\n\nIf you want to deepen your practice and receive longer breathwork videos + Meditations you can join our Patreon community:\nhttps://www.patreon.com/breathewithsandy\n\nMuch love,\nSandy \n\n\n",
  "tags": [
    "breathwork",
    "morningroutine",
    "anxietyrelief",
    "mentalhealth",
    "calmmind",
    "stressfree",
    "mindfulness",
    "dailycalm",
    "wellnessjourney",
    "wimhof",
    "yoga",
    "meditation",
    "pranayama",
    "selfcare",
    "peacefulmorning",
    "healthyhabits",
    "beginnersyoga",
    "holistichealth",
    "emotionalwellbeing",
    "mindbodyspirit",
    "personalgrowth",
    "breathe",
    "feelgoodmorning",
    "positivity",
    "meditationmusic"
  ],
  "publishedAt": "2024-05-06T15:00:08Z",
  "duration": 1071,
  "durationFormatted": "17:51",
  "viewCount": 309980,
  "likeCount": 6700,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/uttz-TKTQF4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/uttz-TKTQF4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/uttz-TKTQF4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/uttz-TKTQF4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/uttz-TKTQF4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/uttz-TKTQF4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Here is a 5 round 25 minute version with longer breath holds for those who want to dive a little bit deeper 🙏<br><br><a href=\"https://www.patreon.com/posts/104786668?utm_campaign=postshare_creator\">https://www.patreon.com/posts/104786668?utm_campaign=postshare_creator</a>",
    "When its time to wake up my son i turn on the light and say...allllllllright",
    "What I really truly appreciate is that the video doesn&#39;t end abruptly after the guided practice does. It leaves me such a comfortable and much needed, uninterrupted space to simmer in the benefits and go a little deeper before I end. Especially with the quality of music you have, its so precious and calming. This makes such a huge difference.",
    "Breath work is one of the  tools for personal transformation <br>When the outward world seems tumultuous look inward for peace and tranquility <br>Thank you for publishing this work",
    "Thank you for this lovely guided breathwork. Your presence on earth is appreciated by me and many others.🙏"
  ],
  "channelSubscriberCount": 256000,
  "channelVideoCount": 180
}