{
  "video_id": "uw1qkVgzVzo",
  "title": "10-minute ENCORE | Add to ANY workout!",
  "description": "Add this 10-minute encore to the end of any cycling workout to take your training to the next level!! This quick 10-minute challenge is packed with motivating songs and challenging pushes!! I am so excited you decided to take this extra challenge!! \n\n👉 Sign up for Bike & Bells THRIVE here! https://kaleighcohen.com/bikeandbellsthrive/\n\nIMPORTANT! The RPMs noted throughout the ride are just a range! Make sure to ride where you feel comfortable! That may be above or below the range indicated. \n\n🇮🇸 We're hosting a trip to ICELAND in JUNE 2024! Reserve your spot here! 👉 https://www.trovatrip.com/trip/europe/iceland/iceland-with-kaleigh-cohen-jun-2024\nCheck out what's included and the itinerary above! 👆\nSpots are limited | ONLY 15 SPOTS AVAILABLE! The first 10 people to sign up get an early bird rate and SAVE $100! Payment plan options are available! \n\nNeed a longer WARM-UP?  https://youtu.be/tOjKOmtPcqs\n\nMY LINKS:\nLooking for indoor cycling shoes?- https://ride.shimano.com/KCF15\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nSpotify playlist- https://open.spotify.com/playlist/0RoHjES1BkQDMtnGXw3icl?si=cecb1097cf984c7a\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\nADD IT:\nDESSERT!- https://youtu.be/7N1YgqcxqHs\n\nRESISTANCE for my classes\nYou always want to feel something under your feet, this will ensure you are doing the work, prevent you from bouncing in the saddle, and protect your knees!\n6 - Working your way up that hill | Moderately Light \n7 - Mid-hill already, you can definitely feel this! | Medium\n8 -  This is where heavy really starts to kick in | Moderately Heavy\n9 - We are really starting to climb now! This is a challenging resistance! | Heavy\n10 - Top of your hill! You should be able to keep a smooth pedal stroke. | VERY Heavy\nWatch this for more detail: https://youtu.be/8DbpBXGAB8Q\n\nPOSITIONS for my classes\n1st position: Seated position.\n2nd position: Standing with hands at the front of handlebars, also called jogs.\n3rd position: Standing with hands at the end of handlebars, also called climbs.\nOver the Saddle: 3rd position, hips shifted back slightly and chest over the front of the handlebars.\nJumps: seated to 2nd position.\nFreezes: 2nd position, minimizing upper body up and down movement. \nLeaps: seated to 3rd position.\nThe Trio: seated, 2nd, 3rd, 2nd, seated position.\nSwitchbacks: 3rd to 2nd position.\nTick Tocks: 3rd to over the saddle.\n\nMODIFICATIONS for seated options\n2nd position jogs and moves: Stay seated and increase speed a bit, really focus on the pull-up to activate the quadriceps.\n3rd position climbs and moves: Stay in the saddle and increase resistance a smidge, really focus on the push-down and pull-up of the pedal stroke to activate the glutes, hamstrings, and quadriceps maximizing power with the heavy resistance.\n\nCHAPTERS:\n0:00 - 2:47 JUMPS | Born for This by CRMNL\n2:48 - 6:25 ROLLING HILLS | Queuing Love Songs by NIGHTCAP\n6:26 - 9:27 SPRINT TO THE TOP | It's Going Down by Damned Anthem\n9:28 - 11:21 COOL DOWN | Feeling Good by Upstate\n\n\nSome of the links listed above are affiliate links, such as Amazon, and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for the harm, damage, or injury as a result of any information provided.\n\n\nMB01QEYGXBQJDN1",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [],
  "publishedAt": "2024-01-07T10:02:09Z",
  "duration": 681,
  "durationFormatted": "11:21",
  "viewCount": 53035,
  "likeCount": 1745,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/uw1qkVgzVzo/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/uw1qkVgzVzo/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/uw1qkVgzVzo/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/uw1qkVgzVzo/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/uw1qkVgzVzo/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/uw1qkVgzVzo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I love this new encore. I absolutely did not want to do it but I had to get to 45 minutes so I had to. And welcome little change.",
    "Every time I see you drop a towel I mean to come and tell you my solution to this, but I always forget after the ride is over.  On Amazon I found a roll of elastic with button holes all along it. I cut a decent length, sew a button on it, and thread it through the tag on the towel.  If the towel doesn’t have a tag I just cut a small hole near the end seam.  Then I attach it to my bike before my ride.  The elastic allows the towel to comfortably reach your face but if you drop it the towel still stays connected to your bike.  Sadly the only thing I can’t do is a towel ‘cheers’ at the end of the ride, but I’m there in spirit. Lol",
    "16w pregnant &amp; working out with you three times a week! Just finished this and a 20min ride! Wooohooooooo!!",
    "Took your advice and added to Monday&#39;s ( Tuesday for me) ride this week! This Encore is packed with awesomeness!",
    "Can we just all appreciate Kayleigh&#39;s motivating upbeat personality. No matter what kind of day im having, her videos lift me up!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}