{
  "video_id": "UyoqRHklKjc",
  "title": "15 MIN EXPRESS PILATES WORKOUT || Dynamic Intermediate Pilates (No Equipment)",
  "description": "Get ready to move with this Express Pilates Workout. This class is dynamic and fast-paced so don't worry if you have to do it a few times to get the feel of it. Have fun! 😊\n\n🤍 ¿Hablas español? Subscribe to my Spanish YouTube Channel.\nhttps://www.youtube.com/channel/UCnUpf4yc9TYkmhFUq4cbJoA\n\n🌸 Mat from Liforme - https://liforme.com/\nUse my code 'MOVEWITHNICOLEYOGA' for a discount.\n\n\n🤍 INSTAGRAM: @movewithnicole\n\n\n🎥 Videography by Bodie Rex\n♫ Music from https://www.epidemicsound.com/referral/n9a93q/\n\n\n\n\n\n--\nDISCLAIMER:\nPlease consult your doctor or health care professional before starting this workout. If you experience pain or discomfort at any time during this workout, you should stop immediately. By performing these exercises, you do so at your own risk. By using this video, you understand and agree that Move With Nicole Pty Ltd will not be held responsible or liable for any injury or loss you may suffer as a result of this workout video.",
  "channelTitle": "Move With Nicole",
  "channelDescription": "Hi, I'm Nicole! 😊 I am a Certified Pilates & Certified Yoga Instructor (RYT 500) with many years of in-studio teaching experience. As a former dancer and gymnast, I have always had a passion for movement and I love being able to share that passion with others. I believe in finding forms of movement that feel good for your body and soul and I hope that through my classes, I can guide you to your best feeling self!\n\n--\nI was a professional Latin Ballroom Dancer and taught Ballroom dancing to adults for 7+ years. This is truly where I established my passion for teaching movement. When I retired from competitive dancing in 2017, I began teaching Barre and Pilates in studios and gyms in Sydney.\n\nDuring COVID lockdown, Dance & Pilates studios closed and that was when I poured my love of teaching into this channel, hoping to help people keep moving and feeling good!\n\nThank you so much for practicing with me and I hope you enjoy the classes as much as I love creating them for you. 🩷\n",
  "tags": [
    "pilates workout full body",
    "full body pilates workout",
    "pilates full body workout",
    "pilates full body",
    "pilates workout",
    "full body workout",
    "at-home workout",
    "pilates for weight loss",
    "at-home pilates",
    "at-home pilates workout",
    "full body pilates",
    "total body workout",
    "move with nicole",
    "mat pilates",
    "everyday pilates",
    "express pilates",
    "15 minute pilates",
    "15 minutes pilates workout",
    "pilates workout 15 minutes",
    "pilates workout 15 minutes full body",
    "15 min pilates",
    "dynamic pilates"
  ],
  "publishedAt": "2024-03-07T12:09:09Z",
  "duration": 1091,
  "durationFormatted": "18:11",
  "viewCount": 1456722,
  "likeCount": 40650,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UyoqRHklKjc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UyoqRHklKjc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UyoqRHklKjc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UyoqRHklKjc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UyoqRHklKjc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UyoqRHklKjc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Oh boy - this workout embodies &quot;tiny but MIGHTY!&quot; Don&#39;t let the &quot;15 mins express&quot; title fool you. This will give you a burning but totally rewarding sweat!!",
    "I don’t know how you can kill me in 18 minutes-but THANK YOU. You have changed my life Nicole❤️🔥",
    "Love your classes. Please add more 10 min stretch and 15-20 min Pilates and yoga flow videos. I don’t have enough time for the longer ones and don’t like to stop mid stream and not finish out the workout without a wind down and final zen moment. Thank you for your time and efforts. You are greatly appreciated.❤",
    "Some of these moves can be really challenging, so I tell myself: If Mick Jagger can do yoga and pilates at 80, so can I at 46. 😁💪 Thank you Nicole for keeping us motivated and for always reminding us on a correct breathing technique.😊",
    "Thank you, Nicole, for all of your amazing classes! I started doing them in the beginning of the year, and now I do them as part of my daily routine and I feel better both physically and mentally because of them. It&#39;s one of the things in my day that I truly look forward to!  Thank you! 😀"
  ],
  "channelSubscriberCount": 4460000,
  "channelVideoCount": 229
}