{
  "video_id": "UZj1-pZYKrU",
  "title": "Advanced Power Breathing | TAKE A DEEP BREATH",
  "description": "🔹 Ready to transform your health? Download our FREE Breath Mastery Guide Here: https://www.takeadeepbreath.co.uk/feel-good-breathwork-3\n\n\nAbout This Video:\n10 Rounds of Deep Breathing | 30 Breaths | 2 Min Holds | Onscreen Timer\nMake sure you are subscribed so you don't forget to breathe:\nhttps://www.youtube.com/TAKEADEEPBREATH?sub_confirmation=\n\nAbout This Channel:\nHey there! I'm Mike Maher, founder of TAKE A DEEP BREATH and your personal breath coach.\nDid you know that 95% of us don't breathe properly? As a breath coach, I help you master your breath to:\n\n- Eliminate Stress\n- Boost Energy\n- Sharpen Focus and Concentration\n\nFor nearly a decade, I've explored the power of breathwork, combining ancient techniques with modern science. This isn't just another video course – I offer one-on-one live coaching sessions over Zoom, tailored to your needs.\n\nBy harnessing the power of your breath, you can unlock your full potential and transform every aspect of your life. Ready to feel amazing? \n\nLet's take a deep breath together and start your journey to a better you...\n\nBook a Complementary 1:1 Breath Coaching Discovery Call Here: ►►https://calendly.com/mike-maher/breathwork-discovery-call-clone?month=2024-09\n\nFor business inquiries: hello@takeadeepbreath.co.uk\n\nSafety Information: \nDo not practice this breathwork during pregnancy, or if you are epileptic. People with cardiovascular issues, or any other serious health conditions, should always consult a medical professional before starting breathwork. These breathing exercises are a guide only, you should always listen to your own body and not push yourself, if you feel unwell STOP. Never practice breathing exercises before or during diving, driving, swimming, taking a bath, or in any other circumstance where the loss of consciousness could result in bodily harm. Deep breathing may cause tingling sensations, a ringing in the ears, and/or light-headedness. These are normal responses and are no cause for alarm. If you faint, however, you have gone too far and should take it more slowly next time.\n\nDisclaimer \nThe information provided in this video is provided for informational purposes only and is NOT to be used or relied on for any treatment purposes. All information provided by TAKE A DEEP BREATH is of a general nature, only for educational/entertainment purposes. No information is to be taken as medical or health advice. Follow this breathing exercise at your own risk. TAKE A DEEP BREATH or Mike Maher is not responsible for any losses, liabilities, injuries or damages resulting from any and all claims as a result of your reliance on the information contained in this video. There is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself. We use affiliate links which means if you buy something, we'll receive a commission, we appreciate the support you give us and we hope to keep adding value to you.\n\nTAKE A DEEP BREATH is not affiliated, associated, authorized, endorsed by, or in any way officially connected with the Wim Hof, The Wim Hof Method, Innerfire, or any of its subsidiaries or its affiliates. The official Wim Hof Method Course can be found here: https://www.wimhofmethod.com/elearning",
  "channelTitle": "TAKE A DEEP BREATH",
  "channelDescription": "Welcome to TAKE A DEEP BREATH, My name is Mike Maher, I am a breathwork instructor, podcaster and researcher of the breath. I have studied many modalities and I am proud among other things to be an Oxygen Advantage Master Instructor.\n\nOn my channel here you will find a huge variety of Breathing Exercises for Health, Relaxation & Motivation. We also host #Breathcast which is a dedicated Breathwork Podcast where we interview the world's top breath and health experts.\n\nBreathwork is where you consciously alter your breathing pattern to achieve a set of results such as helping you to relax, raise your energy, increase your immune system, change your state of consciousness or calm your parasympathetic nervous system.\n\nBreathwork has been a key component in Yoga for centuries,  now with the help of people such as Joe Rogan & books such as the Oxygen Advantage, breathwork is part of mainstream society.\n\n\n",
  "tags": [
    "wim hof",
    "wim hof method",
    "wim hof vice",
    "wim hof interview",
    "cold showers",
    "wim hof science",
    "ice man",
    "iceman",
    "ice bath",
    "wim hof advice",
    "meditation",
    "wif hof",
    "wim hof joe rogan",
    "wim hof course",
    "breath work",
    "health benefits of mediation",
    "wim hof podcast",
    "breathing exercise",
    "wim hof breathing technique",
    "WHM",
    "breathing tutorial",
    "stress management",
    "cold therapy",
    "wim hoff",
    "deep breathing",
    "brown fat",
    "guided meditation",
    "free wim hof",
    "take a deep breath",
    "tadb"
  ],
  "publishedAt": "2019-03-21T22:58:42Z",
  "duration": 2987,
  "durationFormatted": "49:47",
  "viewCount": 1229649,
  "likeCount": 9741,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/UZj1-pZYKrU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/UZj1-pZYKrU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/UZj1-pZYKrU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/UZj1-pZYKrU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/UZj1-pZYKrU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/UZj1-pZYKrU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "❤ If you enjoyed this Breathing Exercise, then download our FREE Feel-Good Breathwork Guide here: ►► <a href=\"https://www.takeadeepbreath.co.uk/freepdf\">https://www.takeadeepbreath.co.uk/freepdf</a>",
    "Been doing the following for 2 months<br>1) this video<br>2) ice bath<br>3) meditation<br>4) semen retention<br>5) abstaining from alcohol<br>6) 1 hour workouts daily<br>7) 100oz of water daily<br>8) bare feet on ground atleast 30 mins daily<br>9) Lions mane mushrooms and cordeceps mushrooms daily<br><br>I&#39;m 35 but feel and move like I am 21 but think as someone twice my age.<br><br>The amount of self love and self respect i feel has never been matched by any other period of my life.",
    "Please never take this down, I use it every single day.",
    "I just made a decision to do this instead of attempting suicide. I was desperate to escape my pain. <br><br>Someone sent me this as I’m a huge fan of Wim Hof. Fortunately I chose to try this first. Got to round 8 and couldn’t stop crying and shaking. <br><br>I think I’ll get through these next few hours now. <br><br>Thank you for saving my life today. Whoever you are. God bless you…🙌❤️",
    "I&#39;ve been doing your 10 rounds of breathing for about 2 months now followed by an ice bath. Some of the things I noticed  is, I&#39;m mentally sharper and faster than people around me. I&#39;m aware of breathing deeply through out the day. I don&#39;t procrastinate as much. I&#39;m sticking to my workouts more. I don&#39;t need the acceptance of others. My intuition is spot on. I look better,  feel better,  and  I&#39;m more optimistic about my life. I seem to attract more younger pretty women. Even men are more attracted to me, in a none sexual way. Some guys seem to be jealous of me especially when there women are around me. That let&#39;s me know I&#39;m doing it right. I did 3 rounds of breathing for about a year, then I did 6 rounds of breathing for about 2 years.  I can feel a major difference between 6 rounds and 10 rounds. 3 rounds of breathing and a cold shower per day made me feel really good for a long time, 10 rounds of breathing and a daily ice bath put me on a superhuman level,  spiritually, physically,  and mentally. Thanks for your videos.  You are doing the lords work."
  ],
  "channelSubscriberCount": 295000,
  "channelVideoCount": 386
}