{
  "video_id": "V-wqo1aIpLU",
  "title": "30-min NO REPEAT Strength Training | FULL BODY SUPERSETS",
  "description": "Supersets, no repeat, and full body! This workout has everything to get strong and have fun! The focus for today's training is total body definition and building muscle! We will accomplish this by using supersets!\n\nOur supersets will follow a peripheral heart action structure to boost the intensity and effectiveness even more! PHA training is when we alternate between upper and lower body exercises with little rest between, this will pump the heart rate up as your body works to push blood from the upper and lower body during our pushes! This is a great way to build lean muscle while burning fat! And the no-repeat structure is helpful to keep our focus and keep things fun and we only get one chance to work on each exercise! \n\nIn order to maximize the hypertrophy goal of this workout aim to use moderately heavy weights relative to you and your training level and the exercises that we are performing! You will know you picked the right weight if by the last 10-15 seconds of our 45 seconds of work, the reps are getting very challenging, but doable with good form! \n\n30-MINUTE NO-REPEAT FULL BODY SUPERSET STRENGTH  WORKOUT EQUIPMENT, STRUCTURE, AND EXERCISES\n\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 25lbs / 4.5 to 11.3kg When selecting a weight for this workout, you want to lift moderately heavy!\n- EXERCISE MAT \n\nSTRUCTURE\nNO REPEAT STRUCTURE\n12 SUPERSETS | 24 EXERCISES \nWORK: 45 SECONDS REST: 30 SECONDS\n\nEXERCISE LIST\nCHEST PRESS | TATE PRESS\nRENEGADE ROW | PLANK TO LOW SQUAT TO CURL\nOVERHEAD SQUAT | ALT. DEAD STOP SNATCH\nKICKSTAND ROMANIAN DEADLIFT TO CURTSY LUNGE | SWITCH SIDES\nHAMMER CURLS | HAMMER PUMP CURLS\nKNEELING REAR DELT FLYS | HIGH KNEELING IN AND OUT SHOULDER PRESS\nSINGLE LEG GLUTE BRIDGE | SWITCH SIDES\nTRICEP OVERHEAD EXTENSION | SNOW ANGEL\nGOBLET SQUAT | LATERAL SQUAT 2 RIGHT/2 LEFT\nALT. DIAGONEL REVERSE CRUNCH | BUTTERFLY CRUNCH\nSTRAIGHT LEG CROSS BODY CRUNCH | SWITCH SIDES\n\nI am so glad you joined me for this workout! It's always better to workout with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2024-03-07T09:59:57Z",
  "duration": 1756,
  "durationFormatted": "29:16",
  "viewCount": 146303,
  "likeCount": 2565,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/V-wqo1aIpLU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/V-wqo1aIpLU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/V-wqo1aIpLU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/V-wqo1aIpLU/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/V-wqo1aIpLU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Well, this workout is full of strength. My arms, shoulders,  legs and my back do not look like an old 70 year old lady. I&#39;m so happy and my confidence is sky high. I believe that any form of exercise must include strength training because this is how we lose weight quicker and get a shapely physique and maintain the shape you want. Cycling has also changed my legs and I love the shape of my legs. Kaleigh, when I started cycling  with you years ago, I never thought I&#39;d shed 45 pounds and keep it off and have such a great attitude and  plus tone my entire body. Girl I even color my hair bright red now, 😅 Two things ill never give up are cycling and strength training. I am so fabulous and it&quot;s because of you and making exercise fun!😊❤❤",
    "No repeats are the best!!  And I loved that we did some of the more unique exercises.  Tate press was new for me--that one felt really good!!",
    "These 30 minute full body workouts are helping me so much. I have such bad gym anxiety so I’d rather work out at home but can’t ever figure out what I want to do. Thanks for doing what you do 🥰🥰",
    "She has got the gift of the gab. It takes a completely different and special effort to speak continuously during a strength workout. You rock Kaleigh 🤟",
    "No repeat supersets are my fave! Tate press was new to me, I was glad I went down 5 lbs for that one. Lots of stretching is on the menu for today and tmw as I&#39;m still feeling tight from Monday. 🔥💪❤"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}