{
  "video_id": "v7AYKMP6rOE",
  "title": "Yoga For Complete Beginners - 20 Minute Home Yoga Workout!",
  "description": "Yoga for Complete Beginners! Adriene welcomes all levels - complete and total beginners to start here! Hop on the mat and start to build the foundation of your own yoga practice with this 20 minute home workout video! Enjoy, stay mindful and find what feels good. \n\n#yogaforbeginners  #freeyogavideos #yogawithadriene\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for complete beginners",
    "yoga for beginners",
    "yoga poses for beginners",
    "beginners yoga",
    "beginners yoga class",
    "beginner yoga",
    "yoga at home",
    "yoga for weight loss",
    "yoga workout",
    "yoga (sport)",
    "free yoga videos",
    "yoga beginners",
    "how to yoga",
    "online yoga",
    "free yoga",
    "easy yoga",
    "free yoga videos online",
    "yoga basics"
  ],
  "publishedAt": "2013-11-18T03:56:16Z",
  "duration": 1425,
  "durationFormatted": "23:45",
  "viewCount": 54363037,
  "likeCount": 771180,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/v7AYKMP6rOE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/v7AYKMP6rOE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/v7AYKMP6rOE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/v7AYKMP6rOE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/v7AYKMP6rOE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/v7AYKMP6rOE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Literally to the 1% who&#39;s reading this, God bless you, and may your dreams come true, stay safe and have a wonderful day",
    "completely let myself go after years of depression and just basically losing myself, so i decided to try out something positive. Day 1- complete 🥳💗<br><br>Edit: thank you so much for the love guys🥺 I truly didn’t expect so much encouragement from you all! I gave up a few times, but I’m still going at it!💪🏾",
    "I&#39;m in tears... I feel so good and so much better physically and emotionally after doing this everyday for a week. I can&#39;t believe I waited until the age of 48 to start Yoga",
    "I’m trying yoga for the first time. Trying to be in better shape and deal with my anxiety. You made it seem approachable.",
    "I am 34 diagnosed with bad prognosis AML Leukemia. Six rounds of chemotherapy and this was the best 20 minutes of exercise I have had in nine months. Thank you."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}