{
  "video_id": "v7SN-d4qXx0",
  "title": "Bedtime Yoga | 20 Minute Bedtime Yoga Practice | Yoga With Adriene",
  "description": "This gentle bedtime yoga practice is a great remedy for anyone feeling stress, anxiety, or tension in the mind or body. Use this evening yoga practice to decompress, prepare for a good night's rest or simply use it any time of day to remedy the imbalance. Put on something comfy. Yoga to the rescue! Enjoy. \n\nFor more relaxing bedtime yoga practices, check out our Bedtime Yoga playlist: \nhttps://www.youtube.com/watch?v=v7SN-d4qXx0&list=PLui6Eyny-UzxlcWgUFYAcnNInS3SNe6Fs\n\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "bedtime yoga",
    "Bedtime yoga practice",
    "Bedtime yoga stretch",
    "Bedtime yoga routine",
    "yoga for sleep",
    "Sleep yoga",
    "Night time yoga",
    "Yoga before bed",
    "Evening yoga",
    "Yoga for insomnia",
    "Yoga (Sport)",
    "yoga with adriene",
    "hatha yoga",
    "yoga remedies",
    "adriene mishler",
    "yoga for stress",
    "yoga for tension",
    "yoga for relaxation",
    "relaxing yoga",
    "healing yoga",
    "yoga for flexibility",
    "yoga stretches",
    "meditation",
    "pranayama",
    "yoga practice"
  ],
  "publishedAt": "2015-12-16T19:30:01Z",
  "duration": 1149,
  "durationFormatted": "19:09",
  "viewCount": 20662240,
  "likeCount": 212076,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/v7SN-d4qXx0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/v7SN-d4qXx0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/v7SN-d4qXx0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/v7SN-d4qXx0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/v7SN-d4qXx0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/v7SN-d4qXx0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "What is something you can let go of for today?",
    "This 7 year old practice is truly the gift that keeps on giving <a href=\"UCkszU2WH9gy1mb0dV-11UJg/m8MfY4jbFsWJhL0PyouA2Ak\"></a>",
    "For almost the last 10 years, since I was a child, I&#39;ve had severe anxiety. It&#39;s uncommon for me to get more than a few hours sleep a night, I have chronic pain from holding so much tension, and I have constant intrusive thoughts, and many panic attacks. I often have to take sedatives to even begin to relax my body. I thought I&#39;d try this tonight and I cried mid way through because I could feel the tension leaving my body. I didn&#39;t think once about any of my worries, my fears, my &#39;failures&#39; during the day. It is bliss to have even 20 minutes without them. This was perfect. Thank you.",
    "While massaging my feet, I started thinking of where my feet had taken me the last 29 years. I couldn’t help but cry. It was such an intimate moment with myself. Thank you",
    "Just wanted to pop on here and say: I&#39;ve been using this video nightly for about a year now, and it has allowed me to start falling asleep at a normal bedtime and stop having PTSD nightmares. My mental health is improving, and I no longer have as much pain and tension in my shoulders and back. You are really transforming my life with this simple 20-minute practice. Thank you SO much for sharing!"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}