{
  "video_id": "VbQzf59pt5Q",
  "title": "Best Workout To Build Muscle After 50 (Dumbbell Workout Over 50)",
  "description": "Before you start this best workout to build muscle after 50, be sure to subscribe to the channel: https://www.youtube.com/liveanabolic?sub_confirmation=1\n\nBest workout to build muscle after 50 - hey man, in this video I’m going to give you the best workout to build muscle after 50. I get that you’re busy. Maybe you don’t have a lot of equipment. And you want something that’s going to help you build muscle without joint pain. Well, this is the best workout to build muscle after 50. So let’s get to it. \n\nFirst thing you should know with any workout to build muscle after 50 is to check your ego at the door. I know it sounds funny. But if you really want to build muscle after 50, young-guy workouts are not going to do it for you. Those type of workouts will hurt your testosterone and likely lead to injury or joint pain. I don’t want that for you. Because to build muscle after 50 years old you don’t have time to keep starting over from injuries or anything like that. Do you know what I mean?\n\nOkay so can you build muscle after 50? Yes. No doubt about it. And in this dumbbell workout over 50 I’ll show you how. Now, this workout to build muscle at 50 is a full body routine. So you don’t want to do this workout to build muscle at 55 every single day of the week. Instead, you’ll want to use this dumbbell workout over 50 just 3 times per week. \n\nSo another reason I call this the best workout to build muscle after 50 is because it is short, but the movements are very efficient. Basically, you’ll get the biggest bang for your buck. And this build muscle 50 year old man routine will do the trick. You’ve got presses, squats, rows, all the exercises that will help you make gains. So if you’re wondering can 50 year old man build muscle? Again, yes you can. Just follow this workout for building muscle after 50 and you’ll be in good shape. \n\nAlso, inside this building muscle after 50 male specific workout you’ll notice I’m giving a bunch of special cues. When it comes to how to build muscle after 50 you want to use proper form. If you don’t you’ll struggle to crack the code when it comes to how to build muscle mass after 50 and I don’t want that for you. So as you go over this dumbbell workout over 50, be sure to take the tips that I’m giving you because they will help big time. \n\nOkay so there you have it. The best workout to build muscle after 50. Know anyone else who could use this workout to build muscle after 50? Be sure to share this video with them: https://youtu.be/VbQzf59pt5Q\n\nGet your Ripped After 40 program here: https://rippedat40formen.com\n\nAlso, be sure to subscribe to the channel so you never miss out on another build muscle after 50 tutorial or dumbbell workout over 50 videos in the future!",
  "channelTitle": "Live Anabolic",
  "channelDescription": "Live Anabolic is a health and fitness channel for men over 40 who want to build muscle, burn fat, boost testosterone naturally and get back in shape. Our mission is to give men in their 40s, 50s, 60s and beyond content just for them. See, guys our age have to do things differently. And when you do, you'll see amazing changes with your body and health. Which is why our nutrition advice and workouts are specific to older men who want to get their body, energy and life back. Welcome to the channel!",
  "tags": [
    "best workout to build muscle after 50",
    "workout to build muscle after 50",
    "build muscle after 50",
    "build muscle after 50 years old",
    "can you build muscle after 50",
    "workout to build muscle at 50",
    "workout to build muscle at 55",
    "build muscle 50 year old man",
    "can 50 year old man build muscle",
    "building muscle after 50",
    "building muscle after 50 male",
    "how to build muscle after 50",
    "how to build muscle mass after 50",
    "dumbbell workout over 50",
    "workout for men over 50",
    "gary walker workout"
  ],
  "publishedAt": "2019-07-15T15:55:01Z",
  "duration": 498,
  "durationFormatted": "8:18",
  "viewCount": 545066,
  "likeCount": 9251,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VbQzf59pt5Q/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VbQzf59pt5Q/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VbQzf59pt5Q/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VbQzf59pt5Q/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VbQzf59pt5Q/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VbQzf59pt5Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hey man, in this workout I&#39;m going to give you an awesome workout you can do at 50+ using only dumbbells. Comment below and let me know what you think of the routine!",
    "I&#39;m 59 and I just finished my second week (3 workouts a week) and I&#39;m already seeing results and I have increased weights from when I started. This workout is perfect for me with my equipment at home. Also, wanted to let you know that posting these on YouTube is effective as I purchased your Ripped after 40 workout. And thanks for showing us what the perfect, natural physique looks like. You give me something to shoot for.",
    "I had a health setback that kept me from my usual workouts. Months later, when I went to start back, I didn’t know where to begin. I saw your after 50 workout on YouTube, and since I’m 62 I figured I’d start here. I’m thrilled that  I came across you, and this routine ... I feel like it’s the  perfect way to get my workout “groove” back again! Thanks so much!",
    "Efficient. Functional. Focused. As a dude born in the 60&#39;s, I appreciate the simplicity. Well done, brother, and thank you...",
    "I am 65 and go to the gym 6 days a week. It is an investment in my health which potentially could save me thousands of dollars in medical bills in the future. I think it is worth the time and energy to watch what you eat and do some form of cardio/resistance training daily."
  ],
  "channelSubscriberCount": 691000,
  "channelVideoCount": 1137
}