{
  "video_id": "VEHDLpM5w1I",
  "title": "30-minute Full Body NO REPEAT Strength Training",
  "description": "This is fun and effective strength training for your entire body! Our training session includes 24 exercises to build full-body functional strength, improve balance, and provide you with a workout that will get you stronger in your training and stronger in life!! The structure for today's workout is fun and challenging! I love no-repeat workouts because they move quick and we get only one shot to maximize each exercise! With that in mind, as we work through our 24 exercises remember to give it your all to really reap the benefits this workout will provide you with! Now, let's get STRONG!\n\n30-MINUTE FULL BODY NO-REPEAT STRENGTH WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 15lbs to 45lbs / 7 - 20.4kg When selecting a weight for this workout, you want to lift moderately heavy! Pick a weight that will challenge you.\n\nSTRUCTURE\n24 TOTAL EXERCISES\nNO REPEAT STRUCTURE\nWORK: 45 SECONDS REST: 20 SECONDS\n\nEXERCISE LIST\n- GOBLET SQUAT\n- SUMO SQUAT WITH PRESS AND PASS\n- HIPS UP PULLOVER\n- NARROW PUSHUP\n- REVERSE GRIP CHEST PRESS\n- FORWARD/BACK LUNGE\n- SWITCH SIDES\n- NARROW RDL\n- KICKSTAND RDL AND ROW\n- SWITCH\n- CLOSE GRIP ROW\n- V-SIT ARNOLD PRESS\n- LONG LEVER GLUTE BRIDGE\n- NARROW GLUTE BRIDGE\n- LOW SUMO HOLD WITH CLOSE GRIP HAMMER CURL\n- KNEELING BICEP CURLS\n- TOES TURNED OUT CALF RAISE\n- KETTLEBELL OR DUMBBELL SWING\n- STEERING WHEEL\n- PLANK WALK\n- SIDE PLANK WITH KNEE PULL\n- SWITCH\n- LEGS OUT FULL SIT UP\n- HEEL TAPS\n \n\n\nI am so glad you joined me for this workout! It's always better to workout with a friend!\n\nKaleigh\n\nDon't forget to stretch! 👉 https://youtu.be/IjH_8pdybfs\n\nMY LINKS:\nAmazon Storefront- https://www.amazon.com/shop/kaleighcohenfitness\nLike to know about my outfit?- https://amzn.to/41ZammW\nProtein I Love! - https://bit.ly/3SPyEwG\nBecome a member here- https://www.buymeacoffee.com/kaleighcohen\nKCF merch- https://kaleighcohen.com/shop/\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is essential to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2023-09-26T08:59:55Z",
  "duration": 1789,
  "durationFormatted": "29:49",
  "viewCount": 235575,
  "likeCount": 4666,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VEHDLpM5w1I/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VEHDLpM5w1I/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VEHDLpM5w1I/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VEHDLpM5w1I/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VEHDLpM5w1I/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VEHDLpM5w1I\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I didn&#39;t want to go to the gym but i did it. I just knew I wasn&#39;t alone on this one. I said to myself “It&#39;s just for 30 minutes, you got this “Thanks for your workouts, they&#39;re very carefully prepared and on point 🎉❤",
    "Stroke gal here, feeling defeated on account of struggling to complete exercises that were once status quo for me but I didn’t quit.  Thanks for no repeat, mentally that helped me push through 😮",
    "My name is Stephanie and I love this workout. I’m totally blind. I love how you were very descriptive. Thank you. Keep that up.😊",
    "62 years young here!! Great full body WO!!🎉",
    "Often people say that dogs resemble their owner, this dog is very laid back :)  Love your energy, I just got a giant motivation boost!"
  ],
  "channelSubscriberCount": 324000,
  "channelVideoCount": 650
}