{
  "video_id": "vNyJuQuuMC8",
  "title": "20-Minute Yoga For Beginners | Start Yoga Here...",
  "description": "In this 20-minute session for beginners, we will work with breath and other foundational elements to set you up for a sustainable and beneficial practice you enjoy! This is the perfect practice to send to a friend who wants to get into yoga. This is also designed as the perfect all-around practice for someone of any yoga background, with a meditative pace and strong focus on form and function to increase flexibility, build strength, and regulate the nervous system.\n\nRepeat this practice and commit to consistency to feel your mental, emotional, and physical health transform. \n\nYou will move through breath work, poses for the spine, hips, shoulders, and core, as well as poses for the hamstrings, wrists, ankles, knees, and low back. \n\nYoga is for everyone! The hardest part is showing up. Thank you for allowing me to guide you through practice. Let me know how it goes for you in the comment section below!\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for beginners 20 minutes",
    "yoga for complete beginners - 20 minute home yoga workout",
    "yoga for beginners",
    "beginners yoga",
    "yoga for complete beginners adriene",
    "beginners yoga at home",
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "morning yoga",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne"
  ],
  "publishedAt": "2022-05-02T05:00:17Z",
  "duration": 1301,
  "durationFormatted": "21:41",
  "viewCount": 2605500,
  "likeCount": 34024,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/vNyJuQuuMC8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/vNyJuQuuMC8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/vNyJuQuuMC8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/vNyJuQuuMC8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/vNyJuQuuMC8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/vNyJuQuuMC8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I loved this yoga session for beginners! I&#39;m not into sports but I&#39;m starting to appreciate yoga and its gentle way to lead you to movement and awareness.",
    "Just wanted to pop in and say a quick thank you Adrienne! Had a daughter recently and went into heart failure needless to say I have been down for months and missed the new years 30 day journey for the first time in 4 years. SUPER glad to report I&#39;m back I did it just a couple months late and have been doing 2 or 3 videos every day since March. Your videos let me stay calm in my VERY uncertain world. Thank you from the bottom of my heart sending love to you and Benji!",
    "Köszönjük!",
    "❤ Beginning again! It was fabulous",
    "When you say the hardest part is showing up and you did it, following with take good care I feel so touched like I’m talking to a friend it feels so sincere. You are truly amazing. Thankyou for having this on YouTube for free ❤️"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}