{
  "video_id": "VrdrnXIpECU",
  "title": "15 Minute HIIT CARDIO INDOOR CYCLING WORKOUT",
  "description": "When you are short on time and still want to kick butt, this will be your go-to cycling class! This 15 minute HIIT cardio cycling workout brings the heat! 🔥 With minimal recovery and maximum effort, your goals won't slip away even when life gets hectic and time is of the essence!\n\nThis 15 minute HIIT CARDIO cycling workout is part of our FIT for YOU fifteen series! All of the workouts in this series are short, spicy, and effective! You can find the strength FIT for YOU series on the Kaleigh Cohen Strength Channel to really help you boost your power, endurance, and get stronger! Now that you've finished your cardio, find strength here! https://www.youtube.com/KaleighCohenStrength\n\nThis cycling class is filled with powerful songs and choreography to get your heart pumping and your mood lifted in a time crunch!\n\nRemember this is your workout! If you need a longer warmup before this ride find one here, https://youtu.be/EzEaTen6CMU \nTake longer recoveries when needed, pay attention to proper form, and give it ALL YOU'VE GOT!\n\nI am so excited that you are here for this workout! Let’s kick some butt!\n\nTHE AFTER PARTY! 🔥🔥 WANT MORE?! Make the most of your workout with this quick Tabata Burner! https://youtu.be/zus6t02H8oM\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spin class when I was 15. Since then I've been addicted to spin classes and indoor cycling. Now, as a certified Spin class Instructor, Stages Beats Instructor, and NASM certified fitness trainer, my goal is to share the most fun, motivating, and energizing indoor cycling workouts that will bring out your inner BUTT-KICKER!\n\nI'm so glad you decided to join my indoor cycling class today! Grab your water bottle, grab your towel, get on your bike and let's kick some butt! - Kaleigh Cohen Fitness\n_________________________________________________________________________________________________\n\n0:00 - 2:12 WARM UP | Hello Hello by Chair Model\n2:13 - 5:00 SPEED INCREASES | Rise Up by Emilio Rojas\n5:01 - 7:38 SPRINTS | Clap Your Hands by Catiso\n7:39 - 10:54 SPEED OVER SADDLE | Won't Let Up by Native 51\n10:55 - 12:19 INVERTED SPRINTS | Let's Play by The Smocks\n12:20 - 13:44 ROLLING HILLS | Just How We Do It by The Fancee\n13:45 - 15:27 JUMPS/ FREEZES | Power Theatrical Trailer by Until The Very End\n15:28 - 17:55 COOL DOWN | Take a Look Around by Paper Trees\n_________________________________________________________________________________________________\n\nNew to my indoor cycling workouts? START HERE! 👉  https://youtube.com/playlist?list=PLBJ0TIYiwZzihdgD643Q_JZ-kvakaybNG\n\nIf you are doing a Spin class on a stationary bike or exercise bike instead of a spin bike and prefer to stay in the saddle, DO THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance and try and keep the same cadence. \n_________________________________________________________________________________________________\n\n⭐️ Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/kaleighcohencycling\n\n⭐️ SAVE 15% on indoor cycling shoes here! Use code KCF15 at checkout! 👉  http://shimanoindoor.com/discount/KCF15\n\n⭐️ Want to maximize your workouts? Find awesome gear here? 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️ The best tablet mount for your spin bike!👉 https://bit.ly/2UeHHK1\n\n🎶 Jam out anytime and anywhere! Here are all of my Spotify playlists, just for YOU! 👉 https://open.spotify.com/user/7nc336145b90ijgxxg8o3wett\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ KCF fit wear, fitness tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\n⭐️ Want special KCF emojis and behind-the-scenes access? Become a Kaleigh Cohen Fitness channel member here! 👉 https://www.youtube.com/channel/UChY_9WJx0saa0St48lSdytQ/join\n\n⭐️ For those of you that asked how you can help support these indoor cycling workouts 👉 https://www.buymeacoffee.com/kaleighcohen\n\n⭐️ Share this cycling workout with a friend👉  https://youtu.be/VrdrnXIpECU\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n#HIIT #Cardio #IndoorCycling #CyclingWorkout",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "hiit cardio cycling workout",
    "cycling workout",
    "indoor cycling",
    "hiit",
    "burn fat",
    "spin class",
    "velo",
    "bike",
    "cycling training",
    "spinning",
    "fat burning",
    "spin workout",
    "spinning class",
    "workout",
    "hiit workout",
    "15 minute",
    "Kaleigh Cohen spin",
    "Kaleigh cohen",
    "online spin class",
    "free spin class",
    "spin class workout",
    "free online spin class",
    "best online spin classes",
    "spin class videos for home",
    "online streaming spin class",
    "best spin class",
    "indoor cycling workout"
  ],
  "publishedAt": "2021-09-13T10:35:02Z",
  "duration": 1076,
  "durationFormatted": "17:56",
  "viewCount": 172172,
  "likeCount": 3501,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VrdrnXIpECU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VrdrnXIpECU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VrdrnXIpECU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VrdrnXIpECU/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VrdrnXIpECU/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VrdrnXIpECU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I LOVE the music!!! Thank you for the positive upbeat music and lyrics!! No trash talking or explicit content!! 💗💗🤩🤩",
    "Terrific addition to another ride❤🎉Thank you Kayleigh and Jason🎉❤",
    "I love your workouts, but the pug gives me lifeeee🤣😍😍😆",
    "We&#39;re on top of the world! These workouts are what push us to keep building micro habits every day, bringing us closer to the top!",
    "Love this one, wish there were more 15 min’ers"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}