{
  "video_id": "VUjiXcfKBn8",
  "title": "10 Minute Guided Breathing Meditation",
  "description": "This Original 10 minute guided meditation recorded by us, will bring you into a peaceful state with just you and your breath.  Within just a few moments, with a focus on your breathing can heighten your mindfulness and clarity of the mind.  Enjoy!\n\nSpoken Voice: Original Commentary recorded by us.\nBackground Music: Composed by a member of this channel.\nBackground Image: is an original derivative unique to this channel, Transformed from images Licensed by shutterstock.com, and other Licensed images where attributions are not required.",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "meditation",
    "mindfulness meditation",
    "guided meditation",
    "10 minute meditation",
    "breathing meditation",
    "meditation guided",
    "meditation mindfulness",
    "meditation 10 minutes",
    "guided mindfulness meditation",
    "meditation breathing",
    "guided breathing meditation",
    "guided meditation 10 minutes",
    "guided meditation breathing",
    "guided meditation mindfulness",
    "morning meditation",
    "meditation morning",
    "guided meditation morning",
    "10 minute morning meditation"
  ],
  "publishedAt": "2021-04-04T09:00:09Z",
  "duration": 616,
  "durationFormatted": "10:16",
  "viewCount": 1408284,
  "likeCount": 24791,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VUjiXcfKBn8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VUjiXcfKBn8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VUjiXcfKBn8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VUjiXcfKBn8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VUjiXcfKBn8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VUjiXcfKBn8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To all those people who chose to come here to meditate. I want you all to know that the creator of this universe is proud of you for choosing meditation to relax/heal/calm yourselves and not resorting to other types of things like intoxication or anything to relax yourselves. You all are extremely strong and the creator of this universe is with y&#39;all so keep calm and meditate and you shall achieve what your soul seeks. Peace and love to all from India. 💙💜",
    "I&#39;m 50 now, and this is the first time ever I meditate, although I suffered inner anxiety and stress for all my life. I was very sceptical, but it really does help me. Thank you for making this available to everyone, in a way which allows for everyone to practice her / his own way and rhythm.",
    "I felt like my mind has been washed out with cold water. So calming and cooling meditation",
    "I just moved abroad for college, leaving my family and girlfriend back home. Been super stressfull couple of days, I am so happy I found this",
    "I started smiling and laughing after I thanked myself out loud for joining this meditation. What an amazing mood change from depression to utter bliss. I won&#39;t stop"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}