{
  "video_id": "VxHoJuyxiXs",
  "title": "Guided Meditation - Raising your vibration with the Angels",
  "description": "This video is a guided meditation that raises your vibration to the fifth dimension, which leads you on the ascension pathway. You will be connected to ten Archangels, who will help you open and activate your 12 chakras. This will bring you confidence, hope, wisdom and love.",
  "channelTitle": "Natasha Tome",
  "channelDescription": "We all have the Divine right to lead happy and fulfilled lives. My mission is to help that process for everyone through meditations, healing, and intuitive guidance.\nFor more information, visit www.natashatome.com",
  "tags": [],
  "publishedAt": "2016-03-26T11:24:58Z",
  "duration": 2182,
  "durationFormatted": "36:22",
  "viewCount": 4160179,
  "likeCount": 47435,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VxHoJuyxiXs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VxHoJuyxiXs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VxHoJuyxiXs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VxHoJuyxiXs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VxHoJuyxiXs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VxHoJuyxiXs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Been listening to this for eight years… Still here and October 2024❤❤❤❤❤❤❤❤",
    "During my meditation today, I was guided to share this message: “You all hold and have an inner light, shining even in your darkest moments.  Even in your saddest moments.  That light, that divine spark within each and every one of you, shines like an eternal flame, never going out, just radiating your beautiful selves outwards.  That light within you, is what you should nurture and tend to, feeding that light with hope, faith, positivity, love, joy, compassion, the list goes on. This light is your own sovereignty you hold within, and caring and nurturing that light is never selfish, it is what you must do, to fulfill your soul purpose. Stay in that alignment of light, allow it to burn steady and strong, unaffected by the winds of energy of all that surrounds you, only feel yourself shining bright, shining true, shining full of love.  Strong and steady, you have the utmost spiritual support behind you.”<br>During these times where we spend so much time at home, if you have a question, feel free to ask me by sending an email to natome44@gmail.com.  Sending lots of love out to you all.",
    "I&#39;m Hindu, strong belief in Archangels they are the most kind angels always helping me no matter what are the circumstances",
    "This has always been and will continue to be my absolute favourite guided meditation on the internet. It leaves me vibrating. Endlessly grateful for it, thank you.",
    "💖🙌💖   If you read this, doesn&#39;t matter where you are right now on this planet, I wish you a wonderful night and a happy peaceful life where all your dreams become true. Wishing you this from Colorado.💖🙌💖"
  ],
  "channelSubscriberCount": 40500,
  "channelVideoCount": 49
}