{
  "video_id": "VyvuWt3XVRI",
  "title": "PILATES ABS in 14 DAYS 🔥 Deep Core Activation | 8 min Pilates Workout",
  "description": "This pilates abs workout challenge will help you with deep core activation and get a strong pilates core in 14 days. It's an intense 8 minute at home pilates core workout with ab exercises to help you sculpt and lose belly fat. I challenge you to do this for 14 days and let me know how you do in the comments down below! For the best abs fat loss results, do this with my longer fat burn workouts on the LEAN App and healthy nutrition.\n\n🔥 Join the LEAN Transformation Method! 🔥 Get access to a structured 8 week guide, personalised meal plans, hundreds of recipes, and so much more right at your fingertips! Get the best results on the LEAN App: https://leanwithlilly.page.link/download-the-app-today\n\n👩‍🎓 Students get 25% off the LEAN Transformation Method on the LEAN App: https://www.leanwithlilly.com/student?ref=lillysabri\n\n🥤 The supplements & protein bars I use to get results: https://leanwithlilly.com/collections/nutrition?ref=lillysabri\n\n💪 Get your Free Home Workout programs here: https://leanwithlilly.com/pages/Lilly-Sabri-workout-guides?ref=lillysabri\n\n💙 Gymshark Outfit: https://gym.sh/Shop-LillySabri-YT\n\n🤍 FOLLOW ME:\nInstagram:  https://instagram.com/lillysabri\nTikTok: https://www.tiktok.com/@lillysabri?lang=en\nPrivate Facebook Group- Lean with Lilly Guides\nhttps://www.facebook.com/groups/508730913266325/\nTwitter:  https://twitter.com/lillysabri\nFacebook:  https://www.facebook.com/lilly.sabri/\n\n🔔 DON'T FORGET to Subscribe for daily uploads xx\nHit that bell icon to get a notification when I upload.\n\n0:00 Pilates Abs in 14 Days\n0:36 Get The Best Results\n0:54 At Home Pilates Abs Workout\n9:51 Complete Deep Core Activation Exercise\n\nDisclaimer: Please remember that we cannot spot reduce fat, meaning we can’t choose the areas on our body where we lose fat. However to get fat loss results I recommend the following:\n1. Being in calorie deficit\n2. Cardio/ HIIT workout (I often call these Fat Loss/Burn workouts on my channel)\n3. Resistance training and specific muscle targeted workouts. To strengthen and develop specific muscles.\nI have hundreds of other home workouts available on my channel, so you can pick and choose which workouts you want to do, to not only make you build a strong body, but also feel amazing.\nPlease remember every body is different and we all progress at different rates. The fact that you have shown up and completed this workout is incredible. You should be very proud of yourself for taking the steps to improve not only your physical, but also your mental health.\nThe key to achieving your fitness and health goals is consistency and healthy lifestyle changes, without restriction. I don’t believe in crazy fad diets. Simply eat nutritious food, move your body, smile and enjoy the journey! Love Lilly",
  "channelTitle": "Lilly Sabri",
  "channelDescription": "Subscribe for weekly Full Body Home Workouts and Pilates exercises!\n\nI’m Lilly Sabri, founder of LEAN with Lilly. I’ve been a Chartered Physiotherapist since 2010, APPI Pilates instructor, Fitness, Heath and Lifestyle Influencer.\n\nOver the years, I’ve educated and empowered hundreds of thousands of people around the world to live a healthier lifestyle in a way that encourages increased body confidence regardless of shape, size and fitness level. Their transformations have been my driving force.\n\nMy aim is to create a supportive community, accessible to anyone wanting to take control and make changes towards leading a healthier, happier lifestyle!\n\nI've now taken my years of physio experience and poured it into my guides, workout videos, and more to develop a fit, confident and healthy lifestyle for myself and others! Join the #LeanWithLilly family to take control, feel confident and live a healthier, happier lifestyle!\n\nSocials: @lillysabri\nWebsite: www.leanwithlilly.com",
  "tags": [
    "home workout",
    "home exercise",
    "workout program",
    "from home workout",
    "at home workout",
    "workout challenge",
    "best ab workout",
    "flat stomach",
    "how to get abs",
    "abs workout",
    "ab workout",
    "burn belly fat",
    "flat stomach workout",
    "flat belly workout",
    "abs exercise",
    "lose belly fat",
    "how to lose belly fat",
    "abs exercises",
    "belly fat loss",
    "pilates",
    "pilates abs workout",
    "pilates workout",
    "pilates abs",
    "abs challenge",
    "tone",
    "deep core activation",
    "core activation",
    "activate core",
    "at home pilates workout"
  ],
  "publishedAt": "2023-09-25T14:00:32Z",
  "duration": 627,
  "durationFormatted": "10:27",
  "viewCount": 4699293,
  "likeCount": 125423,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VyvuWt3XVRI/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VyvuWt3XVRI/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VyvuWt3XVRI/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VyvuWt3XVRI/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VyvuWt3XVRI/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VyvuWt3XVRI\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "🔥 Join the LEAN Transformation Method! 🔥 Get access to a structured 8 week guide, personalised meal plans, hundreds of recipes, and so much more right at your fingertips! Get the best results on the LEAN App: <a href=\"https://leanwithlilly.page.link/download-the-app-today\">https://leanwithlilly.page.link/download-the-app-today</a>",
    "I just want to say that as someone who has always hated exercise and exercise classes because of the environment and the way it makes me feel, i love the language used in this. Like &quot;if you&#39;re feeling extra strong today&quot; or just &quot;if you&#39;re able to do this, but if you&#39;re not here is an alternative&quot; makes it feel very welcoming!!",
    "To anyone who&#39;s reading this:<br>You are strong. You are beautiful. You are powerful. <br>Remind yourself that working out is not a punishment for what you ate, but a celebration of what your body can do!<br>I hope you have a fantastic day :))",
    "I&#39;ve done this for 2 weeks now every day, I only missed 2 days but I replaced the workout with 30 mins of cardio on those days. I started at 134lbs and I am now at 124lbs! I see a strong outline for my abs, as well as muscle definition in my arms. I also changed my diet to ZERO snacking + 3 healthy meals per day. It&#39;s hardwork but I see the results which makes me keep at it even more!! &quot;You never know if its going to work until you try.&quot; - the quote that changed my mindset.",
    "I wish my stomach would get flatter just by watching this video"
  ],
  "channelSubscriberCount": 6080000,
  "channelVideoCount": 1352
}