{
  "video_id": "VZ2pTfT_nCA",
  "title": "10 DAY - 10 MIN CHAIR WORKOUT To Lose BELLY FAT!",
  "description": "This is a chair workout you can do for 10 days and only will take 10 mins of your time. If you have back problems this ab chair workout is for you! This chair workout is for women over the age of 35 but if you're younger you can still try this ab chair workout.\n-\nIf you want my PERSONAL help getting rid of that STUBBORN BELLY FAT… Download the Ml.Fitness App and let’s work together 📲❤️: https://get.ml.fitness/zug0/MyApp\n\n-\n\n-DISCLAIMER- \n\nYou can’t only focus on doing this workout. Here are 5 steps that will get rid of your belly fat: \n\n\n1️⃣Increase Your Daily Physical Activity: Intensive cardio exercises such as running, cycling, and swimming can help burn calories and reduce body fat, including belly fat.\n\n2️⃣Focus on a Healthy Diet: Consuming a balanced diet that includes foods high in protein, fiber, and healthy fats can help reduce belly fat. A diet low in processed and sugary foods is also effective.\n\n3️⃣Incorporate Strength Training: Resistance or strength training helps build muscle, which is metabolically active and burns more calories, even at rest.\n\n4️⃣Reduce Stress Levels: High levels of stress can cause an increase in cortisol, which can contribute to the buildup of belly fat. Yoga, meditation, and breathing exercises are a few stress-management techniques.\n\n5️⃣Get Adequate Sleep: Proper sleep is vital for weight management. Sleep deprivation may lead to hormonal imbalances, increasing the hunger hormone ghrelin, which can cause overeating\n\n\n✖️Subscribe For More Content Like THIS Ladies : https://bit.ly/2YyLhC9\n\n\n✖️Don't Forget To TURN ON YOUR NOTIFICATIONS!!🔔 \n\n\n✖️Connect With Me: \nFacebook📲: https://www.facebook.com/Mrlondontv\n\nInstagram📲: https://www.instagram.com/mr.londontv/\n\nTwitter📲: https://twitter.com/mrlondontv\n\nTikTok📲: https://vm.tiktok.com/TBm6yx/\n\n✖️WHAT IS MRLONDON ABOUT: \nWhat's going on ladies, Welcome to my YouTube channel. I've been a certified personal trainer for almost 8 years. I provide online coaching helping thousands of women every year worldwide. As you can see my main focus on my channel is helping women mentally and physically. My goal is to give women the motivation, confidence and knowledge to be the best versions of themselves!\n\n✖️Business Inquires📧: Mrlondontv@gmail.com\n\nTIMESTAMPS\n0:00 - INTRO\n0:20 - Chair workout\n10:06 - Outro",
  "channelTitle": "MRLONDON",
  "channelDescription": "Welcome to my channel, dedicated to empowering women to embrace a healthier lifestyle. Here, you’ll find an array of content designed to keep you engaged and motivated on your fitness journey.\n\nOn this channel, get ready for INTENSE yet FUN workouts, alongside Motivation Tips, Vlogs, and a treasure trove of fitness wisdom.\n\nDon’t just watch – join our community! Subscribe and hit the notification bell to stay updated. For more real-time updates and fitness tips, follow me on all my social media platforms.\n\nLet's make fitness not just a goal, but a lifestyle! 💪🏾\n",
  "tags": [
    "chair workout",
    "chair workout for beginners",
    "chair workout for belly fat",
    "chair workout for abs",
    "lose belly fat sitting down",
    "seated belly fat workout",
    "seated fat burn workout",
    "seated ab exercises",
    "mrlondontv"
  ],
  "publishedAt": "2023-04-30T17:00:07Z",
  "duration": 641,
  "durationFormatted": "10:41",
  "viewCount": 1063285,
  "likeCount": 36208,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/VZ2pTfT_nCA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/VZ2pTfT_nCA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/VZ2pTfT_nCA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/VZ2pTfT_nCA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/VZ2pTfT_nCA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/VZ2pTfT_nCA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I’m giving you a 7-Day FREE Trial to my ML Community! ✅ Inside, you’ll get exclusive workouts, LIVE sessions, and join a group of women all pushing each other to win. Let’s get stronger together! 👊🏾❤ <a href=\"https://free-trial.mrlondon.co/YT\">https://free-trial.mrlondon.co/YT</a>",
    "I’m a 50 yr old man,  I’ve done this work out for 5 days at 5am (best time to workout by the way-on an empty stomach for quicker results). Results: lost 5lbs - 1 or 2 cups of coffee (light creamer) in the AM, any meal at noon, and a hearty salad in the evening (6pm) with carrots and almonds to feel full. I need to have the crunch! Going to continue the routine Saturday and Sunday. No cheat days and no breaks until I reach my goal of 180lbs. Currently at 210lbs. Hope this helps anyone. Establish a routine is key!",
    "After 3 kids I was able to always get back in shape but getting in a car accident and having to undergo multiple surgeries at the same time losing my mother got me in the worst shape ever been in gaining 50 pounds but for the last 6 months through diet I was able to lose 40 pounds and have been watching your videos for the last month to help with toning the rest and building muscle which were severely weak also the mom pouch that is getting smaller every time I do your workouts. Started off small with your vids and now moving up some. I am seeing an amazing difference in my body already and feel like I am starting to look even better than before having children. These exercises are effective and are gentle enough to be able to do. I watch multiple videos of yours to improve on different and problem areas and have some memorized now but keep coming back for the encouraging motivation and patience you provide in your videos. It helps so much and is the exact help so many women have needed for so long. Thank you.",
    "I’ve been working out with you (almost) everyday, steadily, since 6 Nov, and have lost 9 kilograms… I actually start with a 10 min HIT workout, followed by your 10 minutes of chair workout…. It works, and discipline/resolve are the key for this 60 years old guy to get back his mojo. Thanks again! Drew",
    "I DID IT!!!! And my abs R burning and my heart is pumping. This is definitely a form of HIIT. Thanks Mr. London. Ill be 70 in Jan and I&#39;m going for it!!! See u tomorrow for one of your other abs workouts. I hear it is alright to do abs everyday...walk everyday...yet alternate upper and lower workouts w a couple days of weight lifting. Feeling stronger everyday!"
  ],
  "channelSubscriberCount": 2710000,
  "channelVideoCount": 558
}