{
  "video_id": "W2hRlGrgoUQ",
  "title": "10 Minute Yoga For Beginners ( EASY Morning Stretches )",
  "description": "This 10 Minute yoga for beginners routine offers easy morning stretches for back pain relief.\nYoga is a great addition to your morning routine to help stretch the body and stiffness away.\nStretching the back in the mornings is important for overall health and will truly help you feel physically free throughout the day.\nThis 10 minute morning yoga is beginner friendly and created for general back pain. \nIf injury is present be sure to ask your dr if these stretches for back pain are safe for you.\nThis Morning yoga class can be done in bed or on the mat!\nJoin me this morning for this beginners 10 minute yoga for back pain routine.\n\n#MorningYoga #10MinuteYoga #Yoga\n\n \n\nYoga With Bird's Email List:\nhttps://mailchi.mp/34e952e0ed28/yoga-with-bird-email-list\n\nGet Your FREE Monthly Calendar!\nhttp://www.yogawithbird.com/calendars/\n\n\n\nYoga Challenges:\n30 Day Yoga For Inflexible People: https://www.youtube.com/playlist?list=PLCIrre1vyDlybJmrSb19MiVWnve5slKTJ\n30 Day Yoga For Relaxation: https://www.youtube.com/playlist?list=PLCIrre1vyDlwr-X3VF2CrZdf7rDrWH1aB\n7 Day Yoga For Overall Health: https://www.youtube.com/playlist?list=PLCIrre1vyDlyTB8gu7I99XQkw9M85YdTk\n5 Day Yoga For Mornings: https://www.youtube.com/playlist?list=PLCIrre1vyDlyjr87XsR6j4QGzyKKxwsTH\n5 Day Yoga For Hips: https://www.youtube.com/playlist?list=PLCIrre1vyDlwAnZvLflZM-e5WWedHTBpo\n\nDISCLAIMER: \nSome links may be affiliate links that Yoga With Bird earns a small percentage of how ever each affiliate product is something she genuinely loves and has used herself. Please consult your physician before joining in on this practice. By participating in this activity you acknowledge that yoga is a physical discipline that requires a certain amount of mental concentration and physical strength and endurance. You agree to work according to your own limitations and take full responsibility for your own safety and well-being. Listen to you body at all times and never do anything that causes pain. You acknowledge that participation in this activity exposes you to a possible risk of personal injury. You are fully aware of this risk and hereby release Yoga With Bird/Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "10 minute yoga",
    "10 minute yoga class",
    "10 minute yoga sequence",
    "10 minute yoga for beginners",
    "10 minute yoga sequence for beginners",
    "10 minute yoga for back pain",
    "10 minute morning yoga",
    "10 minute morning yoga for beginners",
    "10 minute yoga full body stretch",
    "yoga",
    "yoga with bird",
    "morning yoga",
    "morning yoga for beginners",
    "10 min yoga",
    "10 min morning yoga",
    "morning yoga for back pain",
    "morning stretch",
    "morning stretches",
    "morning yoga stretch",
    "yoga for beginners",
    "beginners yoga"
  ],
  "publishedAt": "2020-02-24T04:20:18Z",
  "duration": 520,
  "durationFormatted": "8:40",
  "viewCount": 3148964,
  "likeCount": 59355,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/W2hRlGrgoUQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/W2hRlGrgoUQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/W2hRlGrgoUQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/W2hRlGrgoUQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/W2hRlGrgoUQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/W2hRlGrgoUQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Get $20 off one of my favourite activewear brands at <a href=\"http://rwrd.io/8v1aaao\">http://rwrd.io/8v1aaao</a> 🐆",
    "Finally !! Someone who actually understands the limits of beginners, even stiff as a board old fogeys like me ! :-)  I looked through some of your other routines as well and found many that seem perfect for me. Thank you !! Subscribed,",
    "Finally !! Someone who actually understands the limits of beginners.",
    "I work early mornings unloading groceries and this is the perfect way to start my day and get myself up &amp; out of bed at 4 am. :) i’ve used this every morning for about a week or so. thank you so much for a routine that can be done in bed &amp; centers the back!",
    "My body is so ridiculously tight!  I decided to take a small step in the right direction by doing a short stretch routine morning and night.  Sticking to it..well, that will be another thing.  So this morning I took you out into my bathwater temp backyard, laid out a blanket, and followed along with you while watching white puffy clouds in the beautiful blue sky, listening to hummingbirds humming away in the flowers, Finches chirping away in the trees, and getting an occasional kiss from one of my pups.  Not only did you give me a stretch routine I CAN DO, but you made me want to do MORE!  Taking time to do your routine outside also made the beginning of my morning so peaceful and beautiful. Thank you Bird for understanding that not all of us are limber and for doing stretches a true beginner can do and feel good about!  Namaste.  😌"
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}