{
  "video_id": "w7GSmtiDUJ4",
  "title": "Flow - Day 20 - Inward",
  "description": "Day 20. This is huge. You made it to Day 20! And perfectly timed, we take this session to continue the journey inward. This session asks a lot of good questions and continues to cultivate and add new vocabulary to the physical practice. This is time well spent with yourself. (Thank you for letting me be a part of it!)Let’s go! \n\nLet me know how this one goes for you in the comments below!\n\n- - - - - - - - - - \n\n🤍 FLOW - Downloadable Collection 🤍\nhttps://ywa.co/flow\nBased on requests from the community, we are excited to announce a downloadable version of FLOW. It is offered on a donation basis, so just pay what feels good!\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "home yoga",
    "home yoga practice",
    "yoga at home",
    "at home yoga",
    "Adriene Mishler",
    "austin yoga instructor",
    "free yoga",
    "free yoga videos",
    "full yoga class",
    "morning yoga",
    "online yoga",
    "yoga practice",
    "yoga with Adrienne",
    "30 days of yoga",
    "30 Day yoga journey",
    "30 Day yoga challenge",
    "20 minute yoga practice"
  ],
  "publishedAt": "2024-01-21T06:00:30Z",
  "duration": 1222,
  "durationFormatted": "20:22",
  "viewCount": 826802,
  "likeCount": 17139,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/w7GSmtiDUJ4/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/w7GSmtiDUJ4/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/w7GSmtiDUJ4/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/w7GSmtiDUJ4/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/w7GSmtiDUJ4/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/w7GSmtiDUJ4\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Breathe. Lower your shoulders. Soften the skin of your forehead. Thank you Adriene. A beautiful way to start, or end, the day.  Knowing that so many others are experiencing this practice is so comforting! 🎶",
    "Shoutout to those of us who are a couple of days behind, but still hanging in there! You&#39;re doing great!",
    "I love how at the end of every practice, there is just enough time after Adriene says Namaste for me to say Namaste in return before the music fully drops in.",
    "You might say it becomes more difficult over time to find space to practice, but to me actually I really have started to crave the yoga. My body needs it, so I look forward to it each day!",
    "Today I didn&#39;t really feel like doing yoga, I wanted to skip today because yesterday I cried for three hours and I didn&#39;t have the strength to do yoga. However, after making it, I started crying and not out of sadness but out of gratitude. even though I didn&#39;t feel strong enough, I did it and I&#39;m very proud of myself, thank you Adriene for today, you are amazing and thank you for the fact that I can practice with you thank you that despite these bad times, I can forget for a moment and focus on myself, thank you very much ❤️ let&#39;s take care of ourselves and have a wonderful, peaceful Sunday for everyone ❤️"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}