{
  "video_id": "W7mN-i0J7M0",
  "title": "INTENSE Weight Gain Workout - OMG! 😱",
  "description": "Learning how to gain weight fast if you're skinny is hard.INTENSE Weight Gain Workout - OMG! 😱\n\nIf you are a person that is struggling to gain weight this workout is for you. You don’t need any weights for this intense weight gain workout. \n\nIf you are skinny there is nothing more frustrating than eating everything in sight and still not being able to gain weight. This video will help you gain weight even when working out at home. \n\n\n🙏 S U B S C R I B E (please lol)\n👉 START NOW -  https://www.kobokofitness.com/\n1️⃣ 21-Day Belly Fat Focus (BFF) Program - https://bit.ly/3pAETFu\n2️⃣ 8-Week Booty Fix Program - https://bit.ly/3pDNebC\n3️⃣ Jan - Dec Workout Schedule -   https://www.kobokofitness.com/\n4️⃣ 30 DAY CHALLENGE -  https://www.kobokofitness.com/\n5️⃣ ALL ACCESS PASS -  https://www.kobokofitness.com/\n\nCoupon Codes\nBooty Fix Program\nCOUPON CODE: SPECIAL\n\nBelly Fat Focus (BFF) Program\nCOUPON CODE: BFF99\n\nALL ACCESS PASS (everything + Jan - Dec Workout Schedule)\nCOUPON CODE: KOKOPUFF\n\nLearning how to gain weight fast if you're skinny is hard. For some people, weight gain is as painful as weight loss for others so I made this video specifically for most of us that struggle in gaining weight. \n\nIf you're skinny and looking for exercises on how to gain weight or how to get big fast this weight gain workout at home can definitely help you. \n\nMost people can do this workout everyday with no problems but check with your doctor if you have any questions, concerns, or special circumstances.\n\nAlways warm up for 2-3 minutes before doing ANY workout. Here's a good multi-purpose warm up that most people can easily do. \n20 sec jumping jacks\n20 sec squats\n20 sec lunges\ndo twice\n\nBe sure to consider the rest of your workout commitments as you decide which workouts to do. 20 - 30 min total per day is a good amount!\n\n-------------------------\n😃ABOUT KOBOKO \n------------------------\nMy name is Kola Olaosebikan. Mom to one delightful toddler and happily married :) I am a Certified Personal Trainer (CPT) trained by the American Council on Exercise and Stanford University. I am Nigerian AND American AND in love with pizza (no tomato sauce. thanks)\n\nI love sharing fitness vlogs. The BEST at home workouts for women. Mostly bodyweight meaning you can complete my youtube workout videos with no equipment! My intention is to help you get your best body ever! \n\nYou'll get\n-Home workout without equipment\n-Home workouts with minimal equipment (resistance bands and dumbbells)\n-LOWERBODY WORKOUTS! haha\n-Dance Workouts\nAnd so much more!!\nAs an online trainer, I also love the random chances I get to actually MEET my Koko puffs (you) in person! \n\nAnyway, on this fitness channel, you'll find mainly workouts. All the workouts are fast and highly effective. They will help you with weight loss, flatter abs, strength, booty growth. I may also do reviews of fitness products from time to time but not very often.\n\n-------------------\nDISCLAIMERS\n-------------------\nSome links may be affiliate links.\n\nNote: All information provided by Koboko Fitness is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold Koboko Fitness harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims. This disclaimer applies to all videos existing and in the future.",
  "channelTitle": "Koboko Fitness",
  "channelDescription": "Home workout fitness channel with the BEST workout videos for women. No equipment needed!\nI am a Certified Personal Trainer (CPT) trained by the American Council on Exercise and Stanford University. \n\n💌 BUSINESS EMAIL - hello@kobokofitness.com\n\nMost workouts are bodyweight exercises so you don't need any equipment. You'll get butt workouts, lower body workouts, abs workouts, upper body workouts, back fat workouts, arm workouts. Basically, every type of workout you can do at home. \nSubscribe now 🎈\n\nMORE KOBOKO:\nWebsite - https://www.kobokofitness.com\nInstagram - https://www.instagram.com/kobokofitness\n\n\n\nCREDITS:\nThese credits apply to all videos on the Koboko Fitness channel \nMusic provided by NoCopyrightSounds [NCS]\n• http://soundcloud.com/NoCopyrightSounds\n• http://instagram.com/NoCopyrightSounds\n• http://facebook.com/NoCopyrightSounds\n• http://twitter.com/NCSounds\n",
  "tags": [
    "home workout",
    "at home workout",
    "bodyweight workout",
    "no equipment workout",
    "fitness routine",
    "fitness channel",
    "online trainer",
    "home workout without equipment",
    "personal trainer"
  ],
  "publishedAt": "2021-02-10T16:30:07Z",
  "duration": 877,
  "durationFormatted": "14:37",
  "viewCount": 2547203,
  "likeCount": 69002,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/W7mN-i0J7M0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/W7mN-i0J7M0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/W7mN-i0J7M0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/W7mN-i0J7M0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/W7mN-i0J7M0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/W7mN-i0J7M0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "It&#39;s my first day to workout. March 29.<br>Can someone like it, so i could remember this",
    "I&#39;m so tired of hearing people say &quot;ohh you&#39;re too skinny&quot; , &quot;you should eat more&quot; , &quot; Are you still a kid?&quot; And these comments coming from people i love. I feel insecure about my body . It&#39;s like i&#39;m trapped in a 12 year body . I&#39;ve been struggling with gaining weight and i eat right i&#39;m also moderately active. I hope this workout turns out to be the winner for me . I really want to gain weight.",
    "Been doing this exercise since 6th June, I didn&#39;t weight myself everyday though.<br>Day 1: 42.6kg<br>Day 14: 42.9kg (so yeah a small increase but I also blame myself for continuing the habit of keeping myself hungry)<br>Day 15: 43.3kg<br>Day 17: 43.6kg<br>Day 18: 43.3kg<br>Day 19: 44.0kg<br>Day 20: 44.2kg<br>Day 26: 43.7kg (I haven&#39;t been working out because I had pain in my left arm prior to getting vaccinated. I also ate a little less).<br>Day 27: 43.7kg<br>Day 28: 44.0kg<br>Day 29: 43.9kg<br>Day 30: 44.0kg<br>Day 31: 43.8kg <br>Day 32: 43.8kg<br>Day 33: 44.1kg<br>Day 34: 44.2kg<br>Day 36: 44.3kg<br>Day 37: 44.3kg<br>Day 38: 44.6kg<br>Day 40: 45.4kg<br>Day 41: 45.2kg<br>Day 42: 44.7kg<br>Day 43: 44.9kg<br>Day 44: 45.0kg<br>Day 45: 45.2kg<br>Day 46: 45.1kg<br>Day 47: 45.0kg<br>Day 48: 45.0kg<br>Day 49: 44.9kg<br>Day 50: 44.9kg<br>Day 52: 45.0kg<br>Day 60: 45.2kg<br>Day 61: 45.3kg<br>Day 65: 46.0kg (officially not underweight anymore)<br>Day 66: 45.5kg<br>Day 68: 45.7kg<br>Day 69: 45.8kg<br>Day 71: 46.3kg<br>Day 72: 46.2kg<br>Day 76: 46.4kg<br>Day 78: 46.5kg<br>Day 79: 46.3kg<br>Day 82: 46.4kg<br><br>My advice is to also eat more calories than you do. Slowly reach the target of eating 2,000 calories a day.<br><br>EDIT: By Halloween or Christmas (preferably halloween), I hope to reach 50kg. I&#39;m only 5&#39;2 but I want to be physically and will try to bulk up a little with the use of dumbbells.<br><br>EDIT 2: I have bought dumbbells and I hope to start using them on Day 84. <br><br>EDIT 3: I have started using dumbbells on Day 84 but I&#39;m doing more of basic workout exercise FIRST with them so I won&#39;t be updating until I&#39;m ready to use them for this workout on the video but thank you everyone for liking my comment and taking the time to look at it. I&#39;ll get back when I&#39;m ready incorporate this intense workout with my dumbbells. (I&#39;m starting with 3kg dumbbells).<br><br><br>EDIT 4: August 16th, 2022. I forgot about this comment lmaooo. I&#39;m around 50kg and I&#39;m no longer focused so much on my weight. I started Muay Thai in May 2022 and I&#39;m going to the gym now  in which I started a month ago. Deadlifting 20kg and bench press 5kg. Keep eating well and getting fit. The dedication actually helped me to love fitness and martial arts.",
    "Finally something from a female fitness youtuber aimed for GAINING weight and not for LOSING it which is literally every damn video on youtube, thanks for this!!!",
    "I love how she&#39;s not too serious or like a strict face, i love how she jokes around and it makes me laugh while doing the exercise. I kept failing but i won&#39;t give up &lt;3"
  ],
  "channelSubscriberCount": 1890000,
  "channelVideoCount": 926
}