{
  "video_id": "W9YtvgljfyY",
  "title": "10-Minute Guided Stretching Routine for Runners",
  "description": "This guided stretching routine is great for runners or anyone with tight hips! We'll hold each static stretch for about 30 seconds, spending a total of 10 minutes targeting some of the common tight areas for those who run (or spin) frequently.\n\nI recommend doing this stretching routine AFTER a run. Before a run, focus on mobility and dynamic stretches/movements. I have some guided running warm ups on my channel:\n—Run warm up: https://youtu.be/P3akL1qoSQQ\n—Warm up with a band: https://youtu.be/znOktRB9j8w\n\n\nFor details, visit my blog: http://bit.ly/1OWLiq1\n\n_____\n\n—Follow me on Instagram https://www.instagram.com/nicolepearce/\n—Follow me on TikTok https://www.tiktok.com/@nicolepearcemovement\n\n_____\n\nSONG | https://www.youtube.com/watch?v=89IUA...\n\nDisclosure: This post was made in partnership with Watermark Seaport. You can visit their website here: http://bit.ly/1szbTzo",
  "channelTitle": "Nicole Pearce Movement",
  "channelDescription": "Hi! I'm Nicole. I’m a STOTT trained Pilates Instructor, a NASM Certified Personal Trainer, and a Pregnancy & Postpartum Corrective Exercise Specialist. I've been teaching since 2013. In addition to these certs, I'm certified in Lagree Fitness, Spinning, and Indo-Row. \n\nThere is a ton of class variety to be found on this channel, but my primary focus is Pilates, mobility, and functional strength. All workouts have an emphasis on proper form. Let's support our bodies by focusing on functional, purposeful movements.\n\nLooking forward to moving together!\n",
  "tags": [
    "workout",
    "fitness",
    "stretching for runners",
    "stretches for runners",
    "guided stretching runners",
    "running stretches",
    "10 minute stretching routine"
  ],
  "publishedAt": "2016-05-24T21:12:24Z",
  "duration": 736,
  "durationFormatted": "12:16",
  "viewCount": 510739,
  "likeCount": 6678,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/W9YtvgljfyY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/W9YtvgljfyY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/W9YtvgljfyY/hqdefault.jpg",
      "width": 480,
      "height": 360
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/W9YtvgljfyY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hi, runners! I recently posted a new video that I think you&#39;ll also find beneficial and wanted to share. It&#39;s a 25-minute class focused on hip mobility (with some glutes work as well): <a href=\"https://www.youtube.com/watch?v=1pJP2WOtQk8\">https://youtu.be/1pJP2WOtQk8</a>",
    "I&#39;ve olnly been doing this for a week and I can already see improvements in my hamstrings flexibility. Very helpful for my long runs! 😊",
    "I&#39;ve been doing this routine for years now and it is my all time favourite stretching routine! Thank you so much!",
    "I’ve been running a lot preparing for a half marathon, and i used to only stretch my hamstrings bending down, calves on a step, and quads holding my foot. This thing stretched my booty like it was a rubber band, all the sides of the legs and the something band she said, i mean i was starting to feel awful but i love this i love it thank you",
    "I like how you didn’t put music because I was able to put my own. Awesome video, super relaxing (:"
  ],
  "channelSubscriberCount": 95800,
  "channelVideoCount": 1305
}