{
  "video_id": "Wd9VxqWxPuw",
  "title": "20 Minute Spin Class Workout (FAT BURNING INDOOR CYCLING!!)",
  "description": "Best fat burning workouts can be found in our 90 day fitness program\nhttp://athleanx.com/x/best-fat-burn\n\nThis 20 minute spin class workout is a great fat burning indoor cycling routine.  This spin class workout includes intervals of high intensity spinning followed by periods of lower intensity indoor cycling.  It’s a great idea to include indoor cycling class in your workout plan one to two days per week on days that you’re not lifting weights.\n\nThis 20 minute spinning workout will get your heart rate pumping and help you burn fat and calories.  You can do this indoor cycling workout at home if you’ve got a stationary or spinning bike, or it can be done in the gym.  You’ll need to adjust the resistance on your spinning bike to make sure you’re working harder during the high intensity intervals, and let up on the resistance a little bit during the lower intensity periods.\n\nA 20 minute indoor cycling workout is the perfect amount  of time to give your metabolism a boost to help burn fat.  However too much cardio exercise can actually waste away at your muscle tone.  Make sure to keep spinning workouts to a maximum of 2 per week.\n\nFor all the best fat burning and strength training workouts, subscribe to our Youtube channel  https://www.youtube.com/user/womensworkouts",
  "channelTitle": "Athlean-XX for Women",
  "channelDescription": "The home for workouts specifically geared towards women!  While we all can appreciate a flat stomach and wanting to get skinny, we focus on helping our women develop strong, toned muscles that are lean, athletic and most of all...healthy!  Be sure to subscribe to our channel and get all of our latest workout videos, challenges and tips as we release them.  Guess what else, we're not just about workouts for women, we focus on diet plans for those wanting to get a flatter stomach as well!  That means, you'll find plenty of helpful nutrition videos on our channel too.  So keep watching and we'll help you get leaner legs, slimmer thighs, toned arms to die for, and yes...we'll even help you get abs if you want them!  Strong.  Lean.  Athletic.  ATHLEAN!\n\nWant to get the man in your life in shape?  Be sure to point him over to our men's workout channel at http://youtube.com/user/jdcav24\nYep, we can fix him too!",
  "tags": [
    "spin workout",
    "spin class",
    "spin class workout",
    "20 minute spin class",
    "20 minute spin workout",
    "20 minute spin class workout",
    "20 minute spinning",
    "20 minute spinning workout",
    "spinning workout",
    "indoor cycling workout",
    "20 minute indoor cycling",
    "20 minute indoor cycling workout",
    "indoor cycling class",
    "spinning class",
    "athlean xx",
    "athleanxx",
    "athlean xx for women"
  ],
  "publishedAt": "2014-12-26T18:51:44Z",
  "duration": 1274,
  "durationFormatted": "21:14",
  "viewCount": 1848962,
  "likeCount": 13917,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Wd9VxqWxPuw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Wd9VxqWxPuw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Wd9VxqWxPuw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Wd9VxqWxPuw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Wd9VxqWxPuw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Wd9VxqWxPuw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m not exaggerating when I say this video changed my life. I started my exercise habit about 3 years ago with this video and I come back again and again. Thank you AmyJo!",
    "I recently began spinning again after a lengthy period of not spinning.  By far athleanxx have the best workouts to get me back into it.",
    "Nice and simple workout. Love the authentic enthusiasm and effort of Amy. Love that the music is only in the background. I would only recommend putting a visual for the sprint times and intensity. It would really help. Thank you.",
    "Perfect workout! Loved the amount of talking she did, not to much, not to little. Most talkers get on my nerves working out. I will be doing her workout often!!!! Thanks...",
    "I’ve just begun working out on a spin bike .... you kicked this 58yr olds butt!!  Loved it !!!"
  ],
  "channelSubscriberCount": 661000,
  "channelVideoCount": 919
}