{
  "techniqueDifficulty": [
    {
      "level": "Intermediate",
      "score": 0.7
    },
    {
      "level": "Advanced",
      "score": 0.6
    }
  ],
  "techniqueDifficultyConfidence": 0.8,
  "techniqueDifficultyExplanation": "The workout includes a variety of movements such as lunges, squats, lateral push-ups, and dumbbell exercises. These require coordination and balance, indicative of intermediate difficulty. Advanced difficulty is reflected in the inclusion of complex patterns like 180° jumps, bear plank combinations, and transitions such as front to back lunge with jump switch, which require good body awareness and control. The metadata mentions a focus on controlled movements and proper form, adding further complexity.",
  "effortDifficulty": [
    {
      "level": "Challenging",
      "score": 0.8
    },
    {
      "level": "Extreme",
      "score": 0.5
    }
  ],
  "effortDifficultyConfidence": 0.9,
  "effortDifficultyExplanation": "The workout's 45-minute duration and structure (40 sec work, 20 sec rest) increase its physical demand, making it challenging. The description emphasizes intensity with terms like 'intense' and 'high intensity,' and uses heavy dumbbells (up to 30 lbs) which further enhances the effort level. User comments about sweating and transformation underscore the demanding nature, supporting an extremely high-energy workout rating.",
  "requiredFitnessLevel": [
    {
      "level": "Beginner",
      "score": 0.4
    },
    {
      "level": "Intermediate",
      "score": 0.8
    },
    {
      "level": "Advanced",
      "score": 0.7
    }
  ],
  "requiredFitnessLevelConfidence": 0.85,
  "requiredFitnessLevelExplanation": "The advanced technique difficulty and challenging to extreme effort level suggest suitability primarily for intermediate to advanced users. However, beginners are still included due to the possibility of modifying exercise intensity and weight load, as indicated by user adaptability in comments and the channel's diverse audience. The workout duration further suggests intermediate and advanced suitability, but the self-modification possibility allows a beginner inclusion as well."
}