{
  "video_id": "WIHy-ZnSndA",
  "title": "17 Min Strength Training Workout for Beginners - Beginner Workout Routine at Home for Women & Men",
  "description": "Download the FREE HASfit app: \nAndroid http://bit.ly/HASfitAndroid -- iPhone http://bit.ly/HASfitiOS\n\nVisit http://hasfit.com/workouts/home/easy-beginner/strength-training-workout-for-beginners/ for the 17 Min Strength Training Workout for Beginners - Beginner Workout Routine at Home for Women & Men instructions\n\n\nDonate with Patreon: https://www.patreon.com/hasfit\nShop HASfit Tribe store: https://hasfit.myshopify.com/\n\nGet up to 2x Faster Results by following a Fitness Program Calendar:\nWhich program is right for me? http://bit.ly/2E16cng\nFoundation Beginner Program: http://bit.ly/2AnjffQ\n30 Day Muscle Building: http://bit.ly/2RqYBoO\n30 Day Torch (weight loss): http://bit.ly/2VjavR5\nMotive Home Athlete’s Plan (intermediate): http://bit.ly/2s09waU\nWarrior 90 2.0 (advanced): http://bit.ly/2QX3IxQ\nMore programs to choose from here: http://bit.ly/2E16cng\n\nGet our Diet Guide:\nEating For Life https://goo.gl/7qnHn4\n\nPersonal Training Services: http://hasfitpersonaltrainer.com\n\nFollow us for more!\nFacebook: https://www.facebook.com/HASFitness/\nInstagram: https://www.instagram.com/hasfit_official/\nSnapchat: @hasfit\nTwitter: https://twitter.com/HeartSoulFit\n\nDisclaimer:\nYou should consult your physician or other health care professional before starting a HASfit program or any other fitness program to determine if it is right for your needs. This is particularly true if you (or your family) have a history of high blood pressure or heart disease, or if you have ever experienced chest pain when exercising or have experienced chest pain in the past month when not engaged in physical activity, smoke, have high cholesterol, are obese, or have a bone or joint problem that could be made worse by a change in physical activity. Do not start this fitness program if your physician or health care provider advises against it. If you experience faintness, dizziness, pain or shortness of breath at any time while exercising you should stop immediately.\n \nHASfit offers health, fitness and nutritional information and is designed for educational purposes only. You should not rely on this information as a substitute for, nor does it replace, professional medical advice, diagnosis, or treatment. If you have any concerns or questions about your health, you should always consult with a physician or other health-care professional. Do not disregard, avoid or delay obtaining medical or health related advice from your health-care professional because of something you may have read on this site. The use of any information provided on this site is solely at your own risk.\n \nHASfit makes no warrants, promises, or claims regarding accuracy of the calories burned estimate. It is provided only as a general reference and each person should use an indirect calorimetry system for a more accurate estimate.\n \nDevelopments in medical research may impact the health, fitness and nutritional advice that appears here. No assurance can be given that the advice contained on HASfit will always include the most recent findings or developments with respect to the particular material.",
  "channelTitle": "HASfit",
  "channelDescription": "Join Coach Kozak and Claudia through over 1,000 on-demand home workout routines and exercise plans for all goals.\n\n• Named “Top Fitness App” for 10 years straight\n• 99% approval rating on over 1 Billion completed workouts\n\nBecome the best version of you with the free HASfit app:\n\n• Home workout routines for all fitness levels (limited mobility, senior, beginner, intermediate, advanced)\n• Get up to 2x faster results by following a complete fitness plan\n• Stream your workouts to your TV using your Chromecast, Roku, Amazon Fire, or AppleTV\n• Search to find your perfect workout from 3 – 60 minutes\n• Modifications to help you customize the workout for your specific needs\n• Save your favorite routines for easy access later\n• Exercise with dumbbells or no equipment\n\nDiscover new workouts added each week:\n• Fat Burning\n• HIIT & Tabata\n• Muscle Building\n• Cardio\n• Strength Training\n• Low Impact\n• Kickboxing and MMA\n• Kettlebell\n• Flexibility and Yoga\n\nFind Complete Workout Plans and Programs!\n",
  "tags": [
    "strength training for beginners",
    "weight training for beginners",
    "beginner workout",
    "beginners workout",
    "beginners workout for women at home",
    "beginners workout for men at home",
    "beginners workout at home",
    "beginners workout routine",
    "workout for beginners",
    "beginner workout routine for women at home",
    "beginner workout routine for men",
    "beginner workout routine",
    "beginner workout for women",
    "beginner workout at home",
    "beginner workout for men",
    "strength training for women"
  ],
  "publishedAt": "2016-08-30T18:00:01Z",
  "duration": 1088,
  "durationFormatted": "18:08",
  "viewCount": 4482194,
  "likeCount": 80977,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/WIHy-ZnSndA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/WIHy-ZnSndA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/WIHy-ZnSndA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/WIHy-ZnSndA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/WIHy-ZnSndA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/WIHy-ZnSndA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "People most likely will not see this. This video is rather old at this point. Using this video and changing my diet slightly. I lost 120 lbs over this past year. I will go on to upgrade myself to the longer workouts on Hasfit&#39;s channel. I love what you two have done for my life. I hope some person out there can read this commet and know that it is possible!",
    "i actually finished a weights workout? me with my noodle arms???? holy heck ive never been more proud of myself. thank you for this video!",
    "I&#39;ve been doing this video in my little apartment during covid lockdown and it&#39;s one of my favorites I&#39;ve come across so far. I&#39;m at the tail end of chemotherapy and trying to build my muscle back up. It&#39;s challenging but not to the points of being unable to complete it. Thank you for making this!",
    "My arms are burning and I love it.  I have lost 39 pounds over the last three months with diet and exercise.   This is a wonderful video... Who would give it a thumbs down???  Stay motivated......",
    "This is by far the most realistic beginner strength training video I’ve ever seen. Finished it and feeling the burn."
  ],
  "channelSubscriberCount": 2110000,
  "channelVideoCount": 1788
}