{
  "video_id": "wIyzNOirdb8",
  "title": "10-Minute Seated Dumbbell Strength Workout for Seniors",
  "description": "In this video, I will guide you through a revitalising 10-minute seated dumbbell strength workout designed specifically for seniors. This quick and safe routine is perfect for improving mobility, building strength, and boosting overall health. Dumbbells are used to add light resistance, and you can follow along from the comfort of your chair at home. I’ll provide step-by-step guidance to ensure you perform each exercise with proper form, reducing the risk of injury.\n\nBe sure to warm up before beginning this workout:\n🧘‍♂️ https://www.youtube.com/playlist?list=PLBx06e-L9mh7mNpgdyjA1bvq-YH6X9HYV\n\nSubscribe for regular exercise videos for seniors:\n🔔 https://www.youtube.com/channel/UCC4TRhL4BiA7--jpxVVXcpQ?sub_confirmation=1\n\nSign up for our 4-week seniors’ exercise eBook and more:\n📚 https://www.morelifehealth.com/join\n\nWarm-Up (Marching on the Spot): 0:55\nWeighted Calf Raises: 2:19\nBicep Curls: 2:55\nShoulder Raises: 3:25\nAlternating Arm Raises: 3:52\nRowing Exercise: 4:17\nLeg Raises (Front): 5:09\nTricep Extensions: 6:02\nShoulder Shrugs: 7:34\nNeck Stretch (Up/Down): 8:18\nNeck Stretch (Side to Side): 8:55\nRowing Exercise (Bent Over): 9:21\nAnkle Circles (Clockwise): 10:04\nAnkle Circles (Counterclockwise): 10:22\nCool Down (Shoulder Rolls): 11:00\n\nAccelerate your progress with our recommended resistance bands:\n🔗 https://morelifehealth.com/bands\n🛒 https://amzn.to/40ajaag\n\nHelp us create more content for seniors:\n❤️ https://www.morelifehealth.com/donate\n\nSubscribe for regular exercise videos for seniors:\n🔔 https://www.youtube.com/channel/UCC4TRhL4BiA7--jpxVVXcpQ?sub_confirmation=1\n\nJoin our Facebook support community:\n📱 https://www.facebook.com/groups/morelifehealthseniors/\n\nDISCLAIMER:\nMore Life Health provides health, fitness, and nutritional information intended for educational purposes only. All videos and information should not be considered medical advice.\nMike is a licensed physiotherapist; however, he is not your physiotherapist and cannot diagnose you via the internet. You should not rely on this information as a substitute for, nor should it replace, professional medical advice, diagnosis, or treatment.\nIf you have any concerns or questions about your health, you should always consult with a doctor or other healthcare professional. Do not disregard, avoid, or delay obtaining medical or health-related advice because of something you may have read on this site.\nThe use of any information provided is solely at your own risk. Consult your doctor or healthcare provider before starting a More Life Health program or any other fitness program to determine if it is suitable for your needs. Do not begin this fitness program if your doctor or healthcare provider advises against it.\nIf you experience faintness, dizziness, pain, or shortness of breath while exercising, stop immediately.\n\n#SeatedDumbbellWorkout #SeniorStrength #SafeExercise",
  "channelTitle": "More Life Health Seniors",
  "channelDescription": "Welcome to More Life Health!\n\nThis channel is dedicated to helping older adults improve balance, strength, fitness, flexibility, and confidence - all from the comfort of your own home.\n\nJoin Mike, a Senior's Specialist Physiotherapist, as he guides you through exercises and tips to move well, feel better, and get more out of life every day!\n\nSubscribe now to stay motivated and start your journey to a healthier, more active lifestyle.\n",
  "tags": [
    "Seniors Workout",
    "Strength Training",
    "Quick Workout",
    "10 Minute Workout",
    "Safe Exercise",
    "Senior Fitness",
    "Home Exercise",
    "Senior Health",
    "Fitness For Seniors",
    "Easy Workout",
    "Strength For Seniors",
    "Active Aging",
    "Healthy Lifestyle",
    "Mobility Exercises",
    "Fall Prevention"
  ],
  "publishedAt": "2019-02-12T09:25:57Z",
  "duration": 721,
  "durationFormatted": "12:01",
  "viewCount": 299462,
  "likeCount": 3124,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/wIyzNOirdb8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/wIyzNOirdb8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/wIyzNOirdb8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/wIyzNOirdb8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/wIyzNOirdb8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/wIyzNOirdb8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "am 91, last 4 yrs. doing most of things you are teaching. enjoy following you step by step, plus adding some of your methods. when was 39, ran a 100 mils one month",
    "I am a stroke survivor and found your workout easy to follow. Thank you",
    "Thank you for helping seniors",
    "I love ALL your videos.  I am 62 and have osteoarthritis and they are perfect!  You show the correct way to do the exercises, therefore I am not injuring myself and delaying my progress.  Thank you again for a wonderful channel!",
    "I&#39;m a 39 year old with multiple chronic health conditions. i am working up to 2 pound weights (using bands for now). I&#39;ve been alternating seated cardio and strength training. thanks for the video, it reminds me that i can do this!"
  ],
  "channelSubscriberCount": 239000,
  "channelVideoCount": 153
}