{
  "video_id": "wKMy9FEpOhw",
  "title": "30 Min CALISTHENICS WORKOUT | No Equipment | DAY 1",
  "description": "Ready for Day 1 of my Calisthenics series? This is a 30 minute Calisthenics workout with no equipment needed you can follow along at home. This routine is designed to build muscle, increase strength and develop flexibility. The full body workout includes beginner Calisthenics exercises, as well as more advanced variations making it suitable for a range of abilities.\n\nSUBSCRIBE @TomPetoTraining \nTPT VIRTUAL STUDIO (Exclusive Content) https://www.tompetotraining.com/members-area\n\nDOWNLOAD PROGRAM GUIDE | https://mailchi.mp/2f110da246cd/cali-series-guide\n\nINSTA https://www.instagram.com/tompetotraining\n\nTimecodes\n00:00 Coming Up\n00:18 Warm Up\n03:20 Calisthenics Workout\n29:18 What Next?\n\n#calisthenics #calisthenicsworkout  \n\nMusic by Epidemic Sounds (Active Subscription)\n\nDisclaimer\nTo join in these exercises, you must be in good physical health. If you’ve been told for any health or medical reason that you should not take part in physical activity/sport, then you should not take part in this workout. When participating in any physical exercise, there is a possibility of physical injury. If you engage in these exercises, you agree that you do so at your own risk and assume all risk of injury to yourself.",
  "channelTitle": "Tom Peto Training",
  "channelDescription": "Bringing 14+ years personal training experience to your home with follow along workouts to build a strong, athletic physique. \n\nNew videos weekly: Calisthenics / Dumbbell / Barbell / Kettlebell & more\n\nSUBSCRIBE to join with me on your home gym journey building amazing physiques and become part of the home gym community.\n\nBecome part of the TPT Virtual Studio for extra exclusive content & programs (Linked Below)\n",
  "tags": [
    "Calisthenics",
    "full body Calisthenics",
    "calisthenics workout",
    "calisthenics training",
    "calisthenics exercises",
    "calisthenics series",
    "Tom Peto",
    "follow along",
    "30 minute calisthenics",
    "calisthenics at home",
    "bodyweight calisthenics",
    "full body calisthenics workout",
    "Calisthenics series",
    "calisthenics workout series",
    "bodyweight workout",
    "full body workout at home",
    "home workout",
    "beginner Calisthenics",
    "beginner Calisthenics workout",
    "full body workout",
    "bodyweight",
    "calisthenics for beginners"
  ],
  "publishedAt": "2024-09-16T11:30:06Z",
  "duration": 1779,
  "durationFormatted": "29:39",
  "viewCount": 125256,
  "likeCount": 2686,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/wKMy9FEpOhw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/wKMy9FEpOhw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/wKMy9FEpOhw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/wKMy9FEpOhw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/wKMy9FEpOhw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/wKMy9FEpOhw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This program is amazing! I just finished going through your entire playlist for the first time, and now I’m on my second round. I can already see major improvements—when I started, I could barely do one push-up without needing assistance. Now it’s the complete opposite—I don’t even need to do assisted push-ups anymore! Lastly I’m from USA in the state of Arizona.",
    "My husband and I discovered you last month! We are currently on day 12 of the Calisthenics workout, but also doing bands, kettlebell, dumbell workouts too. We are loving it! You are so refreshing compared to other trainers that waffle on about themselves for 10 mins before cracking on with the workout. You get straight to the point! We are combining with a low cal high protein diet- and we have both lost weight and feel wonderful already! Im 48 and hubby is 56 and we are so glad we discovered you! Thanks Tom! We are in Bradford, England.",
    "I&#39;ve been searching for a proper callisthenics beginner&#39;s video and I landed here. Tomorrow morning will be my first day after a few months of inactivity. I need to get back on that horse and your video is simply perfect! Thank you for taking the time to make these day-to-day workouts. God bless you 🙏🏻🌻",
    "After trying several online workout coaches, my son (who is 27) and myself (60!) came across your workouts and instantly knew your style of coaching was right for us. Love your no nonsense approach, clear demonstration of the exercises and no time wasting before, during and after the workouts. Excellent instruction! We&#39;re in South Wales, UK and have been doing your YouTube workouts for several months and just finished day 1 of your Calisthenics series. Thank you and keep up the good work :)",
    "I came across this video by accident while scrolling through YT, and I thought, &#39;Yeah, even youtube is telling me to get up from the couch.&#39; This is my first challenge like this. I hope I find the strength to complete it all. The first workout made me sweat 😅"
  ],
  "channelSubscriberCount": 133000,
  "channelVideoCount": 401
}