{
  "video_id": "WO1a3pWJiz0",
  "title": "10-Minute Core Workout For Lower Back Pain Relief [NO MORE BACK PAIN!]",
  "description": "Strengthen your core and eliminate lower back pain in just 10 minutes a day! This simple, effective core workout routine will strengthen key muscles in your core to stabilize your back and decrease pain. Increase core strength in your abs, obliques, back, and hips to eliminate pain and feel better fast!\n\n======================================\nLINK TO JARED’S THICK EXERCISE MAT: https://urlgeni.us/amzn/drjaredexercisemat\n======================================\n\nWHY DOES YOUR LOWER BACK HURT?\nOne of the main causes of lower back pain is weakness in your core.\n\nYour lumbar vertebrae (your lower back bones) should be a very stable column when it is supported correctly by your core muscles.\n\nWhen these muscles are weak the column becomes lax and unstable which often results in lower back pain.\n\nWHY IS CORE STRENGTH IMPORTANT?\nIf you can strengthen the right core muscles with the right exercises, it will improve the stability in your lower back. This will allow you to perform more activities (like sitting, standing, walking and moving) without pain. \n\nBasically having adequate core strength can alleviate (and even eliminate) lower back pain! That’s exactly what I want to share with you in this video!\n\nBEST CORE EXERCISES FOR LOWER BACK PAIN\nAs a physical therapist, these are the exercises I regularly give to patients to strengthen their core and hips, improve stability in their lower back, and eliminate pain.\n\nIt only takes 10 minutes to perform and trains every major muscle that influences the lower back. This is a complete core strengthening routine and I hope you get some great benefit from performing it regularly.\n\n10-MINUTE CORE WORKOUT ROUTINE FOR LOWER BACK PAIN\n\n0:00 Intro\n0:24 10-Minute Workout Routine\n10:37 Don't Miss This!\n\nSingle Leg Bridge (Left)\nSingle Leg Bridge (Right)\nSide Plank Hip Lift (Left)\nSide Plank Hip Lift (Right)\nBird Dog\nPlank\nUpper Circle Crunch\nReverse Crunch\nTable Top Toe Tap\nSwimmer\nDon't Miss This\n\n💬 Did you try the back pain routine in this video? What did you think? I LOVE hearing from you - leave your experience in a COMMENT and let me know how you feel!\n\n👍🏼 If you did like this video, hit the THUMBS UP button to LIKE this video above. That helps more people to find it here on YouTube so thanks so much for doing that!\n\n✅ Finally, if you haven’t SUBSCRIBED to Tone and Tighten yet I would love to see you back here for more videos in the future! Hit the SUBSCRIBE BUTTON above and be sure you hit that little “bell” to get notified of a new T&T video the moment it goes out.\n\n======================================\n⭐️ OTHER GREAT VIDEOS YOU MIGHT FIND HELPFUL:\n➡️ 7-MINUTE STRETCHING TO UNLOCK LOWER BACK AND HIPS: https://youtu.be/8AeojB3Nphg\n➡️ MY TOP THREE CORE EXERCISES: https://youtu.be/IR0yV_3DfBo\n➡️ ELIMINATE BACK PAIN AT WORK: https://youtu.be/x12GnuV9Qgw\n➡️ HOW TO SLEEP WITH LOWER BACK PAIN: https://youtu.be/SXhB-PwYlpU\n➡️ FIX ONE-SIDED LOWER BACK PAIN FAST: https://youtu.be/LQhvJ-W_VRo\n======================================\n\nHere's a 5 Minute Core Workout To Do Everyday: https://www.youtube.com/watch?v=fcwh_79owDw\n\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. T&T Digital Media, LLC makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.",
  "channelTitle": "Tone and Tighten",
  "channelDescription": "Hi - I'm Jared! I am a doctor of physical therapy who specializes in rehabilitating orthopedic (back, neck, shoulder, knee, etc) and postpartum (diastasis recti) conditions. I love being fit, healthy, strong, and active, and hope to help you accomplish your fitness goals. On this channel you'll learn best treatments for common injuries through exercising and stretching, and how to become a fitter, healthier version of yourself. Please consider subscribing!\n\nDISCLAIMER: The content on this channel is NOT medical advice and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. You agree to indemnify and hold harmless T&T Digital Media, LLC and its officers for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Use of this content is at your sole risk.\n",
  "tags": [
    "workout for lower back pain relief",
    "10 minute core workout for lower back pain",
    "back pain core exercises",
    "back pain exercise",
    "back pain exercises",
    "core workout for back pain",
    "core workout for lower back pain",
    "workout for lower back pain",
    "core exercises for a bad back",
    "core exercises for back",
    "cure low back pain",
    "exercise for back pain",
    "exercise for low back pain",
    "exercises for back pain",
    "fix low back pain",
    "get rid of lower back pain",
    "jared beckstrand",
    "tone and tighten"
  ],
  "publishedAt": "2023-07-13T12:15:02Z",
  "duration": 659,
  "durationFormatted": "10:59",
  "viewCount": 801743,
  "likeCount": 17546,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/WO1a3pWJiz0/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/WO1a3pWJiz0/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/WO1a3pWJiz0/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/WO1a3pWJiz0/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/WO1a3pWJiz0/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/WO1a3pWJiz0\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Did you try this routine? What did you think? COMMENT your experience below and be sure to follow it up with my favorite stretching routine for your hips and lower back: <a href=\"https://www.youtube.com/watch?v=nm-fxV-bwWg\">https://youtu.be/nm-fxV-bwWg</a> Hope it helps you to improve and feel better 🙏🏼",
    "I am 28 with degenerative disc disease, arthritis in my back, a herniated disc, and a pinched sciatic nerve. I was bedridden and in the ER five days ago, and now I’m up moving and doing mostly normal activities. The only reason I’m up is because I’ve been doing these stretches and exercises multiple times a day. This video has been a lifesaver.",
    "I almost died of lower back pain last week. These exercises are helping me tremendously. I’m truly amazed how something so simple can help crippling pain.",
    "I have avoided core exercises for years, primarily because they would hurt my lower back. However I&#39;ve been doing this one for a few weeks now and no lower back pain and I feel that my core is getting stronger. Great job, thank you for putting this together",
    "48 years old. Generally healthy, never had back problems, and then had my back “go out” with such pain/spasm that I could barely walk for a week. After the pain subsided, the weakness felt constant. Doc recommended core strengthening exercises and this easy-to-follow video has been wonderful. Doing daily for 2 weeks and feeling stronger/less weak. Thanks!"
  ],
  "channelSubscriberCount": 2750000,
  "channelVideoCount": 641
}