{
  "video_id": "wPu5MuGAOuM",
  "title": "How to Get Flexible Part 2 - The 20 Min Guided Stretch Routine | Day 12",
  "description": "Part 2 of the full body stretch routine with warm-up integrated. This gets more into the science and methodology of creating better mobility for the body. If you would like to get more yoga in for the day, you are welcome to practice any of the previous classes before this one.",
  "channelTitle": "Yoga With Tim",
  "channelDescription": "Welcome to the channel\nI post yoga videos that will help you to understand the movements and postures in yoga so that you can practice safely while at the same time giving you a great full body workout. I'm glad you're here. If you’re new, dig what you see, and would like to do more yoga with me, please take a moment to subscribe:\nhttps://www.youtube.com/yogawithtim?sub_confirmation=1",
  "tags": [],
  "publishedAt": "2023-01-12T04:43:15Z",
  "duration": 1602,
  "durationFormatted": "26:42",
  "viewCount": 143917,
  "likeCount": 5761,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/wPu5MuGAOuM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/wPu5MuGAOuM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/wPu5MuGAOuM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/wPu5MuGAOuM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/wPu5MuGAOuM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/wPu5MuGAOuM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Giving me Mr Rogers vibes when you were putting on socks at the start of the video. 🥰 Also, I was so excited for a cozy stretch day! It&#39;s gray and rainy out my window this morning. ❤",
    "Today’s practice was amazing! I absolutely love the detailed instruction against the wall. Thank you Tim for reminding us to keep checking in with our nervous system and body when it’s too much back off find your five in a 1 to 10. I have to be reminded I totally forget! I’m so looking forward to tomorrow! I just continually I’m feeling so much physically better. And mentally the challenge is being met to because I have to get up really early to do this before work. Everybody have a great day. See you tomorrow.",
    "I really needed these stretches this morning, as I woke up stiff, with pain in my right scapula and neck. I felt much better after. I&#39;ve no problems with squats, maintaining balance is my issue. The more I do your classes the better I&#39;m getting. Thanks Tim for providing safe and effective classes. Have a great day! Namaste 🧘🏻‍♀",
    "I am loving your 30 day challenge so much!  It isn&#39;t just going through a flow, you are really teaching me so much more.  I am even enjoying your stretching sessions.  <br>Thank you for showing me a more detailed yoga.",
    "Happy day 12!!! These stretches were challenging which means I&#39;m on the right path to achieving ultimate body flexibility. I will surely reference this routine more often to make sure I increase in progress! Thank you Tim and happy Thursday team!"
  ],
  "channelSubscriberCount": 462000,
  "channelVideoCount": 598
}