{
  "video_id": "WVsCRJBP7Hs",
  "title": "Yoga Full Body Stretches for Tension and Sore Muscles",
  "description": "This is a 15 min yoga full body stretch for tension and sore muscle relief. This quick yoga class stretches the entire body to help you feel your best mentally and physically anytime of the day. Use these stretches in the morning or evening!\n\n#Yoga #FullBodyStretch #Tension\n\nJoin this channel as a Member to get access to perks:\nhttps://www.youtube.com/channel/UCxYVPua6HC46HzgT8IIn3vg/join\n\n & support.\n\n________________________________________\n\nFAVORITE ACTIVE WEAR: \n\nLiquido Active - Get 15% off with code: BIRDLIQUIDO https://liquidoactive.com/collections/new?p=S1EZXrrM_\n\nYoga Wheel: https://mbsy.co/LCGmf\n\nVisit My Amazon Store For All My Yoga Must Haves!:\n\n\nMusic: https://www.epidemicsound.com/referral/qnrd89/\n\nJoin Honey to SAVE money while shopping online: https://www.joinhoney.com/ref/45p0vps\n\nIMPORTANT LINKS: https://linktr.ee/yogawithbird\n\nNOTE: Some links may be affiliate links that Yoga With Bird earns a small percentage of however each affiliate product is something she genuinely loves and has used herself.\n\n________________________________________\n\nYOGA CHALLENGES:\n\n30 Day Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlybJmrSb19MiVWnve5slKTJ\n\n30 Day Restorative Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwr-X3VF2CrZdf7rDrWH1aB\n\n7 Day Yoga For Overall Health: https://www.youtube.com/playlist?list=PLCIrre1vyDlyTB8gu7I99XQkw9M85YdTk\n\n5 Day Morning Yoga Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlyjr87XsR6j4QGzyKKxwsTH\n\n5 Day Hip Flexibility Series: https://www.youtube.com/playlist?list=PLCIrre1vyDlwAnZvLflZM-e5WWedHTBpo\n\n________________________________________\n\nABOUT THIS YOUTUBE YOGA CHANNEL\n\nFrancine Cipollone also known as her childhood nickname Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation. She created this YouTube Yoga Channel to offer a space where yoga is accessible to all. This channel is all about feeling good and reconnecting to self. Yoga is for every-BODY, Join the journey by Subscribing today: https://www.youtube.com/yogawithbird\n\nJoin Yoga With Bird's Email List: https://mailchi.mp/34e952e0ed28/yoga-with-bird-email-list\n\n________________________________________\n\nDISCLAIMER: \nPlease consult with a physician before beginning any exercise program. \nBy participating in this activity you acknowledge that this exercise is a physical discipline that requires a certain amount of mental concentration and physical strength and endurance and that you must be in good health to participate. \nYou agree to work according to your own limitations and take full responsibility for your own safety and well-being. \nBy participating in this activity you agree to listen to your body at all times and never do anything that causes pain. \nYou acknowledge that participation in this activity exposes you to a possible risk of personal injury. \nYou are fully aware of this risk and hereby release Yoga With Bird aka Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.",
  "channelTitle": "Yoga With Bird",
  "channelDescription": "Bird is a 200hr Certified Yoga Teacher who found a passion for helping others find inner peace, self love and happiness through the practice of Yoga & Meditation.\n\nYOU ARE WORTHY OF FEELING YOUR BEST!\n\nAlways consult with a physician before beginning any exercise program. By participating in these exercises you acknowledge that they are a physical discipline that requires a certain amount of mental concentration and physical strength, endurance and that you must be in good health to participate. If you engage in these exercises, you agree that you do so at your own risk and are voluntarily participating in these activities, and assume all risk of injury to yourself. You are fully aware of this risk and hereby release Yoga With Bird / Francine Cipollone from any and all liability, negligence, or other claims, arising from, or in any way connected, with your participation in this activity.\n\n",
  "tags": [
    "yoga",
    "yoga full body stretch",
    "full body stretches for tension",
    "full body stretches for sore muscles",
    "yoga for sore muscles",
    "physical therapy",
    "yoga for tension",
    "yoga for tension relief",
    "yoga for sore muscle relief",
    "sore muscles",
    "sore muscle relief",
    "full body yoga",
    "full body stretches",
    "stretches for tension",
    "stretches for sore muscles",
    "sore muscle stretches",
    "stretch",
    "stretches",
    "yoga stretch",
    "yoga with bird"
  ],
  "publishedAt": "2021-08-03T11:29:26Z",
  "duration": 908,
  "durationFormatted": "15:08",
  "viewCount": 2150703,
  "likeCount": 46686,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/WVsCRJBP7Hs/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/WVsCRJBP7Hs/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/WVsCRJBP7Hs/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/WVsCRJBP7Hs/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/WVsCRJBP7Hs/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/WVsCRJBP7Hs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Good morning on the US side. good evening on the other side to all! May your day/night be beautiful &amp; blessed with many positive things. 🕉🧘‍♀️💜🙏",
    "“I’m not folding too deep into this pose. I’m feeling the stretch so I’m going to stop there” so refreshing to hear a yoga teacher say these words. It’s easy to feel guilt shamed into stretching deeper than what is needed. Thank you 🙏🏼",
    "that&#39;s exactly what i needed today! and your &quot;give yourself some gratitude for showing up to the mat today&quot; and &quot;know that the space is here anytime that you need&quot; just makes me so emotional every time :) thank you a lot for doing such an amazing work and sharing it with us! i hope you are having a great day &lt;3",
    "I have the urge to do this every day now. Thank you Bird.<br>I wish everyone in the world would be doing yoga and meditation, we need a higher frequency of love and light. It may sound cheesy but we do.",
    "Thanks!  You really made my day with your positive affirmation at the end to congratulate myself for showing up to the mat. Beautiful session. ❤"
  ],
  "channelSubscriberCount": 980000,
  "channelVideoCount": 897
}