{
  "video_id": "Wxd5couUEM8",
  "title": "10 MIN BARBELL COMPLEX WORKOUT // with Dumbbell Alternative",
  "description": "Short and efficient full body dumbbell or barbell complex workout! 4 compound movements, allowing you to hit more muscles in a short period of time! \n\nThis full body workout can be performed with dumbbells or barbell! \n\nThe barbell I am using for this workout is 25kg (if I was using dumbbells, I would use 10kg x 2) however you can lift heavier or go even lighter depending on if you are wanting more cardio orientated or strength. But bear in mind, this will test your grip and forearm strength too!\n\nIf you are unsure about weight, I’d suggest the lighter option.\n\nSimply follow along! The complex will be clearly shown on screen throughout.\n\nPlease ensure you warm up thoroughly before beginning, go at your own pace that is challenging for you and treat each movement individually within the complex. Please don’t rush into the next movement, smooth transition and full range of motion.\n\nFirst complex 4 minutes, 4 reps per exercise!\n\n* SQUAT TO PRESS\n* ALT REAR LUNGES\n* BENT OVER ROW\n* ROMANIAN DEADLIFTS\n\nRest 30\n\nTimer 30/15\n\n* SQUAT TO PRESS\n* ALT REAR LUNGES\n* BENT OVER ROW\n* ROMANIAN DEADLIFTS\n\nRest 45\n\nFinal complex 2 mins x 1 rep each!\n\n* SQUAT TO PRESS\n* ALT REAR LUNGES\n* BENT OVER ROW\n* ROMANIAN DEADLIFTS\n\nThis workout will test your endurance, mobility, co-ordination, overall strength and athleticism plus burn a lot of energy with the cardio!! \n\nThis is a perfect short workout to do even as a benchmark routine to come back to even once a month to see how you progress! \n\nI hope you all enjoy this workout... short but intense!! \n\nCx\n\n▶ Instagram: @carolinegirvan\n▶ Subscribe to my YouTube Fitness Channel for FREE: https://youtube.com/c/carolinegirvan/?sub_confirmation=1\n\nExtras:\n\n▶ My NEW 20 Min Arms & Shoulders Workout: https://youtu.be/ME0cj3FTbms\n▶ My NEW 10 Min Dumbbell Maker Workout: https://youtu.be/ME0cj3FTbms\n\nEquipment I use in my workouts:\n\n▶ My Amazon UK Page: https://amazon.co.uk/shop/carolinegirvan\n▶ My Amazon US Page: https://amazon.com/shop/carolinegirvan\n\nBusiness Enquiries:\n\n▶ Email: info@carolinegirvan.com\n\nCaroline Girvan \nPO BOX 115\n\nCounty Antrim \nNorthern Ireland \nBT38 8WB\n\n\nDisclaimer: If you are new to exercise or planning on embarking on a new fitness programme, you should consult your physician. This video may offer health, fitness or nutritional information and is meant for educational purposes only. This information is not meant as an alternative to seeking professional medical advice or suggested treatment. Please know that performing any exercise or programme is solely at your own risk. Disclaimer: As an Amazon Associate I earn from qualifying purchases",
  "channelTitle": "Caroline Girvan",
  "channelDescription": "Hello, and welcome! I'm Caroline Girvan, Certified Personal Trainer, MNU Certified Nutritionist, and Pre and Postnatal Specialist.\n\nMy story began in my actual home in 2020, where it was just me, my dumbbells, and my phone. Fast forward, and now we are over 2 million strong! Every day, every session, it has all been part of our shared journey towards growth.\n\nNow, I'm also excited to welcome you to my new digital home, CGX. With exclusive workouts and fresh content, it's a space where we can explore, learn, challenge, and build a stronger body and mind together.\n\nEducation empowers us, and empowerment builds self-confidence. So, expect to learn as we train! We'll cover training fundamentals, spicing things up to keep it fun.\n\nAs a mother, ultra runner, triathlete, and someone striving to be the best version of myself, I'm passionate about sharing my journey with you. I hope you'll find it inspiring as you navigate your own path.\n\nAre you ready? Let's go!\n\nCx\n",
  "tags": [
    "barbell complex",
    "barbell complex workout",
    "barbell complexes",
    "barbell complex workouts",
    "caroline girvan",
    "barbell workout",
    "barbell complex for strength",
    "barbell",
    "barbell exercises",
    "workout",
    "full body workout",
    "strength workout",
    "dumbbell complex",
    "metabolic workout",
    "metabolic training",
    "compound exercises",
    "compound workout",
    "complex workout",
    "fbb",
    "exercise",
    "bodybuilding",
    "dumbbell workout",
    "muscle",
    "build muscle",
    "metabolic conditioning",
    "fitness",
    "power",
    "strong",
    "arms"
  ],
  "publishedAt": "2020-12-10T19:55:49Z",
  "duration": 943,
  "durationFormatted": "15:43",
  "viewCount": 1296535,
  "likeCount": 25088,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Wxd5couUEM8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Wxd5couUEM8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Wxd5couUEM8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Wxd5couUEM8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Wxd5couUEM8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Wxd5couUEM8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you so much for this short and powerful workout. As a perimenopausal woman, I do not want to work out hard for longer than 10 minutes. More, powerful 10 minute workouts please!!",
    "I’d love more barbell workouts as I have one at home. This is perfect, thank you.",
    "I work nights as a nurse in an Emergency Department, and while I am an athlete, so often its spent not working out but skiing, biking, etc. and I lose my pattern of lifting. I didn&#39;t lift all ski season, and found this work out and it was so quick and effective and a great check in on where I need to strengthen and stretch. And I am going into work feeling like I didn&#39;t just sleep all day. Thank you very much!",
    "I feel like this is effective for me rather than dying from finishing cardios. Complex yet enjoyable! Thank you for this ❤️",
    "I just did this routine.  Wow, very challenging.  The last 2 minutes is killer but my body feel so good right now...especially since its over. HA!  Am I the only person who mentally cussing on every move but pushing through to get it done?  Asking yourself why did I do this to myself?  Then later look in the mirror to see your progress; yeah thats why!  I will add this to my rotation...try to increase weight from 55 lbs.  Thanks for the challenge."
  ],
  "channelSubscriberCount": 3740000,
  "channelVideoCount": 640
}