{
  "video_id": "x0nZ1ZLephQ",
  "title": "Meditation For Mental Balance and Grounding",
  "description": "This 17-minute guided meditation welcomes balance and clarity to your mental and emotional self. Practice regularly to connect the brain to the body for mental health and optimal physical well-being.\n\nThis practice invites you to observe with loving-kindness and bring awareness to your internal world. What are your patterns? What are your defaults? WHERE ARE YOU AT?\n\nSettle in. Soften.\n\nFind your ground.\n\nDedicate some time to your breath and receive the gifts of this sweet practice.\n\nYou’re worth it.\n\nPS: In this session, I share one of my secret weapons for tapping into relaxation and joy!\n\nPlease let me know how this session goes for you in the comment section down below!\n\nNamaste.\n\n#yogawithadriene   #freeyoga   #fwfg\n  \n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "meditation",
    "meditation guided",
    "meditation guided for positive energy",
    "guided meditation",
    "how to meditate",
    "yoga for mental health",
    "yoga at home",
    "morning yoga",
    "free yoga videos",
    "home yoga practice",
    "30 days of yoga",
    "yoga for weight loss",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga",
    "yoga for stress relief",
    "yoga for anxiety",
    "at home yoga",
    "relaxation techniques",
    "yoga for health"
  ],
  "publishedAt": "2019-04-28T05:00:02Z",
  "duration": 1033,
  "durationFormatted": "17:13",
  "viewCount": 1933172,
  "likeCount": 31179,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/x0nZ1ZLephQ/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/x0nZ1ZLephQ/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/x0nZ1ZLephQ/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/x0nZ1ZLephQ/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/x0nZ1ZLephQ/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/x0nZ1ZLephQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Today is about slowing down. After you slow down, observe. What&#39;s going on?<br>What is it? Because whatever it is. It’s okay. It’s all part of the process, baby.",
    "Meditation is kind of hard for me, but I promised myself that I will get better at it, I owe it to myself as I abused this little soul with so much stress and anxiety",
    "Exhale day 13🎉 the more I practice yoga, the more I learn it’s not just the body that needs to work out or have rest days, but the mind as well. The more I meditate, the quicker I find peace, and stillness and calm my mind, these are tools that I’ve started to use in day-to-day life, along with Adriene’s voice popping into my head and reminding me to come back to my breath, they help to ground me and to take a few seconds before I carry on. Thank you, Adriene, for this practice my mind needed this rest, as did my body and for the reminders to come back to my breath. 💖🙏🏻🧘🏼‍♀️",
    "As I arrived on my mat this morning, I felt so drained, but as you handed me the fresh picked flowers 💐 I began to smile. I&#39;m at peace. I&#39;m balanced and ready to face my day ahead. Thanks very much  Adriene you&#39;re the best. Love ❤️ always. Namaste 🙌 ❤️ 🙏 👋",
    "Very hard for me to focus today, but I suppose that&#39;s when we need this most. Peace to all."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}