{
  "video_id": "X2IPerFOGyw",
  "title": "10-Day Standing Cardio Workout Challenge",
  "description": "Today's workout is quite challenging and would need you to perform these exercises all while standing up. These cardio exercises will help you burn fat in 10 days all while doing this for 15 minutes everyday!\n\nRoutines such as the Forward Jump, Spilt Jumps, and the Jumping Jacks will surely make you catch your breath but they're very helpful in burning body fat and strengthening your muscles. Routines like the Arm Circles help balance things out. Make sure you utilize the rest times, they're helpful in making this weight loss process work!\n\nDo this everyday for a full body weight loss experience! Good luck and let's get started!❤️💪﻿\n\n**If you want to be notified when I upload a new video, make sure to subscribe to our channel. I upload new videos everyday from Sunday to Friday!",
  "channelTitle": "Roberta's Gym",
  "channelDescription": "I'm here to help you look and feel great, with effective body weight workouts and exercises.\n\nBurn calories and extra fat with simple workout routines you can easily do at home. No equipment or gym necessary.\n\nNew video workouts Monday to Friday and then Sunday as well.",
  "tags": [],
  "publishedAt": "2019-12-06T09:00:39Z",
  "duration": 946,
  "durationFormatted": "15:46",
  "viewCount": 720890,
  "likeCount": 9925,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/X2IPerFOGyw/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/X2IPerFOGyw/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/X2IPerFOGyw/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/X2IPerFOGyw/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/X2IPerFOGyw/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/X2IPerFOGyw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "HEY ROBERTA N EVERYONE!!<br>I wanna say this TOTALLY works!!!<br>I started doing these exercises with 2 more vids exercises for glutes and thighs.<br>I have lost 3Kgs in one month!!!<br>WHOOO HOOOO!!!<br>BUT!<br>I kinda cheated on my diet too😅 but I&#39;ll try not doing so as I continue.<br>My family and friends told me they see the difference too.<br>Thank you so much Roberta!!<br>Loadd of Love and thanks,<br>Yusra🤩🤩😁",
    "Just finished the workout. I&#39;m sweaty n my heart beat is pumped up. I skipped the resting time.  Excellent quick workout. Thank u for this video.",
    "What a nice refresher! Skip the breaks as I do and it is a real cardio blast! 💗",
    "I barley started this work out an it was hard at first but ive been on my 1st week doing it &amp; got use to it ! Like it ! Now im ready for a longer work out!!!",
    "I&#39;m loving it a lot. I still do your exercises when I have got hurt while riding my bicycle."
  ],
  "channelSubscriberCount": 6510000,
  "channelVideoCount": 2319
}