{
  "video_id": "X3-gKPNyrTA",
  "title": "Yoga For Neck, Shoulders, Upper Back  |  10-Minute Yoga Quickie",
  "description": "This short session focuses on yoga for the neck, shoulders, and upper back. This is the perfect moment to check in and care for yourself! We focus on targeted areas that get stressed through everyday activity to combat neck tension, shoulder pain, upper back pain, and poor posture. This therapeutic sequence will combat stress, reduce inflammation, relieve discomfort, and increase the range of motion. \n\nBookmark this practice and repeat to release built-up stress in these targeted areas. Preventative care is the best care!\n\nLet me know how it goes in the comment section down below!\n\nNamaste.\n\n#yogawithadriene   #freeyoga   #fwfg\n\n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "free yoga videos",
    "yoga at home",
    "morning yoga",
    "home yoga practice",
    "30 days of yoga",
    "yoga for weight loss",
    "yoga for beginners",
    "beginners yoga",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga",
    "yoga for neck",
    "yoga for neck pain",
    "yoga for shoulders",
    "yoga for upper back",
    "yoga for upper back and neck",
    "shoulder workout",
    "yoga for back pain",
    "yoga for neck and shoulder pain",
    "beginner yoga",
    "10 minute morning yoga",
    "sciatica stretches",
    "yoga for spine"
  ],
  "publishedAt": "2019-02-10T06:00:00Z",
  "duration": 638,
  "durationFormatted": "10:38",
  "viewCount": 25142441,
  "likeCount": 264826,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/X3-gKPNyrTA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/X3-gKPNyrTA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/X3-gKPNyrTA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/X3-gKPNyrTA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/X3-gKPNyrTA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/X3-gKPNyrTA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hello my friends! How are you feeling today?",
    "I’ve had neck issues for years and also did daily PT. I would have extreme neck pain and burning twice a week for over a decade. I’ve used Biofreeze and Salonpas Patches for relief. My BFF sent me this video on a whim. Since practicing yoga using the video every morning, my neck pain is nearly diminished. It’s truly been life changing. Typically, I don’t post comments, but I wanted to thank Adrienne for changing the quality of my life.",
    "Wow... that was my first time ever doing yoga stuff. It felt really good... I’m kinda shaking now lol  my name is Joseph, I’m a disabled Iraq war veteran a father of two and coming on two years since my wife passed away. I’ve been in a very dark place to say the least. I’m slowly coming out of it and have been looking for natural was to deal with all my physical and emotional pain. So happy to have found you sharing your knowledge of yoga, I could never afford to have a private lesson. I will be doing a lot of your lessons that deal with weight, back and neck pain to start with . Thank you again, I really enjoyed it. Keep up the amazing job 💜",
    "One of my favorite bed-time rituals is rotating my neck round and round, a soundtrack of cricks and cracks following from my joints, and murmuring &quot;daily neck hygiene is soooooo important&quot; while my husband watches, terrified.",
    "Wow love this so much 😮am a very farmer from Uganda and sometimes I have a lot of Neck, shoulders and also upper back pain back after doing this yoga I really feel good for sure thanks so much for giving your time for helping us may God bless you"
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}