{
  "video_id": "XeXz8fIZDCE",
  "title": "Yoga For Lower Back Pain  |  Yoga With Adriene",
  "description": "Adriene leads a Yoga sequence For Lower Back Pain - offering you the tools to assist in healing and preventive care. Practice this sequence regularly and stay tuned for more sequences for the lower back and happy spine. Follow this sequence up with a gentle cobra stretch or bridge pose. Always listen to your body and find what feels good.\n\n#yogawithadriene   #freeyoga   #yogaforbackpain\n\n\n- - - - - - - - - - \n\nDealing with back pain or other spinal issues? Check out our Yoga For Back Pain playlist. It may be just what the doctor ordered. \nhttp://bit.ly/yoga-for-back-pain-playlist\n  \n- - - - - - - - - - \n\n❤️ WELCOME to the Yoga With Adriene YouTube channel! Our mission is to connect as many people as possible through high-quality free yoga videos. We welcome all levels, all bodies, all genders, all souls! SUBSCRIBE  to the channel and join our global movement! ❤️\nhttps://www.youtube.com/user/yogawithadriene?sub_confirmation=1\n\n- - - - - - - - - - \n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, and assume all risk of injury to yourself.",
  "channelTitle": "Yoga With Adriene",
  "channelDescription": "WELCOME to Yoga With Adriene! Our mission is to connect as many people as possible through high-quality free yoga videos. \nWe welcome all levels, all bodies, all genders, all souls!\nIf you're brand-new to yoga, check out my Yoga For Beginners and Foundations of Yoga series. These are designed to give you the tools to build a happy, healthy at-home yoga practice. \nDo your best, be authentic, and FIND WHAT FEELS GOOD.\nJump on in! You don't even have to leave your house. \n\nLove, Adriene\n\nYoga With Adriene, LLC recommends that you consult your physician regarding the applicability of any recommendations and follow all safety instructions before beginning any exercise program. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself.\n",
  "tags": [
    "yoga for lower back pain",
    "low back pain",
    "sciatica",
    "sciatica stretches",
    "yoga for flexibility",
    "yoga for beginners",
    "yoga to relieve back pain",
    "yoga for back pain",
    "yoga for low back pain",
    "yoga for back pain relief",
    "free yoga videos",
    "yoga at home",
    "home yoga practice",
    "yoga",
    "free yoga",
    "yoga with adrienne",
    "adriene mishler",
    "online yoga",
    "at home yoga",
    "yoga workout",
    "yoga with adriene back pain",
    "lower back yoga"
  ],
  "publishedAt": "2014-03-27T00:00:01Z",
  "duration": 947,
  "durationFormatted": "15:47",
  "viewCount": 13675278,
  "likeCount": 152309,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/XeXz8fIZDCE/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/XeXz8fIZDCE/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/XeXz8fIZDCE/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/XeXz8fIZDCE/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/XeXz8fIZDCE/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/XeXz8fIZDCE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Throwing it BACK to YOGA FOR LOWER BACK PAIN today. Share with someone you love or enjoy this healing sequence for yourself! <a href=\"http://www.youtube.com/results?search_query=%23preventativecare\">#preventativecare</a> <a href=\"http://www.youtube.com/results?search_query=%23findwhatfeelsgood\">#findwhatfeelsgood</a> ",
    "Adriene I was in great low back pain. My lower back hurt when I sat, laid down, or walked. I was seriously thinking I may need surgery. A friend of my suggested yoga, I found your video on lower back pain. After 4 days of repeating this video I felt like a different person. I now practice with this video twice a week. This old man who thought the practice of yoga was a bunch of nonsense is now a believer. Thank you for saving me.",
    "I&#39;ve created a YouTube account just to leave this message. <br>In July 2019 i was climbing  a loft ladder that turned out wasn&#39;t fixed properly, it broke from under me and I fell about 8 feet straight onto my back, fracturing my spine. <br>I&#39;ve come across your videos and I cannot begin to put into words what they&#39;ve done for me. I don&#39;t know if you&#39;ll ever read this but I feel like I needed you to know what a huge positive impact  you&#39;ve had on my every day life. I trawled through yoga videos, and always found them to be very impersonal and stand offish. When I stumbled across yours I felt so relieved and relaxed, like i was doing yoga with an old friend. My pain is better every day and often i can feel it working literally as I&#39;m doing it. No other youtuber has had that impact on me. It&#39;s become my new lockdown routine to have Adriene in the morning and before bed. Your humour and wit has me laughing during the poses sometimes! Thank you from the bottom of my heart for changing and improving my world. X",
    "Such a small thing to be proud of myself for, but when you said “once you feel satisfied” I realized I was NOT satisfied, paused the video, and did the whole cycle a couple more times. I have struggled for a long time to feel connected with my body, and I’m a little proud of myself for listening to it, even in this one little way.",
    "I love this digital age where Adrian did this once (or however, long it took) 10 years ago and the effect is still ripping through healing power across the world today."
  ],
  "channelSubscriberCount": 13100000,
  "channelVideoCount": 770
}