{
  "video_id": "xGzeJdiNrh8",
  "title": "Beginners Stretching Routine (15 minutes) - PHYSIO GUIDED home workout",
  "description": "Beginners home workout stretching routine suitable for all levels and guided by Physio Michelle from https://www.pelvicexercises.com.au This gentle whole body stretching routine relieves muscle tension and includes body safe stretches for all levels including beginners. I hope you enjoy and relax with this home stretching routine!\n\n#WithMe #exerciseforbeginners #homeworkout\n\nThis 15 minute guided stretching routine is a home workout to exercise along with. No equipment is required other than a towel and cushion to support your body for the lying down stretches. The seated stretches release muscle tension and improve general flexibility in the neck, chest and shoulders. The kneeling and lying down stretches help you release tight muscles in you upper and lower back, buttocks and hips. All the stretches should feel comfortable and pain free. The routine concludes with deep breathing exercises to help you relax at home.\n\n- - - - - -\nMusic by Aiden Kenway https://www.youtube.com/channel/UCEeJxhzyKSTllNNBMlRaHHQ\n- - - - - - \nDisclaimer \nThe information provided in this video is intended as general information and not a substitute for individual medical advice regarding your medical condition. To the extent permitted by law, neither Healthy Fit Solutions Pty Ltd, as trustee for the P & M Kenway Family Trust (“we”), nor any of our officers, employees, agents or related bodies corporate will be liable in any way (including for negligence) for any loss, damage, costs or expenses suffered by you or claims made against you through your use of, or in connection with, this video or information supplied or offered to be supplied on this video. Although we use our best efforts to provide accurate information and other materials on this video, the video is provided “as-is”. To the extent permitted by law, all warranties, conditions and representations provided about or by this video are excluded.",
  "channelTitle": "Michelle Kenway",
  "channelDescription": "Welcome to Michelle Kenway's Physiotherapy and Safe Exercise Channel! As a highly experienced physiotherapist, I specialize in pelvic floor health and helping you achieve your health and wellness goals. By subscribing and clicking the notifications bell, you'll receive a new video every week filled with valuable exercises and information to improve your wellbeing.\n\nMy channel is perfect for beginners, individuals recovering from injuries or illnesses, and those challenged by chronic health problems such as neck and back pain, and poor core control. You'll also find a wealth of Pelvic Floor Physiotherapy exercises and information videos to help with pelvic floor strengthening, prolapse management, pelvic pain, bowel problems, and constipation.\n\nVisit https://www.pelvicexercises.com.au for even more resources, including pelvic exercise videos, safe exercise books, and videos to download. Join me on your health, fitness, and recovery journey!\n",
  "tags": [
    "physiotherapy",
    "flexibility exercises",
    "stretching routine",
    "home exercise",
    "stretches",
    "Physical Therapy",
    "relaxation",
    "neck stretches",
    "back stretches",
    "hip stretches",
    "deep breathing exercises",
    "home workout",
    "stretching exercises",
    "beginners",
    "stretching for beginners"
  ],
  "publishedAt": "2020-04-02T20:00:09Z",
  "duration": 961,
  "durationFormatted": "16:01",
  "viewCount": 151947,
  "likeCount": 1652,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/xGzeJdiNrh8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/xGzeJdiNrh8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/xGzeJdiNrh8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/xGzeJdiNrh8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/xGzeJdiNrh8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/xGzeJdiNrh8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Thank you for this wonderful routine. I am not flexible at all and this is the best routine out there that I can really do. Doing it every day.",
    "Thank you so much, Michelle - sore as my body is right now, this gentle set of stretches is exactly what I needed.",
    "This is really good - I can do all the sitting down ones. Many thanks.",
    "It&#39;s soo good and her voice is also sooo relaxing I was just about to sleep thank you soo much maam 😇😇",
    "Just discovered your video/channel when I was challenged to sit  Indian style (criss-cross), and couldn&#39;t get my knees down! Looking forward to feeling more flexible soon! TY!"
  ],
  "channelSubscriberCount": 911000,
  "channelVideoCount": 306
}