{
  "video_id": "XkgHNXjbNgM",
  "title": "Do This Workout After Eating - 11 Min To Burn Calories",
  "description": "If you want to burn calories after eating food then today's video workout is for you!\n\nAs you know, our body's main source of energy is the food we eat. If you want to burn calories and lose fat you either need to eat less food, or exercise more in order to consume those calories you just got from eating.\n\nWhen you burn more calories than you eat, your body gets into a state called Caloric Deficit - this is when your muscles require energy to maintain a certain level of physical effort, but your body doesn't have this energy ready available. It then starts burning calories it deposited in terms of fat or the calories you get from digesting food.\n\nSo make sure you perform this workout after every meal. It contains simple, body-weight exercises that are not hard to do, and don't involve intensive moves - to avoid getting sick with the food in your stomach.\n\nLet's start the workout and be sure to subscribe to the channel to receive new video workouts everyday Monday to Friday.\n\nGood luck and leave me a comment below, tell me how you feel and how often you do this workout! 💪❤️",
  "channelTitle": "Roberta's Gym",
  "channelDescription": "I'm here to help you look and feel great, with effective body weight workouts and exercises.\n\nBurn calories and extra fat with simple workout routines you can easily do at home. No equipment or gym necessary.\n\nNew video workouts Monday to Friday and then Sunday as well.",
  "tags": [
    "workout after eating",
    "exercise after eating",
    "training after eating",
    "home video workout after eating",
    "workout after eating food",
    "burn calories after eating",
    "burn calories after food",
    "burn food calories",
    "burn food fat",
    "lose food fat",
    "lose fat easily",
    "workout to burn fat fast at home",
    "workout after dinner",
    "workout after breakfast",
    "workout after lunch",
    "quick workout after meal",
    "home fat burning exercises",
    "roberta's gym",
    "video workout",
    "simple workout to lose calories"
  ],
  "publishedAt": "2019-01-15T09:54:22Z",
  "duration": 693,
  "durationFormatted": "11:33",
  "viewCount": 1954475,
  "likeCount": 32947,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/XkgHNXjbNgM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/XkgHNXjbNgM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/XkgHNXjbNgM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/XkgHNXjbNgM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/XkgHNXjbNgM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/XkgHNXjbNgM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I do this every after meal and do the 1 mile walk exercise afterwards. I also follow Chloe Ting&#39;s 2021 2 week shred in combination to this and it helped me loose weight. No extreme dieting, I just avoided junk and sugary foods. I eat veggies, fish, chicken, pork, brown rice but no coffee. I drink juice sometimes but only those with no added sugar like Ceres.",
    "Anybody here after eating heavy lunch or dinner?😂😂🤣🤣",
    "My room is where i excercise. Its upstairs so the whole house wobbles when you jump. So this one is good!",
    "Mini guide❤️<br>High knee twist<br>Side bends<br>Side leg lift<br>Tricep dip<br>Rise and pile<br>Arm circles<br>Lunges<br>Lateral arm circles<br>Side leg raise<br>Rise and pile<br>Tricep dip",
    "Thanks, Now I&#39;m feeling less guilty to had that heavy dinner 😅"
  ],
  "channelSubscriberCount": 6510000,
  "channelVideoCount": 2319
}