{
  "video_id": "Xl_B45DpMLU",
  "title": "Daily Calm | 10 Minute Mindfulness Meditation | Self Soothing",
  "description": "Tamara Levitt guides this 10 minute Daily Calm mindfulness meditation as a self soothing practice.\n\nDownload Calm: https://calm.onelink.me/314175158?pid=YT\n\nFollow Us:\nDaily Calm Community on Facebook - https://www.facebook.com/groups/daily...\nTwitter - https://twitter.com/calm\nInstagram - https://www.instagram.com/calm/",
  "channelTitle": "Calm",
  "channelDescription": "Our mission is to make the world healthier and happier through the super power of calm. \n\nThere are lots of benefits to meditation, such as decreasing anxiety, worry and stress.\n\nIt enhances self-awareness, self-acceptance and patience. And it strengthens our resilience amidst uncertainty and adversity. Who wouldn’t benefit from a little bit of that?\n \nCalm is all about mindfulness, the practice of paying attention to our thoughts, emotions and experiences without judgement.\n\nWhen we’re able to maintain moment-to-moment awareness, we can make the choices that best serve us in life. If you’re like us, you were drawn to mindfulness and meditation to live a happier, more peaceful, authentic life.",
  "tags": [
    "meditate",
    "meditation",
    "mindfulness",
    "zen",
    "peaceful",
    "relax",
    "calm",
    "white noise",
    "rest",
    "peace"
  ],
  "publishedAt": "2018-10-30T08:33:06Z",
  "duration": 608,
  "durationFormatted": "10:08",
  "viewCount": 4880015,
  "likeCount": 48409,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Xl_B45DpMLU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Xl_B45DpMLU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Xl_B45DpMLU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Xl_B45DpMLU/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Xl_B45DpMLU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;m new to meditation, I&#39;m recovering from a horrible nervous breakdown that suddenly hit me about 5 or 6 months ago, after struggling with it for months almost giving up and taking my own life I finally reached out for help and started therapy and mindfulness meditation a couple of weeks ago, I just stumbled on this meditation last night, it&#39;s so beautiful it makes me cry, I&#39;m finally seeing a bright light at the end of a very dark scary  tunnel 😥🤗❤️🙏",
    "What&#39;s done is done. What&#39;s gone is gone. One of life&#39;s lessons is always moving on. It’s okay to look back to see how far you’ve come but keep moving forward.",
    "“It’s enough to be taken care of by me.” What a realization for those of us who seek comfort from the outside. We are enough for ourselves.",
    "&quot;May I be Happy. May I be safe&quot;<br>This was supposed to be calming but I started sobbing because that is all I want. That&#39;s what I need. I&#39;ve been lacking happiness and safety for so long, this really caught me off guard.",
    "This was a wonderful help for me trying to cope with my sister&#39;s sudden death.  The tears pour out but still it soothes me."
  ],
  "channelSubscriberCount": 1130000,
  "channelVideoCount": 844
}