{
  "video_id": "xpfJKIvDZMg",
  "title": "Beginner Elliptical Workout: STAMINA & STRENGTH  | 20 Minutes",
  "description": "If you're new to the elliptical and looking for a beginner workout to kickstart your fitness journey, join Sunny Trainer Debbie for this 20-minute Beginner Elliptical Workout. This workout focuses on gradually building full-body strength and stamina by challenging both resistance and speed. Get ready to sweat and feel the burn as you work towards improving your cardiovascular fitness.\n\nWarmup:\n00:40 - Find a comfortable speed and start pedaling. Aim to increase the speed gradually with each passing minute. By the end of the warmup, you should aim for a rating of perceived exertion (RPE) of 7, where 10 is the highest level of exertion.\n\nWorkout:\nRound 1- Speed Intervals\n03:41 - Increase your speed on the elliptical, aiming for 15-20 strides per minute. Push yourself to maintain a challenging pace.\n\n04:07 - Take a recovery period, allowing your body to catch its breath and prepare for the next interval.\n\n05:08 - Increase your speed again, aiming for 15-20 strides per minute. Focus on maintaining good form and pushing yourself a little further.\n\n05:36 - Take another recovery period, allowing your heart rate to lower slightly before the next interval.\n\n06:37 - Increase your speed once again, aiming for 15-20 strides per minute. Push yourself to maintain the pace and feel your muscles working.\n\n07:07 - Take a recovery period to catch your breath and prepare for the next interval.\n\n08:08 - Increase your speed for the fourth interval, aiming for 15-20 strides per minute. Push yourself to challenge your endurance and feel your heart rate rise.\n\n08:38 - Take a recovery period, allowing your body to recover before moving on to the next round of intervals.\n\n09:37 - Increase your speed for the fifth and final interval, aiming for 15-20 strides per minute. Push yourself to finish strong and give it your all.\n\n10:07 - Take a final recovery period before moving on to the next round of intervals.\n\nRound 2 - Resistance Intervals\n11:06 - Increase the resistance on your elliptical by 2-3 levels. Feel the increased challenge and focus on engaging your muscles.\n\n11:37 - Take a recovery period to catch your breath and prepare for the next interval.\n\n12:37 - Increase the resistance again by 2-3 levels. Embrace the added challenge and keep your form steady.\n\n13:06 - Take a recovery period to allow your body to recover before the next interval.\n\n14:06 - Increase the resistance once more by 2-3 levels. Feel the burn as you push through the resistance and work your muscles.\n\n14:37 - Take a recovery period to catch your breath and prepare for the next interval.\n\n15:33 - Increase the resistance by 2-3 levels. Focus on maintaining good form and pushing through the challenging resistance.\n\n16:06 - Take a recovery period, allowing your body to recover before the next interval.\n\n17:06 - Increase the resistance one more time by 2-3 levels. Feel the intensity rise as you challenge your strength and endurance.\n\n17:36 - Take a recovery period to catch your breath and prepare for the final interval.\n\n18:30 - Increase the resistance by 2-3 levels for the last interval. Embrace the challenge and give it your all as you work towards the end of the workout.\n\nCooldown\n19:05 - Gradually decrease the speed and resistance on your elliptical to bring your heart rate down. Focus on deep breathing and allow your body to recover.\n\nCongratulations on completing the 20-minute Beginner Elliptical Workout with Sunny Trainer Debbie Diaz! By incorporating speed intervals and resistance intervals, you've challenged both your cardiovascular fitness and muscular strength. Remember to cool down properly to aid in your recovery. Keep up the great work and continue your fitness journey with determination and consistency.\n\nSubscribe to get free workouts, challenges, fitness community, latest in-home fitness equipment and more! \n\nStay connected with your fitness and download SunnyFit App below:\nApple - App Store : https://apple.co/3JixdjS\nAndroid - Play Store: https://bit.ly/android-sunnyfit\n\n--------------------------------------------\n\nFITNESS EQUIPMENT USED\n✔️ Smart Long Stride Advanced Electromagnetic Elliptical Machine: SF-E3889SMART\n🛒 https://bit.ly/46AAise\n\nRECOMMENDED WORKOUT PLAYLIST: \n▶️ New Workouts: https://bit.ly/yt-new-workouts-playlist\n▶️ Elliptical Workout: https://bit.ly/SHF-Elliptical-Workouts-Playlist\n\nFREE RESOURCES\n💡 Free Workouts: https://sunnyhealthfitness.com/pages/workouts\n💡 Articles: https://sunnyhealthfitness.com/blogs/index\n\nFOLLOW US ON SOCIAL\n👍 Website: https://sunnyhealthfitness.com\n👍 Facebook: sunnyhealthandfitness\n👍 Instagram and Tiktok: @sunnyhealthfitness\n#sunnyhealthfitness #elliptical #ellipticalmachine #ellipticalworkout #cardio #cardioworkout",
  "channelTitle": "Sunny Health & Fitness",
  "channelDescription": "Fit for Everyone | At Sunny Health & Fitness, we believe a quality workout experience and healthy lifestyle should be within reach of anyone who wants it. Our mission is to make fitness accessible to everyone, including you!\n\nSunny Health & Fitness is dedicated to helping you reach your goals. We have provided the equipment to everyday households for over a decade and now we are branching out to provide videos on technique, assistance, and customized workouts for each category in our line of premier fitness equipment. \n\nSubscribe to our channel to discover the latest in home fitness, weekly exercises, and product troubleshooting guides. Visit our website to discover articles and workouts and take a trip to our social media for daily updates on all things health and fitness.\n\nPlease send up an email with any questions or troubleshooting needs. Use the link below.",
  "tags": [
    "Sunny Health And Fitness",
    "elliptical workout",
    "low impact workout",
    "elliptical workout for beginners",
    "sunny health and fitness elliptical",
    "elliptical machine",
    "elliptical trainer",
    "elliptical machine workout",
    "elliptical workouts",
    "eliptical workout",
    "elliptical exercise",
    "sunny elliptical workout",
    "sunny health elliptical",
    "sunny elliptical",
    "elliptical trainer workout for beginners",
    "elliptical machines",
    "workout with elliptical",
    "elliptical exercise machine",
    "sunny elliptical machine"
  ],
  "publishedAt": "2023-07-03T19:00:26Z",
  "duration": 1250,
  "durationFormatted": "20:50",
  "viewCount": 56403,
  "likeCount": 757,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/xpfJKIvDZMg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/xpfJKIvDZMg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/xpfJKIvDZMg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/xpfJKIvDZMg/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/xpfJKIvDZMg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This is truly a beginner&#39;s workout (unlike fit scope ones that say they are). Thank you!",
    "Holy moly what a workout! Let’s go peeps! Thank you for this vid, I really needed this!",
    "Excellent beginner elliptical session. I was struggling but made it through!",
    "This is perfect for me and I do love it. It’s only “20 minutes of my day and I can move on with my life!” I’ve been committed to this for over 3 months at least 5 days a week and I feel so much better 🎉Thank you!",
    "I use the elliptical daily 30 or 40 minutes in 3 months I lost 20 pounds I&#39;m going for more"
  ],
  "channelSubscriberCount": 165000,
  "channelVideoCount": 2007
}