{
  "video_id": "xqER1L2U5cM",
  "title": "25 MIN FULL BODY HIIT for Beginners - NO REPEAT 7 Million Celebration",
  "description": "7 MILLION STRONG! \n\n 25-Minute Fusion Workout | 7 Workout Styles for ALL Levels!\n\nWE DID IT!  7 MILLION incredible souls in the growwithjo family! \n\n I am beyond grateful for each and every one of you. Your energy, commitment, and support have made this community a place of strength, joy, and transformation. This workout is my THANK YOU, a celebration of how far we’ve come TOGETHER!\n\nThis 25-minute fusion workout combines seven unique styles of training into one powerful, fun, and effective session. We’ll be moving through walking, weights, HIIT, dancing, Pilates, kickboxing, and mini bands, giving you a full-body burn while keeping things exciting! Whether you’re just starting or leveling up, this workout is for YOU. It’s beginner-friendly with modifications, but if you want to turn up the intensity, grab a set of small weights and mini bands for an extra challenge.\n\nThis is more than a workout—it’s a celebration of YOU, of US, and of the power of showing up for yourself. Thank you for growing with me. Let’s make these 25 minutes count—LET’S GO!!!\n\nEnjoy more weekly workout releases in the GWJ home App: https://growwithjo.com\n_______\nGENERAL INQUIRY EMAIL → support@growwithjo.com\nPARTNERSHIPS EMAIL → mgmt@growwithjo.com\n_______\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "all standing workouts",
    "all standing",
    "low impact",
    "low impact workouts",
    "women beginner workout",
    "fitness videos",
    "abs",
    "workouts",
    "fit",
    "fitness journey",
    "transformation",
    "grow with jo",
    "growwithjo fusion",
    "fusion grow with jo",
    "weight loss workout",
    "weight loss",
    "walk the weight off",
    "25 min",
    "25 min hiit",
    "hiit workout growingannanas",
    "growingannanas",
    "hiit",
    "cardio",
    "kickboxing",
    "minibands",
    "walking workout",
    "pilates workout",
    "dance workout",
    "growwithjo dance"
  ],
  "publishedAt": "2025-03-15T13:30:11Z",
  "duration": 1684,
  "durationFormatted": "28:04",
  "viewCount": 300220,
  "likeCount": 10072,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/xqER1L2U5cM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/xqER1L2U5cM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/xqER1L2U5cM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/xqER1L2U5cM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/xqER1L2U5cM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/xqER1L2U5cM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I wept after this workout because I was able to finish it (with some modifications) in spite of being on chemotherapy treatment for breast cancer. Every little victory counts, praise be to the Lord! And also thank you Jo for what you do ❤",
    "2 years later I want you to know I am down 150 pounds and you were who got me to start working out. I love you!",
    "I wasn’t in the mood to exercise today, but I decided to find a quick 15-minute workout. This was the first one that popped up and it caught my interest. I only planned to do the first 15 minutes but once I started, the music and Jo’s smile kept me going, especially knowing she’s pregnant. I thought if Jo can do this, so can I. I skipped the weights and ran in place instead. Thank you so much for your workouts. They have truly transformed my life. May God continue to bless you and cover you! ❤",
    "I love this 7 in 1 Workout! Please do more videos like this! It is so easy to stay motivated when the workout style changes so often in one workout. I&#39;ve been working out with you since last may and i have never before stayed consistend with any other workout routine. I love your videos and the positivity you radiate! Thank you Jo!",
    "I love that you&#39;re doing a new video every Saturday!!! Thank you!"
  ],
  "channelSubscriberCount": 7200000,
  "channelVideoCount": 454
}