{
  "video_id": "xv-ejEOogaA",
  "title": "A 10-Minute Journey to Inner Peace | Guided Meditation",
  "description": "This is an Original 10 minute guided morning meditation recorded by us.   As the morning unfolds, may you walk this path of inner peace with unwavering grace and unshakable resolve.  Know that you are not alone, for the universe conspires to support your journey towards self-discovery.  Trust in the wisdom of your intuition, and allow the symphony of your soul to guide you towards a deeper understanding of who you truly are.  May your journey be filled with serenity, profound insights, and boundless joy.  And may the morning sun illuminate your path, reminding you of the infinite possibilities that lie within your grasp.  Wishing you a morning filled with peace and inner harmony.\n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "10 minute meditation",
    "meditation 10 minutes",
    "guided meditation 10 minutes",
    "inner peace",
    "journey to inner peace",
    "inner peace meditation",
    "guided meditation inner peace"
  ],
  "publishedAt": "2023-05-23T09:00:43Z",
  "duration": 615,
  "durationFormatted": "10:15",
  "viewCount": 1802893,
  "likeCount": 27292,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/xv-ejEOogaA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/xv-ejEOogaA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/xv-ejEOogaA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/xv-ejEOogaA/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/xv-ejEOogaA/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/xv-ejEOogaA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I was actually crying during this medation just because for once today I felt so free and I appreciated myself. That is something that I have been really struggeling with these past few weeks. I am putting so much pressure on myself to the point that I’m suffocating in it in my own thoughts. But today I just let go and let myself just feel everything inside me and I’m really gratefull for that so Thank you ❤️",
    "Nice and calm. I flew in the sun and everything was so light and peaceful ☺",
    "I wasn&#39;t in my body when I was in the forest. I was a ribbon of pure energy. Tears of healing washing over my face have become an accepted part of these meditations. These meditations truly reach a level of self acceptance I have yearned for. Thank you. Hug.",
    "Dang, that went by fast and got hit with a loud ad right after 😂 - Thank you!",
    "This was beautiful.. Starting my day with good affirmations-<br>Today is my day<br>I am capable of achieving what I dreamt for<br>Universe is working for my best.<br>Tables will turn and I will Win<br>Things are in my favor <br>I am hard working <br><br>Hope all of us get what we pray for. Get them for our betterment. Stay positive, universe is hearing you ❤"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}