{
  "video_id": "XVlXHG-P9YY",
  "title": "Beginners Indoor Cycle Workout | Home Workout | Ideal World",
  "description": "Join Tim Britton, fitness trainer, personal instructor and Ideal World's fitness coach as he guides you through a beginners workout with an indoor cycle or exercise bike. If you find this workout a little too easy, simply increase the resistance on your indoor bike and repeat the workout!\n\nSee our exercise and fitness range here: https://j.mp/360pvKC\n\nConnect with Ideal World:\nFacebook: https://www.facebook.com/idealworldtv\nInstagram: https://www.instagram.com/idealworld.tv/\nPinterest: https://www.pinterest.co.uk/idealworld/\n\n#workout #exercise #fitness",
  "channelTitle": "Ideal World",
  "channelDescription": "Tune in to Ideal World on Freeview 51, Sky 668, or Freesat 810! We're your go-to channel, featuring over 18 hours of live content daily. From gardening tips to tech hacks, and beauty must-haves, we've got your lifestyle covered! Plus if you're near a TV, no worries! Head over to idealworld.tv and get the full Ideal World experience online. Shop the latest deals, watch our live shows, and snag those must-haves—all from the comfort of your own home!\n",
  "tags": [
    "indoor cycling workout",
    "indoor cycling",
    "indoor cycling for beginners",
    "indoor cycling workouts",
    "cycling workout",
    "hiit indoor cycling workout",
    "beginner spin workout",
    "workout",
    "beginner workout",
    "spinning workout",
    "spin workout",
    "indoor cycling workouts beginners",
    "cycle training workout",
    "beginner spin class",
    "indoor cycle workout beginner",
    "spin class for beginners",
    "cycling workout for beginners",
    "bike workout",
    "spinning workout for beginners",
    "indoor cycle workout begginer"
  ],
  "publishedAt": "2016-06-28T10:47:04Z",
  "duration": 626,
  "durationFormatted": "10:26",
  "viewCount": 1085818,
  "likeCount": 7791,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/XVlXHG-P9YY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/XVlXHG-P9YY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/XVlXHG-P9YY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/XVlXHG-P9YY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/XVlXHG-P9YY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/XVlXHG-P9YY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "For once, a trainer who walks you through step by step. This was really helpful, a real beginners guide. Thanks!",
    "Just found this exercise. I&#39;m a bit overweight, maybe 15 to 20 lbs, so i bought a pro-form 500 spx back in late june of this yr. Haven&#39;t ridden a bicycle in many yrs and this pro-form, well...i could ride it more. That standing position for me...WOW! I powered through this first try, but maybe I&#39;ll stay seated and just crank the resistance up 3 or 4 times on those parts instead (cranking is making me think i bought the wrong bike). It felt awkward, but maybe that&#39;s because i&#39;m on a bike that doesn&#39;t tilt, whereas a bicycle can. Eventually i&#39;ll go to your intermediate video. That said...great early morning start to my day!",
    "Hello I am 62 years old and have COPD and this beginners workout is perfect and it’s making everything around my problem much stronger So I want to thank you so much have a healthy and happy life carol goode🌷",
    "I’m only 9 And my dad is obsessed with working out! So he said get on the exercise bike and watch this vid while I’m doing it This vid changed my life! Now my dad is proud of me! THANK YOU SO MUCH!!!",
    "Omg you are amazing. I just purchased a spin bike and I haven’t worked out in 6 months. You really gave a great workout in 10 minutes. I’m going to do this for the rest of the week and then try something more advanced. Thanks"
  ],
  "channelSubscriberCount": 20100,
  "channelVideoCount": 413
}