{
  "video_id": "XwRcPXtULVg",
  "title": "Full Body Workout with Dumbbells | NO REPEAT",
  "description": "No time to get bored with this 20 minute no repeat full body strength session! With 45 seconds to work and a quick 20 second recovery we are going to make the most of this short, but effective dumbbell workout! We combine upper and lower body exercises to work most muscle groups more than once to make the most of this no repeat format. We also finish strong with an all out abs section.\n\nAs with every workout we do, form is going to be so important to maximize this training session! Remember this is your time so make the most of it!\n\nFULL BODY NO REPEAT DUMBBELL WORKOUT STRUCTURE AND EXERCISES\nEQUIPMENT NEEDED\n- DUMBBELLS- I used a range from 10lbs to 30lbs\n- EXERCISE MAT\n\nSTRUCTURE\n20 TOTAL EXERCISES \nWORK: 45 SECONDS REST: 20 SECONDS\nNO REPEAT SO MAKE EACH SET COUNT!\n\nEXERCISE LIST\n- BICEP CURLS\n- ALT. CROSS BODY CURLS\n- REV. GRIP ROWS\n- REAR DELT FLYES\n-ALT. REAR STEPPING LUNGE\n- SQUAT\n-GLUTE BRIDGE\n- 3PT. PUSH UPS\n- CHEST FLYES\n- SKULL CRUSHERS\n- ROMANIAN DEADLIFT\n- SUMO SQUAT\n- CALF RAISES\n- ALT. CURTSY LUNGE\n- CROSS BODY CRUNCH\n- SWITCH SIDES\n- CRUNCH\n- REVERSE CRUNCH W/ WIDE TAP\n\nThanks for working out with me! It's always better to work out with a friend!\n\nKaleigh\n\n⭐️ Find tips, recipes, and more here! 👉  https://www.kaleighcohen.com \n\n⭐️ Find all of the equipment used for these workouts here! 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\n⭐️Want more workouts to help you reach your goals? Subscribe here! 👉  https://www.youtube.com/channel/UC0PZtgIWY5__DxIR0iVttQA\n\n⭐️ Hang out with the community and get all the 4-1-1!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n⭐️ Tips, recipes, and a FREE fitness journal template! 👉 https://www.kaleighcohen.com\n\nSome of the links listed above are affiliate links and if you make a purchase through the link, I may make a small commission, this is totally free for you, but really does help support these workouts for you! Thank you in advance, it is very much appreciated!\n_________________________________________________________________________________________________\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for any harm, damage, or injury as a result of any information provided.\n\n#fullbody  #workout  #norepeatworkout",
  "channelTitle": "Kaleigh Cohen Strength",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you BUILD CONFIDENCE THROUGH STRENGTH!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n\n\n\n\n\n",
  "tags": [],
  "publishedAt": "2022-11-15T10:00:31Z",
  "duration": 1597,
  "durationFormatted": "26:37",
  "viewCount": 281524,
  "likeCount": 4621,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/XwRcPXtULVg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/XwRcPXtULVg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/XwRcPXtULVg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/XwRcPXtULVg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/XwRcPXtULVg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/XwRcPXtULVg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "This was a great challenge - I cannot imagine what would have happened if there were repeats! Lol So happy to see everyone back and our little Sweet Potato on her throne!",
    "Muscles: Every Man&#39;s Dream changed my life completely! I feel stronger, more confident, and motivated every day.",
    "I appreciate the warm ups before these workouts. Helps me take the time to do one!",
    "Finally a workout that is not just crazy music and no talk. But instead with good explanations. Thanks!",
    "I love no repeat workouts.  It makes me go heavier!  Just like the cycling workout yesterday, everything is on point 😊  So glad you &amp; your family are back in the US ❤️"
  ],
  "channelSubscriberCount": 323000,
  "channelVideoCount": 649
}