{
  "video_id": "xzTQkHT_dng",
  "title": "30 minutes of Virtual Scenery - Treadmill / Exercise Machine (Cotswolds UK)",
  "description": "Treadmill? Exercise bike? Cross trainer? Rowing machine? Flying carpet? Beat the boredom with a virtual tour around the picturesque Hobbit Shires of Gloucester while you work out for a full 30 minutes.  The music is not to everyone's tastes (classical) so mute and use your own accordingly, or treat yourself to a taste of culture :o)\n\nSPEED NOTES:  I've had some feedback comments regarding the speed of the video not being \"realistic\" and not accurately representing running or walking. Before publishing, I experimented creating the video at various jogging or cycling speeds, but found with the slower speeds, the visuals got very tedious very quickly.  \n\nIn the end I settled for slower speeds around the more interesting parts and faster speeds during the less interesting bits, so hopefully providing sufficient change of scenery to keep the visuals interesting.  The faster speeds also allow you to see much more of the area than you would do at slow speeds.  :o)",
  "channelTitle": "Rickvanman - Variety Channel",
  "channelDescription": "Variety channel covering anything and everything, from van life, V-logging, carnivore diet, astrophotography, touring & camping, self-build motorhomes, forest walks,  allotment gardening, plus lots of other things.\n\nI’m just a guy who enjoys making YouTube videos for a hobby and generally likes to point a camera at whatever I’m interested in at the time. \n\nI'm also the Voiceover guy from The Honest Guys meditation channel: http://www.youtube.com/user/TheHonestGuys\n\nAll questions (including what mic am I using) answered here: http://rickvanman.co.uk/faq.html\n\n.",
  "tags": [
    "virtual scenery",
    "treadmill",
    "exercise bike",
    "cycling",
    "scenery",
    "exercise",
    "virtual",
    "30 minutes",
    "workout",
    "guided workout",
    "cotswolds",
    "countryside",
    "uk",
    "vehicle mounted",
    "tour",
    "touring",
    "armchair",
    "Treadmill scenery",
    "exercise bike scenery",
    "cross trainer scenery",
    "30 minute workout",
    "exercise machine scenery",
    "chedworth",
    "bibury",
    "arlington row",
    "Bike",
    "Exercise Machine",
    "Park",
    "United Kingdom (Country)",
    "jogging",
    "running",
    "fitness"
  ],
  "publishedAt": "2013-12-12T09:50:08Z",
  "duration": 1850,
  "durationFormatted": "30:50",
  "viewCount": 579845,
  "likeCount": 3410,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/xzTQkHT_dng/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/xzTQkHT_dng/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/xzTQkHT_dng/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/xzTQkHT_dng/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/xzTQkHT_dng/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/xzTQkHT_dng\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I hate the treadmill.  I repeat.  I hate the treadmill.  Just used this to run in the gym and even used your car speedups as intervals to increase my own speed.  Also uses the music to run faster.  Thank you for this.  You are a great human being.",
    "Have to say! Best flying carpet session I have had in ages!",
    "The scenery is like nothing around here, this is perfect for a 30 min power walk on the treadmill...too hot to go outside right now so this will do the trick! Thanks.",
    "I bought a spin bike and did the 30 min to your video....LOVED IT!  Music is brilliant! Such a fantastic way to wind down after work. Thank you for sharing.",
    "Splendid scenery. Well chosen music. Made my 30 minute workout a joy. Thank you so very much!"
  ],
  "channelSubscriberCount": 148000,
  "channelVideoCount": 1005
}