{
  "video_id": "Y26VWM9MfL8",
  "title": "20 min FULL BODY DUMBBELL WORKOUT | Sculpt and Strengthen | With Warm Up + Cool Down",
  "description": "Join me for a 20 minute FULL BODY DUMBBELL EXPRESS WORKOUT. I've included a super quick warm up and cool down in this one for a complete routine to do on its own. Today I'll be using two 10LB dumbbells. This is a low impact routine which means there is NO JUMPING. There are NO REPEATS with intervals of 45 seconds on and 15 seconds rest. So get ready to sculpt! 💞 xox Mik\n\nEQUIPMENT:\n- Medium set of dumbbells (I'll be using two 10LB weights)\n- Mat \n\n\n💞 WINTER WORKOUT CHALLENGE 2023 💞\n\nWEEK 5 PLAYLIST:\nhttps://youtube.com/playlist?list=PL3D3ysBMhKYWwvVkPkju36x6RbMEYZijj\n\nFULL SCHEDULE:\nhttps://www.fitbymik.com/winter-workout-challenge-schedule\n\nSIGN UP HERE (to be eligible for prizes):\nhttps://www.fitbymik.com/winter-challenge-sign-up\n\nREQUEST TO JOIN THE FACEBOOK GROUP:\nhttps://www.facebook.com/groups/1283167828900995/\n\n\n\nWEBSITE: www.fitbymik.com\nINSTAGRAM: https://www.instagram.com/fitbymik/?hl=en\nFACEBOOK: https://www.facebook.com/fitbymik/\n\n\n#homefitness #dumbbells #fullbody",
  "channelTitle": "fitbymik",
  "channelDescription": "Hey! My name is Mikala, but you might know me as fitbymik! I am a fitness instructor, personal trainer, dancer and aerialist born and raised in Toronto Canada. I have a passion for health and fitness that lead me to a Bachelors Degree in Kinesiology, and over a decade of teaching in the fitness industry. Some of the class genres I have taught include Barre Fitness, Strength and Conditioning, Yoga, Pilates, Zumba, Aquafit, dance and gymnastics. I also have years of expertise with one-on-one personal training and fitness coaching. One of my favourite things about this industry is the ability to help others achieve their goals and feel their best!\n\nIn between teaching and learning, I spent many years performing as a dancer and aerialist with Norwegian Cruise Line. I also performed as an aerialist at Tokyo Disney Resort in Japan!\n\nI can’t wait to continue bringing more workouts and challenges to help YOU reach your fitness and flexibility goals!\n",
  "tags": [
    "fitbymik",
    "at home workout",
    "quick at home workout",
    "follow along workouts",
    "talking workout",
    "full body dumbbell",
    "total body dumbbell",
    "dumbbell workout",
    "10lb dumbbells",
    "20 min workout",
    "20 min full body workout",
    "dumbbell strength",
    "dumbbell sculpt",
    "dumbbell strength workout",
    "modifications included",
    "warm up and cool down included",
    "dumbbell workout for women",
    "workout for women",
    "warm up included",
    "full body workout with warm up",
    "fun workout",
    "express full body workout"
  ],
  "publishedAt": "2023-02-02T14:00:20Z",
  "duration": 1371,
  "durationFormatted": "22:51",
  "viewCount": 739159,
  "likeCount": 14344,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Y26VWM9MfL8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Y26VWM9MfL8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Y26VWM9MfL8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Y26VWM9MfL8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Y26VWM9MfL8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Y26VWM9MfL8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I appreciate how you lower the music when you&#39;re speaking, but crank it back up when you&#39;re not. Whoever edits the videos, bravo.",
    "My muscles felt SO much better after doing this workout! It saves so much time to have the warmup and cool down included!<br><br>I request more:<br>• 20 min full body dumbbell workouts like this (mix of mat and standing workouts) with warmup and cool down included<br>• 20 min full body standing dumbbell workout with warmup and cool down included<br><br>Keep up the good work!",
    "I&#39;ve been doing your workouts since April.  I&#39;m a 46 yo single mom and prior to working out with you I had tried many programs but couldn&#39;t make any stick. I&#39;ve really noticed my muscle mass declining in the last few years, but since doing your workouts I am definitely feeling and seeing a difference!  I really appreciate how they are short and sweet (I&#39;m currently loving your 20 minute workouts), they work the whole body, and there&#39;s so much diversity I never get bored.  My low back issues are much improved now that my glutes/core/lats are stronger (maybe stronger than they&#39;ve ever been?) and I also notice that I&#39;m much stronger on my mountain bike as well.  Your level of instruction is just right for me.  I appreciate your encouragement to modify and your bright smile when the burn starts kicking in!  Thank you so much Mik!  I really appreciate your content.",
    "I have been doing your workouts for about 2 months now, just a couple times a week as an addition to my Yoga practice, and what a difference it has made! I have more energy, and I notice I am stronger in things like side plank and chaturanga...they are becoming easier. Thank you for these video they are really well done and hit just right.",
    "Really love your workouts! So glad I found you! Thanks for making videos for approachable workouts."
  ],
  "channelSubscriberCount": 896000,
  "channelVideoCount": 290
}