{
  "video_id": "YF_P1ZzYgjA",
  "title": "Daily Calm | 10 Minute Mindfulness Meditation | Forgetting Time",
  "description": "Tamara Levitt guides this 10 minute Daily Calm mindfulness meditation. Enjoy an experiential practice that explores the importance of forgetting time.",
  "channelTitle": "Calm",
  "channelDescription": "Our mission is to make the world healthier and happier through the super power of calm. \n\nThere are lots of benefits to meditation, such as decreasing anxiety, worry and stress.\n\nIt enhances self-awareness, self-acceptance and patience. And it strengthens our resilience amidst uncertainty and adversity. Who wouldn’t benefit from a little bit of that?\n \nCalm is all about mindfulness, the practice of paying attention to our thoughts, emotions and experiences without judgement.\n\nWhen we’re able to maintain moment-to-moment awareness, we can make the choices that best serve us in life. If you’re like us, you were drawn to mindfulness and meditation to live a happier, more peaceful, authentic life.",
  "tags": [
    "meditate",
    "mindfulness",
    "mindful",
    "peace",
    "relax",
    "calm"
  ],
  "publishedAt": "2018-10-13T11:00:04Z",
  "duration": 623,
  "durationFormatted": "10:23",
  "viewCount": 1550429,
  "likeCount": 16953,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/YF_P1ZzYgjA/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/YF_P1ZzYgjA/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/YF_P1ZzYgjA/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/YF_P1ZzYgjA/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/YF_P1ZzYgjA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "What&#39;s done is done. What&#39;s gone is gone. One of life&#39;s lessons is always moving on. It’s okay to look back to see how far you’ve come but keep moving forward.",
    "This morning I am grateful for;<br>1. Waking up in a beautiful and safe house - I am home<br>2. Meditation in the warmth of the morning sun on my rug - I am cozy<br>3. Another day off work to do anything I want - I am free<br>Thank you",
    "Today, I finished the whole meditation without opening my eyes or checking the time. A few less thoughts that usual too.",
    "Who else has picked up meditation since the pandemic started?",
    "I have been doing meditation since 1980, I think that you are helping a lot of people, keep doing what you doing"
  ],
  "channelSubscriberCount": 1130000,
  "channelVideoCount": 844
}