{
  "video_id": "YIaEYcr0Bfk",
  "title": "Floor Exercises: Total Body Workout (Arms, Abs, Butt, Thighs)",
  "description": "Open Me::::\n\nGET VIRTUAL COACHING: carolinejordanfitness@gmail.com  \n\nInstagram: @carolinejordanfitness  \n\nhttp://www.carolinejordanfitness.com/  \n \nSUBSCRIBE: https://www.youtube.com/c/CarolineJordan \n\nDONATE: https://www.paypal.me/CarolineJordanUS  \n\nHURT FOOT FITNESS COACHING PROGRAM HERE: https://www.hurtfootfitness.com \n\nHurt Foot Fitness e-book: https://gum.co/HurtFootFitness  \n\nHealing Diet: https://www.hurtfootfitness.com/healingdiet \n  \nStrong Body Program : https://www.hurtfootfitness.com/strongbody\n\nHigh Hamstring Tendonitis Guidebook: https://gumroad.com/l/highhamstringtendonitis  \n\n\nBuy Book: http://amzn.to/2kLQZtA  \n\nBlog: http://www.carolinejordanfitness.com/blog/  \n\nFacebook: https://www.facebook.com/carolinejordanfitness  \n\nTwitter: https://twitter.com/carolinefitness  \n\n\nIf you liked this video, please support the channel by hitting \"LIKE\" and the \"SUBSCRIBE\" button. Your support helps fuel future content and a more powerful impact in the health of the planet. \n\nWho needs a gym when there’s the living room floor? Bodyweight floor exercises are a simple, effective way to improve balance, flexibility, and strength without gym machines or equipment. Get moving at home with these fun, uplifting floor exercises for a total body tone.\n\nAre you ready to get sweaty? My Youtube floor workouts have been such a fan favorite, I thought it was time to film another round of feel good fitness moves just for you. This exercise routine is perfect to be done at home when you are short on time and need a workout that is fast, effective, and well rounded.\n\nHave you subscribed to the Youtube channel yet? Make sure you do it and hit that notification bell so we stay connected every time I upload new content that's just for you. I love floor exercises because you can do them anywhere and they feel SO good on the body. Anytime you need a little bit of movement, you can roll out your exercise mat and press PLAY: at the gym, at home, or while traveling. I have a floor exercise playlist on youtube here. Check it out: https://www.youtube.com/playlist?list=PLDh6UAgf3aBGium0_xEJcrTKwZq1Y9oPB \n\nWheres your favorite place to workout? Do you have a spot in your house you like to sweat? I love my living room floor - its the perfect size for home workouts like this routine of floor exercises. I had so much fun creating this workout for you! I hope you have fun doing this workout too. Here are the floor exercises you'll move through in this non-weight bearing routine:\n\nFloor Exercises Routine. Total Body Non Weight Bearing Workout.\n\nV sit pick up\nV Sit row (tone arms and back)\nV sit bow and arrow for obliques\nsun bathing knee tuck\nside plank side booty from kneeling\nside lying scissor kicks for oblique and thighs\nfrog pumps\nfrog ab press\ninner thigh scissor\nPretend jumpboard\nkneeling hinge\npushups\nback extension reach\nreverse plank lean back triceps\nhalf plank triceps dip on bum (sun bathing position)\n\n\nAs always, please check with your doctor or physical therapist before starting this or any exercise tontine. Honor your body, move mindfully, and modify as needed! Ready to go? Roll out your mat and bring it on!\n\nIf you liked this video and found it helpful, be sure to hit LIKE, subscribe to the channel, and share this video with someone who could benefit from this fun, uplifting floor workout too!\n\nHere to help you use movement as medicine and feel your best,\n\nCaroline\nDISCLAIMER: This content (the video, description, links, and comments) is not medical advice or a treatment plan and is intended for general education and demonstration purposes only. This content should not be used to self-diagnose or self-treat any health, medical, or physical condition. Don’t use this content to avoid going to your own healthcare professional or to replace the advice they give you. Consult with your healthcare professional before doing anything contained in this content. You agree to indemnify and hold harmless Caroline Jordan Fitness its officers, employees, and contractors for any and all losses, injuries, or damages resulting from any and all claims that arise from your use or misuse of this content. Caroline Jordan Fitness makes no representations about the accuracy or suitability of this content. Use of this content is at your sole risk.\n\nRelated Searches;\ndoes full body workout build abs\ntotal body exercises that tone your arms\nbest abs and butt workout moves",
  "channelTitle": "Caroline Jordan",
  "channelDescription": "Hello! I'm Caroline Jordan, a Certified Health and Fitness Coach here to help you heal, grow, and kick butt in life.  If you are looking for more energy, less stress, and a healthier mindset, you have come to the right place. I specialize in helping people find safe, effective ways to exercise. I am here to teach you how to use MOVEMENT AS MEDICINE for mental and physical well being. My mission is to help you develop a positive relationship to self and exercise that adds to the quality of your life. I can teach you how to drop the extremes, create lasting lifestyle change, and feel good in your skin. Through my Youtube channel you will learn how to challenge yourself in a healthy way and explore your full potential. Let’s get your mind, body, and spirit in great shape so you can love your life. \n\nBusiness Inquiries : Carolinejordan@gushcloud.com \nWebsite: http://www.carolinejordanfitness.com\nFacebook: https://www.facebook.com/carolinejordanfitness\nInstagram: @carolinejordanfitness",
  "tags": [
    "Floor Exercises",
    "Total Body Workout",
    "best fitness coach",
    "fitness coach on youtube",
    "does full body workout build abs",
    "total body exercises that tone your arms",
    "best abs and butt workout moves",
    "workout for abs",
    "full body workout for women",
    "butt and thigh workout",
    "home workout",
    "home cardio workout",
    "lower body floor workout",
    "best butt workouts at home",
    "best exercises for lower abs"
  ],
  "publishedAt": "2019-08-12T15:58:59Z",
  "duration": 1355,
  "durationFormatted": "22:35",
  "viewCount": 284475,
  "likeCount": 6353,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/YIaEYcr0Bfk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/YIaEYcr0Bfk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/YIaEYcr0Bfk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/YIaEYcr0Bfk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/YIaEYcr0Bfk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/YIaEYcr0Bfk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "5 years after this video was posted, and it&#39;s STILL relevant! I have a relatively strong core, and I find this workout challenging and Caroline&#39;s positivity contagious! 😁",
    "I met a girl in Sydney, she worked out 1 hours every morning on the floor and had been doing it for 20 + years - she was 72 and the strongest woman I have ever met.",
    "Found myself here after a sleepless night, had some negativity and anxiety lurking and I don’t know what made me get up and roll out my mat but even tho some of the sets were absolutely messy and silly— I am so grateful I sat and focused on myself in a restorative way. It really shifted my perspective. Thanks Caroline.",
    "Going to do this today, thank you!!!  I tell my husband &quot;This woman! Oh my gosh... I always know i can do all those exercises and it is soo bugging! She works me out so hard!! &quot;  THANK YOU SO MUCH FOR YOUR VIDEOS. They have helped me get back into shape after three years of grieving.",
    "I have a foot injury and grateful to find this video so I can still exercise at home!"
  ],
  "channelSubscriberCount": 669000,
  "channelVideoCount": 1095
}