{
  "video_id": "YKCy0HlH55M",
  "title": "20 minute Cycling Workout for Beginners",
  "description": "This is a 20 min indoor cycling workout for beginners! If you just got your spinning bike, exercise bike, or stationary bike, THIS IS FOR YOU!\n\n\n\nFor the beginners, make sure you watch this BEFORE this Spinning class! 👉https://youtu.be/AG6Dwi1T9do\n\n⭐️ Want to maximize your workouts? Find awesome gear here? 👉 https://www.amazon.com/shop/kaleighcohenfitness\n\nI'm so glad you decided to join my cycling class today, let's go for a ride! Grab your water bottle, grab your towel, get on your bike and let's get these pedals spinning! - Kaleigh Cohen Fitness\n\n0:00 - 1:24 Welcome!\n1:25 - 4:24 Warm Up | Here We Go Again by Floyd Wonder\n4:25 - 6:58 Speed Increase | Everybody by Norman\n6:59 - 8:56 Climbs | Coconut by Chair Model\n8:57 - 11:54 Sprints | Cybernetics by Hallmore\n11:55 - 14:04 Climbs | The Drum by The Seige\n14:05 - 16:04 Jogs | Fire by The Smocks\n16:05 - 18:54 Sprints | The Long Way Home by Noah\n18:55 - 21:39 Cool Down | Better Than by KAINA\n\n\n🟢 New to my indoor cycling workouts? START HERE! 👉- https://www.youtube.com/playlist?list=PLBJ0TIYiwZzjLnd3RU_J2y-dm9a34Ggw3\n\n🚴‍♀‍ If you are doing this indoor cycling workout on a stationary bike or exercise bike and cannot go into the standing positions (2nd and 3rd) and would like an added challenge during these, TRY THIS:\n2nd position: increase your speed! Try anywhere between 5-15 RPMs.\n3rd position: increase your resistance here but try and keep the same cadence. \n\n🎶 This playlist can be found at my Spotify 👉- https://open.spotify.com/playlist/1mVFhKyRBfBlzHOda03Tps?si=KndPSBBLRfiD-4juVLm10g\n\n💁🏼‍♀‍ Get to know me here 👉https://youtu.be/la6BwPsvo9k\n\n🟣 Let’s connect!\nInstagram- https://www.instagram.com/kaleighacohen/\nFacebook- https://www.facebook.com/kaleighcohenfitness\n\n🟢 Subscribe for more indoor cycling workouts: https://www.youtube.com/kaleighcohenfitness\n\n🟣 Share this indoor cycling workout with a friend:\nhttps://youtu.be/YCUXybufIiA\n\n🟢 WATCH NEXT! 👉 https://youtu.be/83H7JV0x7DU\n\n💁🏼‍♀‍ Hello! I'm Kaleigh! I attended my first Spinning class when I was 15. Since then I've been addicted to indoor cycling workouts. Now, as a certified Spin class Instructor and certified fitness trainer, my goal is to provide you with fun, motivating, and energizing indoor cycling and strength workouts that motivate you to be YOUR BEST YOU! This is cycling motivation! Thanks for cycling with me!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your health care provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.\n\n#20min #beginner #spinningclass",
  "channelTitle": "Kaleigh Cohen Cycling",
  "channelDescription": "Hello! I'm Kaleigh and I create CYCLE & STRENGTH training programs to challenge and transform you into an unstoppable force!\n\nI'm here to help you CLIMB YOUR MOUNTAIN and SPRINT THROUGH THE STORM!\n\nI am a certified Spin instructor, Stages Beats instructor, NASM certified personal trainer, and Girls Gone Strong Pre/ Postnatal coaching certified with over 13 years of experience coaching all over the world!\n\n🔴 DISCLAIMER 🔴 When beginning any fitness workout or regimen, it is important to consult your physician to ensure this program is right for you. Do not start this program if your healthcare provider advises otherwise. Any exercises or information on this channel, through videos or comments, is to be used at your own risk. Kaleigh Cohen Fitness will not be responsible or liable for harm, damage, or injury as a result of any information provided.",
  "tags": [
    "cycling workout",
    "beginner workout",
    "beginner spin workout",
    "cycling",
    "workout",
    "spin class",
    "45 minute workout",
    "indoor cycling workouts",
    "indoor cycling",
    "spinning",
    "spin workout",
    "spinning class",
    "fitness",
    "spin",
    "home workout",
    "spin instructor",
    "spinning workout",
    "weight loss",
    "hip hop spin class",
    "cardio workout",
    "exercise bike",
    "stationary bike",
    "indoor cycling workout",
    "kaleigh cohen spin",
    "kaleigh cohen"
  ],
  "publishedAt": "2020-07-06T11:15:14Z",
  "duration": 1300,
  "durationFormatted": "21:40",
  "viewCount": 1713747,
  "likeCount": 30340,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/YKCy0HlH55M/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/YKCy0HlH55M/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/YKCy0HlH55M/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/YKCy0HlH55M/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/YKCy0HlH55M/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/YKCy0HlH55M\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "💜Did you just get a bike and new to indoor cycling? Let me know! I would love to hear from you!! 💜",
    "So severely overweight woman here 🙋🏻‍♀️ Got an exersize bike for Christmas and have been trying to distract myself during the 10 miles I&#39;ve been doing daily. I just beaten my time by 5 minutes, added an extra 3 miles on and actually laughed and enjoyed myself. Looking forward to coming back tomorrow, so thank you 💜",
    "New at this I am disabled, both knees replaced, arthritis, chronic back pain, osteoarthritis and degenerative bone disease, my son bought me a stationary bike so I won’t wither away, need all the positive energy to start a new beginning for my body ❤️💪🏼🙏🏼🙌🏼",
    "Hi Kaleigh. I started this workout 3.5  weeks ago and could barely make the 10 minute mark. Happy to say that I completed the whole thing today.  Thanks so much for your effort and encouragement.  Feeling good!",
    "It took me 3 tries to complete this without stopping, but now I am loving it! You are the perfect mix of positivity without being overly perky, and I don&#39;t feel like I&#39;m being ordered around or talked down to. I&#39;m actually enjoying cardio for the first time in my life, and I am looking forward to trying out all of your videos. Thank you!"
  ],
  "channelSubscriberCount": 351000,
  "channelVideoCount": 595
}