{
  "video_id": "YMF5h6HpxKk",
  "title": "Guided Abundance Meditation | Bob Proctor",
  "description": "✅Experience the power of meditation and learn more about life-changing guided meditation with Omvana:👉 https://go.mindvalley.com/2TpiU2Gb\n\nWe could all use a little extra dose of abundance — regardless of who you are or where you are in life. This guided meditation is bound to get your abundance juices flowing. So sit back, relax, and sink into your visualizations of a more abundant life. Experience the power of meditation now.\n\nABOUT BOB PROCTOR:\nBob Proctor is one of the most sought-after leaders in professional coaching and business seminars, as featured in the popular film The Secret. He has taught thousands of people worldwide on how to shift their consciousness in order to create fulfilling relationships, successful careers and financial stability. His teachings instill not only the mental foundations of success and the motivation to achieve, but also the actionable strategies that will empower them to grow, improve, and thrive in today’s ever-changing world.\n\n#meditation​ #abundance​ #bobproctor",
  "channelTitle": "Mindvalley ",
  "channelDescription": "Welcome to Mindvalley: the world’s most powerful life transformation platform. \n\nAt Mindvalley, we believe that being human is more than just what our broken education system makes it out to be. And we take pride in teaching the art of truly living extraordinary, fulfilling, happy lives.\n\nOn our Mindvalley YouTube channel, you’ll get:\n#1: FREE access to Mindvalley’s exclusive personal growth content by the world’s top teachers\n#2: Viewing and commenting rights on Mindvalley’s talks, live workshops and events\n#3: Access to our Community Wall, with inspiring quotes, event invitation and discussion points\n#4: Guided meditations, music and tracks to relax, focus and sleep\n#5: LIVE, free webinars, accessible no matter where you are\n\nOur courses transform lives and our community testifies to it. Join us now by subscribing to our channel and hitting the bell icon to stay updated on new uploads and live streams. Welcome to the community of Changemakers! \n",
  "tags": [
    "benefits of meditation",
    "power of meditation",
    "guided meditation for anxiety",
    "meditation for stress and anxiety",
    "stress relief meditation",
    "mindfulness meditation",
    "guided meditation for positive energy",
    "meditation guided",
    "meditation for anxiety",
    "meditation for beginners minute meditation",
    "meditation for positive energy",
    "mindvalley",
    "guided meditation",
    "sleep meditation",
    "meditation music relax mind body",
    "meditation music for positive energy",
    "guided meditation sleep"
  ],
  "publishedAt": "2017-11-15T06:22:16Z",
  "duration": 1313,
  "durationFormatted": "21:53",
  "viewCount": 3754284,
  "likeCount": 32249,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/YMF5h6HpxKk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/YMF5h6HpxKk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/YMF5h6HpxKk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/YMF5h6HpxKk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/YMF5h6HpxKk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/YMF5h6HpxKk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Experience the power of meditation and learn more about life-changing guided meditation with Omvana:👉 <a href=\"https://go.mindvalley.com/2TpiU2Gb\">https://go.mindvalley.com/2TpiU2Gb</a>",
    "Whoever is reading this... you are magic. A true force to be reckoned with. A beautiful masterpiece of the universe. You are a shining white light full of happiness, positivity, prosperity, health, abundance, joy, luck, success, and all the good in the world. You are not one in a million... you are one in forever. There is only one of you across all dimensions, galaxies, and times. You are so unique and unusual, so extraordinary in your own remarkable way. Stay thankful gorgeous people!!!!! Have the best day everyday! Much, much love angels ❤️❤️❤️",
    "I came back to this meditation after 4 years. <br><br>In 2018 I decided to start my own company. I remember I was listening to this in the summer of 2018 a few months before having the idea to form my company. <br><br>Since then my business has grown double or even triple year after year. In 2021 I was even offered a buy out. <br><br>I came back to this meditation on accident in 2022 and thought back in retrospect as to how my life now truly has abundance like I could have never imagined.<br><br>Believe in yourself and stay positive ❤️",
    "Hi Bob, thank you for this. I started doing this meditation in August 2019. It changed my life. In November 2019 I went to a different country with a job with more than 3-times my actual monthly salary. I had the possibility of bringing my family with me in January 2020. Today in 2022, two years from that time, I am back using this vital resource. If it changed my life, I am sure it will change the life of everyone who performs it with faith and in harmony with the universe. Abundant blessings to all.",
    "I used to listen to this just to calm my mind a year ago. Little did I know that my life would transform within a year and every dream I had on mind would manifest itself in this physical world. I am back to claim more and to create more with a more vibrant energy that I possess. Keep listening. This audio creates magic that you will realize later"
  ],
  "channelSubscriberCount": 2440000,
  "channelVideoCount": 2352
}