{
  "video_id": "yMfmaQAXQns",
  "title": "30 Minute Spin® Class: High Intensity CALORIE TORCHER (Intense Free Online Spin® Spin®  Workout)",
  "description": "Torch FAT & SCULPT in this 30 Min High-Intensity Spin® Class / Indoor Cycling Ride with hills, Sprints, & Jumps. Let's GO! \n\nHave you checked out our new YouTube Sweat Junkie Membership options?! For only $4.99/mo you can get 40+ bonus SSoD full-length fitness classes right now directly through YouTube!!! Learn more now at https://www.youtube.com/channel/UCHD2b6aFl04u6E-xuEtPpzg/join \n\nIf you loved this class, access more workouts FREE for 7 Days! https://bit.ly/2ZmBdN2\n\nJoin Mimi and SSoD Fam in this 30 min INTENSE Spin and indoor cycling workout class. You'll burn calories AND tone with this combo of hills, sprints, and jumps. You'll have so much fun, 30 min will fly and you'll be back again tomorrow!  \n\nWe're publishing a TON more spin videos, so subscribe!  Remember to STRETCH with our 5 min Cool Down Stretch: https://www.youtube.com/watch?v=aix2q4WSv8U  \n\nIF YOU'RE NEW!  \nWelcome to StudioSweat onDemand! No models, no B.S., just REAL workouts with REAL PEOPLE getting REAL RESULTS.   We hope you enjoy our free workout videos including spin indoor cycling classes, HIIT, Strength, Kettlebell, Pilates, Yoga, TRX, Bootcamp and more. We're also adding more variety of workout lengths and classes for different levels! :D   \n\nWANT TO TAKE IT TO THE NEXT LEVEL? Join the SSoD ALL-ACCESS Membership! \nAccess our ENTIRE add-free video library of 1000+ fat-torching workouts that you can stream on mobile apps, TV apps, or browsers AND we release *fresh* new workouts every few days!   \n\nStart your 7-Day Trial: https://bit.ly/2ZmBdN2  \nOR use code “SWEAT5YT” to get your $5 All Access Pass Intro Month  \n\nABOUT Studio SWEAT onDemand: \nStudio SWEAT onDemand is an online app and platform that provides full hour and express specialty Spin®, TRX® and other amazing Total Body workouts, available to stream and download at your convenience. New workouts and spin workout classes with fresh tunes are released all the time!  \n\n#spinclass #spinworkout #indoorcycling",
  "channelTitle": "Studio SWEAT onDemand",
  "channelDescription": "Welcome to StudioSweat onDemand (SSoD) where you come to work out with REAL PEOPLE and get REAL RESULTS. No models, no B.S., we're here to help YOU become the BEST version of yourself. \n\nOur channel features a ton of workout videos including spin indoor cycling classes, HIIT, Strength, Kettlebell, Pilates, Yoga, TRX, and more. We're adding more variety of workout lengths and classes for different levels. \n\nIf you loved our free classes, check out our ENTIRE video library of 1000+ fat-torching workouts that you can stream anytime, anywhere.\n\nAccess ALL workouts FREE for 7 days: https://www.studiosweatondemand.com/freetrial-youtube/\n\nABOUT Studio SWEAT onDemand:\nStudio SWEAT onDemand is an online app and platform that provides full hour and express specialty Spin®, TRX® and other amazing Total Body workouts, available to stream and download at your convenience. New workouts and spin workout classes with fresh tunes are released all the time! www.studiosweatondemand.com\n\nLet's go!\n~Cat",
  "tags": [
    "Free online cycling classes",
    "Best online spin classes",
    "Free online spin class",
    "workout videos online",
    "free studio sweat on demand class",
    "free studio sweat on demand",
    "free spin class video",
    "30 minute spin class",
    "30 minute Spin class video",
    "Online Spin Class Free",
    "spin class",
    "spinning class",
    "indoor cycling",
    "cycling workout",
    "stationary bike workout",
    "indoor cycling workouts",
    "online spinning workout",
    "spin cycle class video",
    "free spin class",
    "free online spin class",
    "spin workout"
  ],
  "publishedAt": "2019-09-20T18:21:57Z",
  "duration": 1895,
  "durationFormatted": "31:35",
  "viewCount": 4669873,
  "likeCount": 28439,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/yMfmaQAXQns/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/yMfmaQAXQns/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/yMfmaQAXQns/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/yMfmaQAXQns/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/yMfmaQAXQns/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/yMfmaQAXQns\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Get instant access to tons of workouts just like this with a 7-Day Free Trial of Studio SWEAT onDemand @ <a href=\"https://www.studiosweatondemand.com/freetrial-youtube\">https://www.studiosweatondemand.com/freetrial-youtube</a> now!!",
    "I weighted 104.500kgs on Sept 2021, I started doing this rutine, every day, Now I weight 86.000kgs! Amazing result. I can sent proofs of it!! Thank you Studio on Demand!!",
    "STOP SEARCHING❗<br>BEST INSTRUCTOR‼<br>BEST MUSIC‼<br>U will keep coming back for this heat 🔥",
    "Listen everyone who this lady said you’re cheating to; if you’re on the spin bike trying to get fit, you’re not cheating at all, no matter where you put the resistance or rpm’s. Good on you for making the effort and don’t stop because someone told you you’re cheating. If you’re here, you’re winning fair and square!",
    "This was my go to ride in Afghanistan and still is now that I’m home. I’ve done it over 200 times."
  ],
  "channelSubscriberCount": 169000,
  "channelVideoCount": 1299
}