{
  "video_id": "yPK7ISPEu3M",
  "title": "15 Min Daily Yoga Flow | Every Day Full Body Yoga Routine",
  "description": "👉 Join my Flexibility Program to master challenging poses - https://www.charliefollows.com/flexibility-program\n\nWelcome to this 15 min daily yoga flow, an easy to follow full body practice you can do every day. \n\nThis full body sequence includes options to suit different levels and is intended to give you a well rounded, complete practice that you can come back to daily.\n\nI hope you enjoy this daily yoga flow. \n\nCharlie x\n\nLinks:\nOnline Programs: https://www.charliefollows.com/programs\nNewsletter: https://www.charliefollows.com/newsletter\n\nSocial Media:\nInstagram: https://www.instagram.com/ch3rlieflow/\nFacebook: https://www.facebook.com/charliefollowsyoga\nTikTok: https://www.tiktok.com/@charlieefollows?_t=8jbfibQBEiO&_r=1\n\nCharlie Follows is a yoga channel. Charlie’s aim is to spread joy through movement with her signature playful style of vinyasa flow. Charlie hopes to inspire others with her love for the practice and build a community of yoga lovers. Charlie is a registered Yoga Teacher with over 500hrs of training in vinyasa yoga and functional anatomy. She combines her knowledge of anatomy with an intelligent approach to sequencing to offer yoga flows that are creative, playful and effective. Charlie taught for years at studios in her home town and now focuses her teaching online. Join Charlie for online programs through her website: https://www.charliefollows.com\n\nDISCLAIMER:\nPlease consult with your physician regarding the suitability of any recommendations made on this channel. Before beginning any form of exercise programme ensure that you are following all safety instructions specific to your own well being. When participating in any exercise or exercise program, there is the possibility of physical injury. If you engage in this exercise or exercise program, you agree that you do so at your own risk, are voluntarily participating in these activities, assume all risk of injury to yourself and release Charlie Follows from any liability.",
  "channelTitle": "Charlie Follows",
  "channelDescription": "Join my online programs to achieve your goals at the link below!\n\nHi, I’m Charlie, I’m a certified Yoga Teacher who's happy to be here spreading joy through movement. \n\nOn this channel I share classes for all levels as well as tutorials and little gems of information that can help you learn more about your body and develop your yoga practice. \n\nI look forward to seeing you in class x\n\n",
  "tags": [],
  "publishedAt": "2024-03-09T01:00:33Z",
  "duration": 914,
  "durationFormatted": "15:14",
  "viewCount": 1507114,
  "likeCount": 34486,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/yPK7ISPEu3M/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/yPK7ISPEu3M/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/yPK7ISPEu3M/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/yPK7ISPEu3M/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/yPK7ISPEu3M/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/yPK7ISPEu3M\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "I&#39;ve dismissed yoga for most of my life until I had spinal injuries from a car accident and overuse. Started following your earlier classes to ease my way into the practice. Now I do your classes 4-5 times a week and I feel amazing. Thank you Charlie! ❤",
    "Was having a hard day. Decided to do yoga in the middle of my day. Chose this slow and couldn’t have been more pleased. Always grateful. Thank you.",
    "A perfect flow for me!  Towards the end of the class I had the thought TWICE, &quot;this is awesome, but I&#39;ll have to do x pose after these mere 15 mins are finished&quot;.  And then you went and incorporated the pose!!  You are quickly becoming my favorite yoga teacher on YT.  THANK YOU Charlie!",
    "That was beautiful! A really thorough class in 15 mins. I feel set to start the day, and will be revisiting this class! Thanks so much Charlie for the care and love you put into your classes!",
    "Thank you so much Charlie for sharing your flows with us.  Excellent guidance and pace.  I start my day with 10-15 mins of yoga, it’s a life changer. After 25+ years of pack pain from nursing (added in a daily 1 min plank too last year,omg the difference I now have in my core) and not had a flare in past 5 years!  🧘🏼‍♀️💜"
  ],
  "channelSubscriberCount": 991000,
  "channelVideoCount": 1004
}