{
  "video_id": "YPrm_5u-9HM",
  "title": "15 Minute Workout - Best Indoor Cycling Training Cardio Session",
  "description": "Subscribe to GCN Training: https://gcn.eu/GCNTraining\n\nGet your heart pumping with GCN's cardio session. Use your turbo trainer to ride up the Col de Soller and get a great bike workout!\nFollow GCN on YouTube for more turbo sessions: http://gcn.eu/SubscribeToGCN\n\nRide with Daniel Lloyd up the beautiful Col de Soller in Mallorca in this short but tough, effective training session to tackle on your home trainer. \n\nIn just 15 minutes, you can get a great workout, the secret is in the pyramid structure combined with an emphasis on different pedalling speeds. \n\nDan talks you through the session, step by step, giving valuable advice as well as encouragement. All the while you can get distracted by the beautiful Mallorcan scenery. \n\nNot all exercises are suitable for everyone - there is no ‘one size fits all’ approach. As with any strenuous exercise, you should take into account factors such as your flexibility, strength and overall health to determine if an exercise is appropriate for you, and consult a doctor/physician before beginning a programme of exercise. Discontinue your exercise session immediately if you experience any pain, dizziness or discomfort. \nPartaking in training sessions following GCN's video instruction is entirely at your own risk, and Global Cycling Network, its partners and its affiliated companies cannot be held responsible for any injuries which may occur as a result of these exercises.\n  \nBuy GCN Cycling Kit! Click here: http://gcn.eu/BuyGCNKitYT\n\nBuy The Music:\nAtlantis Ocean - Stellar Vault: http://gcn.eu/1EaZW1H\nSpartaque - No Way Back\nLike Mind - Feelin\nSebastian Weikum - It Moves On | Roddy Reynaert Dub http://gcn.eu/1orVBVX\nSergio Fernandez - Jam Sax http://gcn.eu/1pvV1Y4\n\nAbout GCN:\n\nThe Global Cycling Network puts you in the centre of the action: from the iconic summit of the Stelvio to the epic trails of Fort William, Scotland, everywhere there is pavé or dirt, world-class racing, and pro riders, we will be there bringing you all the action, essential analysis and unparalleled access every week, every month, and every year.\n\nWelcome to the Global Cycling Network | Inside cycling\n\n\n\nYoutube Channel - http://gcn.eu/gcnYT\nFacebook - http://gcn.eu/gcnFb\nGoogle+ - http://gcn.eu/gcnGPlus\nTwitter - http://gcn.eu/gcnTW\n\nLeave us a comment below!\n\nMusic licensed by Cue Songs",
  "channelTitle": "Global Cycling Network",
  "channelDescription": "The Global Cycling Network puts you in the centre of the action: from the iconic climbs of Alpe D’Huez and Mont Ventoux to the cobbles of Flanders, everywhere there is road or pavé, world-class racing and pro riders, we will be there bringing you action, analysis and unparalleled access every week, every month, and every year. We show you how to be a better cyclist with our bike maintenance videos, tips for improving your cycling, cycling top tens, and not forgetting the weekly GCN Show. Join us on YouTube’s biggest and best cycling channel to get closer to the action and improve your riding!\n\nWelcome to the Global Cycling Network!\n",
  "tags": [
    "GCN",
    "Global Cycling Network",
    "Sports",
    "Cycling",
    "Bike",
    "Road Bike",
    "Cyclist",
    "high intensity training",
    "Pro cycling",
    "Cycling Training",
    "Sec Features",
    "work out",
    "Turbo session",
    "turbo-training",
    "Workout",
    "fitness",
    "training session",
    "indoor cycling",
    "home trainer",
    "HIIT",
    "Mallorca",
    "cardio",
    "sp-santini",
    "sfish15"
  ],
  "publishedAt": "2014-11-07T14:52:02Z",
  "duration": 989,
  "durationFormatted": "16:29",
  "viewCount": 729145,
  "likeCount": 4685,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/YPrm_5u-9HM/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/YPrm_5u-9HM/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/YPrm_5u-9HM/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/YPrm_5u-9HM/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/YPrm_5u-9HM/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/YPrm_5u-9HM\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Great work out! I have a heart problem,  I had to start with medicine but first I wanted to try and work on my (heart) condition. I found this workout on YT and since 3 weeks I workout everyday for 15 minutes. My bloodpressure is gone down, I&#39;m no longer short of breath and no more pain on the chest. I feel healthy and I&#39;m in much better  shape.",
    "That&#39;s one way to get the heart pumping strong! Second day on this cardio session and I must say I Love it! This is a lifestyle now for me! All about my health and Longevity for my kids in the end I really wanna be around when they all grow up and learn they can think for themselves!",
    "I&#39;ve just done this workout for the first time today, as I was a little short on time. The fact is that this turned out to be an excellent choice, and very effective workout. By the end of the 15 minutes my legs were burning, my heart rate raised and lowered as it was supposed to within the instructions, as well with my effort levels. A couple of days ago I&#39;ve done the 30 minutes hill climbing, and it was just as good! Don&#39;t bother with people who may be saying this is an unacceptable workout. They probably just need a little more time on the saddle to complete and understand a workout like this. Many thanks for this and the other videos, guys! It is a fantastic work!!",
    "This class is a bar-setter, for sure! Thanks, GCN. I&#39;m done!!!!",
    "Just got a spin bike to compliment my outdoor bike.  I used this 15 minute trainer in my own way.  I kept cadence with beat of the music, giving more resistance thru it.  It was excellent for me, 63yo.  Thank you, I will look for more of your training vids and use this one again.  Thanks !"
  ],
  "channelSubscriberCount": 3390000,
  "channelVideoCount": 8298
}