{
  "video_id": "yt3CpkmFAfc",
  "title": "Physio Neck Exercises Stretch & Relieve Routine",
  "description": "Physical Therapist neck exercises from https://www.pelvicexercises.com.au with Physio Michelle who guides you through this 5 minute exercise routine to stretch your neck muscles and relieve neck and shoulder tension. \n\nMichelle Kenway presents a series of neck exercises for relieving common areas of tension. These general neck exercises and should all feel comfortable and pain free. These exercises are not designed to treat specific neck conditions. Never stretch beyond the limits of personal comfort and immediately cease any neck exercises associated with physical discomfort. \n\nThis exercise video guides you step by step through the following basic neck exercises and techniques to relieve neck and shoulder muscles and improve posture. \n\nNeck exercise 1 - Correct your sitting posture with your spine lengthened, lift  the crown of your head towards the ceiling, raising your chest slightly and relaxing your shoulders.\n\nNeck exercise 2 - Shoulder rolls relieve neck and shoulder tension. Make circular movements of the shoulder girdle as if drawing circles with the shoulders. Inhale as you raise your shoulders upwards and exhale as you roll your shoulders back and down. \n\nNeck exercise 3 - Chin to chest stretch lengthens muscles at the back of the neck. Sit tall with your spine tall and gently lower your chin towards your chest as you exhale. Repeat 3-4 exercises.\n\nNeck exercise 4 - Ear to shoulder stretches and relieves tension in the side neck muscles. Correct your posture, fix your left shoulder down by holding under your chair with your left hand. Slowly lower your right ear to your right shoulder keeping your nose facing forwards. This exercise stretches the neck muscles in the left side of your neck. Maintain for 30-45 seconds, slowly release and repeat twice.\n\nNeck exercise 5 - Nose to armpit stretch relieves muscles that run from the head into the shoulder. Correct your posture, grasp under the seat of your chair with your left hand and rotate your head towards the right, lowering your nose to your right armpit. You will feel a gentle stretch on the left side of your neck. Maintain stretch for 30-45 seconds and repeated twice. Perform on both sides of the neck. \n\nNeck exercise 6 - Nose to opposite knee can stretch and relieve the muscles from the neck to the tip of the shoulder blade. Set your posture and hold the base of your chair with your left hand. Rotate your head slightly to the right and gently lower your nose towards your right knee. Maintain for 30-45 seconds and twice. Perform on both sides of the neck. \n\nUpper back/shoulder exercise 7 – Reach forward stretches muscles in your middle back between your shoulder blades. Link your fingers and roll your shoulders forwards as you reach in front of your body. Gently lower your chin to chest for added neck stretch.\n\nChest stretch exercise 8 - Backward reach stretches your chest and improves posture. Link your fingers behind your back. Raise your arms away from your back and lift your chest. You should feel a gentle stretch across the front of your chest. \n\nComplete your neck exercises with 2-3 shoulder rolls and reset your posture with your spine lengthened and your shoulders relaxed down.\n\n#physiotherapy  #neckstretches #neckexercises\n\nDisclaimer \nThe information provided in this video is intended as general information and not a substitute for individual medical advice regarding your medical condition. To the extent permitted by law, neither Healthy Fit Solutions Pty Ltd, as trustee for the P & M Kenway Family Trust (“we”), nor any of our officers, employees, agents or related bodies corporate will be liable in any way (including for negligence) for any loss, damage, costs or expenses suffered by you or claims made against you through your use of, or in connection with, this video or information supplied or offered to be supplied on this video. Although we use our best efforts to provide accurate information and other materials on this video, the video is provided “as-is”. To the extent permitted by law, all warranties, conditions and representations provided about or by this video are excluded.",
  "channelTitle": "Michelle Kenway",
  "channelDescription": "Welcome to Michelle Kenway's Physiotherapy and Safe Exercise Channel! As a highly experienced physiotherapist, I specialize in pelvic floor health and helping you achieve your health and wellness goals. By subscribing and clicking the notifications bell, you'll receive a new video every week filled with valuable exercises and information to improve your wellbeing.\n\nMy channel is perfect for beginners, individuals recovering from injuries or illnesses, and those challenged by chronic health problems such as neck and back pain, and poor core control. You'll also find a wealth of Pelvic Floor Physiotherapy exercises and information videos to help with pelvic floor strengthening, prolapse management, pelvic pain, bowel problems, and constipation.\n\nVisit https://www.pelvicexercises.com.au for even more resources, including pelvic exercise videos, safe exercise books, and videos to download. Join me on your health, fitness, and recovery journey!\n",
  "tags": [
    "neck exercises",
    "neck stretches",
    "Physical Exercise (Word)",
    "physical therapist",
    "neck stretching exercises",
    "neck exercise video",
    "exercise video",
    "Stretch",
    "Stretching (Character Power)",
    "Physical Therapy (Medical Specialty)",
    "Neck Pain (Symptom)",
    "physio",
    "physiotherapy",
    "Michelle Kenway"
  ],
  "publishedAt": "2013-09-12T04:22:43Z",
  "duration": 310,
  "durationFormatted": "5:10",
  "viewCount": 4812715,
  "likeCount": 54045,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/yt3CpkmFAfc/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/yt3CpkmFAfc/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/yt3CpkmFAfc/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/yt3CpkmFAfc/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/yt3CpkmFAfc/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"360\" src=\"//www.youtube.com/embed/yt3CpkmFAfc\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Quarantine really got everyone comin to the neck stretching videos",
    "I always come back to these videos after long study sessions. I&#39;ve been coming back to this video at least once a week for 2 years. Thank you! This video has saved my neck/back!",
    "I&#39;ve had consistent neck pain in one side for several months now, and these exercises help relieve some of that tension. Thank you!",
    "Brilliant exercises.  I woke up with neck pain , i follow these exercises,  pain goes instantly. <br>Highly recommended if anyone have back shoulder and neck pain.",
    "Folks, it works! I&#39;ve been doing them for 5 days, and now I can turn my head with no pain. Thank you so much!"
  ],
  "channelSubscriberCount": 911000,
  "channelVideoCount": 306
}