{
  "video_id": "YzRUEmqDJd8",
  "title": "GUIDED MEDITATION for Healing  Anxiety, PTSD, Panic & Stress",
  "description": "This is a gentle guided meditation for healing anxiety, PTSD, panic & stress. (details below) Join our community/see our products: https://www.thehonestguys.co.uk/products\n\nThe Meditation includes diaphragmatic breathing (or belly breathing) that takes you into a relaxed state, after which affirmations for peace and healing will be narrated. \n\nIncludes a gentle wakeup at the end of 18 minutes. \n\n____________________________________\n\nTHE HONEST GUYS\nWe create effortless ways for anyone to reach a profound sense of deep relaxation, meditation and sleep, without ever having to try.  In particular, we cater to anyone who is turned-off by the idea of \"meditation\", but still want to reap the massive health benefits, that meditation can bring. We offer this through high-quality audio productions, called 'guided visualisations'. These include sleep talk-downs, meditations, wonderful fantasy imagery and stories. \n\nPlease subscribe to our channel (It's Free), and (importantly), DO click the bell icon, so you receive notifications of all our new uploads : http://www.youtube.com/thehonestguys?sub_confirmation=1\n\nIf you enjoy our work and would like to support the channel, please consider purchasing one of our high-quality products: https://www.thehonestguys.co.uk/products\n\nJoin one of our membership Programs to get advert-free access to virtually every video we have ever made! :  https://www.thehonestguys.co.uk/vip-membership-info\n\nOr alternatively, if you would like to support us in other ways:  click here:  https://www.thehonestguys.co.uk/sponsorship\n\n____________________________________\n\nSOCIAL MEDIA - Interact with us here:\n\nFacebook: Our main community-focused page. Interact on a daily basis: http://www.facebook.com/THGMEDITATIONS\n\nTwitter: http://twitter.com/TheHonestGuys\n\nInstagram: http://instagram.com/thehonestguys\n\nWebsite: Official website of The Honest Guys: http://www.thehonestguys.co.uk\n\n\n\n\n#panicattack #panicattackrelief #guidedmeditation #thehonestguys #anxietyrelief",
  "channelTitle": "The Honest Guys - Meditations - Relaxation",
  "channelDescription": "We create effortless ways for anyone to reach a profound sense of deep relaxation, without ever having to try. We specialize in sleep meditation and similar, including wonderful fantasy visualizations and stories all designed to invoke serene calm.\n\nIn particular, we cater to anyone who is turned-off by the general idea of meditation, but still want to reap the huge health benefits, that meditation brings.\n\nWe make our recordings freely available on YouTube so others can benefit from them, because we want to help people.\nEvery one of our guided meditations, mindfulness meditations, fantasy sleep stories, and meditation exercises, is produced with genuine care and love for those people who use them, because we too have needed the kind of help our meditations are trying to offer.\n\nSubscribe for new uploads. We regularly publish brand new content.\n\n# sleepmeditation # meditation for sleep #guidedmeditationsleep  #mindfulnessmeditation #guidedmeditation #thehonestguys #bestmeditations \n",
  "tags": [
    "guided meditation",
    "guided healing",
    "meditation for anxiety",
    "relief for PTSD",
    "stress relief",
    "calming",
    "deep relaxation",
    "guided meditation for healing",
    "belly breathing",
    "diaphragmatic breathing",
    "guided visualisation",
    "guided pain relief",
    "guided relaxation",
    "guided sleep",
    "relaxing music",
    "relaxation",
    "uk",
    "male voice",
    "english",
    "voice",
    "panic relief",
    "ptsd"
  ],
  "publishedAt": "2020-05-12T20:00:11Z",
  "duration": 1098,
  "durationFormatted": "18:18",
  "viewCount": 1061117,
  "likeCount": 13592,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/YzRUEmqDJd8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/YzRUEmqDJd8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/YzRUEmqDJd8/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/YzRUEmqDJd8/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/YzRUEmqDJd8/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/YzRUEmqDJd8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "We are all only humans looking for something to feel less lonely, less scared. I pray for everyone to feel peace and safety ❤",
    "It’s so comforting to read these comments and realize that I am not alone in my struggles. That everything that I’m experiencing, other are experiencing too. That everything is going to be okay. I’m going to be okay. You’re going to be okay.",
    "To you reading this right now... you are beautiful.  Everything will work itself out.   Everyone here knows how you feel right now.  This feeling sucks, but know that you will be be ok.  This too shall pass...Don’t fight the anxiety, just allow it to work it’s way through and Let it do its thing.  Embrace the moment as you become at peace with things.   Now I want you to close your eyes and place your hands in front of you and lightly wiggle your fingers like you’re playing a piano.   You are shedding this off as we speak.  It’s dripping off your fingertips...Feel it melt off yourself. See, there it goes......we love you .  At peace... at peace.... at peace...  at peace....🙏🏻🌼🍀☀️✨🌼🍀🌼🍀🐣🌼🍀☀️✨🙏🏻",
    "For a long period of time my mind has been overcome with stress to the point of playing games, hallucinating and see things that are just not there due to my intense stress levels of overthinking and ruminating over things that I have no control over. Since coming across your video and engaging in your meditation practice consistently and daily. I am now starting to see significant changes  my mind and total wellbeing is more relaxed too. Thank you so much you are a life saver. Much appreciated 🙏",
    "Wow... that helped, that really helped. I faced with quite an unpleasant situation that left me speechless, I couldn&#39;t breathe, I felt numb but with too many thoughts rushing through my mind. There were too many things to handle for me, so I needed help and I found it. It eased my mind, I could finally fall asleep. And as I write it in the morning I can say - I still feel great. The problem isn&#39;t gone but at least I can breathe. Thank you, guys, you do a marvellous job, more like magic. Love from Ukraine."
  ],
  "channelSubscriberCount": 1260000,
  "channelVideoCount": 731
}