{
  "video_id": "zdFWA4dp3zk",
  "title": "15 Minute Energy Cleanse (Guided Meditation)",
  "description": "Just 15 minutes to immerse yourself in this energy cleanse guided meditation can rejuvenate your mind, body, and spirit in profound ways.  We often accumulate stress, tension, and negative energy that weigh us down and cloud our clarity. This meditation offers a powerful tool to release these burdens, cleanse your energetic field, and restore balance within yourself.  Through gentle visualization and intentional breathing, you can let go of stagnant energy, emotional baggage, and mental clutter, creating space for renewed vitality and positivity to flow freely.  Reclaim your sense of peace, and step forward with a lighter, more vibrant energy that empowers you to navigate life's challenges with grace and resilience.  This is an Original 15 minute guided  morning meditation recorded by us.  \n\nA special thank you to all our monthly supporters!  \nWe appreciate all your support and contribution to allow this channel to continue to share our guided meditations with the world.  Thank you!!!\nIf you would like to join our monthly supporters, you can do so here:  https://www.buymeacoffee.com/greatmeditation/membership\n\nCredits: \nThis recording has been produced by and Exclusively owned by us (Great Meditation).\nVoice spoken:  Original commentary recorded by us.\nBackground Image: Original image produced by, and exclusively owned by us.\nBackground Music:  Exclusively owned and produced by us",
  "channelTitle": "Great Meditation",
  "channelDescription": "Our channel consists of a group of individuals collaborating together to produce our very own Original guided meditations Exclusive to Great Meditation.   Each video on our channel features an Original Recording Written, Spoken, Edited and Produced by us.  All our videos contains their own Original Commentary unique to that specific video, adding value to our listeners, and are transformative in nature leading to the best possible viewer experience.  Our value proposition offered to our listeners comes from our Original Voice Recordings which guides the listener into a peaceful state of meditation.   \n\nThe background music we use in our meditations have either been produced by us and exclusively owned by us (Great Meditation) or by one of our individual team members.\n\nAll background visuals are original artwork produced by us, or are composed from licensed images that have been transformed by us into an original derivative unique to our channel.\n\n\n\n\n\n",
  "tags": [
    "guided meditation",
    "meditation",
    "meditation guided",
    "morning meditation",
    "meditation morning",
    "energy cleanse",
    "energy cleansing",
    "energy cleansing meditation",
    "meditation energy cleanse",
    "guided meditation energy cleansing",
    "15 minute meditation",
    "meditation 15 minutes",
    "guided meditation 15 minutes",
    "anxiety",
    "stress"
  ],
  "publishedAt": "2024-04-02T09:00:50Z",
  "duration": 916,
  "durationFormatted": "15:16",
  "viewCount": 378537,
  "likeCount": 8457,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/zdFWA4dp3zk/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/zdFWA4dp3zk/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/zdFWA4dp3zk/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/zdFWA4dp3zk/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/zdFWA4dp3zk/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/zdFWA4dp3zk\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Unconditional light and love to all 💜",
    "Time to cleanse our minds and bodies of what no longer serves us! 🙌🏽😌☀️",
    "This was the first time an energy cleansing meditation made me cry. Thank you!",
    "I asked my guides to find me the most optimal meditation for today. And I am so glad it was this one. It was such a peaceful, yet powerful meditation. It was ideal. Thank you so much. 💚💚💚💚💚💚💚💚",
    "15 minutes is all it takes to elevate my vibration even a little bit. Thank you for this wonderful meditation! 🧘 ❤🙏"
  ],
  "channelSubscriberCount": 1290000,
  "channelVideoCount": 877
}