{
  "video_id": "zejHjXjhdiY",
  "title": "30-Minute Bodyweight Workout",
  "description": "No equipment, no problem! This all-bodyweight workout from Barry's trainer Taylor Walker will tone your muscles and leave you dripping sweat! \r\n\r\n\r\nPOPSUGAR Fitness offers fresh fitness tutorials, workouts, and exercises that will help you on your road to healthy living, weight loss, and stress relief. Check out Class FitSugar, our do-it-along-with-us real-time workout show hosted by Anna Renderer, who will inspire you to sweat alongside fitness experts and Hollywood’s hottest celebrity trainers. Class FitSugar regularly covers the most buzzed-about workout classes and trends, including the Victoria's Secret workout, Tabata, P90X, the Bar Method, and more.\r\n\r\nSubscribe to POPSUGAR Fitness!\r\nhttps://www.youtube.com/subscription_center?add_user=popsugartvfit\r\n\r\nLike us on Facebook!\r\nhttps://www.facebook.com/PopSugarFitness/\r\n\r\nCheck us out on Instagram!\r\nhttps://www.instagram.com/popsugarfitness/\r\n\r\nEat clean with POPSUGAR\r\nGet a full two-week clean-eating plan with our brand-new app! Seventy recipes for breakfast, lunch, dinner, snacks, and treats, as well as simple shopping lists and more! Get the app here: https://itunes.apple.com/us/app/clean-eating-plan-and-recipes/id1262482098?mt=8\r\n\r\nVisit POPSUGAR!\r\nhttps://www.popsugar.com/fitness/30-minute-cardio-toning-bodyweight-workout-46867717",
  "channelTitle": "PS Fit ",
  "channelDescription": "The brand you know and love as POPSUGAR is now PS, and our popular workout series (including Class Fitsugar, Dance Fitsugar, and Breathe Fitsugar) are now united under a single brand: PS Fit.\n\nPS has long dominated the fitness space as the No. 1 source for free at-home workouts on YouTube, and that’s not changing. We will continue to create workouts for every fitness level, including no-equipment exercises, HIIT workouts, yoga flows, and more. \n\nOn PS Fit, you’ll find videos ranging from five to 60 minutes in length. You can choose to exercise specific body parts and select the level of intensity that works for you. Maybe you want to combine your cardio with dance via a salsa, ’90s pop, or hip-hop workout. If you’re in the mood for stretching, yoga, or meditation, we’ve got you covered there, too. Whatever you choose, you can be confident that all of our workouts are designed and led by knowledgeable and credentialed experts.\n",
  "tags": [
    "POPSUGAR Fitness",
    "FitSugarTV",
    "workout class",
    "fitness",
    "fitness video",
    "10 minute workout",
    "bikini body",
    "work out",
    "class fitsugar"
  ],
  "publishedAt": "2019-12-22T17:00:15Z",
  "duration": 2097,
  "durationFormatted": "34:57",
  "viewCount": 3676282,
  "likeCount": 42778,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/zejHjXjhdiY/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/zejHjXjhdiY/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/zejHjXjhdiY/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/zejHjXjhdiY/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/zejHjXjhdiY/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/zejHjXjhdiY\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "It`s great to see the lady on the left doing the modified (easier) versions of some exercises for those who can`t do the &quot;standard&quot; one. Really appreciate it! Thank you",
    "She says at the end, &quot;You can do this workout anytime, anywhere!&quot; And I thought, &quot;as long as you&#39;re inside your own place if you&#39;re on virus lock down Day 6 like I am, but I get your point.&quot; Then they said they would be here for me... and I kinda got a warm fuzzy. For real. Thanks.",
    "I&#39;ve been so grateful for PopSugar this month as I stockpile some extra fitness time between gym workouts so that I can enjoy the holidays guilt-free. I did this workout today in my kitchen tonight, in my pajamas, while waiting for the royal icing to set on my sugar cookies. I love Taylor&#39;s efficient but effective workouts and I know I&#39;ll be feeling this a little in my legs tomorrow.",
    "I honestly have been too lazy to workout for the past few months. I just started to do popsugarfitness workout videos a couple of weeks ago and I feel great. I guess I just needed some motivation and believe in myself. my goal is to at least lose close to a hundred pounds by the end of 2020. I know I can do this and never give up on anything. I am just tired of being unfit.",
    "Great total body, arms, legs, abs and bit of cardio + strength mixed in- perfect for a 30minute workout. I also regularly rotate Taylor’s other cardio workout. I love how she uses the usual HIIT breaks fir active recovery abs. Keep the total body cardio, toning 30 minute workouts coming Anna :)"
  ],
  "channelSubscriberCount": 6500000,
  "channelVideoCount": 1928
}