{
  "video_id": "Zl_grb33STg",
  "title": "How To Burn More Calories Lifting Weights (Do These 3 Things)",
  "description": "One of the biggest differences between weight lifting vs cardio is that while lifting weights is great for building muscle, it’s not so great if you’re looking to burn calories. In this video, I’ll explain how that affects your ability to burn fat and build muscle, and then cover how to burn more calories by covering three tweaks that you can make during your lifting workouts. By the end, you’ll end up with a full body weight training workout that you can get started with right away to burn fat.\n\nExercise alone is not very effective at losing fat if your diet is not under control. But with a proper diet, adding the right type of exercise to it can significantly speed up your results. When comparing weight lifting vs cardio, while resistance training doesn’t burn many calories compared to cardio, it does have one important advantage over the latter. Doing cardio alone can lead to a small amount of muscle loss. \n\nThis is important to note because muscle is what will help keep your metabolism high as you lose weight and will ensure you end up looking lean and muscular rather than just “skinny” after a diet. This means that, if you’re looking to burn fat and build muscle in the most optimal manner possible, a combination of resistance training with cardio is best. I’ll show you exactly how to do this with three tweaks and then give you an example workout that puts it into practice. \n\nWhen it comes to how to burn more calories through weight lifting, the first tweak is with how much weight you’ll be lifting and how many reps you’ll be doing in your sets for each exercise. More specifically, research suggests that you can nearly double the number of calories you burn in a set by lifting lighter weights for more reps. However, although we can burn slightly more calories the lighter in weight we go, note that for the best muscle building results while still burning significantly more calories, a good recommendation is to use a weight that’s between 40-60% of the maximum weight you could lift for that exercise. For most people, this means choosing a weight that you could do around 15-30 reps with. Just remember, you still need to push yourself hard enough for this to be effective.\n\nTweak 2 to burn fat with weight training involves using the most muscle mass as possible within your workouts. Illustrating this is a 2017 study tested a variety of resistance training exercises and compared the calories burned. They compared several “isolation exercises” that only worked one small muscle at a time, to “compound exercises” that work several different muscles simultaneously. They found that lat pulldowns, which work several back muscles as well as the biceps, burned almost 20% more calories than bicep curls. Squats, which work the whole lower body, burn almost 35% more calories than leg extensions. We’ll apply this by filling our workout with big exercises that will work every single muscle of our body\n\nFinally, the most important thing you can do to burn more calories is improve your time efficiency. How? You can do so by making use of a circuit style of training. Using this method will enable us to add more exercises and sets into our workout without having to stay in the gym any longer than normal. But we will want to be careful with the exercise selection to ensure we don’t compromise our gains by overworking the same muscle groups with not enough rest. Alright now that we’ve got the science down, let’s apply it into a workout that can be done either at a gym or even at home with just dumbbells.\n\nThe workout includes 3 circuits that each have 4 exercises. Within each circuit you will progress from one exercise to the next resting for only 15-20 seconds. Pick a weight that you could do somewhere between 15-30 reps with if you pushed hard. If you reach above 30 reps, then you know it’s time to use a heavier weight. Finally, if you’re a beginner, perform each circuit 2-3 times, intermediate 3-4 times, and advanced 4-5 times. \n\nCircuit 1:\nDB Bench Press → DB Row →  DB Shoulder Press → Reverse Crunch  \n\nCircuit 2: Lower Body:\nGoblet Squat→ DB RDL → DB Calf Raise →  Weighted Crunch\n\nCircuit 3: Full Body:\nReverse Lunges → Push Up→ DB Facepulls → Plank\n\nYou’ll get the most benefit from this workout if you implement it no less than 2 but no more than 4 times a week. That said, I wouldn’t use this style of workout if your main goal is to build muscle and improve your strength. \n\nFor those looking for an all in one step-by-step program that’s personalized specifically for your body and your fitness goals, you can take the analysis quiz to discover which science-based program would be best for you and where your body is currently at below:\nhttps://builtwithscience.com/your-potential-realized/?utm_source=YouTube&utm_medium=Video&utm_campaign=How+To+Burn+More+Calories+Lifting+Weights+%28Do+These+3+Things%29&utm_term=03%2F10%2F2021\n\nSubscribe to my channel here:\nhttps://www.youtube.com/jeremyethier/?sub_confirmation=1",
  "channelTitle": "Jeremy Ethier",
  "channelDescription": "This channel is focused on providing science-backed training and nutritional videos in order to help you become the best version of yourself. I'm certified by NASM and FMS (functional movement screening), and a Kinesiology graduate based in Vancouver, Canada. I focus on providing unbiased information to help you optimize your training and nutrition.",
  "tags": [
    "how to burn calories",
    "how to burn fat",
    "fat loss workouts",
    "burn fat with weight training",
    "weight",
    "lifting vs cardio",
    "lose weight without cardio",
    "how to burn more calories",
    "burn calories",
    "workout to lose weight",
    "circuit workout",
    "cardio vs weight training",
    "burn fat and build muscle",
    "builtwithscience",
    "jeremyethier",
    "how to lose fat and build muscle",
    "fat burning exercises",
    "calorie burning exercises"
  ],
  "publishedAt": "2021-10-03T16:02:27Z",
  "duration": 645,
  "durationFormatted": "10:45",
  "viewCount": 2360820,
  "likeCount": 60228,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Zl_grb33STg/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Zl_grb33STg/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Zl_grb33STg/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Zl_grb33STg/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Zl_grb33STg/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Zl_grb33STg\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Hope you enjoyed this one! As mentioned in the video, these methods are not ideal if you&#39;d like to prioritize building muscle and strength. But for those who are up for a challenge and looking for a way to burn more calories within their weights workouts without sacrificing gains, give this a shot! Here&#39;s a link to the full article and workout we covered: <a href=\"https://builtwithscience.com/burn-more-calories-lifting/\">https://builtwithscience.com/burn-more-calories-lifting/</a>",
    "1. Lighter weights, more reps<br>2. Work out multiple muscle groups at once<br>3. Take shorter breaks between workouts",
    "do this 2-4 times a week<br>Circuit 1:<br><br>DB Bench Press  <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=423\">7:03</a><br>DB Row  <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=440\">7:20</a> <br>DB Shoulder Press <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=449\">7:29</a><br>Reverse Crunch  <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=461\">7:41</a><br><br>- Rest 15-20 sec <br>- 3-4 sets<br>- 15-20 reps<br><br>Circuit 2: Lower Body:<br><br>Goblet Squat <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=483\">8:03</a><br>DB RDL  <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=502\">8:22</a><br>DB Calf Raise  <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=514\">8:34</a><br>Weighted Crunch <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=527\">8:47</a><br><br>- Rest 15-20 sec<br>- 3-4 sets<br>- 15-20 reps<br><br>Circuit 3: Full Body:<br><br>Reverse Lunges <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=552\">9:12</a><br>Push Up <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=560\">9:20</a><br>DB Facepulls <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=578\">9:38</a><br>Plank <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=588\">9:48</a><br><br>- Rest 15-20 sec<br>- 3-4 sets<br>- 15-20 reps",
    "How to burn more calories lifting: take 2-3 minutes rest between sets and walk around the gym (or on the treadmill) during that time; this easily adds 3-400 steps to your daily total",
    "Tweaks to increase calorie burn:<br>1) Less weight, more reps <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=158\">2:38</a><br>Train near failure, 40-60% of max<br>2) Increase muscle mass used <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=246\">4:06</a><br>Compound exercices instead of isolation exercises<br>3) Implement circuits <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=295\">4:55</a><br>Time efficiency. Train separate muscles with shorter breaks<br>The Workout: <a href=\"https://www.youtube.com/watch?v=Zl_grb33STg&amp;t=385\">6:25</a>"
  ],
  "channelSubscriberCount": 7100000,
  "channelVideoCount": 301
}