{
  "video_id": "Zlwk82OM9Us",
  "title": "Stretching Exercises for Bedtime - Relaxing Routine before Sleep or Anytime to Feel Better",
  "description": "The best way to end a long day is with bedtime stretches. Whether you are felling sore or didn’t get a chance to workout you will feel relaxed and rejuvenated after these exercises.\n\nThese stretches will feel great anytime of day, but are formulated for and especially effective in promoting restful sleep.  \n\nPut on your pajamas and join me on the mat, a soft rug, or even your bed. \n\nThank you for working out with me. \n\nGoodnight and sleep tight 😴 \n\nProducts and I use and recommend can be found here:\nhttps://www.amazon.com/shop/seniorshapefitness\nas an Amazon associate/influencer I earn from qualifying purchases \n\nJoin SeniorShape on Facebook:\nhttps://www.facebook.com/SeniorShapefitness/",
  "channelTitle": "SeniorShape Fitness",
  "channelDescription": "Hello and welcome to SeniorShape with Lauren! I’m thrilled you have found my channel! I am an ACE (American Council on Exercise) certified fitness instructor. I also hold a specialization in senior fitness. \nIt is my passion to create fun, new exercises and routines that are never boring. \nMy videos are easy to follow and the exercises featured are specifically curated for beginners, and active older adults. The workouts are challenging and at a great pace that works well for anyone. \nPlease subscribe so you never miss a new workout.\n\nEquipment I use or recommend can be purchased on my Amazon store page www.amazon.com/shop/seniorshapefitness\n*as an Amazon associate/influencer I earn from qualifying purchases\n\nFor those who have graciously asked to donate so I can continue to provide free videos can contribute through \nVenmo: @SeniorShape\nI appreciate your support!\n\nThanks for working out with me!\nLauren\n\n",
  "tags": [
    "Senior shape with lauren",
    "Beginners",
    "Stretch",
    "Stretching exercises",
    "Better sleep",
    "Relaxing stretches",
    "Stretches to do before bed",
    "Stretching workout",
    "YouTube",
    "Video",
    "Best",
    "Free",
    "Stretches for women",
    "Flexibility",
    "Stretches for flexibility",
    "Stretches for seniors",
    "Stretching in bed",
    "low impact",
    "beginner stretches",
    "senior shape fitness",
    "easy stretching routine",
    "post workout stretches",
    "stretching workout",
    "home workout",
    "stretching exercies",
    "pilates stretches",
    "stretches for better sleep"
  ],
  "publishedAt": "2021-03-15T10:34:01Z",
  "duration": 793,
  "durationFormatted": "13:13",
  "viewCount": 288982,
  "likeCount": 5755,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/Zlwk82OM9Us/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/Zlwk82OM9Us/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/Zlwk82OM9Us/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/Zlwk82OM9Us/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/Zlwk82OM9Us/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/Zlwk82OM9Us\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Nice ! I have waited all day to do this stretch and it accomplished exactly what it was meant to do... stress release and feeling relaxed !!! Thank you again for a great video !!!",
    "the music you chose for this video is just delightful",
    "I love this one.   I keep coming back to it when I’m tired.",
    "Lauren, I want to tell you a little story. I was recently visiting my 8-year-old granddaughter in California. Her parents are going through a divorce and things have been a little topsy turvy for her, alternating one week with Dad and one week with Mom. At bedtime my son had been letting her do some rough housing thinking it was a way for her to burn off some energy, but , of course, it had just the opposite effect. I suggested we all do your bedtime stretches instead. Well it calmed her down and she was able to go to bed without the usual hoopla. They have continued to do these stretches every night and bedtime has become a pleasure rather than a chore. So even though your channel is “Senior Shape” this video at least has brought some calm to a little girl and her dad during an otherwise stressful situation. You are so appreciated. ❤",
    "My kids (son, 7 and daughter, 11) have been joining me for this stretch routine lately. We do it at bedtime and love how relaxing it is. Thank you so much!"
  ],
  "channelSubscriberCount": 599000,
  "channelVideoCount": 290
}