{
  "video_id": "zr08J6wB53Y",
  "title": "10 MIN HIGH INTENSITY WORKOUT - burn lots of calories, HIIT / No Equipment I Pamela Reif",
  "description": ".. ready for a KILLER routine? on a positive note: it's only 10 minutes & the music is amazing! ♥︎ / Werbung\n\nI know, we have a love-hate relationship to my 15min HIIT workout. Me too, I admit that. \nA 10min routine was definitely missing on my channel! Still a killer, still burning lots of calories, still breaking a sweat.. but: it's only 10 minutes :D \n\nThis workout is:\n1. FILLED WITH BASICS. \nNothing too fancy, nothing too dancy. Ask your male partner to join! They won't need to shake their hips for this one.\n2. a mix out of \"QUICK MOVEMENTS\" and \"ACTIVE BREAKS\".  \nYou will find Dolphin Holds & Planks in between all the quick movements. Almost feels like a break, but don't forget to keep the core strength :D\n3. HIGH ENERGY. \nFor some reason it doesn't drag me down - but rather gives me MORE energy! Might also be the music though.\n\nby the way: NO LUNGES. \n\n__\n\nIf you struggle or need a break: don't worry about it. Take a small rest, get something to drink & continue once you're ready :) most important is that you don't quit and push yourself. \n\n▸ Depending on your fitness level, height and weight you will burn between 70-130 kcal. \nI burned about 80kcal in those 10min (which is a lot for me, I'm a small human and I normally burn about 250kcal in a 1h session). \n\n__\n\n▸ you can find FREE WORKOUT PLANS on my Instagram Channel. 30min, 45min and Beginner Friendly combinations. Check out the Highlight Bubble \"Workout Plans\" for that.  \n\n➞ Instagram http://www.instagram.com/pamela_rf/\n\n▸ use #PamelaReif if you want me to see your workout pics and videos! \n\n__\n \nI update my workout playlist weekly & it's available on Spotify, Apple Music, etc. ♥︎\nhttp://wmg.click/GetActive\n\n1. Jason Derulo - Take You Dancing 0:00 - 3:07 \n2. Hyperclap - Cry for you 3:08 - 5:31\n3. Wave Wave (feat. Joel Crouse) - Broke (Alle Farben Remix) 5:32 - 8:25 \n4. Robin Schulz - Alane (Yves V Remix) 8:26 - 10:45\n\n__\n\n➞ Instagram http://www.instagram.com/pamela_rf/\n➞ Food Account http://www.instagram.com/pamgoesnuts/\n__\n\nBusiness Contact:\npamela_reif@icloud.com\n\n__\nunterstützt durch Warner Music Germany\n\nDisclaimer:\nWhen joining me for this workout video, you need to take some precautions as your health and safety is the most important. To avoid any injury or harm, you need to check your health with your doctor before exercising. By performing any fitness exercises without supervision like with this video, you are performing them at your own risk. See a fitness professional to give you advice on your exercise form. Pamela Reif will not be responsible or liable for any injury or harm you sustain as a result of this video.",
  "channelTitle": "Pamela Reif",
  "channelDescription": "Super happy to be your online training buddy! \n♡ free fitness videos in real time \n♡ free workout schedules every 2nd Sunday on my Instagram (pamela_rf). \nDifferent versions: Lose Weight, 30min per day, etc. \n♡ 12 different workout plans in my Pam App: https://www.pam-app.de/app\n♡ have a look at the YouTube Playlists to filter the workouts depending on your level!  \n\nall links / Impressum:\nwww.pamelareif.com\n",
  "tags": [
    "workout",
    "training",
    "abs",
    "sickpack",
    "flat",
    "tummy",
    "stomach",
    "exercise",
    "how to get",
    "home workout",
    "no equipment",
    "sport",
    "body fat",
    "get thin",
    "lose weight",
    "fit",
    "healthy",
    "strong",
    "instagram",
    "keine gewichte",
    "no weight",
    "körpergewicht",
    "pamela rf",
    "muscle",
    "madfit",
    "bauchmuskeln",
    "maddie lymburner",
    "song",
    "good mood",
    "happy",
    "fun",
    "bikini",
    "summer",
    "last minute",
    "Chloe ting",
    "quarantine",
    "dancing",
    "cardio",
    "sweat",
    "butt",
    "booty",
    "burn calories",
    "music",
    "hip",
    "marshall",
    "gute laune",
    "choreo",
    "hiit",
    "high intensity",
    "burn",
    "fat",
    "calorie",
    "fitnessblender",
    "shred"
  ],
  "publishedAt": "2020-08-19T04:30:02Z",
  "duration": 646,
  "durationFormatted": "10:46",
  "viewCount": 27802005,
  "likeCount": 326389,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/zr08J6wB53Y/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/zr08J6wB53Y/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/zr08J6wB53Y/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/zr08J6wB53Y/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/zr08J6wB53Y/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/zr08J6wB53Y\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "my hair was ruined &amp; my face was sweating in the end 😅<br>you&#39;re only allowed to see this if you DO the workout ☝🏼.. don&#39;t you dare to just fast forward haha.",
    "To anyone who wants to quit because it’s too hard: Pamela has been working out for almost ten years, so it’s normal she can handle this perfectly fine. You are greatly motivated and it’s amazing that you actually are doing the workout. You need breaks ? Take them. It’s your pace. You’ll improve with time:) and think about how proud you will be after this ! always stay positive and never forget that doing Pamela Reif’s workouts IS hard but YOU are doing it ;)",
    "the people in the comments makes me feel like I&#39;m working out with funny and supportive friends and I stan that",
    "I&#39;m severly overweight and tried this out for the first time. After around 5 minutes I started crying because I knew I couldn&#39;t finish it. But I&#39;ll try again tomorrow and the day after tomorrow and so on... And I&#39;m sure that one day I&#39;ll be able to do this workout from start to finish without any breaks 💪🏻",
    "If you ever feel like you aren’t doing enough just remember, you doing even just 5 minutes is better than just sitting on the couch doing nothing. Never pressure your self or overwork your self! ❤❤❤❤❤"
  ],
  "channelSubscriberCount": 10400000,
  "channelVideoCount": 290
}