{
  "video_id": "ZrNXcyoy8-w",
  "title": "Full Body Total Beginner Workout",
  "description": "Jumpstart your fitness journey with this full-body workout designed specifically for total beginners! Get ready to boost your confidence and build a solid foundation with easy-to-follow moves that work every major muscle group. Perfect for anyone new to exercise, this workout will help improve strength, flexibility, and endurance without the need for equipment. Start today and feel empowered to reach your fitness goals one step at a time!\n\nyou can support my channel and get workout challenges ad free + monthly calendars here: https://growwithjo.com\n_______\n\nGENERAL INQUIRY EMAIL → support@growwithjo.ca\nPARTNERSHIPS EMAIL → mgmt@growwithjo.ca\n\n_______\nDISCLAIMER:\nAll information provided by growwithjo is of a general nature and is furnished only for educational/entertainment purposes only. No information is to be taken as medical or other health advice pertaining to any individual specific health or medical condition. You agree that use of this information is at your own risk and hold growwithjo harmless from any and all losses, liabilities, injuries or damages resulting from any and all claims.",
  "channelTitle": "growwithjo",
  "channelDescription": "FREE Fun Fitness, Perfect for #Beginners \nthe growwithjo community is the strongest and fastest growing community of women from all abilities and #walks of life\nI've been making people sweat and see their own transformations ever since I was a personal trainer doing 1-on-1 coaching at a local gym 8 years ago. \n\nNow I have the honor of teaching millions of women, and helping them achieve their goals!\nWe all have challenges that we face, but together, as a community we can overcome and make the best out of every obstacle.\nHere are some things you can expect from this channel:\n\n-easy to follow fun workouts(that fly by!!)\n-walking workouts to get your steps in\n-monthly schedules to follow (uploaded in the community tab every month)\n-getting consistent will get you amazing results!\n\nI'm here to keep you motivated and make working out something you look forward to again\nHit subscribe, turn on notifications and LETS GO BABE!\n",
  "tags": [
    "growwithjo",
    "beginner",
    "beginner workouts",
    "walking workouts",
    "all standing workouts",
    "all standing",
    "low impact",
    "low impact workouts",
    "women beginner workout",
    "abs",
    "workouts",
    "fit",
    "fitness journey",
    "transformation",
    "grow with jo",
    "total beginner",
    "bodyweight workout",
    "beginner workout",
    "bodyweight",
    "easy fitness",
    "start again workout",
    "first workout back",
    "20 minutes workout",
    "home workout 20 mins",
    "20 minutes",
    "weight loss workout",
    "guided beginner workout",
    "growwithjo beginner",
    "grow with jo beginner"
  ],
  "publishedAt": "2024-10-28T15:00:11Z",
  "duration": 1198,
  "durationFormatted": "19:58",
  "viewCount": 1559657,
  "likeCount": 39941,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ZrNXcyoy8-w/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ZrNXcyoy8-w/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ZrNXcyoy8-w/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ZrNXcyoy8-w/sddefault.jpg",
      "width": 640,
      "height": 480
    },
    "maxres": {
      "url": "https://i.ytimg.com/vi/ZrNXcyoy8-w/maxresdefault.jpg",
      "width": 1280,
      "height": 720
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ZrNXcyoy8-w\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "Ready to make a real change? This isn’t just a workout—it’s the first step in transforming your life!  With this beginner workout, you’re building a foundation that leads to lasting results, but here’s the secret: consistency is KEY. If you’re actually serious about reaching your goals and staying on track, don’t miss out on the motivating notifications, support, and structure available in GWJ Home. Imagine yourself stronger, more confident, and finally in control of your fitness journey! 🚀 Sign up now, and let’s make sure this is the start you don’t quit on! 💪 Tap the link and commit to the best version of you—don’t let this be the opportunity you look back on and wish you’d taken. <a href=\"https://growwithjo.com/\">https://growwithjo.com</a>",
    "To anybody new to GWJ, I promise it works if you’re consistent. I found her over 2 years ago and never went to a gym and lost 100lbs. I usually do more intense videos now but I’m feeling cruddy and needed a pick me up. This was perfect. And remember, if you can only do 5 minutes or 10. That is fine. Just do 6 minutes the next day and 7 the next. It’s a marathon not a sprint. Make it fun not a chore!",
    "Not me tearing up at the end of this video. It was my first time working out this long in YEARS! I promised myself that this year was going to be the year of change and its already nearly November and i havent done anything. <br><br>Thank you Jo, you really are helping me not go back on my promise to myself.",
    "I dont know if you will see my comment, Im a 30year old single female who has never worked out a day in my life, I wanted to give up so many times throughout this workout but you kept me motivated and I&#39;m glad I stayed, I had a big breakdown at the end when you said you will be with us, you have no idea how much I needed that. Im glad I completed this today, I have subscribed and will tune in everyday from South Africa, thank you for this &lt;3",
    "Everytime I do Jo’s workouts I say to myself “she’s doing God’s work”. So positive, so motivating, so humble, so sweet… I could go on &amp; on. Thank you for finding your purpose Jo🙏❤️"
  ],
  "channelSubscriberCount": 7190000,
  "channelVideoCount": 454
}