{
  "video_id": "ZToicYcHIOU",
  "title": "Daily Calm | 10 Minute Mindfulness Meditation | Be Present",
  "description": "Try Calm for 14 days free: https://www.calm.com/signup-flow?utm_content=blog_ft-sf\n\nTamara Levitt guides this 10 minute Daily Calm mindfulness meditation to powerfully restore and re-connect with the present.",
  "channelTitle": "Calm",
  "channelDescription": "Our mission is to make the world healthier and happier through the super power of calm. \n\nThere are lots of benefits to meditation, such as decreasing anxiety, worry and stress.\n\nIt enhances self-awareness, self-acceptance and patience. And it strengthens our resilience amidst uncertainty and adversity. Who wouldn’t benefit from a little bit of that?\n \nCalm is all about mindfulness, the practice of paying attention to our thoughts, emotions and experiences without judgement.\n\nWhen we’re able to maintain moment-to-moment awareness, we can make the choices that best serve us in life. If you’re like us, you were drawn to mindfulness and meditation to live a happier, more peaceful, authentic life.",
  "tags": [
    "meditation",
    "inner peace",
    "Calm",
    "Relaxation",
    "Guided meditation",
    "Breathing",
    "silence",
    "stillness",
    "peace",
    "happiness",
    "meditate",
    "mindfulness",
    "MBSR",
    "mindful"
  ],
  "publishedAt": "2016-10-12T22:32:12Z",
  "duration": 630,
  "durationFormatted": "10:30",
  "viewCount": 27089246,
  "likeCount": 293891,
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/ZToicYcHIOU/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/ZToicYcHIOU/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/ZToicYcHIOU/hqdefault.jpg",
      "width": 480,
      "height": 360
    },
    "standard": {
      "url": "https://i.ytimg.com/vi/ZToicYcHIOU/sddefault.jpg",
      "width": 640,
      "height": 480
    }
  },
  "embedHtml": "<iframe width=\"480\" height=\"270\" src=\"//www.youtube.com/embed/ZToicYcHIOU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
  "comments": [
    "To everyone that&#39;s meditating regularly in their life: thank you for making the world a better place",
    "I like that she stops talking for a few minutes in places so you can actually meditate and be mindful.",
    "Hey stranger on the internet, I hope your days been going well. I know you&#39;re probably going through a lot but I hope you are smiling and laughing more than crying. If youre feeling sad or anxious, take a moment to breath, and do something that makes you relaxed or happy or be with someone you love. If you want to be alone, that&#39;s okay too. But remember that there are 13 million others whom have watched this meditation video and we&#39;re all here if you need some help. May whoever&#39;s reading this all find happiness and love in their lives &lt;3",
    "Reading all these comments feels like walking into a room and finding a big supportive family y’all🥹🥹🫶🏻 thank you so much 🧡😭",
    "“When things change inside you, things change around you.” 😍"
  ],
  "channelSubscriberCount": 1130000,
  "channelVideoCount": 844
}