{
  "Charlie Farley_Southern Summertime (feat. Colt Ford & Daniel Lee)": {
    "genre": "Country Rap",
    "track bpm": 90,
    "lyrics summary": "The lyrics celebrate the joys of summer in the southern United States, including singing along to the radio, drinking cold beverages, and enjoying casual fun with friends outdoors.",
    "lyrics sentiment": "Positive because the lyrics express joy and celebration of summer activities.",
    "music energy": "Medium because the song has a steady rhythm and a lively vibe without being overly intense.",
    "music danceability": "Medium because the beat is steady and suitable for relaxed, casual dancing.",
    "valence": "High because the overall tone of the song is joyful and lighthearted.",
    "mode": "Major because the song has a bright and upbeat quality."
  },
  "Moccasin Creek_Country Boy Friday Night": {
    "genre": "Hip-Hop",
    "track bpm": 90,
    "lyrics summary": "The song describes an ideal Friday night spent in the countryside, emphasizing the joy and camaraderie of hanging out on back roads with friends, embracing a laid-back and carefree lifestyle typical of country living.",
    "lyrics sentiment": "Positive because the lyrics express enjoyment and celebration of country life and good times with friends.",
    "music energy": "Medium because the song likely has a steady, moderate rhythm typical of laid-back hip-hop with country influences.",
    "music danceability": "Medium because the song has a groove suitable for casual dancing, reflecting a hip-hop style combined with country themes.",
    "valence": "High because the lyrics and mood project an uplifting and joyful atmosphere focused on leisure and fun.",
    "mode": "Major because the key of the track is F Major, which typically conveys a bright and uplifting sound."
  },
  "I4NI_How We Roll (feat. The Lacs, Moonshine Bandits, Redneck Souljers, Bubba Sparxxx, Demun Jones & J Rosevelt)": {
    "genre": "Country Rap",
    "track bpm": "about 90",
    "lyrics summary": "The song 'How We Roll' features themes typical of country and Southern lifestyle, such as driving big trucks, Southern pride, camaraderie, and living proudly in a rural environment.",
    "lyrics sentiment": "Positive because the lyrics celebrate Southern pride, camaraderie, and an adventurous, carefree lifestyle.",
    "music energy": "High because of the upbeat tempo and lively, assertive delivery in the vocal performances.",
    "music danceability": "Medium because the beat is steady and prominent but tailored more for head-nodding and groove than dance.",
    "valence": "High because the tone is celebratory and the lyrics express joy and pride.",
    "mode": "Major because the song has a triumphant and confident mood, typical of major-key compositions."
  },
  "I4NI_Roll With Me (feat. Chris Hurt)": {
    "genre": "Southern Hip Hop",
    "track bpm": 120,
    "lyrics summary": "The lyrics describe a carefree, party-like approach to life, emphasizing living in the moment despite others' jealousy and criticism.",
    "lyrics sentiment": "Mixed because the lyrics convey enjoyment and confidence while acknowledging jealousy from others.",
    "music energy": "High because the track likely has a strong, upbeat tempo typical of Southern Hip Hop.",
    "music danceability": "High because the genre typically features strong rhythmic elements suitable for dancing.",
    "valence": "Medium because while the lyrics are about having fun, there is also an undertone of dealing with jealousy which adds complexity.",
    "mode": "Minor because the genre often uses darker chord progressions that create a gritty, intense atmosphere."
  },
  "Moonshine Bandits_We All Country (feat. Colt Ford, Sarah Ross & Charlie Farley)": {
    "genre": "Country Rap",
    "track bpm": 85,
    "lyrics summary": "The lyrics celebrate rural lifestyle and unity across different regions of the United States, emphasizing that regardless of whether one is from the east coast, west coast, south, or midwest, they all share a common country identity.",
    "lyrics sentiment": "Positive because the lyrics express a sense of pride and celebration of country culture and unity.",
    "music energy": "Medium because the song has a steady beat with rap verses that add dynamics without being overly intense.",
    "music danceability": "Medium because the beat is steady and the rhythm is easy to follow, making it suitable for casual dancing.",
    "valence": "High because the lyrics convey a positive and celebratory tone about country lifestyle.",
    "mode": "Major because the song's melody and overall tonality are bright and upbeat, reflecting the celebratory nature of the lyrics."
  }
}