{
  "Kyle Dixon & Michael Stein_This Isn't You": {
    "genre": "Soundtrack",
    "track bpm": 80,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics, it is an instrumental track.",
    "music energy": "Medium because the ambient soundtrack style has moderate intensity and dynamic range typical for setting a scene.",
    "music danceability": "Low because the music is intended as a soundtrack, not for dancing, with a focus on atmosphere over rhythm.",
    "valence": "Medium because the soundtrack likely provides emotional complexity without strong positive or negative cues.",
    "mode": "Major because the key is B Major, which typically imparts a bright and resolved tonal quality."
  },
  "Jamin Winans_Who You Were": {
    "genre": "Soundtrack",
    "track bpm": 130,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics and the song is purely instrumental.",
    "music energy": "High because the tempo is fast at 130 BPM, indicating a bright and intense feel.",
    "music danceability": "Medium because the fast tempo allows for danceability even though it is a soundtrack piece.",
    "valence": "Medium because instrumental tracks often convey a mix of emotions through musical dynamics and tone.",
    "mode": "Major because fast tempos and bright tonal qualities generally imply a major mode."
  },
  "Max Richter_Vladimir's Blues": {
    "genre": "Classical",
    "track bpm": 116,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the piece has no lyrics.",
    "music energy": "Low because it is a solo piano composition with a soft and gentle dynamic.",
    "music danceability": "Low because it is not rhythmically driven for dancing and has a 3/4 time signature.",
    "valence": "Low because the composition is described as melancholic and evocative.",
    "mode": "Major because the piece is in the A major key, which contributes to its tonal qualities."
  },
  "Kyle Dixon & Michael Stein_A Kiss": {
    "genre": "Synthwave",
    "track bpm": "about 90",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to express any sentiment.",
    "music energy": "Medium because the track likely has a steady synthetic rhythm typical of synthwave music.",
    "music danceability": "Medium because the track has clear rhythmic elements that encourage movement, typical of synthwave.",
    "valence": "Medium because the instrumental synthesizer sound is inspired by nostalgic but intense sci-fi themes.",
    "mode": "Minor because the chords used suggest a darker, introspective feel common in synthwave and soundtracks."
  },
  "Bon Vie_Broken Promises": {
    "genre": "Pop",
    "track bpm": 128,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Instrumental because there are no lyrics to analyze for sentiment.",
    "music energy": "High because the full tempo of the track is 128 BPM, which is fast-paced.",
    "music danceability": "High because the track reaches a full tempo of 128 BPM, providing a strong and consistent beat.",
    "valence": "Medium because while the chords suggest an upbeat feel, without lyrics the emotional content is balanced.",
    "mode": "Minor because the chords, including Cm and Fm, suggest a darker sound."
  }
}