{
  "Playboi Carti_EVIL J0RDAN": {
    "genre": "Trap",
    "track bpm": 154,
    "lyrics summary": "The lyrics of 'EVIL J0RDAN' by Playboi Carti explore themes of fame, identity, and the pressures of modern relationships, all set against a backdrop of recklessness and chaos. Carti paints a picture of an unpredictable lifestyle, where his public persona teeters on the edge of control.",
    "lyrics sentiment": "Mixed because while the lyrics express themes of identity and chaos in a potentially dark and dangerous lifestyle, there is also the element of boldness and freedom.",
    "music energy": "Low because despite the high tempo, the overall sound is described as having low energy, likely due to its atmospheric and synth-driven production.",
    "music danceability": "High because the track has a 4/4 time signature and is described as very danceable, with a strong trap rhythm and manic beats.",
    "valence": "Medium because although the song has melancholic undertones, the bold and reckless energy adds a layer of emotional complexity.",
    "mode": "Major because the track is in C♯/D♭ major which often conveys a brighter tonal quality despite the melancholic themes."
  },
  "Kendrick Lamar_tv off (feat. lefty gunplay)": {
    "genre": "Hip Hop",
    "track bpm": "about 90",
    "lyrics summary": "The song 'TV Off' explores themes of authenticity, street survival, skepticism towards fake people, societal critiques, and personal introspection. Kendrick Lamar uses metaphors such as turning off the television to symbolize a rejection of mindless consumption and a rallying cry for self-awareness and engagement with reality.",
    "lyrics sentiment": "Mixed because the lyrics express both critiques of society and a call for authenticity alongside a sense of personal reflection.",
    "music energy": "Medium because the track likely maintains a steady but intense delivery typical of Kendrick Lamar's style, emphasizing lyrical focus rather than aggressive instrumentation.",
    "music danceability": "Medium because while the beat likely has a consistent rhythm suitable for head-nodding, it isn't overpowering, focusing more on lyrical delivery.",
    "valence": "Medium because the lyrics are contemplative and socially critical, which often accompanies a complex emotional background.",
    "mode": "Minor because the themes and introspective nature of the lyrics suggest a moody and serious tone."
  },
  "Drake_IDGAF (feat. Yeat)": {
    "genre": "Trap",
    "track bpm": "about 140",
    "lyrics summary": "The lyrics express a nonchalant and defiant attitude towards critics, flaunting wealth and confidence while showing loyalty to their inner circle.",
    "lyrics sentiment": "Mixed because the lyrics have a confident, defiant tone but also portray a dismissive attitude.",
    "music energy": "High because the track uses a raucous bass-heavy production and glitch-y bass that create an intense sound.",
    "music danceability": "Medium because while the bass-heavy beats drive motion, the complexity might limit danceability slightly.",
    "valence": "Medium because the confidence and defiance are balanced with a nonchalant, dismissive tone.",
    "mode": "Minor because sci-fi synthesizers suggest a moody, unresolved tension in the melody."
  },
  "Tyga_Pop It Off": {
    "genre": "Hip Hop",
    "track bpm": 100,
    "lyrics summary": "The lyrics of 'Pop It Off' by Tyga and Lil Wayne revolve around themes of wealth, luxury, and indulgence, emphasizing a lifestyle where money and pleasure are central. The song repeatedly mentions 'popping it off,' suggesting a sense of explosive energy and excitement.",
    "lyrics sentiment": "Mixed because while the lyrics celebrate wealth and indulgence, they also contain elements of explicit language and bravado.",
    "music energy": "Medium because while the track is described as having average energy, it maintains excitement with its catchy beat and dynamic flow.",
    "music danceability": "High because the beat is very danceable with a strong 4/4 time signature that encourages movement.",
    "valence": "Medium because while the song is upbeat and indulgent, the explicit nature and boastful tone add complexity to the emotional landscape.",
    "mode": "Major because the song is in the C♯/D♭ major key, giving it a bright and assertive tonal quality."
  },
  "Future_Like That": {
    "genre": "Trap",
    "track bpm": 140,
    "lyrics summary": "The lyrics of 'Like That' focus on the lifestyle and ethos of street life and success in the hip-hop industry, with a bold declaration of living a life of extravagance and risk. Kendrick Lamar's verse includes confrontational lines targeting other artists, like Drake and J. Cole.",
    "lyrics sentiment": "Mixed because the lyrics express both confidence and confrontation, portraying a luxurious lifestyle while taking jabs at other artists.",
    "music energy": "High because the track has a fast tempo and intense delivery, typical of trap and hardcore hip-hop.",
    "music danceability": "Medium because while it has a strong beat typical for hip-hop, the focus on lyrical delivery might reduce its straightforward danceability.",
    "valence": "Medium because the lyrics and complex emotions mix bravado with confrontation, contrasting moods.",
    "mode": "Minor because the track and lyrical themes focus on darker, more aggressive content typical of minor modes."
  }
}