{
  "Kungs_This Girl (Kungs Vs. Cookin' On 3 Burners)": {
    "genre": "Electronic Dance",
    "track bpm": 120,
    "lyrics summary": "The song lyrically explores romantic themes, often focusing on feelings of infatuation and being deeply captivated by a special girl.",
    "lyrics sentiment": "Positive because the lyrics express romantic admiration and infatuation.",
    "music energy": "High because the track has an upbeat tempo and energetic electronic production.",
    "music danceability": "High because the remix features a strong, steady beat typical of dance music which encourages movement.",
    "valence": "High because the remix provides an uplifting and euphoric feeling through its vibrant sound.",
    "mode": "Major because the overall tone is bright and cheerful, typical of uplifting dance music."
  },
  "Bakermat_Baianá": {
    "genre": "Dance",
    "track bpm": 122,
    "lyrics summary": "The lyrics of 'Baianá' focus on themes of arrival and celebration, emphasizing unity and creating a welcoming atmosphere through repetitive phrases such as 'Good night, people, 'cause I arrived.'",
    "lyrics sentiment": "Positive because the lyrics emphasize a welcoming and celebratory atmosphere.",
    "music energy": "High because the track features pulsating beats and vibrant instrumentation typical of dance music.",
    "music danceability": "High because of the strong, consistent rhythm designed to make people move.",
    "valence": "High because the overall tone is uplifting and joyful, fitting the celebratory theme.",
    "mode": "Major because the music creates a bright and happy atmosphere typical of celebratory dance tracks."
  },
  "Masove_Mr. Saxobeat": {
    "genre": "Dance Pop",
    "track bpm": 120,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics.",
    "music energy": "High because the tempo is fast and the instrumentation is intense.",
    "music danceability": "High because the track features a strong, consistent beat ideal for dancing.",
    "valence": "Medium because although it's danceable and energetic, the minor mode could add a slightly darker tone.",
    "mode": "Minor because it is explicitly stated in the metadata and minor keys often add a moody or unresolved tonal quality."
  },
  "Riton_Friday (feat. Mufasa & Hypeman) - Dopamine Re-Edit": {
    "genre": "House",
    "track bpm": 124,
    "lyrics summary": "The lyrics describe anticipation for the weekend with a sense of excitement and eagerness to let loose and have fun once Friday arrives. It underscores living for the weekend and enjoying an endless wave of weekend activities.",
    "lyrics sentiment": "Positive because the lyrics express joy, anticipation, and excitement about having fun on the weekend.",
    "music energy": "High because the track is upbeat and lively, typical of house music designed to energize and engage listeners.",
    "music danceability": "High because the strong, consistent beat typical of house music invites dancing and movement.",
    "valence": "High because the upbeat tempo and joyful lyrics create a happy and uplifting mood.",
    "mode": "Major because the track carries a bright and upbeat tonal quality that is often associated with major keys."
  },
  "Kungs_Never Going Home": {
    "genre": "EDM",
    "track bpm": 122,
    "lyrics summary": "The lyrics of 'Never Going Home' celebrate the power of music and human connection. It invites listeners to embrace the moment and ride the wave of excitement and freedom.",
    "lyrics sentiment": "Positive because the lyrics express joy and the excitement of enjoying music and life.",
    "music energy": "High because the track has a fast tempo and exuberant instrumentation typical of a dance anthem.",
    "music danceability": "High because the track is designed with a strong, consistent beat that encourages dancing.",
    "valence": "High because the track is described as soul-lifting and joyful.",
    "mode": "Major because the track is composed in C Major, contributing to its bright and uplifting sound."
  }
}