{
  "Kesha_Raising Hell (feat. Big Freedia)": {
    "genre": "Pop",
    "track bpm": 126,
    "lyrics summary": "The song explores themes of self-expression, embracing one's flaws, and celebrating life's wild moments, portraying a message that enjoying oneself doesn't equate to being bad.",
    "lyrics sentiment": "Positive because the lyrics encourage self-expression and celebrate life with a sense of empowerment and rebellion.",
    "music energy": "High because the song is described as energetic and liberating, supporting a sense of rebellion and empowerment.",
    "music danceability": "High because the track features a strong beat and rhythm, encouraging movement and dance.",
    "valence": "High because the song promotes a positive message of freedom, empowerment, and celebration.",
    "mode": "Major because the track exudes a bright, empowering, and uplifting feel."
  },
  "Kesha_Raising Hell - Steve James Remix": {
    "genre": "Pop",
    "track bpm": "around 128",
    "lyrics summary": "The lyrics of 'Raising Hell' revolve around themes of self-expression, empowerment, and enjoying life boldly. It focuses on the rebellious act of embracing one's imperfections and living life to the fullest, encouraging listeners to challenge societal norms.",
    "lyrics sentiment": "Positive because the lyrics celebrate empowerment and embracing a carefree attitude towards life.",
    "music energy": "High because the remix by Steve James likely incorporates vigorous beats and dynamic instrumentation typical of energetic pop and dance tracks.",
    "music danceability": "High because the track features a strong beat and an engaging rhythm designed to make people move.",
    "valence": "High because the song's themes of empowerment and celebration contribute to an uplifting and joyful mood.",
    "mode": "Major because the song conveys an optimistic and triumphant tonal quality through its theme of empowerment and liberation."
  },
  "JAY-Z_Empire State Of Mind": {
    "genre": "Hip Hop",
    "track bpm": 88,
    "lyrics summary": "The lyrics of 'Empire State Of Mind' by JAY-Z celebrate the aspirations and struggles associated with New York City life, portraying the journey from Brooklyn's streets to achieving global stardom, and highlighting the city's cultural landscape.",
    "lyrics sentiment": "Mixed because the lyrics celebrate the vibrant culture and dreams associated with New York City, while also acknowledging the challenges and hardships faced by its residents.",
    "music energy": "High because the track features a powerful, driving beat and dynamic vocal delivery, particularly in the chorus with Alicia Keys.",
    "music danceability": "Medium because the song has a steady rhythmic beat that supports some dancing, but with a focus on lyrical content rather than big dance hooks.",
    "valence": "Medium because while the song has uplifting and hopeful themes, it also reflects on challenges and struggles, giving it a balanced emotional tone.",
    "mode": "Minor because the song has a reflective and somewhat introspective quality, typical of a minor key."
  },
  "JAY-Z_Numb / Encore": {
    "genre": "Rap Rock",
    "track bpm": "about 110",
    "lyrics summary": "The lyrics of 'Numb / Encore' express themes of feeling inadequate and seeking validation, a sentiment found in Linkin Park's 'Numb'. They are combined with Jay-Z's confident verses from 'Encore', where he commands attention and demands praise from an audience.",
    "lyrics sentiment": "Mixed because the lyrics juxtapose the self-doubt and longing for acceptance from 'Numb' with the celebratory and self-assured verses of 'Encore'.",
    "music energy": "High because the track combines the intense beats of hip-hop with the powerful instrumentation of rock.",
    "music danceability": "Medium because the tempo is steady and the mashing of genres provides a groove, but it's not primarily designed for dancing.",
    "valence": "Medium because the track blends the darker emotional tone of 'Numb' with the triumphant feel of 'Encore'.",
    "mode": "Minor because the overarching theme from 'Numb' gives the track a moody and introspective edge."
  },
  "Kanye West_POWER": {
    "genre": "Hip Hop",
    "track bpm": 120,
    "lyrics summary": "The song critiques the allure and corruption of power, exploring its intoxicating yet destructive nature and the effects it has on both individuals and society.",
    "lyrics sentiment": "Mixed because the lyrics focus on the intoxicating allure of power while also critiquing its destructive potential.",
    "music energy": "High because the beat is assertive and the production is intense.",
    "music danceability": "High because the beat is super catchy and has a strong rhythm that promotes movement.",
    "valence": "Medium because the song has both uplifting and dark elements, creating an emotionally complex tone.",
    "mode": "Minor because the song's themes and melody create a dark and introspective feel."
  }
}