{
  "USHER_Yeah! (feat. Lil Jon & Ludacris)": {
    "genre": "Crunk",
    "track bpm": 105,
    "lyrics summary": "The song captures the excitement of the club scene, with themes of attraction and the thrill of lust at first sight.",
    "lyrics sentiment": "Positive because the lyrics highlight excitement, attraction, and celebration in a party atmosphere.",
    "music energy": "High because the track has an intense and lively beat with aggressive instrumentation typical of crunk music.",
    "music danceability": "High because the song features strong, consistent beats designed to get people moving on the dance floor.",
    "valence": "High because the track conveys an upbeat, exciting, and joyful party vibe.",
    "mode": "Major because the song's crunk style and party atmosphere generally feel bright and triumphant."
  },
  "Black Eyed Peas_Boom Boom Pow": {
    "genre": "Electro-pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics focus on futuristic and technological imagery with much repetition around phrases like 'gotta get that' and 'boom boom boom'.",
    "lyrics sentiment": "Neutral because the lyrics are factual and playful, emphasizing repetitive futuristic themes without delving into deep emotional content.",
    "music energy": "High because the tempo is fast and the song uses intense, electronic instrumentation characteristic of electro-pop and hip-hop.",
    "music danceability": "High because the song has a strong, consistent beat and rhythmic emphasis that compels movement and dancing.",
    "valence": "Medium because although the song is energetic and rhythmic, it focuses on thematic imagery rather than conveying a strongly uplifting or dark mood.",
    "mode": "Major because the track is in the A major key, giving it a bright and resolved tonal quality."
  },
  "Rihanna_Don't Stop The Music": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "A party anthem where the singer encourages listeners to keep dancing and enjoying the music without interruption.",
    "lyrics sentiment": "Positive because the lyrics encourage continuous enjoyment and a festive atmosphere.",
    "music energy": "High because the tempo is fast and the track is intense, designed to energize listeners.",
    "music danceability": "High because the song has a steady, strong beat and rhythm, making it very suitable for dancing.",
    "valence": "High because the song is uplifting and encourages a party-like, joyous atmosphere.",
    "mode": "Minor because it is written in F♯ Minor, which gives a moody yet upbeat feel to the party atmosphere."
  },
  "Destiny's Child_Lose My Breath": {
    "genre": "R&B",
    "track bpm": 119,
    "lyrics summary": "The lyrics question whether romantic partners can keep up with the energy and effort the singers put into their relationships, serving as a challenge and empowerment anthem.",
    "lyrics sentiment": "Mixed because the lyrics convey a playful but challenging message about meeting expectations in relationships.",
    "music energy": "High because the track is intense and lively with a fast tempo and assertive beats.",
    "music danceability": "High because the strong and consistent beat is designed to make people dance.",
    "valence": "High because the track's overall tone is assertive and empowering, creating a positive and uplifting sound.",
    "mode": "Major because the song is in a major key, which supports its bright and empowering theme."
  },
  "Ciara_Goodies (feat. Petey Pablo)": {
    "genre": "R&B",
    "track bpm": 100,
    "lyrics summary": "The lyrics focus on themes of female empowerment, independence, and self-respect. A confident female persona asserts her unwillingness to compromise her values for superficial desires in romantic relationships.",
    "lyrics sentiment": "Positive because the lyrics express empowerment and self-respect.",
    "music energy": "Medium because the song has a steady beat and assertive lyrics.",
    "music danceability": "High because the rhythm is catchy and designed to make people move.",
    "valence": "High because the song delivers an empowering and self-assured message.",
    "mode": "Major because the tone is bright and assertive, supporting a positive message."
  }
}