{
  "070 Shake_Glitter": {
    "genre": "Hip Hop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics of 'Glitter' by 070 Shake explore themes of identity, self-discovery, and the challenges of finding meaning and purpose in life amidst the superficiality of fame and success.",
    "lyrics sentiment": "Mixed because while the song grapples with the struggles and superficialities of fame, it also contains introspection and hints of self-realization.",
    "music energy": "Medium because the introspective nature suggests a balanced dynamic range, neither too subdued nor overly intense.",
    "music danceability": "Medium because the beat is likely steady and groovy, typical of Hip Hop but not dominating enough for high danceability.",
    "valence": "Low because the themes explore the challenges and superficial nature of fame, creating a more melancholic tone.",
    "mode": "Minor because the introspective and self-reflective themes suggest a darker, more unresolved tonal quality."
  },
  "DeJ Loaf_Changes": {
    "genre": "Hip Hop",
    "track bpm": 102,
    "lyrics summary": "The song 'Changes' by DeJ Loaf discusses the artist's growth and transformation, noting how her ambitions have changed her relationships, particularly with old friends who couldn't keep up with her progress.",
    "lyrics sentiment": "Mixed because the lyrics reflect both ambition and the emotional challenges of changing relationships.",
    "music energy": "Medium because the shift to a combative rap style increases intensity, though it remains balanced.",
    "music danceability": "Medium because the steady beat at 102 BPM supports some groove but isn't predominantly dance-focused.",
    "valence": "Low because the lyrics and tone reflect introspection and challenging personal changes.",
    "mode": "Minor because the song's themes and tonal quality suggest a darker, unresolved feeling."
  },
  "Daye Jack_Finish Line": {
    "genre": "Hip Hop",
    "track bpm": 109,
    "lyrics summary": "The song 'Finish Line' by Daye Jack is a motivational anthem about self-affirmation, perseverance, and determination. It focuses on striving for success and overcoming obstacles.",
    "lyrics sentiment": "Positive because the lyrics express themes of self-affirmation and perseverance in achieving success.",
    "music energy": "Medium because the song maintains a steady and engaging tempo with a motivational tone.",
    "music danceability": "High because the track has a consistent beat and rhythm, making it suitable for dancing.",
    "valence": "Medium because the track balances motivational themes with a minor key, bringing a nuanced emotional depth.",
    "mode": "Minor because it is in the A♯/B♭ minor key, lending a more introspective and determined tone."
  },
  "Olivia Rodrigo_Can’t Catch Me Now - from The Hunger Games: The Ballad of Songbirds & Snakes": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics suggest a sense of elusive freedom, with imagery of nature and evasion as the protagonist claims they cannot be caught.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of freedom and evasion that feels both empowering and tinged with underlying urgency or escape.",
    "music energy": "Medium because Olivia Rodrigo's music typically balances intensity with a steady, dynamic range.",
    "music danceability": "Medium because the lyrics suggest a fluid, rhythmic quality likely reflected in the musical arrangement, suitable for light dancing.",
    "valence": "Medium because the lyrics evoke both uplifting elements of freedom and a more complex undertone of evasion.",
    "mode": "Major because the empowering and assertive theme of the lyrics suggests a bright, resolved tonal quality."
  },
  "ABLAZE_Can't Tell It All": {
    "genre": "Contemporary Gospel",
    "track bpm": 167,
    "lyrics summary": "The lyrics are a grateful expression of all the good things that have been bestowed upon the singer by a higher power, such as protection and provision, which they feel incapable of fully expressing due to the abundance.",
    "lyrics sentiment": "Positive because the lyrics express gratitude and acknowledge the goodness received from a higher power.",
    "music energy": "High because the track has a fast tempo and likely features powerful vocal delivery common in gospel music.",
    "music danceability": "Medium because while it has a strong rhythmic component typical of gospel, the focus may be more on vocal expression than dance beats.",
    "valence": "High because the tone is uplifting and joyful, celebrating the benevolence experienced by the singer.",
    "mode": "Major because the chords and overall message suggest a bright, positive feeling common in gospel music."
  }
}