{
  "Little Mix_Shout Out to My Ex": {
    "genre": "Pop",
    "track bpm": 126,
    "lyrics summary": "The song is an anthem of empowerment and resilience, addressing a past relationship where the ex-partner has moved on with someone else. It expresses hurt yet confidently claims to have moved past the relationship, emphasizing personal liberation and overcoming heartache.",
    "lyrics sentiment": "Positive because the lyrics focus on empowerment and moving forward from a past relationship, despite the initial hurt.",
    "music energy": "High because the song features a lively tempo and dynamic pop arrangement intended to energize and uplift.",
    "music danceability": "High because the track has a strong, consistent beat that encourages movement and dancing.",
    "valence": "High because the overall tone is uplifting and confident, celebrating personal growth and independence.",
    "mode": "Major because the song sounds bright and resolved, fitting its theme of empowerment."
  },
  "Ariana Grande_Break Free": {
    "genre": "Pop EDM",
    "track bpm": 130,
    "lyrics summary": "The song is about breaking free from past constraints and pursuing personal independence and empowerment.",
    "lyrics sentiment": "Positive because the lyrics focus on empowerment and breaking free from limitations.",
    "music energy": "High because the tempo is fast and the production is intense and dynamic.",
    "music danceability": "High because the track features a strong, consistent beat and rhythm that encourages dancing.",
    "valence": "High because the song sounds uplifting and triumphant, focusing on empowerment and freedom.",
    "mode": "Major because the song conveys a bright and empowering tone through its chord progressions."
  },
  "Justin Bieber_Never Say Never": {
    "genre": "Pop",
    "track bpm": 97,
    "lyrics summary": "The lyrics encourage persistence and overcoming challenges, serving as an uplifting anthem to never give up.",
    "lyrics sentiment": "Positive because the lyrics convey an optimistic message about resilience and persistence.",
    "music energy": "High because the track has a fast tempo and features intense, driving instrumentation.",
    "music danceability": "High because the rhythm is consistent and strong, suitable for dancing.",
    "valence": "High because the song's tone is uplifting and positive.",
    "mode": "Major because the track is in C major, giving it a bright and resolved sound."
  },
  "The True Blue_God Complex": {
    "genre": "Indie Pop/R&B",
    "track bpm": 148,
    "lyrics summary": "The lyrics explore themes of betrayal, heartbreak, and loss of trust in a friendship or relationship, expressing the narrator's pain after being let down by someone considered a best friend.",
    "lyrics sentiment": "Negative because the lyrics express feelings of betrayal and the pain of losing trust in a friendship.",
    "music energy": "Medium because the track likely has a steady dynamic range typical of indie pop and R&B music with emotional intensity.",
    "music danceability": "Medium because while the song has a clear rhythm and beat structure, it's not explicitly designed as a dance track.",
    "valence": "Low because the lyrical content is sad and melancholic, focusing on themes of betrayal.",
    "mode": "Minor because the song is in D Minor, which typically conveys a darker, more somber tone."
  },
  "Olivia Rodrigo_vampire": {
    "genre": "Pop",
    "track bpm": 137,
    "lyrics summary": "The central theme of 'vampire' by Olivia Rodrigo revolves around feelings of betrayal and emotional hurt, potentially from a close relationship that turned sour.",
    "lyrics sentiment": "Negative because the lyrics express feelings of betrayal and emotional pain.",
    "music energy": "Medium because although the tempo is fast, the emotion and instrumentation are moderate in intensity.",
    "music danceability": "Medium because it's somewhat danceable with a steady rhythm but not overwhelmingly so.",
    "valence": "Low because the overall mood of the song is described as sad.",
    "mode": "Minor because the song conveys a dark, unresolved emotional tone."
  }
}