{
  "Charli xcx_Von dutch a. g. cook remix featuring addison rae": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics depict a lifestyle full of fame and success, where Charli XCX and Addison Rae express their confidence and living lavishly. They portray interactions with fans, hint at rivalries inspired by their achievements, and talk about their constant presence in the public eye.",
    "lyrics sentiment": "Positive because the lyrics express confidence, fame, and a celebration of success.",
    "music energy": "High because the track likely has upbeat and dynamic instrumentation typical of pop remixes.",
    "music danceability": "High because pop remixes often have a strong, consistent beat designed for dancing.",
    "valence": "High because the tone of the track is celebratory and confident.",
    "mode": "Major because the lyrics and overall theme suggest a bright and triumphant mood."
  },
  "Megan Thee Stallion_Her": {
    "genre": "Hip House",
    "track bpm": 120,
    "lyrics summary": "Megan Thee Stallion raps boastfully about her pride as a woman, dismisses her haters, and celebrates her success, identity, sexual power, and financial achievements.",
    "lyrics sentiment": "Positive because the lyrics express pride, confidence, and celebratory success.",
    "music energy": "High because the track is described as high octane and fierce.",
    "music danceability": "High because the song has a consistent and upbeat tempo designed for dancing.",
    "valence": "High because the tone is upbeat and celebratory.",
    "mode": "Major because it is identified as having a major key and conveys a bright, confident tone."
  },
  "Beyoncé_I'M THAT GIRL": {
    "genre": "R&B",
    "track bpm": 105,
    "lyrics summary": "The song is a bold and empowering anthem where Beyoncé asserts her confidence and self-worth, stating that her identity is defined by her own strength and individuality, not by external factors.",
    "lyrics sentiment": "Positive because the lyrics express confidence, empowerment, and self-affirmation.",
    "music energy": "High because the track features a strong vocal delivery and dynamic production.",
    "music danceability": "High because it has a steady and pronounced beat suitable for dancing.",
    "valence": "High because the song conveys an empowering and uplifting message.",
    "mode": "Major because the song has a bright and triumphant tonal quality."
  },
  "The Pussycat Dolls_When I Grow Up": {
    "genre": "Pop",
    "track bpm": 130,
    "lyrics summary": "The song revolves around the theme of fame and the desire for recognition and success. The lyrics express a strong sense of ambition and the longing to be in the spotlight, emphasizing dreams of becoming famous, being a star, and achieving stardom.",
    "lyrics sentiment": "Positive because the lyrics express ambition and optimism towards achieving fame and success.",
    "music energy": "High because the track has a fast tempo and vibrant, upbeat instrumentation typical of energetic pop music.",
    "music danceability": "High because the track features a strong, consistent beat making it very suitable for dancing.",
    "valence": "Medium because while the song is upbeat and aspiring, the underlying theme of wanting more can be seen as both hopeful and somewhat yearning.",
    "mode": "Minor because the track is noted to be in a minor key, adding a slightly introspective or solemn tone beneath the energetic surface."
  },
  "Justin Timberlake_SexyBack (feat. Timbaland)": {
    "genre": "Pop",
    "track bpm": 117,
    "lyrics summary": "In 'SexyBack', Justin Timberlake expresses themes of seduction and confident allure, as he claims to be reviving a bold and sexy attitude. The lyrics depict him as a captivating figure, enticing a partner by embracing liberating and assertive behavior. He exudes charm and charisma, inviting listeners into a stylish and provocative atmosphere.",
    "lyrics sentiment": "Positive because the lyrics celebrate confidence and empowerment, expressing allure and appeal.",
    "music energy": "High because the track features a driving beat and dynamic production with energetic vocals.",
    "music danceability": "High because it has a strong, infectious beat that encourages movement and dancing.",
    "valence": "High because the song's production and lyrical content elicit feelings of excitement and positivity.",
    "mode": "Major because the song has an upbeat and triumphant sound, typical of major tonalities."
  }
}