{
  "Taylor Swift_I Forgot That You Existed": {
    "genre": "Pop",
    "track bpm": 96,
    "lyrics summary": "The song explores the theme of moving on and finding peace after a tumultuous relationship or experience, expressing liberation from emotional baggage associated with someone who has wronged the singer.",
    "lyrics sentiment": "Positive because the lyrics express liberation and personal growth by moving past hurt and achieving peace.",
    "music energy": "Medium because the song maintains a steady rhythm and a balanced dynamic range.",
    "music danceability": "Medium because the track has a steady and moderate groove suitable for casual dancing.",
    "valence": "High because the lyrics imply a sense of relief and freedom, and the overall tone is uplifting.",
    "mode": "Major because the song conveys a resolved and positive feeling, reflecting closure and new beginnings."
  },
  "Taylor Swift_The Man": {
    "genre": "Pop",
    "track bpm": "about 95",
    "lyrics summary": "The lyrics of 'The Man' by Taylor Swift explore themes of gender inequality and reflect on how Swift's career might be different if she were a man.",
    "lyrics sentiment": "Negative because the lyrics critique societal gender biases and the challenges faced by women.",
    "music energy": "Medium because the song has a strong vocal presence and a steady, driving beat.",
    "music danceability": "Medium because the beat is steady and groovable, though not overwhelmingly dance-focused.",
    "valence": "Medium because while the song addresses serious topics, its delivery is catchy and engaging.",
    "mode": "Major because it is written in C Major, lending a bright and resolved tonal quality to the track."
  },
  "Taylor Swift_Cruel Summer": {
    "genre": "Pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics of 'Cruel Summer' depict a passionate and tumultuous summer romance, full of yearning and emotional intensity.",
    "lyrics sentiment": "Mixed because the lyrics convey both the excitement and pain of a summer romance, indicating contrasting emotions.",
    "music energy": "High because the track features an upbeat tempo and intense production typical of energetic pop songs.",
    "music danceability": "High because the strong, rhythmic beat makes it suitable for dancing.",
    "valence": "Medium because while the song is upbeat and catchy, the lyrical themes of longing and complexity add emotional depth.",
    "mode": "Major because the overall melody and chord structure sound bright and uplifting despite the mixed emotional content."
  },
  "Taylor Swift_Miss Americana & The Heartbreak Prince": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song 'Miss Americana & The Heartbreak Prince' by Taylor Swift narrates a story set in the metaphorical halls of American high school, where personal challenges reflect broader political and social struggles. It explores themes of youthful disillusionment and defiance against a backdrop of national political change.",
    "lyrics sentiment": "Mixed because the lyrics portray youthful disillusionment and defiance, with both melancholic and hopeful undertones.",
    "music energy": "Medium because the song maintains a steady, balanced dynamic range typical of pop music.",
    "music danceability": "Medium because while the song has a steady rhythm, it focuses more on lyrical storytelling than a dance beat.",
    "valence": "Medium because the song carries a blend of melancholy and hopefulness, reflecting a complex emotional narrative.",
    "mode": "Minor because the overall tone and themes conveyed in the song are introspective and somewhat unresolved."
  },
  "Taylor Swift_Paper Rings": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics talk about a deep romantic commitment to a partner, valuing love over material wealth, and cherishing shared memories.",
    "lyrics sentiment": "Positive because the lyrics express joy, love, and commitment.",
    "music energy": "High because the song bursts with infectious energy and fervency.",
    "music danceability": "High because the pop genre and steady beat promote dancing.",
    "valence": "High because the tone is upbeat and filled with joy and love.",
    "mode": "Major because the melody and lyrics convey happiness and resolution."
  }
}