{
  "Taylor Swift_the 1": {
    "genre": "Indie Pop",
    "track bpm": 86,
    "lyrics summary": "The song reminisces about a lost love, wondering if things could have been different, and explores themes of nostalgia, regret, and the passage of time.",
    "lyrics sentiment": "Negative because the lyrics express regret and nostalgia over a lost relationship.",
    "music energy": "Medium because the song has a steady, reflective tempo that is neither too fast nor too slow.",
    "music danceability": "Medium because the rhythm is steady and suitable for casual listening or light dancing.",
    "valence": "Medium because the track has a bittersweet tone mixing nostalgia with regret.",
    "mode": "Major because despite the reflective themes, the melody maintains a bright, open quality."
  },
  "Houndmouth_Sedona": {
    "genre": "Indie Rock",
    "track bpm": 120,
    "lyrics summary": "The track 'Sedona' by Houndmouth explores themes of nostalgia, the rise and fall associated with Sedona, a symbolic fading dream and bygone era of Hollywood glamor. It captures the essence of lost opportunities, big dreams, and inevitable change.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of nostalgia and loss over passing opportunities and dreams, coupled with an appreciation for past glories.",
    "music energy": "Medium because the track combines a steady rhythm with a rich, sonorous melody typical of indie rock.",
    "music danceability": "Medium because the song has a rhythmic cadence suitable for light dancing with its rock-influenced beat.",
    "valence": "Medium because it reflects both somber reflections and the glimmer of past hopes and dreams, balancing melancholy with upliftment.",
    "mode": "Major because the melody and chord progressions convey a brighter, more resolved tonal quality despite the reflective lyrics."
  },
  "Lord Huron_She Lit a Fire": {
    "genre": "Folk Rock",
    "track bpm": 85,
    "lyrics summary": "The song portrays a deep and enduring love, focusing on a man’s determination and perseverance to find the beloved who ignited his passion.",
    "lyrics sentiment": "Positive because the lyrics express themes of love, determination, and hope in the face of separation.",
    "music energy": "High because it evokes strong emotions and intensity, as noted in the reviews describing it as poignant and beautiful.",
    "music danceability": "Medium because it is described as somewhat danceable with a steady rhythm, but the focus is more on emotional engagement rather than creating a strong dance beat.",
    "valence": "Medium because the emotional tone is complex, combining hopeful and longing elements with intensity and beauty.",
    "mode": "Major because the track is in the key of C major, typically associated with a bright and resolved sound."
  },
  "Hozier_Would That I": {
    "genre": "Folk Rock",
    "track bpm": "about 75-85",
    "lyrics summary": "The lyrics explore themes of love, loss, and transformation, using vivid natural imagery such as trees, fire, and ash to symbolize these cycles.",
    "lyrics sentiment": "Mixed because the lyrics juxtapose the joy and transformation of love with its inevitable loss and the resulting introspection.",
    "music energy": "Medium because the song has a balanced dynamic range with moderate intensity and emotional engagement.",
    "music danceability": "Medium because the rhythm provides a gentle groove suitable for light movement, but is not prominently dance-focused.",
    "valence": "Medium because the mixture of hopeful love and undertones of loss creates a complex emotional tone.",
    "mode": "Minor because the themes and metaphors used suggest a moody and introspective quality."
  },
  "Niall Horan_San Francisco": {
    "genre": "Pop",
    "track bpm": 136,
    "lyrics summary": "The lyrics of 'San Francisco' express a yearning to reconnect with someone significant, capturing feelings of longing and reflection on past mistakes.",
    "lyrics sentiment": "Mixed because the lyrics convey both longing and a desire for redemption, indicating a blend of regret and hope.",
    "music energy": "High because the tempo is brisk and supports the emotional intensity of the lyrics.",
    "music danceability": "Medium because while the beat is steady and upbeat, the lyrical content suggests a more emotional focus than pure danceability.",
    "valence": "Medium because the track captures a mix of hopeful and introspective tones, balancing emotional complexity.",
    "mode": "Major because despite the themes of reflection, the key of B♭ Major often corresponds to a brighter, more hopeful tonality."
  }
}