{
  "Fergie_Fergalicious": {
    "genre": "Pop",
    "track bpm": 129,
    "lyrics summary": "The lyrics of 'Fergalicious' by Fergie center around themes of self-empowerment and confidence, with playful and sassy declarations of independence and attractiveness. The song celebrates individuality and challenges traditional gender norms.",
    "lyrics sentiment": "Positive because the lyrics express confidence, empowerment, and playful self-affirmation.",
    "music energy": "Medium because although it has a lively and upbeat atmosphere, it maintains a steady tempo and balanced dynamics.",
    "music danceability": "High because the song features a catchy beat, infectious hooks, and a party-like vibe, making it highly suitable for dancing.",
    "valence": "High because the song has an upbeat and playful mood, conveying joy and self-assurance.",
    "mode": "Minor because it is noted to be in a G♯/A♭ minor key, despite its overall upbeat theme."
  },
  "Gwen Stefani_Hollaback Girl": {
    "genre": "Pop",
    "track bpm": 110,
    "lyrics summary": "The lyrics revolve around Gwen Stefani asserting her confidence by declaring that she is not a 'hollaback girl', using an assertive tone and spelling out the word 'bananas' in a catchy, repetitive manner.",
    "lyrics sentiment": "Positive because the lyrics express self-confidence and empowerment.",
    "music energy": "High because the song is fast-paced with exuberant vocals and strong instrumentation.",
    "music danceability": "High because it features a strong, consistent beat that is catchy and easy to dance to.",
    "valence": "Medium because while the song is energetic and catchy, the minor mode gives it a slightly edgy and assertive tone.",
    "mode": "Minor because the melody and chord progression are in a minor key, giving it a slightly dissonant and bold atmosphere."
  },
  "Black Eyed Peas_Imma Be": {
    "genre": "Pop",
    "track bpm": 92,
    "lyrics summary": "The song conveys themes of ambition, success, and self-confidence, celebrating a glamorous lifestyle with fame and fortune while emphasizing determination and a desire to leave a lasting legacy.",
    "lyrics sentiment": "Positive because the lyrics express ambition, self-confidence, and a celebration of success and glamour.",
    "music energy": "Medium because the song has average energy levels with a strong but not overly intense beat.",
    "music danceability": "Medium because the beat is steady and inviting, but not dominantly pushing for dancing.",
    "valence": "High because the tone is uplifting and celebratory, reflecting success and confidence.",
    "mode": "Major because the track is in a C major key, contributing to its uplifting and triumphant feel."
  },
  "Justin Timberlake_SexyBack (feat. Timbaland)": {
    "genre": "Pop",
    "track bpm": 117,
    "lyrics summary": "The lyrics of 'SexyBack' are about exuding confidence and appeal, inviting listeners to embrace their sexuality and enjoy the nightlife.",
    "lyrics sentiment": "Positive because the lyrics celebrate confidence and self-expression in a playful manner.",
    "music energy": "High because the track features a fast tempo with dynamic production.",
    "music danceability": "High because of the consistent, powerful beat and rhythmic vocal delivery designed to encourage dancing.",
    "valence": "High because the lyrics and upbeat rhythm create a fun and exciting atmosphere.",
    "mode": "Minor because despite the positive energy, the tonality sounds darker and more sensual, typical of a minor mode."
  },
  "Flo Rida_Low (feat. T-Pain)": {
    "genre": "Crunk",
    "track bpm": 128,
    "lyrics summary": "The lyrics celebrate nightlife and dancing at clubs, focusing on the impressive dance moves of a woman who gets 'low' on the dance floor.",
    "lyrics sentiment": "Positive because the lyrics express enjoyment and admiration for dance culture and nightlife.",
    "music energy": "High because the song features fast tempo and intense electronic production.",
    "music danceability": "High because the beat is consistent and designed for dancing in a club setting.",
    "valence": "High because the song is upbeat and creates a celebratory mood.",
    "mode": "Major because the melody and chord progressions have a bright and lively quality."
  }
}