{
  "Spice Girls_Wannabe": {
    "genre": "Pop",
    "track bpm": 110,
    "lyrics summary": "The lyrics of 'Wannabe' are about female empowerment, friendship, and the importance of loyalty between friends. The song expresses that if someone wants to be romantically involved with any of the Spice Girls, they must first understand the importance of the girls' friendship with each other.",
    "lyrics sentiment": "Positive because the lyrics emphasize fun, friendship, and empowerment.",
    "music energy": "High because the song has a lively tempo with dynamic vocals and bright instrumentation.",
    "music danceability": "High because the track has a catchy, upbeat rhythm that encourages dancing.",
    "valence": "High because the melody and lyrical themes are joyful and celebratory.",
    "mode": "Major because the song has an uplifting and cheerful tone."
  },
  "Christina Aguilera_Lady Marmalade - From \"Moulin Rouge\" Soundtrack": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The track is a modern rendition of the classic song 'Lady Marmalade,' significantly focusing on themes of female empowerment and allure.",
    "lyrics sentiment": "Positive because the lyrics celebrate confidence and empowerment, encapsulating themes of freedom and self-expression.",
    "music energy": "High because the track features a powerful vocal delivery and intense instrumentation typical of Christina Aguilera's style.",
    "music danceability": "High because the song features a strong and rhythmic beat suitable for dancing.",
    "valence": "High because the song's energy is exuberant and the lyrics project confidence.",
    "mode": "Major because the track's arrangement and melody are bright and uplifting, typical of pop anthems."
  },
  "blink-182_All The Small Things": {
    "genre": "Pop Punk",
    "track bpm": 108,
    "lyrics summary": "The lyrics of 'All The Small Things' by blink-182 focus on the small, meaningful details in a romantic relationship and the joy they bring. The song has an upbeat and catchy hook that expresses youthful love and the importance of appreciating little moments.",
    "lyrics sentiment": "Positive because the lyrics express joy and appreciation for the small, meaningful moments in a relationship.",
    "music energy": "High because the track features fast-paced tempos and dynamic guitar riffs typical of pop-punk music.",
    "music danceability": "High because the song has a strong and energetic beat with a rhythm that encourages movement.",
    "valence": "High because the tone is upbeat, lively, and joyful, reflecting themes of happiness and love.",
    "mode": "Major because the melody and chord structure are bright and resolved, typical of happy and uplifting songs."
  },
  "Ace of Base_All That She Wants": {
    "genre": "Pop",
    "track bpm": "about 94",
    "lyrics summary": "The song revolves around a woman who is unconcerned about commitment, seeking pleasure and material gain. It discusses her pursuit of a good time without the emotional attachments that typically accompany relationships.",
    "lyrics sentiment": "Mixed because the lyrics portray a sense of independence and freedom but also hint at a superficial, possibly lonely lifestyle.",
    "music energy": "Medium because the song has a steady beat and prominent but not overpowering instrumentation typical of pop tracks from the early '90s.",
    "music danceability": "High because it features a strong, consistent beat suitable for dancing.",
    "valence": "Medium because the music sounds upbeat and catchy, yet the lyrics suggest a deeper, somewhat detached meaning.",
    "mode": "Minor because the song has a slightly brooding and mysterious tone, typical for minor key songs."
  },
  "Sixpence None The Richer_Kiss Me": {
    "genre": "Alternative Rock",
    "track bpm": "about 100",
    "lyrics summary": "The lyrics describe focusing on positivity and appreciating love, even in the face of setbacks and challenges.",
    "lyrics sentiment": "Positive because the lyrics emphasize love and appreciation despite adversity.",
    "music energy": "Medium because the track balances a steady rhythm with accessible melody.",
    "music danceability": "Medium because the beat is steady and conducive to light movement.",
    "valence": "High because the song's message is uplifting and focuses on positivity and love.",
    "mode": "Major because the melody conveys a bright and optimistic feel."
  }
}