{
  "Jon Hopkins_Inner Peace": {
    "genre": "Ambient",
    "track bpm": 150,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because it is an instrumental track with no lyrics.",
    "music energy": "Medium because the tempo is high but the ambient nature suggests balanced intensity.",
    "music danceability": "Medium because the consistent beats and tempo of 150 BPM suggest a groove, though ambient elements may make it less pronounced.",
    "valence": "Medium because the ambient nature likely conveys a mix of moods without distinct emotional extremes.",
    "mode": "Major because the chords E, A, C#m, B suggest a more joyful and resolved harmonic progression."
  },
  "Anna B May_Solitude": {
    "genre": "Ambient",
    "track bpm": 170,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental with no explicit lyrical content.",
    "music energy": "Medium because it maintains a steady beat with increasing intensity but has ambient characteristics.",
    "music danceability": "Medium because the steady beat allows for moderate danceability despite its ambient nature.",
    "valence": "Medium because the ethereal atmosphere creates a balanced emotional tone that is not overly positive or negative.",
    "mode": "Minor because it is in D# min which contributes to its introspective and dreamlike quality."
  },
  "Sol Rising_Ignite the Light": {
    "genre": "World Devotional",
    "track bpm": 140,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "Low because the track is described as having low energy despite a higher tempo, suggesting minimal intense instrumentation.",
    "music danceability": "Medium because it is somewhat danceable with a steady beat but not prominently rhythmic.",
    "valence": "Medium because the track is described as melancholic yet in a major key, indicating a mix of emotions.",
    "mode": "Major because the track is specified to be in a major mode with key of D."
  },
  "Ritzen Town_Repose": {
    "genre": "Ambient",
    "track bpm": 59,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and has no lyrical content to convey emotions.",
    "music energy": "Low because the tempo is slow and it's labeled as a relaxing version, indicating minimal instrumentation.",
    "music danceability": "Low because a 59 BPM tempo is very slow and not suitable for dancing, aligning with a relaxing yoga music style.",
    "valence": "Low because the track is in a minor key and intended for relaxation, suggesting a calming, introspective mood.",
    "mode": "Minor because the track is explicitly stated to be in G Minor, reflecting a moody and introspective tone."
  },
  "Ritzen Town_Malasana": {
    "genre": "Electronic",
    "track bpm": 140,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any emotion.",
    "music energy": "High because the tempo is fast at 140 BPM and is described as suitable for jogging or cycling.",
    "music danceability": "Medium because while the tempo is high, it depends on the rhythmic structure which isn't fully described.",
    "valence": "Medium because the track is instrumental and the mood is not explicitly stated, suggesting a balanced emotional feel.",
    "mode": "Major because the track is described with an Allegro (fast, quick, bright) tempo, indicating a brighter tonal quality."
  }
}