{
  "dragongirl_chopping mall": {
    "genre": "EDM",
    "track bpm": "about 128",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is described as an 'Original Mix' typically indicating it's instrumental.",
    "music energy": "High because it's an EDM track, which usually features a fast tempo and intense beats.",
    "music danceability": "High because EDM generally has a strong, consistent beat designed to facilitate dancing.",
    "valence": "Medium because EDM tracks can have a dynamic range of emotion, not strictly euphoric or melancholic.",
    "mode": "Major because EDM tracks often use bright, uplifting progressions to energize listeners."
  },
  "Obeka_Drum Core": {
    "genre": "Gqom",
    "track bpm": 140,
    "lyrics summary": "The song includes lyrical elements like 'Dance in flattery' and 'I wonder if you can escape,' amidst repetitive rhythmic phrases focusing on movement and dance.",
    "lyrics sentiment": "Mixed because the lyrics have elements of playful dance commands ('Dance in flattery') and a slightly challenging or threatening tone ('I wonder if you can escape').",
    "music energy": "High because the tempo is fast at 140 BPM and the song has intense instrumentation suitable for high-energy dancing.",
    "music danceability": "High because the track has a consistent and strong rhythmic beat, typical for dance music genres like Gqom.",
    "valence": "Medium because, despite its high energy, the melancholic description suggests a subtly complex emotional tone.",
    "mode": "Major because the track is explicitly in a major key, which generally conveys a bright, open tonal quality."
  },
  "Polly_Keep Busy": {
    "genre": "Indie Pop",
    "track bpm": "about 70-80",
    "lyrics summary": "A song about the quiet helplessness and melancholy following a breakup, expressing the efforts to stay busy while dealing with heartbreak.",
    "lyrics sentiment": "Negative because the lyrics express feelings of heartbreak and helplessness.",
    "music energy": "Low because the track is a ballad with a slow, reflective tempo and a melancholic mood.",
    "music danceability": "Low because the song is a slow, reflective ballad not intended for dancing.",
    "valence": "Low because the tone is melancholic and reflective of heartbreak.",
    "mode": "Minor because the song's mood is dark and introspective, typical of a heartbreak ballad."
  },
  "Poly Armour_Your Lesson (Alternative)": {
    "genre": "Deep House",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'Your Lesson (Alternative)' by Poly Armour seem to involve themes of introspection and electronic connections, with references to 'the screenlight', 'reaching insights', and a reflection on privacy and observation. The lyrics evoke a sense of mystery and an exploration of digital space.",
    "lyrics sentiment": "Neutral because the lyrics seem to describe the actions and observations in a digital or introspective setting without expressing overtly positive or negative emotions.",
    "music energy": "Medium because the bpm of 120 indicates a moderate level of intensity, common in Deep House music.",
    "music danceability": "High because Deep House typically features a consistent, danceable beat and the bpm is suitable for dancing.",
    "valence": "Medium because the lyrics evoke a balanced emotional tone with introspection rather than joyful or sad emotions.",
    "mode": "Minor because the reflective and mysterious nature of the lyrics suggests a darker, introspective quality typical of the minor mode."
  },
  "Jens Konrad_Slangehvisker": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics of 'Slangehvisker' by Jens Konrad are in Danish and include a voice whispering that what one is doing is wrong, raising concerns about losing someone dear.",
    "lyrics sentiment": "Negative because the lyrics express a sense of wrongdoing and fear of loss.",
    "music energy": "Medium because the track likely has a balanced dynamic range typical of contemporary pop music.",
    "music danceability": "Medium because while pop music often has a steady beat, it may not be dominant enough for high danceability.",
    "valence": "Low because the lyrical content involves themes of wrongdoing and potential loss, which contribute to a darker tone.",
    "mode": "Minor because the themes of the lyrics suggest a moody and introspective nature."
  }
}