{
  "Aaron Hibell_levitation": {
    "genre": "Ambient",
    "track bpm": 66,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "Low because the track is described as having low energy and is not very intense.",
    "music danceability": "Low because the track is described as not very danceable and focusing more on a melancholic, ambient sound.",
    "valence": "Low because the track is described as melancholic, suggesting a darker emotional tone despite its major mode.",
    "mode": "Major because the track is identified as being in the major mode, which typically sounds more resolved or bright."
  },
  "ODESZA_This Version Of You - Joseph Ray Remix": {
    "genre": "Electronic",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics suggest a concept of self-realization and transformation, inviting the listener to imagine different versions of themselves.",
    "lyrics sentiment": "Neutral because the lyrics are descriptive about personal transformation without explicit emotional tones.",
    "music energy": "Medium because the remix likely features dynamic electronic beats balanced with ambient elements.",
    "music danceability": "High because the track is a remix with a pronounced beat typical for electronic music.",
    "valence": "Medium because the ambiance created by Julianna Barwick's vocals and the electronic elements likely conveys a mix of serenity and introspection.",
    "mode": "Major because the tone of the remix suggests an uplifting and bright quality typical of electronic tracks."
  },
  "John Summit_Human (feat. Echoes)": {
    "genre": "House",
    "track bpm": 125,
    "lyrics summary": "The lyrics of 'Human (feat. Echoes)' emphasize the importance of staying present and embracing human vulnerability and emotions, with the repeated phrase 'Breathe' serving as a reminder to stay calm and grounded.",
    "lyrics sentiment": "Positive because the lyrics encourage embracing emotions and connecting with others on a deeper level, promoting an optimistic view of human vulnerability.",
    "music energy": "High because the track features a 125 BPM tempo typical of energetic house music, with captivating beats designed for dancing.",
    "music danceability": "High because the consistent 125 BPM tempo provides a strong beat suitable for dance environments, typical of house music tracks.",
    "valence": "Medium because while the track encourages positive connections, the key of F Minor adds a subtle complexity to the mood.",
    "mode": "Minor because the song is in the key of F Minor, which contributes to a slightly introspective or moody sound despite its energetic beat."
  },
  "GASHI_My Year": {
    "genre": "Hip Hop",
    "track bpm": 145,
    "lyrics summary": "The lyrics of 'My Year' by GASHI featuring G-Eazy focus on living a lavish lifestyle, with mentions of wealth, partying, and relationships with women.",
    "lyrics sentiment": "Negative because the lyrics emphasize a hedonistic lifestyle and objectification, lacking positive emotional depth.",
    "music energy": "High because the track has a fast tempo and intense dynamics, as indicated by a high energy rating of 81/100.",
    "music danceability": "High because the track is designed for dancing, with a consistent and strong beat, as indicated by a danceability rating of 84/100.",
    "valence": "Medium because despite the intensity and energy, the lyrical content contributes a complex emotional tone rather than purely positive.",
    "mode": "Minor because the track is in B Minor, which typically conveys a darker, more introspective mood."
  },
  "Galantis_Runaway (U & I)": {
    "genre": "EDM",
    "track bpm": 126,
    "lyrics summary": "An ecstatic, escapist EDM jam about chasing true love.",
    "lyrics sentiment": "Positive because the lyrics express a hopeful and joyful pursuit of love.",
    "music energy": "High because the track is described as having high energy with intense production and tempo.",
    "music danceability": "High because it has a consistent beat that makes it suitable for dancing, typical of EDM.",
    "valence": "Medium because the mood is ecstatic yet described as somber, indicating a mix of emotional tones.",
    "mode": "Major because the track is in a major key, which typically conveys brighter and more resolved emotions."
  }
}