{
  "M83_Intro": {
    "genre": "Electronic",
    "track bpm": 105,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track has no lyrics and focuses on ambient soundscapes.",
    "music energy": "High because the track has a building intensity with powerful synths and dynamic soundscapes.",
    "music danceability": "Medium because the track maintains a steady beat suitable for gentle or ambient dancing, though it's not primarily beat-driven.",
    "valence": "Medium because the track combines ethereal and expansive sounds that evoke both wonder and melancholy.",
    "mode": "Major because the key is F♯/G♭ major, contributing to its expansive and optimistic sound."
  },
  "West Welch_Ambrosia": {
    "genre": "Alternative/Indie",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental without lyrics to convey sentiment.",
    "music energy": "Medium because of the balanced dynamic range and steady instrumentation a typical Alternative/Indie track has.",
    "music danceability": "Medium because Alternative/Indie tracks often feature a groove that is suitable for light dancing.",
    "valence": "Medium because instrumental tracks often have a subtle mix of moods designed to evoke complex emotions.",
    "mode": "Minor because Indie tracks frequently explore introspective and moodier tonalities."
  },
  "The Seige_Outside": {
    "genre": "Hip Hop",
    "track bpm": 130,
    "lyrics summary": "The song is an empowering anthem about determination and overcoming obstacles. The lyrics focus on self-assurance and the drive to succeed, expressing confidence and resilience against challenges.",
    "lyrics sentiment": "Positive because the lyrics express confidence, ambition, and resilience.",
    "music energy": "High because the track has a fast tempo and dynamic instrumentation.",
    "music danceability": "High because it has a consistent, strong beat that promotes dancing.",
    "valence": "Medium because the tone combines motivational elements with an assertive, serious intensity.",
    "mode": "Minor because the song is in F♯/G♭ minor, which gives it a darker, more serious undertone."
  },
  "The Seige_Animal": {
    "genre": "Hip Hop",
    "track bpm": 134,
    "lyrics summary": "The song 'Animal' by The Seige features lyrics about selecting the appropriate weapon and being cautious of snakes around, indicating themes of vigilance and readiness.",
    "lyrics sentiment": "Mixed because the lyrics depict themes of caution and readiness which imply both awareness and potential confrontation, contrasting with the high energy of the music.",
    "music energy": "High because the track is described as having high energy and intense instrumentation.",
    "music danceability": "High because the track is described as very danceable and suits a fast pace of 134 BPM.",
    "valence": "Medium because although the song has high energy suitable for dancing, the cautious and confrontational nature of the lyrics introduces complexity to the emotional tone.",
    "mode": "Minor because the song is described to be in a minor key, which often sounds more introspective or dark."
  },
  "The Seige_Prime": {
    "genre": "Alternative Hip Hop",
    "track bpm": 118,
    "lyrics summary": "The song 'Prime' by The Seige deals with themes of self-empowerment and pride, with lyrics expressing confidence and success in defying societal expectations and overcoming adversity.",
    "lyrics sentiment": "Positive because the lyrics express pride and confidence in identity and success despite challenges.",
    "music energy": "High because the song has intense dynamics and strong rhythmics.",
    "music danceability": "Medium because it has a somewhat danceable groove but is not primarily made for dancing.",
    "valence": "Medium because while the lyrics are confident, the somber tone adds emotional depth.",
    "mode": "Major because the track has a bright and assertive tonal quality."
  }
}