{
  "Arthur_Paradise": {
    "genre": "Pop Dance",
    "track bpm": 137,
    "lyrics summary": "A playful and humorous track that blends elements of pop, dance, and comedic storytelling.",
    "lyrics sentiment": "Positive because the lyrics are playful and humorous, designed to entertain and amuse the listener.",
    "music energy": "High because the tempo is fast and the song has a lively and intense rhythm.",
    "music danceability": "High because the consistent and upbeat rhythm is designed to make people dance.",
    "valence": "High because the mood is moderately joyful and entertaining.",
    "mode": "Major because the key is in A Major which gives a bright and resolved tonal quality."
  },
  "Palm Trees_Long Day": {
    "genre": "Chillout Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics seem to reflect on the theme of missing someone, with an emphasis on relaxation and enjoying life's simple pleasures, like driving with a full tank and taking things slow after a long day.",
    "lyrics sentiment": "Mixed because the lyrics express both longing and a sense of relaxation and freedom.",
    "music energy": "Medium because the song is described as good for all occasions and has a moderately joyful mood, without being intense.",
    "music danceability": "Medium because the track is suitable for dancing and has a steady tempo, but isn't purely dance-focused.",
    "valence": "Medium because the mood is moderately joyful, balancing a sense of longing with relaxation.",
    "mode": "Minor because the song is in F♯ Minor, often associated with a slightly introspective or moody tone."
  },
  "ODBLU_greedy": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song 'Greedy' by ODBLU emphasizes themes of self-worth and confidence, capturing a playful essence with its lyrical content.",
    "lyrics sentiment": "Positive because the lyrics express self-love and confidence with a playful tone.",
    "music energy": "Medium because the track is described as vibrant and playful, typical of upbeat pop music without being overly intense.",
    "music danceability": "High because the song likely has a strong and consistent beat, typical of pop tracks designed to engage listeners to move.",
    "valence": "High because the song's themes of self-love and confidence exude an uplifting mood.",
    "mode": "Major because the song has a playful, confident, and uplifting vibe associative with major key signatures."
  },
  "Nate VanDeusen_Goodbyes": {
    "genre": "Deep House",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because it is an instrumental track with no lyrics to express emotional tones.",
    "music energy": "Medium because Deep House typically has a steady and moderately intense groove.",
    "music danceability": "High because Deep House often features a strong, consistent beat suitable for dancing.",
    "valence": "Medium because Deep House can offer a balanced emotional tone, neither too uplifting nor too melancholic.",
    "mode": "Minor because the chords Am, F, C, G suggest a minor tonality common in Deep House tracks."
  },
  "Iaco_Lean In": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song encourages the listener to 'lean in' to life and relationships, suggesting themes of unity and emotional support.",
    "lyrics sentiment": "Positive because the lyrics encourage embracing challenges and fostering connections with others.",
    "music energy": "Medium because the song has a balanced dynamic with steady instrumentation appropriate for pop music.",
    "music danceability": "High because the song features a strong, consistent beat that invites movement and dancing.",
    "valence": "High because the tone is uplifting and the lyrics promote positive actions and emotions.",
    "mode": "Major because the melody and harmonies convey brightness and optimism."
  }
}