{
  "Kodaline_Brother": {
    "genre": "Indie Rock",
    "track bpm": 68,
    "lyrics summary": "The song 'Brother' by Kodaline is a tribute to the unbreakable bond between close friends, celebrating the enduring nature of such relationships akin to familial bonds. The lyrics reflect loyalty and resilience through life's challenges and shared experiences.",
    "lyrics sentiment": "Positive because the lyrics celebrate deep friendship and unwavering loyalty.",
    "music energy": "Medium because the song has an epic feel with balanced instrumentation and emotional intensity.",
    "music danceability": "Low because the song's tempo is slow and its focus is more on emotional storytelling than on rhythm.",
    "valence": "High because the lyrics and musical arrangement convey warmth and emotional positivity.",
    "mode": "Major because the song has a triumphant and uplifting tonal quality."
  },
  "Stay Outside_Overboard": {
    "genre": "Indie Rock",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'Overboard' by Stay Outside explore themes of love, loss, and emotional struggle depicted through metaphorical water imagery. The song features a narrative of attempting to maintain a relationship while feeling adrift and overwhelmed, emphasizing the difficulty of staying afloat emotionally.",
    "lyrics sentiment": "Mixed because while the song touches on the struggles and difficulties in a relationship, it also hints at the potential for resolution and understanding.",
    "music energy": "Medium because the track likely balances intensity with melodic storytelling, typical of Indie Rock.",
    "music danceability": "Medium because the rhythm is steady enough to follow but not overwhelming, suitable for casual or light dancing.",
    "valence": "Medium because the song contains emotionally complex themes with both hopeful and troubled elements.",
    "mode": "Minor because the themes of struggle and emotional depth suggest a moody, introspective tonality."
  },
  "Fuller_Backslide": {
    "genre": "Pop",
    "track bpm": 117,
    "lyrics summary": "The lyrics discuss the emotional turmoil and anxiety associated with a complicated relationship and mental health struggles. The song reflects on feelings of regret and the difficulty of moving on, symbolized by the term 'backsliding', which means falling back into old habits or states.",
    "lyrics sentiment": "Mixed because the lyrics touch on themes of regret and anxiety but also contain elements of introspection and acceptance.",
    "music energy": "High because the song is described as having high energy with a pacey tempo of 117 BPM.",
    "music danceability": "High because the track is described as very danceable with a consistent 4/4 time signature.",
    "valence": "Medium because while the music is upbeat and danceable, the lyrical content deals with complex emotional themes.",
    "mode": "Major because the track is directly noted to be in a major key, suggesting a brighter sound than the lyrical themes might indicate."
  },
  "Silver & Gold_Feel a Little Closer": {
    "genre": "Indie Pop",
    "track bpm": "about 120",
    "lyrics summary": "Based on typical indie pop themes, the song likely explores themes of connection and affection.",
    "lyrics sentiment": "Positive because the title and common themes in indie pop suggest feelings of closeness and joy.",
    "music energy": "Medium because indie pop often maintains a balance between calm and lively instrumentation.",
    "music danceability": "Medium because indie pop songs often have a groove suitable for casual dancing.",
    "valence": "High because the chord progression (Em, G, D, A) is typically used in uplifting songs.",
    "mode": "Major because the presence of chords like G major and D major suggests a bright tonality."
  },
  "Bo Burnham_Art Is Dead": {
    "genre": "Comedy Music",
    "track bpm": 86,
    "lyrics summary": "The song critically examines the state of modern art and the entertainment industry, highlighting the commercialization and self-indulgence overshadowing genuine creative expression.",
    "lyrics sentiment": "Mixed because the lyrics use satire to explore disillusionment with the commercialization of art, combining critical insight with a humorous tone.",
    "music energy": "High because despite the introspective lyrics, the song has an upbeat tempo and intense delivery.",
    "music danceability": "Medium because it maintains a steady beat that suits casual or light dancing but is not overtly focused on dance rhythms.",
    "valence": "Medium because the song combines satirical humor with a critique of the entertainment industry, resulting in an emotionally complex tone.",
    "mode": "Major because the song is composed in the E major key, which typically conveys a brighter and resolved tonal quality."
  }
}