{
  "MF DOOM_Rhymes Like Dimes": {
    "genre": "Hip Hop",
    "track bpm": "about 90",
    "lyrics summary": "The lyrics discuss themes of wealth, skill, and the rapper's prowess with words, using clever wordplay and metaphors.",
    "lyrics sentiment": "Mixed because the lyrics boast about skills and wealth but also contain introspective and humorous elements.",
    "music energy": "Medium because the track has a steady beat and dynamic lyric delivery, typical of hip hop.",
    "music danceability": "Medium because the groove is strong enough for head-nodding, but not highly rhythmic for extensive dancing.",
    "valence": "Medium because the track blends boastful, humorous, and reflective tones.",
    "mode": "Minor because the melody has a slightly moody and introspective feel, which is common in MF DOOM's style."
  },
  "MF DOOM_Rapp Snitch Knishes": {
    "genre": "Hip Hop",
    "track bpm": "about 90",
    "lyrics summary": "The lyrics discuss the foolishness of rappers who incriminate themselves through their lyrics, revealing their own crimes and illegal activities.",
    "lyrics sentiment": "Mixed because the lyrics convey a critique of certain behaviors in the rap community with a somewhat humorous tone.",
    "music energy": "Medium because the track features a steady hip-hop groove typical of MF DOOM's style, with a focus on lyrical delivery rather than aggressive instrumentation.",
    "music danceability": "Medium because the beat is steady and groovy, typical for nodding along or casual head bobbing, but not overly dominant for dance-focused movement.",
    "valence": "Medium because while the lyrics critique serious behavior, they do so with a laid-back and ironic delivery.",
    "mode": "Minor because the track has a somewhat dark and introspective feel, typical of MF DOOM's style."
  },
  "MF DOOM_One Beer": {
    "genre": "Hip Hop",
    "track bpm": 90,
    "lyrics summary": "The lyrics explore themes of maintaining one's authentic path amid life's distractions and challenges, with reflections on hard work, self-worth, and seeking recognition.",
    "lyrics sentiment": "Mixed because while there are themes of struggle and questioning authenticity, there is also an element of perseverance and carving one's path.",
    "music energy": "Medium because the song has an average dynamic range and consistent rhythm.",
    "music danceability": "High because the tempo and beat structure make it suitable for dancing.",
    "valence": "Medium because the themes mix introspective struggles with a hopeful, determined tone.",
    "mode": "Major because the track is described as upbeat and uses a major key."
  },
  "Tyler, The Creator_Answer": {
    "genre": "Hip Hop",
    "track bpm": "about 90",
    "lyrics summary": "The lyrics depict feelings of hurt and frustration, focusing on the artist's strained relationship with his absent father and desires for closure.",
    "lyrics sentiment": "Negative because the lyrics address themes of emotional pain and unresolved familial relationships.",
    "music energy": "Medium because the track has a steady rhythm and moderate intensity typical of Tyler, The Creator's style.",
    "music danceability": "Medium because the beat is consistent though not particularly fast-paced, suitable for moderate grooving.",
    "valence": "Low because the emotional tone is sad and somber, reflecting the lyrical content.",
    "mode": "Minor because the music and lyrics convey a sense of tension and unresolved emotional conflict."
  },
  "Kendrick Lamar_DUCKWORTH.": {
    "genre": "Hip Hop",
    "track bpm": "about 85",
    "lyrics summary": "The lyrics tell a personal and detailed story about an encounter between the artist's father and his future boss, which could have negatively impacted his family and career if not for a coincidence.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of tension and potential danger, but also gratitude and fate.",
    "music energy": "Medium because the track features steady beats and a narrative delivery style, typical of Kendrick Lamar's storytelling focus.",
    "music danceability": "Medium because the rhythm is steady but the focus is on lyrical content rather than dance beats.",
    "valence": "Medium because the narrative is complex, embodying both tension and positivity.",
    "mode": "Minor because of the introspective and serious tone of the storytelling."
  }
}