{
  "I'MIN_Replay": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song's chorus expresses a deep emotional connection with the past, reminiscing about the love and moments shared with a significant other. The protagonist also discusses overcoming negativity from others and gaining success independently after moving past a controlling ex-partner.",
    "lyrics sentiment": "Mixed because the lyrics combine feelings of nostalgic love with themes of overcoming challenges and asserting independence.",
    "music energy": "Medium because the song maintains a steady tempo typical of pop tracks, coupled with emotional and narrative expression.",
    "music danceability": "Medium because the beat is steady, accommodating casual dancing, reflective of typical pop structures.",
    "valence": "Medium because the song balances positive and reflective tones, with themes of love and personal strength against adversity.",
    "mode": "Major because the recurring theme of love and reminiscence aligns with an emotionally positive and resolved tonal quality."
  },
  "demxntia_keep smiling": {
    "genre": "Lo-fi",
    "track bpm": 112,
    "lyrics summary": "The lyrics describe a sense of vulnerability and doubt interwoven with themes of love and encouragement, as the narrator expresses devotion and hope by urging a loved one to 'keep smiling' despite uncertainties.",
    "lyrics sentiment": "Mixed because the lyrics convey both expressions of love and vulnerability, capturing a balance of doubt and reassurance.",
    "music energy": "Medium because the track has average energy with a tempo of 112 BPM, conveying a steady mood.",
    "music danceability": "Medium because the track is somewhat danceable, having a consistent beat that allows for gentle movement.",
    "valence": "Medium because while the lyrics contain themes of doubt, the overall message and major mode suggest a balanced emotional tone.",
    "mode": "Major because the track is in a D key and the major mode, contributing to a slightly uplifting feel despite the somber theme."
  },
  "Daniel Caesar_Best Part (feat. H.E.R.)": {
    "genre": "R&B",
    "track bpm": 75,
    "lyrics summary": "A love song where the singers express their appreciation for each other's presence in their lives, emphasizing that being together is the best part of life.",
    "lyrics sentiment": "Positive because the lyrics express appreciation and love between partners.",
    "music energy": "Low because the song has minimal instrumentation and a mellow tempo, creating a soothing atmosphere.",
    "music danceability": "Medium because the track has a steady beat that allows for some groove but is not overly prominent.",
    "valence": "High because the overall tone is uplifting and affectionate, celebrating love and companionship.",
    "mode": "Major because the song's melody and chord progression sound bright and resolved."
  },
  "SZA_Snooze": {
    "genre": "R&B",
    "track bpm": 90,
    "lyrics summary": "The lyrics of 'Snooze' by SZA detail an intense and potentially tumultuous relationship characterized by deep affection, dependency, and obsessive love. SZA expresses unwavering commitment and loyalty, willing to go to extremes such as lying and potentially violent acts out of devotion.",
    "lyrics sentiment": "Mixed because the lyrics express both deep devotion and an intense obsession, showcasing both positive commitment and negative dependency.",
    "music energy": "Medium because the track has a midtempo rhythm and balanced instrumentation with bass, guitars, drums, and synthesizers.",
    "music danceability": "Medium because the song features a steady midtempo rhythm suitable for light dancing.",
    "valence": "Medium because the song captures both the highs and lows of intense romantic commitment, blending affection with struggles.",
    "mode": "Minor because the song conveys a mood that is both introspective and intense, typical of minor key progressions in R&B."
  },
  "aaron's book club_Wrong Side of the Bed": {
    "genre": "Pop / Indie / Digicore",
    "track bpm": 138,
    "lyrics summary": "The lyrics describe waking up with a feeling of discomfort and longing. The singer wishes they could wake up next to someone they love and wonders if today is the day they will express their true feelings.",
    "lyrics sentiment": "Mixed because the lyrics express longing and discomfort, but also a hint of hope about expressing true feelings.",
    "music energy": "Medium because the song has an average energy level according to the description.",
    "music danceability": "High because it is described as very danceable with a strong beat structure.",
    "valence": "Medium because the song mixes feelings of discomfort and longing with a hopeful tone.",
    "mode": "Minor because the track is in a minor key, which typically conveys a more introspective or somber tone."
  }
}