{
  "Macklemore & Ryan Lewis_Downtown (feat. Melle Mel, Grandmaster Caz, Kool Moe Dee & Eric Nally)": {
    "genre": "Hip Hop",
    "track bpm": 110,
    "lyrics summary": "The lyrics celebrate urban life and culture, showcasing a love for exploration and the vibrant city experience.",
    "lyrics sentiment": "Positive because the lyrics express a celebration of downtown life and the joy of exploring the city.",
    "music energy": "High because the track features dynamic rap verses and energetic pop-influenced choruses.",
    "music danceability": "High because the groove is strong and consistent, with a catchy hook and rhythmic flow that encourages dancing.",
    "valence": "High because the song conveys an uplifting and celebratory vibe, enhancing the joyful theme.",
    "mode": "Major because the song has a bright and upbeat tonal quality, typical of a celebratory anthem."
  },
  "Lil Wayne_6 Foot 7 Foot - Edited Version": {
    "genre": "Hip Hop",
    "track bpm": 120,
    "lyrics summary": "The lyrics explore themes of power, hustling, and success against adversity, using intricate wordplay and metaphors.",
    "lyrics sentiment": "Mixed because the lyrics reflect both a triumphant declaration of success and the harsh realities faced during Lil Wayne's rough upbringing.",
    "music energy": "High because the fast-paced and intense vocal delivery drives the track with dynamic force.",
    "music danceability": "Medium because the strong and steady beat underlines the lyrical complexity, making it suitable for rhythmic movement without being overly dominant.",
    "valence": "Medium because while there is a confident tone, the underlying themes are complex and gritty.",
    "mode": "Minor because the overall tonal quality is dark and introspective, typical of many rap and hip-hop tracks."
  },
  "The Used_The Taste of Ink": {
    "genre": "Rock",
    "track bpm": 98,
    "lyrics summary": "The lyrics express a desperate longing to be noticed and understood amidst feelings of isolation, highlighted by the metaphor of a spotlight that should offer glory but instead reveals loneliness.",
    "lyrics sentiment": "Negative because the lyrics convey feelings of isolation and a longing for genuine connection, using a metaphor of a spotlight that underscores loneliness instead of acclaim.",
    "music energy": "Medium because the tempo is moderate, and rock generally has balanced dynamics that are neither too mellow nor overly intense.",
    "music danceability": "Medium because the track's moderate tempo and rock rhythm can suit casual movements but isn't strongly designed for dance.",
    "valence": "Low because the themes of desperation and isolation in the lyrics convey a melancholic and introspective tone.",
    "mode": "Major because the song is in G Major, which typically conveys a brighter and more resolved tonal quality despite the underlying lyrical themes."
  },
  "Brand New_The Quiet Things That No One Ever Knows": {
    "genre": "Alternative Rock",
    "track bpm": 58,
    "lyrics summary": "The song explores themes of regret and missed opportunities, focusing on a breakup and the revelation of an abortion that the narrator's partner had without his knowledge.",
    "lyrics sentiment": "Negative because the lyrics discuss themes of regret, missed opportunities, and a painful revelation about an abortion.",
    "music energy": "Medium because despite the slow BPM, the band uses dynamic instrumentation typical of alternative rock.",
    "music danceability": "Low because the slow tempo and emotive content make it less suitable for dancing.",
    "valence": "Low because the tone is melancholic and the lyrics deal with emotionally heavy topics like regret and loss.",
    "mode": "Minor because it conveys a moody and introspective feeling typical of the song's lyrical content."
  },
  "Manchester Orchestra_Shake It Out": {
    "genre": "Indie Rock",
    "track bpm": "about 120",
    "lyrics summary": "The song reflects on the struggle to overcome personal issues and find redemption, with lyrics expressing a desperate cry for change. It explores themes of faith, personal growth, and the search for inner peace.",
    "lyrics sentiment": "Mixed because the lyrics convey both desperation in the struggle for change and a hopeful plea for redemption.",
    "music energy": "High because the track features intense and fervent instrumentation typical of indie rock anthems.",
    "music danceability": "Medium because the beat is steady and driving but not primarily designed for dancing.",
    "valence": "Medium because the song balances emotional intensity with moments of hope and deliverance.",
    "mode": "Minor because the tonal quality of the track is introspective and somewhat unresolved, fitting the themes of struggle and introspection."
  }
}