{
  "SZA_Ghost in the Machine (feat. Phoebe Bridgers)": {
    "genre": "Indie Pop",
    "track bpm": "about 85",
    "lyrics summary": "The lyrics of 'Ghost in the Machine' express feelings of disillusionment with superficial conversations and relationships. The song explores themes of existential reflection, personal independence, and the struggle to find genuine connection while dealing with emotional turmoil.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of disillusionment and boredom but also touch on yearning for meaningful connection and love.",
    "music energy": "Medium because the song is described as a ballad with emotive delivery but lacks intense dynamics.",
    "music danceability": "Low because the song's introspective and balladic nature suggests a subtle rhythm not designed for dancing.",
    "valence": "Low because the lyrical content is described as raw and melancholy, creating a somber emotional tone.",
    "mode": "Minor because the overall mood of the song is introspective and melancholy, typical of a minor mode."
  },
  "Kali Uchis_After The Storm (feat. Tyler, The Creator & Bootsy Collins)": {
    "genre": "R&B/Soul",
    "track bpm": "about 120",
    "lyrics summary": "The song 'After The Storm' is about resilience, self-reliance, and empowerment. It encourages having a positive outlook even in the face of difficult times, with contributions from Tyler, The Creator focusing on positivity and Bootsy Collins calling for self-reflection and faith.",
    "lyrics sentiment": "Positive because the lyrics emphasize strength, positivity, and self-empowerment in overcoming life's challenges.",
    "music energy": "Medium because the track maintains a dreamy yet steady rhythm with soulful and motivational elements.",
    "music danceability": "Medium because the beat is groovy and well-suited for relaxed, rhythmic movement.",
    "valence": "High because the song's themes of empowerment and positivity create an uplifting mood.",
    "mode": "Major because the track conveys a triumphant and positive tonal quality."
  },
  "The Weeknd_Is There Someone Else?": {
    "genre": "R&B",
    "track bpm": 170,
    "lyrics summary": "The song explores themes of jealousy and suspicion in a relationship, as the protagonist questions their partner about whether there is someone else in their life, reflecting a fear of betrayal and a desire for reassurance.",
    "lyrics sentiment": "Negative because the lyrics express fear and insecurity about potential betrayal in a relationship.",
    "music energy": "Medium because, despite the fast tempo, the track's emotional depth gives it a slightly restrained intensity.",
    "music danceability": "Medium because while the beat is lively, the emotional content might not make it a straightforward dance track for everyone.",
    "valence": "Low because the song's emotional tone is tense and uneasy, dealing with mistrust and anxiety.",
    "mode": "Minor because the haunting melody and themes of uncertainty imbue it with a dark, introspective quality."
  },
  "100 Thieves_Echoes": {
    "genre": "Pop",
    "track bpm": 125,
    "lyrics summary": "The song explores themes of emotional turmoil and introspection, focusing on struggles with overwhelming emotions and haunting memories symbolized as echoes.",
    "lyrics sentiment": "Negative because the lyrics express feelings of being overwhelmed and haunted by past experiences.",
    "music energy": "Medium because the song balances melodic elements with emotional intensity without being overly aggressive.",
    "music danceability": "High because the beat is likely steady and prominent, suitable for movement and engagement.",
    "valence": "Low because the tone is melancholic with themes of emotional struggle and introspection.",
    "mode": "Minor because the lyrical content and emotional tone suggest a dark and introspective quality."
  },
  "Doja Cat_Candy": {
    "genre": "Pop",
    "track bpm": 125,
    "lyrics summary": "The lyrics explore themes of temptation and allure, representing a woman who exudes sweetness and charm but whose true nature is deceptive and artificial. It critiques the superficiality and transient nature of such romantic attractions.",
    "lyrics sentiment": "Mixed because the lyrics use playful metaphors about allure and charm but also highlight the deceptive and insincere nature of superficial relationships.",
    "music energy": "Medium because the song maintains a balanced dynamic range and tempo, allowing for an engaging but not overly intense listening experience.",
    "music danceability": "High because the track has a steady, dance-friendly beat at 125 BPM and a 4/4 time signature, making it easy to move to.",
    "valence": "Medium because, while the song critiques insincerity, it uses playful and light-hearted tones to do so, creating a balanced emotional feel.",
    "mode": "Major because the song is in a G♯/A♭ major key, contributing to its bright and playful melodic quality."
  }
}