{
  "Blackmill_Spirit of Life": {
    "genre": "Chillstep",
    "track bpm": "about 140",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Instrumental because there are no lyrics in the track.",
    "music energy": "Medium because the track likely features a steady beat with soothing electronic elements typical of Chillstep.",
    "music danceability": "Medium because the track probably has a consistent rhythm that can be danced to in a relaxed, fluid manner.",
    "valence": "Medium because the music likely has an emotionally balancing effect, with both uplifting and introspective qualities.",
    "mode": "Minor because Chillstep often features a more introspective and moody atmosphere, aligned with minor tonalities."
  },
  "Emancipator_Soon It Will Be Cold Enough to Build Fires": {
    "genre": "Downtempo",
    "track bpm": 78,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and contains no vocal content to express any sentiment.",
    "music energy": "Medium because the downtempo style maintains a balanced dynamic with a steady, moderate tempo.",
    "music danceability": "Medium because downtempo tracks have beats that are not too slow, allowing for light dancing.",
    "valence": "Medium because the instrumental nature of the track likely provides a complex mix of moods without lyrics.",
    "mode": "Minor because downtempo tracks often use melodies and harmonies that convey a moody or introspective quality."
  },
  "Just Chillax_Enjoy the Flight (feat. Fréd)": {
    "genre": "Chillhop",
    "track bpm": "about 80",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and does not contain any lyrics.",
    "music energy": "Medium because the Chillhop genre often features a steady, relaxed groove with a balanced dynamic range.",
    "music danceability": "Medium because Chillhop typically has a smooth and steady beat, suitable for casual dancing or head-nodding.",
    "valence": "Medium because Chillhop often combines mellow, soothing sounds with a subtle mix of moods.",
    "mode": "Minor because Chillhop frequently has introspective and slightly melancholic tones."
  },
  "XYLØ_Afterlife": {
    "genre": "Electronic",
    "track bpm": 100,
    "lyrics summary": "The lyrics describe a person who is tempted by a relationship that feels both paradisiacal and dangerous, symbolized by allowing darkness to take control. They invite being enveloped by smoke and lies, indicating a willing surrender to an enthralling yet risky situation.",
    "lyrics sentiment": "Negative because the lyrics describe a sense of being engulfed by darkness, control loss, and an awareness of danger in the relationship.",
    "music energy": "Medium because the tempo and electronic elements suggest a balanced but engaging dynamic.",
    "music danceability": "Medium because the steady 100 BPM rhythm facilitates moderate movement without dominating the track.",
    "valence": "Low because the mood of the track is dark and introspective, reinforced by the lyrics focusing on control and darkness.",
    "mode": "Minor because the key of F minor suggests a somber, introspective tonal quality."
  },
  "Cage The Elephant_Cigarette Daydreams": {
    "genre": "Alternative Rock",
    "track bpm": "about 95",
    "lyrics summary": "The lyrics explore themes of introspection and reflection, using imagery of daydreams and cigarettes to convey a longing for escape and nostalgia.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of longing and introspection, mingling both hopeful and melancholic tones.",
    "music energy": "Medium because the song has a steady rhythm and moderate dynamics typical of alternative rock.",
    "music danceability": "Medium because the steady beat allows for casual or light dancing but is not dominant.",
    "valence": "Medium because the tone mixes wistfulness with a touch of optimism.",
    "mode": "Major because the melody has a bright, reflective quality despite the introspective lyrics."
  }
}