{
  "ALTÉGO_Toxic Pony": {
    "genre": "Pop",
    "track bpm": 143,
    "lyrics summary": "The lyrics describe a dangerous and irresistible attraction towards someone, where the narrator feels a sense of inevitability in the relationship and is unable to escape the pull of emotions.",
    "lyrics sentiment": "Mixed because the lyrics suggest both excitement and danger in the feelings of attraction and longing.",
    "music energy": "High because the tempo is fast and the song is described as exuberant with high energy.",
    "music danceability": "High because of the steady 143 BPM beat, typical of danceable pop tracks.",
    "valence": "High because the song is exuberant and likely has a positive, upbeat musical feel despite mixed lyrical themes.",
    "mode": "Major because the song is in the C major key and is described as exuberant."
  },
  "High School Musical Cast_Scream": {
    "genre": "Soundtrack",
    "track bpm": 111,
    "lyrics summary": "The song 'Scream' is about the struggles of finding one's true identity and making decisions when faced with conflicting dreams and expectations. Troy is torn between pursuing his own dreams and conforming to others' expectations, particularly the path his dad wants him to take.",
    "lyrics sentiment": "Mixed because the lyrics express the internal conflict and uncertainty faced by the protagonist, Troy, as he struggles with expectations and desires.",
    "music energy": "Medium because the song maintains a steady tempo of 111 BPM and has a dynamic intensity characteristic of musical theater.",
    "music danceability": "Medium because it has a steady BPM of 111, allowing for broad rhythmic movements typical in musical performances.",
    "valence": "Medium because the song blends emotional struggle with moments of determination and hope.",
    "mode": "Minor because the song's theme and progression reflect internal conflict and introspection."
  },
  "Trick Daddy_Let's Go (feat. Twista & Lil' Jon)": {
    "genre": "Hip Hop",
    "track bpm": "about 105",
    "lyrics summary": "The lyrics express a defiant and no-nonsense attitude, focusing on empowerment and readiness to face challenges. Lines like 'If you want it you can get it, let me know' emphasize a willingness to confront adversaries.",
    "lyrics sentiment": "Mixed because the lyrics convey empowerment and readiness to confront but are also aggressive and confrontational.",
    "music energy": "High because the tempo is brisk and the delivery is intense and aggressive.",
    "music danceability": "Medium because it has a steady beat suitable for some types of dancing, but the focus is more on aggression.",
    "valence": "Medium because while the tone is aggressive, the sense of empowerment provides a slightly positive edge.",
    "mode": "Minor because the composition has a dark and intense quality that complements the aggressive lyrical content."
  },
  "50 Cent_P.I.M.P.": {
    "genre": "Hip-Hop/Rap",
    "track bpm": 95,
    "lyrics summary": "The song 'P.I.M.P.' by 50 Cent provides a perspective on materialism, power dynamics, and self-assertion, centering around the persona of being a confident and untouchable 'player'.",
    "lyrics sentiment": "Mixed because the lyrics express themes of confidence and self-assertion but also touch on materialistic and potentially exploitative aspects of relationships.",
    "music energy": "High because the track features a catchy hook with intense and driving beats typical of early 2000s rap music.",
    "music danceability": "High because the beat is pronounced and steady, encouraging movement and featuring a rhythmic flow ideal for dancing.",
    "valence": "Medium because the tone mixes assertive and confident themes with the darker undercurrents of power dynamics.",
    "mode": "Minor because the track uses harmonies and a melody that contribute to a more moody and serious tone."
  },
  "Tove Lo_Talking Body - KREAM Remix": {
    "genre": "Dance / Pop",
    "track bpm": 124,
    "lyrics summary": "The lyrics of 'Talking Body - KREAM Remix' by Tove Lo explore themes of physical intimacy and contemporary love. They convey a sense of passion with striking imagery and relatable expressions about staying in bed and enjoying the feeling of a lover's skin.",
    "lyrics sentiment": "Mixed because while the lyrics express passion and desire, there is an undertone of raw vulnerability.",
    "music energy": "High because the remix has an intense dance beat and dynamic instrumentation typical of energetic dance tracks.",
    "music danceability": "High because the track has a strong, consistent beat ideal for dancing.",
    "valence": "Medium because while the music is upbeat, the underlying theme of physical intimacy and vulnerability adds emotional complexity.",
    "mode": "Minor because the track is in E Minor, which supports its raw and slightly moody tone."
  }
}