{
  "SAINt JHN_Roses - Imanbek Remix": {
    "genre": "EDM",
    "track bpm": "122",
    "lyrics summary": "The lyrics describe the overwhelming feeling of emotional closeness and love, likening it to a 'force field' that surrounds and protects the narrator. It emphasizes the depth of connection and the unstoppable power of love.",
    "lyrics sentiment": "Positive because the lyrics express joy and romantic devotion.",
    "music energy": "High because the tempo is fast and the instrumentation is intense.",
    "music danceability": "High because the track has a strong, consistent beat typical of dance music.",
    "valence": "High because the tone is uplifting and captures the joy of being in love.",
    "mode": "Major because the melody and chord progression convey a bright, triumphant feeling."
  },
  "Joel Corry_BED": {
    "genre": "Dance-Pop",
    "track bpm": 115,
    "lyrics summary": "The lyrics encourage listeners to shed their burdens, embrace joy, and prioritize their well-being through themes of empowerment and liberation.",
    "lyrics sentiment": "Positive because the lyrics focus on empowerment, liberation, and embracing joy.",
    "music energy": "High because the song has an energetic beat and intense production designed for dancing.",
    "music danceability": "High because the strong, consistent rhythm is designed to make people move.",
    "valence": "High because the song's themes are uplifting and joyful, contributing to a positive mood.",
    "mode": "Minor because the melody is in a minor key, giving a slightly introspective feel despite the overall uplifting atmosphere."
  },
  "The Kid LAROI_STAY (with Justin Bieber)": {
    "genre": "Pop",
    "track bpm": "about 140",
    "lyrics summary": "The song 'STAY' expresses a plea for companionship and the intense desire to keep someone close despite difficulties, focusing on themes of longing and emotional vulnerability.",
    "lyrics sentiment": "Mixed because the lyrics convey a strong desire for attachment and closeness, intertwined with the struggle against personal challenges and regrets.",
    "music energy": "High because of its upbeat tempo and energetic pop production style.",
    "music danceability": "High because the track features a prominent rhythmic pattern that encourages dancing.",
    "valence": "Low because despite its lively music, the lyrical theme is centered around emotional struggle and longing.",
    "mode": "Minor because the song conveys a sense of emotional tension and unresolved feelings."
  },
  "Dua Lipa_Hallucinate": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "The song explores themes of female empowerment and the transformative power of love and friendship.",
    "lyrics sentiment": "Positive because the lyrics focus on empowerment and the uplifting aspects of love and friendship.",
    "music energy": "High because the tempo is fast and the instrumentation is lively and intense.",
    "music danceability": "High because the track has a strong and consistent beat typical of electronic dance music.",
    "valence": "High because the tone is uplifting and positive, driving an emotional response of joy and empowerment.",
    "mode": "Minor because the key is E minor, though the overall feeling is positive due to the upbeat rhythm and instrumentation."
  },
  "Disclosure_Tondo": {
    "genre": "Electronic",
    "track bpm": 87,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Instrumental",
    "music energy": "High because the track is a collaboration with Rudimental, known for high-energy drum and bass influences.",
    "music danceability": "High because of the consistent 4/4 beat and electronic influences, making it suitable for dancing.",
    "valence": "Medium because although it is high energy, the C minor key suggests a balanced emotional tone.",
    "mode": "Minor because the track is in the C minor key, which typically lends a moody or introspective quality."
  }
}