{
  "Kahimi Karie_ZOOM UP !": {
    "genre": "J-Pop",
    "track bpm": 120,
    "lyrics summary": "Lyrics explore themes of longing, nostalgia, and encounters in a rainy cityscape, reflecting melancholy and unspoken love.",
    "lyrics sentiment": "Mixed because the lyrics convey both nostalgia and melancholy through the imagery of rain and transient encounters.",
    "music energy": "Medium because typical J-Pop from this era has a balanced dynamic with rich instrumentation.",
    "music danceability": "Medium because while the rhythm is steady, it is designed more for listening than dancing.",
    "valence": "Medium because the lyrics are emotionally complex, mixing nostalgia with a melancholic backdrop.",
    "mode": "Minor because the lyrical content and emotional tone suggest a darker, introspective quality."
  },
  "ROUND TABLE featuring Nino_Book End Bossa": {
    "genre": "Bossa Nova",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Instrumental because it is a Bossa Nova track by ROUND TABLE featuring Nino, which typically does not focus on explicit lyrical content in its instrumental format.",
    "music energy": "Medium because Bossa Nova often features a relaxed yet rhythmic feel with moderate dynamics.",
    "music danceability": "Medium because Bossa Nova has a steady rhythm suitable for dance styles like samba, but not as dominant as in more upbeat genres.",
    "valence": "Medium because Bossa Nova often balances a sense of nostalgia with a soothing, pleasant sound, neither overly dark nor excessively joyful.",
    "mode": "Minor because Bossa Nova frequently uses minor keys to evoke a sense of longing or introspection."
  },
  "フレネシ_CLOUD BOSSA": {
    "genre": "Bossa Nova",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to express an emotional state.",
    "music energy": "Medium because Bossa Nova typically has a relaxed yet steady rhythmic flow and dynamic range.",
    "music danceability": "Medium because Bossa Nova's rhythm can support casual dancing but is not as upbeat or forceful as other dance genres.",
    "valence": "Medium because the track likely conveys a balance between soft, introspective melodies typical of Bossa Nova.",
    "mode": "Major because Bossa Nova often features bright harmonies despite a mellow tone."
  },
  "フレネシ_レイテンシーガール": {
    "genre": "Bossa Nova",
    "track bpm": 78,
    "lyrics summary": "The song explores themes of facing life's challenges and the emotional impact of these trials. It reflects on personal struggles and the desire to overcome obstacles to find peace and resolution.",
    "lyrics sentiment": "Mixed because the lyrics discuss emotional struggles but also express a desire for resolution and peace.",
    "music energy": "Medium because although the song is lively, its tempo allows for a controlled dynamic range.",
    "music danceability": "High because the bossa nova rhythm is inherently danceable and the steady beat supports movement.",
    "valence": "Medium because the musical tone is balanced, reflecting both emotional struggles and a hopeful resolution.",
    "mode": "Major because the song is in G Major, providing an uplifting and bright sound."
  },
  "Pitcher56_Love Letter - Original Version": {
    "genre": "Pop",
    "track bpm": 118,
    "lyrics summary": "The lyrics likely focus on themes of love, communication, and emotional connection, as implied by the title 'Love Letter'.",
    "lyrics sentiment": "Positive because the song revolves around expressing affection and communication akin to a love letter.",
    "music energy": "High because the track is described as upbeat and features intense musical elements.",
    "music danceability": "High because the tempo is steady and suited for dancing, indicated by its categorization as 'very danceable'.",
    "valence": "Medium because it blends a positive sentiment with minor mode elements, suggesting emotional complexity.",
    "mode": "Minor because the track is in B minor which gives it a slightly introspective or melancholic tone."
  }
}