{
  "Cage The Elephant_Cigarette Daydreams": {
    "genre": "Alternative Rock",
    "track bpm": 114,
    "lyrics summary": "The song \"Cigarette Daydreams\" is about reminiscing about the past, especially youth and lost love. It uses the metaphor of cigarette smoke to describe memories that linger but are transient. Themes include longing, change, and the quest for peace amidst emotional turmoil.",
    "lyrics sentiment": "Mixed because the lyrics reflect themes of nostalgia and longing, suggestive of both a melancholic tone and a gentle remembrance.",
    "music energy": "High because the track is described as having high energy with a brisk tempo and a driving beat.",
    "music danceability": "High because the song has a strong groove and a time signature that promotes dancing.",
    "valence": "Medium because the song blends melancholy with melodic beauty, creating an emotionally complex atmosphere.",
    "mode": "Major because it is noted as being in a major key, which usually suggests a brighter tonal quality despite the melancholic themes."
  },
  "alt-J_Pusher": {
    "genre": "Indie Rock",
    "track bpm": 115,
    "lyrics summary": "The lyrics of 'Pusher' explore themes of longing, emotional dependency, and the struggle between desire and fulfillment, using the metaphor of being a 'pusher' or 'puller' to depict one's approach to relationships and personal aspirations.",
    "lyrics sentiment": "Mixed because the lyrics reflect both the universal longing for connection and the challenges inherent in emotional dependency.",
    "music energy": "Medium because the tempo is moderate and the instrumentation includes layers typical of indie rock.",
    "music danceability": "Medium because the rhythm is steady, which suits casual movement like walking.",
    "valence": "Medium because the emotional tone of the song blends introspection with the potential for connection.",
    "mode": "Major because the song is in D Major, contributing to a slight uplift in its mood despite the complex themes."
  },
  "The Beatles_I'll Follow The Sun - Remastered": {
    "genre": "Acoustic Rock",
    "track bpm": 85,
    "lyrics summary": "The lyrics talk about leaving and moving on in search of something hopeful ('I'll follow the sun'), despite the possibility of sadness ('tomorrow may rain'). It reflects on recognizing past relationships and the inevitability of parting ways.",
    "lyrics sentiment": "Mixed because the lyrics express a mix of melancholy about leaving a relationship and a hopeful search for something better.",
    "music energy": "Low because the track is an acoustic ballad with soft instrumentation and gentle dynamics.",
    "music danceability": "Low because the track has a slow tempo and is structured as a reflective ballad, not designed for dancing.",
    "valence": "Medium because the song has both melancholic themes and hopeful aspirations, creating an emotionally complex mood.",
    "mode": "Minor because the song has a melancholy and introspective quality typical of minor key music."
  },
  "The Weeknd_The Morning": {
    "genre": "R&B",
    "track bpm": 120,
    "lyrics summary": "The lyrics explore themes of excess, fame, and the pursuit of material pleasures, painting a vivid picture of a hedonistic lifestyle that ultimately feels hollow and transient.",
    "lyrics sentiment": "Mixed because the lyrics highlight both the allure of a lavish lifestyle and its ultimately empty and fleeting nature.",
    "music energy": "Medium because the energy is balanced, with The Weeknd's expressive vocals and moderate instrumental intensity.",
    "music danceability": "High because it is described as very danceable with a steady 4/4 beat despite the melancholic themes.",
    "valence": "Low because the overall tone is melancholic, reflecting on the emptiness of hedonism.",
    "mode": "Minor because the track is composed in a minor key, contributing to its moody and introspective feel."
  },
  "Coast Modern_Guru": {
    "genre": "Indie Pop",
    "track bpm": 141,
    "lyrics summary": "The lyrics explore themes of personal growth and self-discovery amid challenges and changes. The narrator expresses a desire for guidance and acknowledges personal imperfections while searching for direction and understanding.",
    "lyrics sentiment": "Mixed because the lyrics depict a combination of struggle and hope, reflecting on personal growth and desire for improvement despite life's challenges.",
    "music energy": "High because the tempo is fast and the song is described as exuberant with high energy.",
    "music danceability": "High because the track is very danceable as indicated by the steady beat and lively tempo.",
    "valence": "High because the mood is described as joyful despite lyrical ambivalence.",
    "mode": "Major because the key is D♯ Major, which typically conveys a bright and positive tonal quality."
  }
}