{
  "Colbie Caillat_Brighter Than The Sun": {
    "genre": "Pop",
    "track bpm": "about 122",
    "lyrics summary": "The lyrics describe a joyful and romantic outlook, celebrating the happiness and warmth that the central figure brings, likening them to sunlight.",
    "lyrics sentiment": "Positive because the lyrics express joy and romantic devotion.",
    "music energy": "High because the song features a bright and upbeat tempo with vibrant instrumentation.",
    "music danceability": "High because the track features a strong and lively beat suitable for dancing.",
    "valence": "High because the song feels uplifting and cheerful, with positive themes and a major tonality.",
    "mode": "Major because the melody and harmonies create a happy and resolved sound."
  },
  "Natasha Bedingfield_Pocketful of Sunshine": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics express themes of freedom, escape, and positivity, where the singer emphasizes taking charge of their own happiness and envisioning a brighter future.",
    "lyrics sentiment": "Positive because the lyrics convey an uplifting and empowering message about self-liberation and optimism.",
    "music energy": "High because the track features a lively tempo and vibrant instrumentation.",
    "music danceability": "High because it has a catchy, rhythmic beat designed for dancing.",
    "valence": "High because the overall tone is cheerful and enthusiastic.",
    "mode": "Major because the melody and harmonies sound bright and uplifting."
  },
  "WILLOW_Wait a Minute!": {
    "genre": "Pop",
    "track bpm": "about 90",
    "lyrics summary": "The song's lyrics reflect on themes of self-realization and questioning one's reality. The protagonist experiences a moment of clarity, pondering their place in the world and the societal roles they are expected to play.",
    "lyrics sentiment": "Mixed because the lyrics convey both self-discovery and inner conflict, questioning societal norms while also expressing empowerment.",
    "music energy": "Medium because the track has a steady tempo and dynamic vocals that maintain engagement without being overly intense.",
    "music danceability": "Medium because the rhythm is engaging and supports fluid movement, even though the beat is not prominently driving.",
    "valence": "Medium because while there are elements of introspection, the overall tone balances between contemplation and empowerment.",
    "mode": "Minor because the tonal quality of the song is more introspective and introspective, in line with the themes of self-questioning."
  },
  "Cat Janice_Dance You Outta My Head": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "The song \"Dance You Outta My Head\" by Cat Janice talks about moving on from a past relationship. The lyrics focus on the protagonist's determination to rid themselves of the memories and emotions tied to a former lover by dancing them out of their mind.",
    "lyrics sentiment": "Mixed because while the song depicts a struggle of moving on from a past relationship, it is also empowering and uplifting in its encouragement to dance away troubles.",
    "music energy": "Medium because the song has a dynamic disco beat and warm vocals, but it is not aggressive or fast-paced.",
    "music danceability": "High because it is described as having a disco beat, making it suitable for dancing and aimed at being a dance floor exorcism.",
    "valence": "Medium because the theme of overcoming emotional baggage contrasts with the empowering and upbeat approach to dealing with it.",
    "mode": "Major because the description highlights an uplifting and catchy sound, typical of pop music which often uses a major key to evoke positive emotions."
  },
  "Declan McKenna_Brazil": {
    "genre": "Indie Rock",
    "track bpm": "about 100",
    "lyrics summary": "The lyrics of 'Brazil' by Declan McKenna likely explore themes of political and social commentary, focusing on events in Brazil, possibly touching on corruption or hypocrisy within the societal or governmental systems.",
    "lyrics sentiment": "Mixed because while there may be elements of criticism and frustration, there can also be undertones of hope or a call to action.",
    "music energy": "Medium because Declan McKenna's style typically features energetic guitar-driven melodies, although not overly aggressive.",
    "music danceability": "Medium because the rhythm is likely steady and engaging but not predominant over the song's message and melody.",
    "valence": "Medium because the song may balance between critical themes and a hopeful or anthemic sound.",
    "mode": "Minor because the likely critical tone of the lyrics and typical indie rock styling points to a more contemplative and introspective sound."
  }
}