{
  "Eurythmics_Sweet Dreams (Are Made of This) - 2005 Remaster": {
    "genre": "New Wave",
    "track bpm": 125,
    "lyrics summary": "The lyrics speak of individuals' desires and dreams, with some people wanting to use, be used, abuse, or be abused. The repetitive chorus highlights that 'sweet dreams are made of this,' suggesting a commentary on the nature of human wants and aspirations.",
    "lyrics sentiment": "Mixed because the lyrics present contrasting emotions, talking about using, being used, abusing, and being abused, alongside a catchy, anthemic chorus.",
    "music energy": "High because the tempo is fast and the track has intense rhythmic beats and instrumentation.",
    "music danceability": "High because the beat is strong and consistent, making it very suitable for dancing.",
    "valence": "Medium because the music has a complex emotional tone with its upbeat tempo combined with darker lyrical themes.",
    "mode": "Minor because the song is in C minor, contributing to its moody and introspective sound despite its energetic beat."
  },
  "Robbie Nevil_C'est La Vie - Single Version": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song explores the frustration and monotony of daily life, questioning the meaning behind routine work and the unpredictability of life.",
    "lyrics sentiment": "Mixed because while there is a sense of frustration and questioning about life's routines, there is also an acceptance of its unpredictable nature.",
    "music energy": "Medium because the track maintains a steady and balanced dynamic range with a pop arrangement.",
    "music danceability": "Medium because the rhythm is consistent and provides a groove suitable for casual dancing.",
    "valence": "Medium because the tone reflects both frustration and acceptance, showing emotional complexity.",
    "mode": "Minor because the overall tone suggests introspection and questioning, contributing to a moodier feel."
  },
  "Men At Work_Down Under": {
    "genre": "Rock",
    "track bpm": 107,
    "lyrics summary": "The lyrics describe an Australian traveler who journeys through various parts of the world and encounters people curious about Australia and its culture.",
    "lyrics sentiment": "Mixed because although the song has a cheerful and catchy melody, the lyrics explore themes of identity and cultural encounters, which contain both positive and reflective elements.",
    "music energy": "Medium because the song has a steady and moderately fast beat but is not overly aggressive.",
    "music danceability": "Medium because the song has a notable rhythm that can be danced to, though it is not primarily a dance track.",
    "valence": "Medium because the track has a balance of lively instrumentation contrasted with some reflective lyrical themes.",
    "mode": "Minor because the song is in B minor, giving it a slightly introspective and unresolved tonal quality."
  },
  "Steve Winwood_Higher Love - Single Version": {
    "genre": "Pop",
    "track bpm": 89,
    "lyrics summary": "The song explores themes of yearning, hope, and the search for something greater in life. The lyrics express a deep longing for a transcendent or 'higher' form of love that goes beyond the ordinary and mundane.",
    "lyrics sentiment": "Positive because the lyrics express hope, spiritual longing, and a desire for a deeper love.",
    "music energy": "Medium because the song has a balanced dynamic range and a steady rhythm that isn't overly intense.",
    "music danceability": "High because it is set at a tempo suitable for dancing, and the rhythm is steady and engaging.",
    "valence": "Medium because the themes are hopeful and contemplative, combining elements of spiritual longing with positive undertones.",
    "mode": "Major because the track is in D♭ Major, which contributes to a bright and uplifting tonal quality."
  },
  "Michael Sembello_Maniac": {
    "genre": "Synth-pop",
    "track bpm": 160,
    "lyrics summary": "The lyrics describe a passionate and driven person who dances with an intense, almost manic energy, pushing themselves to achieve their dreams.",
    "lyrics sentiment": "Mixed because the lyrics balance the intensity and obsession with a sense of inspiration and drive.",
    "music energy": "High because the track features a fast tempo and intense synth instrumentation typical of upbeat 80s anthems.",
    "music danceability": "High because it has a strong, pulsating beat that makes it ideal for dancing.",
    "valence": "High because the song's rhythm and themes of ambition and drive are uplifting and positive.",
    "mode": "Major because the song conveys an upbeat and triumphant mood consistent with major keys."
  }
}