{
  "Calvin Harris_This Is What You Came For": {
    "genre": "EDM",
    "track bpm": 124,
    "lyrics summary": "The lyrics explore themes of attraction, desire, and the allure of a captivating presence, focusing on a charismatic woman who draws everyone's attention and creates a powerful connection with one person in the room.",
    "lyrics sentiment": "Positive because the lyrics celebrate attraction and the unique spark of connection between two people.",
    "music energy": "High because the track is an EDM anthem primed for dance floors with a fast tempo and intense dynamics.",
    "music danceability": "High because the strong, consistent beat is designed to make people move on the dance floor.",
    "valence": "High because the track is uplifting and celebrates the magnetic allure and connection between people.",
    "mode": "Major because the melody and harmony create a bright, triumphant tonal quality."
  },
  "DJ Snake_Let Me Love You": {
    "genre": "EDM",
    "track bpm": 100,
    "lyrics summary": "The song delves into themes of love, perseverance, and the desire to save a failing relationship. The lyrics describe a couple facing challenges and struggles but determined to hold on and make things work.",
    "lyrics sentiment": "Mixed because the lyrics express both hope in persevering in love and challenges faced in the relationship.",
    "music energy": "High because the song has a strong beat and intense production elements typical of EDM.",
    "music danceability": "High because the song is described as having a very danceable vibe with a steady, compelling beat.",
    "valence": "Medium because, while it has melancholic sounds, it also includes hopeful themes of perseverance.",
    "mode": "Major because the song is in a G♯/A♭ major key, which typically conveys a brighter and resolved tonal quality."
  },
  "Calvin Harris_My Way": {
    "genre": "EDM",
    "track bpm": 120,
    "lyrics summary": "The lyrics of \"My Way\" by Calvin Harris explore themes of personal independence and breaking free from constraints.",
    "lyrics sentiment": "Positive because the lyrics express a sense of empowerment and liberation.",
    "music energy": "High because the track has a fast tempo and intense beats typical of an EDM anthem.",
    "music danceability": "High because the track features a strong, consistent rhythm suitable for dancing.",
    "valence": "Medium because while the music is upbeat, the minor key introduces a more introspective tone.",
    "mode": "Minor because the track is in E minor, giving it an introspective and somewhat melancholic feel."
  },
  "Tiësto_The Business": {
    "genre": "EDM",
    "track bpm": 120,
    "lyrics summary": "The lyrics revolve around the central theme of urging someone to focus on getting 'down to business,' suggesting a sense of urgency or intent to take action.",
    "lyrics sentiment": "Neutral because the lyrics focus on a non-emotional directive to take action or concentrate on the task at hand.",
    "music energy": "High because the track features euphoric beats and a fast tempo that creates an intense listening experience.",
    "music danceability": "High because the consistent, driving beat and hypnotic synth lines are designed to make people move on the dance floor.",
    "valence": "Medium because although the beats are euphoric, the haunting vocal delivery adds a layer of emotional complexity.",
    "mode": "Minor because it is in G# min, which often conveys a darker, more introspective quality."
  },
  "Lady Gaga_Rain On Me (with Ariana Grande)": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "The song explores themes of resilience, empowerment, and emotional release in the face of adversity, using rain as a metaphor for both pain and cleansing.",
    "lyrics sentiment": "Mixed because the lyrics acknowledge pain and struggle but also emphasize strength and resilience.",
    "music energy": "High because the track features soaring vocals and intense, danceable beats typical of pop anthems.",
    "music danceability": "High because the song is designed to be danceable with its strong beat and upbeat tempo.",
    "valence": "Medium because while it has an uplifting message of resilience, it intertwines themes of struggle and emotional catharsis.",
    "mode": "Major because the overall mood is empowering and triumphant, despite the lyrical themes of struggle."
  }
}