{
  "Fearless Motivation_Remember Why You Started": {
    "genre": "Motivational Speech",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics focus on perseverance and remembering your initial motivation when facing challenges. They emphasize that despite hardships, one should keep pushing forward and remember that pain is temporary but greatness lasts forever.",
    "lyrics sentiment": "Positive because the lyrics express encouragement and motivate listeners to overcome challenges and pursue their dreams.",
    "music energy": "High because the track delivers a motivational message with intense and inspiring instrumentation typical of motivational speeches.",
    "music danceability": "Medium because the rhythm is steady and engaging but not necessarily designed for dancing.",
    "valence": "High because the lyrics and music convey an uplifting and encouraging message.",
    "mode": "Major because the track aims to inspire and motivate listeners with a positive tone."
  },
  "Rob Bailey & The Hustle Standard_Beast - Southpaw Remix": {
    "genre": "Hip Hop",
    "track bpm": "about 140",
    "lyrics summary": "The song expresses themes of determination, strength, and living life fearlessly as if one were a beast, unafraid to chase dreams and embrace one's full power.",
    "lyrics sentiment": "Positive because the lyrics express confidence and an empowering mindset to live life at its fullest potential.",
    "music energy": "High because the track features intense instruments and a driving rhythm that evokes a sense of power and action.",
    "music danceability": "High because the beat is strong and consistent, making it suitable for gym playlists and energetic movement.",
    "valence": "High because the tone is motivating and uplifting, encouraging strength and perseverance.",
    "mode": "Major because the track conveys a triumphant and empowering vibe through its energetic and motivational atmosphere."
  },
  "Fearless Motivation_Struggle Made Me Stronger": {
    "genre": "Motivational Spoken Word",
    "track bpm": 108,
    "lyrics summary": "The lyrics describe how personal struggles have contributed to the speaker's growth and strength, emphasizing resilience, determination, and the importance of hard work and perseverance.",
    "lyrics sentiment": "Positive because the lyrics express motivation and resilience in overcoming challenges.",
    "music energy": "Medium because the track has average energy with a steady tempo and motivational delivery.",
    "music danceability": "Medium because the track has a steady tempo that supports movement but is not primarily designed for dancing.",
    "valence": "Medium because the motivational tone is uplifting but deals with serious themes.",
    "mode": "Major because the track is described as empowering and uses a major key, which often conveys positivity."
  },
  "Papa Roach_Even If It Kills Me": {
    "genre": "Rock",
    "track bpm": 140,
    "lyrics summary": "The song discusses the struggle of running from one's past and pain, and the difficulty of escaping these burdens. It explores themes of sacrifice, resilience, and devotion in the face of watching someone self-destruct.",
    "lyrics sentiment": "Mixed because the lyrics express both a sense of devotion and a struggle with pain and self-destruction.",
    "music energy": "High because the song features hard rock elements, intense instrumentation, and a powerful emotional delivery.",
    "music danceability": "Medium because while the beat is strong and steady, typical of rock music, it is more for headbanging than traditional dancing.",
    "valence": "Medium because the emotional complexity includes themes of pain and sacrifice, blended with some positive devotion.",
    "mode": "Minor because the themes and emotional tone presented in the lyrics convey a sense of darkness and introspection."
  },
  "Fearless Motivation_You Can Win": {
    "genre": "Motivational Speech",
    "track bpm": 114,
    "lyrics summary": "The lyrics of 'You Can Win' by Fearless Motivation focus on empowerment, perseverance, and recognizing inner strength. They emphasize overcoming adversity, believing in oneself, and the idea that anything is possible with determination.",
    "lyrics sentiment": "Positive because the lyrics express empowerment, determination, and optimism about overcoming challenges.",
    "music energy": "Medium because the track combines motivational themes with steady instrumentation suited for encouragement.",
    "music danceability": "Medium because it has a steady rhythm that supports light movement or workout activities.",
    "valence": "High because the lyrics and tone uplift and motivate the listener to achieve their best.",
    "mode": "Major because the overall message and musical tone are uplifting and resolved."
  }
}