{
  "Nelly Furtado_Promiscuous": {
    "genre": "Pop",
    "track bpm": 114,
    "lyrics summary": "The song 'Promiscuous' by Nelly Furtado featuring Timbaland depicts a flirtatious back-and-forth between two individuals pondering whether to engage in a sexual relationship.",
    "lyrics sentiment": "Mixed because the lyrics contain provocative and flirtatious elements indicating interest and playfulness but also a searching and somewhat indecisive tone.",
    "music energy": "High because the song has an intense, dynamic rhythm and engaging production that conveys excitement and vigor.",
    "music danceability": "High because the song features a steady, catchy beat suitable for dancing.",
    "valence": "Medium because while the tone is playful and flirtatious, the underlying theme of searching introduces complexity.",
    "mode": "Minor because the key and tonality create a slightly introspective and moody feeling."
  },
  "Timbaland_The Way I Are": {
    "genre": "Electrohop",
    "track bpm": 115,
    "lyrics summary": "The lyrics are based on the theme of role reversal and sensuous desires, which can convey an unconventional and intimate narrative between people.",
    "lyrics sentiment": "Mixed because the lyrics touch on role reversal, which can challenge traditional expectations, coupled with sensuous desires, creating a layered emotional narrative.",
    "music energy": "High because the track features intense beats and dynamic production typical of Timbaland's style.",
    "music danceability": "High because the track's steady tempo and rhythmic structure are designed to encourage movement.",
    "valence": "High because the energetic and upbeat futuristic sound makes the overall tone positive and appealing.",
    "mode": "Major because the song, despite its edgy themes, maintains a lighter, upbeat musical environment typical of major modes."
  },
  "Drake_You Broke My Heart": {
    "genre": "Hip-Hop/Rap",
    "track bpm": "about 120",
    "lyrics summary": "The song 'You Broke My Heart' by Drake reflects on feelings of betrayal and heartbreak after a relationship ends, expressing anger and frustration towards an ex who moved on quickly and disrespected him.",
    "lyrics sentiment": "Negative because the lyrics express feelings of betrayal, heartbreak, and anger towards an ex-partner who disrespected him.",
    "music energy": "Medium because the track blends the intensity of hip-hop beats with a more introspective lyrical tone.",
    "music danceability": "Medium because while the rhythm is steady, the emotional content makes it more suitable for listening than dancing.",
    "valence": "Low because the theme and emotional tone of the song revolve around sadness and resentment from a failed relationship.",
    "mode": "Minor because the song conveys a melancholic and introspective atmosphere reflecting on heartbreak."
  },
  "Doja Cat_Naked": {
    "genre": "Pop",
    "track bpm": 111,
    "lyrics summary": "The song 'Naked' by Doja Cat explores themes of sexuality and intimacy, focusing on the idea of becoming more comfortable with being naked and intimate.",
    "lyrics sentiment": "Positive because the lyrics express confidence and a positive approach to themes of sexuality and self-expression.",
    "music energy": "High because the track has a fast tempo and intense dynamics.",
    "music danceability": "High because the beat is prominent and consistent, making it suitable for dancing.",
    "valence": "High because the upbeat tempo and positive lyrical themes create a joyful and energetic atmosphere.",
    "mode": "Major because the song is in a major key, which contributes to its bright and uplifting sound."
  },
  "Timbaland_Give It To Me": {
    "genre": "Pop",
    "track bpm": 111,
    "lyrics summary": "The lyrics present themes of confidence and assertiveness, with a playful tone about being attractive and self-assured.",
    "lyrics sentiment": "Positive because the lyrics express confidence and a playful attitude.",
    "music energy": "High because the track has a fast tempo and a lively rhythm.",
    "music danceability": "High because the track has a strong beat and is highly danceable.",
    "valence": "High because the track's tone is exuberant and lively.",
    "mode": "Major because it is described as having a major tonal quality, typically associated with bright and positive sounds."
  }
}