{
  "AFROJACK_Take over Control (feat. Eva Simons)": {
    "genre": "EDM",
    "track bpm": 130,
    "lyrics summary": "The lyrics describe a desire to be with someone special, a longing to share moments together, and a sense of feeling connected and uplifted through their presence.",
    "lyrics sentiment": "Positive because the lyrics express joy and romantic connection with a desire to share meaningful experiences.",
    "music energy": "High because the tempo is fast and the instrumentation is intense, typical of EDM tracks.",
    "music danceability": "High because the track has a strong, driving beat designed for dancing.",
    "valence": "High because the tone is uplifting and promotes a sense of joy and excitement.",
    "mode": "Major because the melody and overall feel of the song is bright and upbeat."
  },
  "Bruno Mars_Runaway Baby": {
    "genre": "Pop",
    "track bpm": 164,
    "lyrics summary": "The song explores themes of attraction and self-preservation in romantic relationships, highlighting the potential heartache caused by being involved with someone unpredictable.",
    "lyrics sentiment": "Mixed because the lyrics have a playful tone yet caution against the potential pitfalls of romantic relationships.",
    "music energy": "High because the song has a fast tempo and vibrant instrumentation.",
    "music danceability": "High because the catchy melody and rhythm invite listeners to dance along.",
    "valence": "Medium because the playful tone is balanced by serious themes of self-preservation and heartache.",
    "mode": "Minor because the song is in B♭ Minor, which often has a darker tonal quality despite the energetic delivery."
  },
  "Chris Brown_Yeah 3x": {
    "genre": "Dance-Pop",
    "track bpm": 130,
    "lyrics summary": "The song encourages listeners to shed their worries, embrace the present moment, and fully engage in the excitement of the dancefloor. The lyrics are about living in the moment and enjoying a carefree night, with a recurring phrase 'Yeah, yeah, yeah' symbolizing enthusiasm and a carefree attitude.",
    "lyrics sentiment": "Positive because the lyrics express joy and encourage living in the moment with enthusiasm and carefreeness.",
    "music energy": "High because the song features a fast tempo and intense rhythmic claps and vibrant synths.",
    "music danceability": "High because it has a strong and consistent beat designed for dancing and celebration.",
    "valence": "High because the tone is uplifting and jovial, encouraging excitement and enjoyment.",
    "mode": "Major because it is composed in the key of D major, lending a bright and positive tonal quality."
  },
  "Alien Ant Farm_Smooth Criminal": {
    "genre": "Rock",
    "track bpm": 116,
    "lyrics summary": "The lyrics of 'Smooth Criminal' by Alien Ant Farm depict a crime scene, focusing on the anxiety and questions surrounding the victim, Annie, and the lingering uncertainty of her fate.",
    "lyrics sentiment": "Mixed because the lyrics describe a crime scenario which is dark and anxious, yet the energetic delivery adds an uplifting layer.",
    "music energy": "High because the song features powerful rock instrumentation and an energetic arrangement.",
    "music danceability": "High because the track has a strong and steady beat which supports dancing.",
    "valence": "Medium because although the instrumental is upbeat, the lyrical theme is about a crime, adding emotional complexity.",
    "mode": "Minor because despite the energetic arrangement, the theme of the lyrics is dark and tense, typical of a minor mode."
  },
  "Beyoncé_Crazy In Love (feat. JAY-Z)": {
    "genre": "Pop/R&B",
    "track bpm": 100,
    "lyrics summary": "The lyrics describe a romantic obsession where the narrator feels so in love that they act out of character, feeling crazy and unlike themselves.",
    "lyrics sentiment": "Positive because the lyrics express the joyous and passionate nature of being in love, despite feeling out of control.",
    "music energy": "High because the song has intense dynamics and upbeat, lively instrumentation.",
    "music danceability": "High because the strong rhythm and catchy beats make it very danceable.",
    "valence": "High because the music and lyrics create an uplifting and euphoric feeling.",
    "mode": "Major because the song has a bright, triumphant tone that aligns with its joyful theme."
  }
}