{
  "Billie Eilish_BIRDS OF A FEATHER": {
    "genre": "Pop",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Instrumental because there are no lyrics in the track to analyze sentiment.",
    "music energy": "High because the track is likely upbeat and dynamic given Billie Eilish's past pop productions.",
    "music danceability": "High because Billie Eilish's tracks often have a strong, engaging beat suitable for dancing.",
    "valence": "High because the upbeat nature of the track suggests an emotionally positive tone.",
    "mode": "Major because the track's energy and danceability align with a bright, happy sound typically found in major modes."
  },
  "Billie Eilish_WILDFLOWER": {
    "genre": "Pop",
    "track bpm": 94,
    "lyrics summary": "The song likely explores themes of nature, growth, and self-discovery, which could be inferred from the title 'WILDFLOWER'.",
    "lyrics sentiment": "Positive because the term 'wildflower' often symbolizes beauty, resilience, and nature in its unrestrained form, suggesting themes of growth and self-discovery.",
    "music energy": "Medium because Billie Eilish's tracks often feature balanced dynamic range with moderate instrumental intensity.",
    "music danceability": "Medium because her music typically has a steady rhythm suitable for casual dancing.",
    "valence": "Medium because Billie Eilish's music often blends subtle positive and negative emotional cues, resulting in a complex emotional palette.",
    "mode": "Minor because her music frequently employs a moody and introspective tonal quality."
  },
  "Billie Eilish_lovely (with Khalid)": {
    "genre": "R&B",
    "track bpm": "about 115",
    "lyrics summary": "The song 'lovely' explores themes of emotional pain, longing, and the struggle to find solace. The lyrics describe feelings of being trapped in sadness and the desperate hope for relief.",
    "lyrics sentiment": "Negative because the lyrics express feelings of sadness, longing, and entrapment without resolution.",
    "music energy": "Medium because the song features a steady tempo with dynamic vocal delivery, but its instrumentation is not intense.",
    "music danceability": "Medium because the beat is steady and rhythmic, suiting casual listening and light swaying rather than strong dancing.",
    "valence": "Low because the overall tone and lyrical themes are melancholic and emotionally heavy.",
    "mode": "Minor because the chord progressions and melodic lines convey a sense of melancholy and introspection."
  },
  "Billie Eilish_LUNCH": {
    "genre": "Alternative",
    "track bpm": 160,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to provide emotional content.",
    "music energy": "Medium because the track has an average amount of energy typical for alternative genres.",
    "music danceability": "Medium because while it has a consistent rhythm, it is not primarily dance-focused.",
    "valence": "Medium because it is emotionally nuanced despite the energetic tempo.",
    "mode": "Major because the typical major key from the snippet indicates a resolved tonal quality."
  },
  "Billie Eilish_What Was I Made For? [From The Motion Picture \"Barbie\"]": {
    "genre": "Pop",
    "track bpm": 60,
    "lyrics summary": "The song reflects introspective themes where the protagonist questions their purpose and existence.",
    "lyrics sentiment": "Negative because the lyrics convey a sense of confusion and searching for meaning, questioning one's identity and purpose.",
    "music energy": "Low because the tempo is slow and the arrangement is minimalistic and soothing.",
    "music danceability": "Low because the rhythm is subdued and not meant for dancing.",
    "valence": "Low because the tone is introspective and melancholic, reflecting deep emotions.",
    "mode": "Minor because the melody has a somber and introspective quality."
  }
}