{
  "Frank Ocean_Pink + White": {
    "genre": "R&B",
    "track bpm": "about 80",
    "lyrics summary": "The lyrics of 'Pink + White' explore themes of nostalgia, the inevitability of change, and the bittersweet nature of life, often reflecting on cherished memories and lost ones.",
    "lyrics sentiment": "Mixed because while the lyrics reflect on the beauty of memories and nature, they also deal with the inevitability of change and loss.",
    "music energy": "Medium because the track features a steady yet subdued rhythm with a reflective and emotional tone.",
    "music danceability": "Low because the rhythm is more conducive to introspection and listening rather than dancing.",
    "valence": "Medium because the song balances beautiful imagery with themes of loss and change, creating a complex emotional palette.",
    "mode": "Minor because the melody and overall tone convey a sense of introspection and nostalgia."
  },
  "Frank Ocean_White Ferrari": {
    "genre": "R&B/Soul",
    "track bpm": "about 75",
    "lyrics summary": "Frank Ocean's 'White Ferrari' explores themes of nostalgia, personal reflection, and the fleeting nature of life. The lyrics are poetic and often esoteric, especially towards the end of the song.",
    "lyrics sentiment": "Mixed because the lyrics combine themes of nostalgia and reflection with esoteric and philosophical elements that are open to interpretation.",
    "music energy": "Low because the song is built on minimalistic acoustic guitar chords and has a soft, meditative tone.",
    "music danceability": "Low because the track features a meditative, slow-paced soundscape that does not emphasize rhythm or dancing.",
    "valence": "Medium because the emotional tone is introspective and nuanced, mixing nostalgic reflection with poetic elements.",
    "mode": "Minor because the song's introspective and melancholic feel aligns with the characteristics of the minor mode."
  },
  "Frank Ocean_Thinkin Bout You": {
    "genre": "R&B",
    "track bpm": 130,
    "lyrics summary": "The lyrics explore themes of longing and unrequited love, with the artist reflecting on whether the person they are thinking about feels the same way.",
    "lyrics sentiment": "Mixed because the lyrics express both longing and uncertainty about mutual feelings.",
    "music energy": "Low because the song features a mellow, minimalist vibe with soft dynamics and ethereal synths.",
    "music danceability": "Medium because the track has a steady beat and smooth, ambient groove suitable for casual dancing.",
    "valence": "Medium because the mood is contemplative and introspective, balancing longing with a tender musical setting.",
    "mode": "Major because the key of C major contributes to a more resolved, though still introspective, tonal quality."
  },
  "Frank Ocean_Ivy": {
    "genre": "R&B",
    "track bpm": 72,
    "lyrics summary": "The lyrics of 'Ivy' narrate the memories of young love, its beauty, and eventual hardships. It delves into nostalgia, exploring the initial joys and the consequent heartbreak that stems from the fading of that relationship.",
    "lyrics sentiment": "Mixed because the lyrics reflect both the initial joy and excitement of love, as well as the pain and sadness of losing it.",
    "music energy": "Medium because the song has a steady rhythm and emotional intensity without aggressive dynamics.",
    "music danceability": "Medium because while the rhythm is steady and allows for some movement, the song is more reflective and emotional.",
    "valence": "Medium because the tones cover both joyful memories and the sadness of love lost, creating an emotionally complex atmosphere.",
    "mode": "Minor because the song carries a reflective and somewhat melancholic tone, typical of introspective and unresolved feelings."
  },
  "Frank Ocean_Lost": {
    "genre": "Contemporary R&B",
    "track bpm": 123,
    "lyrics summary": "The lyrics of 'Lost' tell a story of intoxicating love intertwined with themes of materialism and the emotional daze that comes with it, capturing the complex emotions of modern relationships.",
    "lyrics sentiment": "Mixed because the narrative includes both reflective melancholy and celebratory exuberance.",
    "music energy": "High because of its driving tempo and intense expressive performance.",
    "music danceability": "High because the track has a strong, consistent beat suited for dancing.",
    "valence": "Medium because the song blends melancholic reflections with exuberant energy, creating a complex emotional tone.",
    "mode": "Major because it is in the G♯/A♭ key and has a generally bright tonal quality despite its lyrical complexity."
  }
}