{
  "Rage Against The Machine_Testify": {
    "genre": "Rap Metal",
    "track bpm": 118,
    "lyrics summary": "The lyrics of 'Testify' critique media manipulation, war, oppression, and power dynamics through vivid imagery and repetitive calls to action.",
    "lyrics sentiment": "Negative because the lyrics express frustration and urgency about societal issues like oppression and media manipulation.",
    "music energy": "High because the song features intense and loud instrumentation typical of Rage Against The Machine's style.",
    "music danceability": "Medium because the beat is somewhat danceable but the focus is more on the political message and aggressive sound.",
    "valence": "Low because the themes are critical and dark, focusing on societal issues.",
    "mode": "Major because the song is noted to be in a major key, despite the dark themes."
  },
  "Vince DiCola_Up the Mountain": {
    "genre": "Soundtrack",
    "track bpm": 160,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "High because it is suitable for running, implying a fast tempo and dynamic composition.",
    "music danceability": "Medium because the fast pace might not align with traditional dance rhythms, but provides a rhythmic drive.",
    "valence": "High because the energy and harmony imply an uplifting and motivational tone.",
    "mode": "Major because the chords include Db, Eb, Ab, A which suggest a bright and resolved sound."
  },
  "Queen_Don't Stop Me Now - Remastered 2011": {
    "genre": "Rock",
    "track bpm": 156,
    "lyrics summary": "A celebration of living life to the fullest and having an unstoppable good time.",
    "lyrics sentiment": "Positive because the lyrics convey a sense of joy, freedom, and celebration.",
    "music energy": "High because the tempo is fast and the instrumentation is intense.",
    "music danceability": "High because the strong and upbeat rhythm encourages lively movement.",
    "valence": "High because the overall tone is uplifting and joyful.",
    "mode": "Major because the melody and chord progression sound bright and triumphant."
  },
  "The Prodigy_Breathe": {
    "genre": "Electronic Dance Music (EDM)",
    "track bpm": 130,
    "lyrics summary": "Breathe explores themes of societal entrapment using intense, aggressive language and imagery.",
    "lyrics sentiment": "Negative because the lyrics explore themes of societal entrapment, reflecting a critical and intense mood.",
    "music energy": "High because the track is intense with fast-paced beats and dynamic rhythms typical of The Prodigy's style.",
    "music danceability": "High because it features a consistent, strong beat characteristic of EDM which is well-suited for dancing.",
    "valence": "Low because despite its danceable nature, the song's mood is described as moody and intense, reflecting darker themes.",
    "mode": "Major because the track is identified in A Major, suggesting a bright tonal quality despite its dark themes."
  },
  "Jill Scott_Run Run Run": {
    "genre": "R&B",
    "track bpm": 150,
    "lyrics summary": "The song 'Run Run Run' by Jill Scott narrates the life of a hardworking mother who is tirelessly working to provide for her child, symbolized by the theme of relentless running.",
    "lyrics sentiment": "Mixed because the lyrics highlight the struggles and resilience of a hardworking mother, combining themes of hardship and hope.",
    "music energy": "High because the track has an upbeat tempo of 150 BPM and an energizing instrumentation.",
    "music danceability": "High because the song has a strong, rhythmic beat suitable for dancing, with a tempo of 150 BPM and a 4/4 time signature.",
    "valence": "Medium because the music is energetic and hopeful, but the lyrical content also touches on themes of struggle and perseverance.",
    "mode": "Major because the song is in the B major key which generally imparts a more upbeat and resolved tonal quality."
  }
}