{
  "James Arthur_Finally Feel Good": {
    "genre": "Pop",
    "track bpm": 79,
    "lyrics summary": "The lyrics explore personal growth and overcoming inner struggles to find happiness and fulfillment. The song expresses a desire to break free from self-destructive behaviors and negative thought patterns to embrace a positive and authentic existence.",
    "lyrics sentiment": "Positive because the lyrics express hope and a desire for personal growth leading to happiness.",
    "music energy": "Medium because the tempo is moderate and the instrumentation is steady, providing a balanced dynamic range.",
    "music danceability": "Medium because the beat is steady and the song has a groove suitable for light dancing.",
    "valence": "High because the song conveys an uplifting narrative about overcoming struggles and finding happiness.",
    "mode": "Major because the song is in B Major, which typically conveys a bright and hopeful tonal quality."
  },
  "Tate McRae_you broke me first": {
    "genre": "Pop",
    "track bpm": 81,
    "lyrics summary": "The song 'You Broke Me First' by Tate McRae explores the aftermath of a broken relationship, delving into themes of betrayal, heartbreak, and personal growth as the narrator transitions from feelings of hurt and resentment to discovering inner strength and resilience.",
    "lyrics sentiment": "Mixed because the lyrics express feelings of heartbreak and betrayal but also convey themes of personal growth and empowerment.",
    "music energy": "Medium because the track features a steady, moderate tempo with emotionally charged vocal delivery.",
    "music danceability": "Medium because the rhythm is consistent and moderately engaging, allowing for light dancing despite the emotional themes.",
    "valence": "Medium because the tone is both melancholic and reflective with an underlying message of empowerment.",
    "mode": "Minor because the song's melody and lyrical content exhibit a somber, introspective mood."
  },
  "Fousheé_Deep End": {
    "genre": "R&B",
    "track bpm": 125,
    "lyrics summary": "The lyrics describe a personal struggle with maintaining composure and self-control amidst life's challenges, with the repeated line 'I been trying not to go off the deep end' signifying resilience and strength.",
    "lyrics sentiment": "Mixed because the lyrics express themes of struggle and resilience against adversity, reflecting both empowerment and tension.",
    "music energy": "Medium because the track is described as having average energy with a hypnotic beat that supports the vocal delivery.",
    "music danceability": "High because it is described as very danceable and has a steady tempo and rhythm at 125 BPM.",
    "valence": "Medium because the track has a balance of dark, introspective themes and an uplifting, empowering message.",
    "mode": "Minor because it is indicated by the song's key and contributes to the haunting and introspective feel."
  },
  "Ritt Momney_Put Your Records On": {
    "genre": "Indie Pop",
    "track bpm": 91,
    "lyrics summary": "The lyrics are about relaxing and not worrying too much, with imagery of joyful and carefree summer days.",
    "lyrics sentiment": "Positive because the lyrics express a message of reassurance and carefree joy.",
    "music energy": "Medium because the tempo and overall vibe are moderately paced and uplifting, typical of Indie Pop.",
    "music danceability": "Medium because the tempo is steady and groovy, making it suitable for light dancing.",
    "valence": "High because the tone is uplifting and positive, encouraging a feeling of happiness and relaxation.",
    "mode": "Minor because the description specifies F# Minor, giving a slightly moody undertone while maintaining an overall positive feel."
  },
  "James Arthur_Train Wreck": {
    "genre": "Pop",
    "track bpm": 75,
    "lyrics summary": "The lyrics of 'Train Wreck' by James Arthur explore themes of inner turmoil, struggles with mental health, and a yearning for redemption. The song reflects the artist's emotional state during a challenging period in his life, marked by fame-related pressures and personal difficulties.",
    "lyrics sentiment": "Negative because the lyrics reflect despair and struggle, highlighting the artist's plea for help and salvation from emotional and existential turmoil.",
    "music energy": "Medium because the song has a steady, moderate intensity with emotional vocal delivery and orchestration.",
    "music danceability": "Low because the song's ballad style and introspective nature do not lend themselves to a dance-friendly beat.",
    "valence": "Low because the tone is melancholic, with lyrics expressing deep emotional distress.",
    "mode": "Minor because the song's melody and chord progressions evoke a sense of sadness and unresolved emotional tension."
  }
}