{
  "BENNETT_Vois sur ton chemin - Techno Mix": {
    "genre": "Techno",
    "track bpm": 138,
    "lyrics summary": "The lyrics express a theme of guidance and support, addressing forgotten and lost boys, encouraging someone to give them a hand to lead them to a different tomorrow.",
    "lyrics sentiment": "Mixed because the lyrics address themes of hope and guidance for a better future, but also reflect on the somber reality of being lost or forgotten.",
    "music energy": "High because the tempo is fast and the track is described as having high energy.",
    "music danceability": "High because it has a strong, consistent beat and is described as very danceable.",
    "valence": "Low because the song is described as somber and in a minor mode, which generally conveys a darker tone.",
    "mode": "Minor because it is explicitly stated to be in D Minor, which provides a somber, introspective quality."
  },
  "Creeds_Push Up - Main Edit": {
    "genre": "EDM",
    "track bpm": 75,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "High because the track is described as having very high energy despite the slow tempo.",
    "music danceability": "High because it emphasizes danceability, typical for an EDM track.",
    "valence": "Low because the song is described as having a melancholic and sad mood.",
    "mode": "Major because the key is G major, often associated with a brighter sound despite the melancholic mood."
  },
  "Nic Johnston_So What - Techno Remix": {
    "genre": "Techno",
    "track bpm": "about 120",
    "lyrics summary": "The track 'So What - Techno Remix' is a techno remix and does not appear to have any explicit focus on lyrics, primarily serving as a dance or club track.",
    "lyrics sentiment": "Neutral because the song is primarily instrumental and designed for dance, focusing on rhythm rather than lyrical content.",
    "music energy": "High because the track is a techno remix, which typically features a fast tempo and intense instrumentation.",
    "music danceability": "High because techno music is structured to have a consistent and strong beat, encouraging movement and dance.",
    "valence": "Medium because techno music can have both euphoric and darker elements, often depending on the specific mix and mood.",
    "mode": "Minor because techno tracks often use minor scales to create a deeper, more atmospheric feel."
  },
  "Durdenhauer_Praise The Lord (Da Shine) (feat. Skepta) - Durdenhauer Edit": {
    "genre": "Hip Hop",
    "track bpm": 100,
    "lyrics summary": "The song talks about a triumphant attitude, focusing on themes of personal achievement and perseverance against odds. The chorus, performed by Skepta, repeats the idea of arriving, seeing, and succeeding, followed by praising the Lord and breaking the law.",
    "lyrics sentiment": "Mixed because the lyrical content balances themes of triumph and rebellion with gratitude.",
    "music energy": "Medium because the track has a steady rhythm typical of hip hop, but not overly aggressive.",
    "music danceability": "High because the rhythm and beat are prominent and consistent, suitable for dancing.",
    "valence": "Medium because the tone mixes triumph with a touch of defiance and rebellion.",
    "mode": "Minor because the musical backing and lyrical themes provide a darker or more introspective edge."
  },
  "Bisken_Outside": {
    "genre": "Dance",
    "track bpm": 150,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "High because the BPM is 150, which indicates a fast and intense pace typical of dance tracks.",
    "music danceability": "High because the track is classified under the Dance genre and has a high BPM, making it suitable for dancing.",
    "valence": "High because the fast tempo and dance genre typically evoke feelings of excitement and positivity.",
    "mode": "Major because Dance tracks often use major keys to create an uplifting and energetic atmosphere."
  }
}