{
  "Meek Mill_Intro": {
    "genre": "Hip-Hop/Rap",
    "track bpm": 96,
    "lyrics summary": "Meek Mill reflects on his triumphant moments and past struggles, illustrating a journey from challenges to success, drawing an analogy to a championship victory against the odds.",
    "lyrics sentiment": "Mixed because the lyrics reflect on past struggles negatively but also celebrate success and resilience positively.",
    "music energy": "High because the track has a vigorous tempo at 96 BPM and an intense delivery.",
    "music danceability": "High because the track has a strong and consistent beat suitable for energetic dancing.",
    "valence": "Medium because while there is an uplifting theme about triumph and victory, there are also reflective elements about past struggles.",
    "mode": "Major because the track is identified to be in a major key, which often conveys bright and triumphant emotions."
  },
  "Nipsey Hussle_Grinding All My Life": {
    "genre": "Hip Hop",
    "track bpm": 180,
    "lyrics summary": "Nipsey Hussle's 'Grinding All My Life' portrays the relentless pursuit of success amidst adversity, reflecting on his journey from street hustler to legitimate businessman.",
    "lyrics sentiment": "Mixed because the lyrics convey determination and resilience but also highlight the struggles and sacrifices involved.",
    "music energy": "High because the tempo is fast and the lyrics and flow are intense.",
    "music danceability": "Medium because the beat is strong, but the focus is more on lyrical content than danceability.",
    "valence": "Medium because the track has a serious tone with elements of triumph and struggle.",
    "mode": "Minor because the melody and chord progression have a somber and introspective quality."
  },
  "Lil Wayne_Uproar": {
    "genre": "Hip Hop",
    "track bpm": 99,
    "lyrics summary": "The lyrics explore themes of disconnection and the inevitable change, with phrases that imply a longing for more harmonious times. The repeated countdown suggests impending transformation or action.",
    "lyrics sentiment": "Mixed because the lyrics reflect a sense of disconnection and longing, combined with an energetic and action-oriented tone.",
    "music energy": "High because the track features an intense and lively beat, typical of Hip Hop production.",
    "music danceability": "High because the track has a strong, consistent beat suitable for dancing.",
    "valence": "Medium because while the music is energetic and lively, the lyrical themes are not entirely joyful or positive.",
    "mode": "Major because the track is in a G♯/A♭ major key, lending it a brighter, more resolved tonal quality."
  },
  "Meek Mill_Ima Boss (feat. Rick Ross)": {
    "genre": "Hip Hop",
    "track bpm": 158,
    "lyrics summary": "The song exudes confidence, power, and leadership with a dominant theme of being in charge and calling the shots, reflecting on the artists' success and influence.",
    "lyrics sentiment": "Positive because the lyrics express confidence, triumph, and dominance over challenges.",
    "music energy": "High because the tempo is fast and the performance is intense and assertive.",
    "music danceability": "Medium because the beat is strong but the song focuses more on lyrical delivery than on dance rhythm.",
    "valence": "High because the tone is triumphant and celebratory.",
    "mode": "Major because the track exhibits a bright, confident, and resolved quality."
  },
  "Jeezy_Put On": {
    "genre": "Hip Hop",
    "track bpm": 138,
    "lyrics summary": "The lyrics convey a strong sense of pride and loyalty to one's city, while also addressing themes of success, fame, and the challenges associated with them. The refrain 'I put on for my city' emphasizes the artists' commitment to their community.",
    "lyrics sentiment": "Mixed because the lyrics express pride and loyalty while also touching on stress and personal challenges.",
    "music energy": "High because the tempo is fast and the instrumentation supports an intense dynamic.",
    "music danceability": "High because the track has a strong, consistent beat that is suitable for dancing.",
    "valence": "Medium because the tone embodies pride but also delves into the stress and challenges of success.",
    "mode": "Minor because the overall tonality is somber and reflective."
  }
}