{
  "Ricky Martin_Livin' la Vida Loca": {
    "genre": "Latin Pop",
    "track bpm": 178,
    "lyrics summary": "The song portrays a thrilling and dangerous lifestyle motivated by an enchanting woman. The narrator describes being irresistibly drawn into her world of excitement and unpredictability.",
    "lyrics sentiment": "Mixed because the lyrics convey both the excitement and potential danger of living an unpredictable, thrill-seeking lifestyle.",
    "music energy": "High because the tempo is fast and the track is performed with vibrant and intense instrumentation.",
    "music danceability": "High because of the strong and consistent rhythm that makes it suitable for dancing.",
    "valence": "Medium because while the song's melody and beat are upbeat, the lyrics hint at unpredictability and danger.",
    "mode": "Minor because the song is in a minor key, which adds a slight edge of tension to the vibrant instrumentation."
  },
  "Barenaked Ladies_One Week": {
    "genre": "Alternative Rock",
    "track bpm": 108,
    "lyrics summary": "The lyrics explore themes of communication breakdown, misinterpretation, and the comedic aspects of human relationships, with a high density of pop culture references.",
    "lyrics sentiment": "Mixed because while the lyrics are playful and humorous, they also reflect on the miscommunications and complexities of relationships.",
    "music energy": "High because the song is fast-paced and features intense vocal delivery and instrumentation.",
    "music danceability": "Medium because while the song has a lively beat, its complex structure may not be ideal for dancing.",
    "valence": "High because the overall tone is playful and comedic.",
    "mode": "Major because the song has an upbeat and light-hearted quality."
  },
  "Vengaboys_Boom, Boom, Boom, Boom!!": {
    "genre": "Europop",
    "track bpm": 130,
    "lyrics summary": "The lyrics describe a party atmosphere where the singer is inviting someone to join and have fun, emphasizing the carefree and enjoyable nature of the experience.",
    "lyrics sentiment": "Positive because the lyrics express joy, excitement, and a call to celebrate and dance.",
    "music energy": "High because the song has a fast tempo and intense beats that create a vibrant atmosphere.",
    "music danceability": "High because the track has a strong, consistent beat that invites dancing.",
    "valence": "High because the overall tone is joyful and encourages a feeling of celebration.",
    "mode": "Major because the song has a bright and uplifting sound."
  },
  "Madonna_Vogue": {
    "genre": "Pop",
    "track bpm": 116,
    "lyrics summary": "The lyrics of 'Vogue' celebrate self-expression, empowerment, and the transformative power of music and dance, with a strong emphasis on voguing and striking a pose.",
    "lyrics sentiment": "Positive because the lyrics promote empowerment and liberation through dance and self-expression.",
    "music energy": "High because the track maintains an energetic tempo with a driving beat suitable for dancing.",
    "music danceability": "High because the song is explicitly designed for dancing with a consistent 4/4 beat and rhythmic groove.",
    "valence": "High because the song conveys a positive and uplifting message about self-empowerment and individuality.",
    "mode": "Major because the track is set in a F♯ Major key, contributing to its bright and triumphant tone."
  },
  "Lou Bega_Mambo No. 5 (A Little Bit of...)": {
    "genre": "Latin Pop",
    "track bpm": 174,
    "lyrics summary": "The lyrics revolve around a series of flirtatious encounters, celebrating life and enjoying the company of various women.",
    "lyrics sentiment": "Positive because the lyrics express joy, flirtation, and a carefree attitude towards life.",
    "music energy": "High because the tempo is fast and the instrumentation is vibrant and lively.",
    "music danceability": "High because the rhythm is infectious and designed to make people move on the dance floor.",
    "valence": "High because the tone is upbeat and celebratory, enhancing feelings of joy and fun.",
    "mode": "Major because the melody and chord progression contribute to a bright and cheerful sound."
  }
}