{
  "Major Lazer_Roll the Bass": {
    "genre": "Trap / Wave",
    "track bpm": 150,
    "lyrics summary": "The song features energetic and bold lyrics that invoke strength and readiness for confrontation, as indicated by phrases like 'We ready fi di war.'",
    "lyrics sentiment": "Mixed because the lyrics convey both a sense of confident readiness and an aggressive challenge.",
    "music energy": "High because the tempo is fast and the production is intense.",
    "music danceability": "High because the strong, consistent beat is designed to make people move.",
    "valence": "Medium because the track has a balance of aggressive tones and uplifting beats.",
    "mode": "Minor because it is in Ab Minor, which often conveys a darker or more intense mood."
  },
  "Yeat_Breathe": {
    "genre": "Trap",
    "track bpm": 145,
    "lyrics summary": "The theme of the song 'Breathe' by Yeat revolves around themes of overwhelming wealth, independence, and disdain for imitators and those who oppose him. It highlights themes of hustle, self-confidence, and an unapologetic attitude towards critics.",
    "lyrics sentiment": "Negative because the lyrics convey disdain and a confrontational attitude towards others who challenge or imitate the artist.",
    "music energy": "High because the track is described as a high-energy anthem, typical of Yeat's aggressive musical style and production.",
    "music danceability": "High because the overall vibe is described as very danceable, indicating a strong, consistent beat suitable for dancing.",
    "valence": "Low because the track projects more negative sounds and themes of disdain and confrontation.",
    "mode": "Minor because the negative tone and themes suggest a darker, unresolved musical quality."
  },
  "Sarz_C'mon Look! (feat. Asake)": {
    "genre": "Electronic",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics are likely party-themed, focusing on themes of enjoying life, dancing, and celebration, typical of what Asake's lyrical style includes.",
    "lyrics sentiment": "Positive because the lyrics emphasize celebration and enjoyment, creating an upbeat mood.",
    "music energy": "High because the track likely has an upbeat tempo and engaging rhythms typical for electronic music.",
    "music danceability": "High because electronic music often has a steady, dance-ready beat.",
    "valence": "High because the track promotes a joyful and celebratory atmosphere through its festive themes.",
    "mode": "Major because the electronic genre and party themes suggest a bright and lively tonal quality."
  },
  "Kendrick Lamar_hey now (feat. dody6)": {
    "genre": "Hip Hop",
    "track bpm": 102,
    "lyrics summary": "The lyrics center around themes of financial success and introspection, referencing wealth and inner peace. There are shoutouts to incarcerated friends, suggesting a personal connection to themes of freedom and what it means to be at peace.",
    "lyrics sentiment": "Mixed because the lyrics reflect both the enjoyment of personal success and wealth, but contain a reflective tone about freedom and connecting with imprisoned friends.",
    "music energy": "Low because the track is described as having a melancholic tone and low energy.",
    "music danceability": "Medium because it features a nostalgic club beat with a modern twist, making it suitable for light dancing.",
    "valence": "Low because the song has a melancholic feel despite the club beat.",
    "mode": "Major because the track is in an A♯/B♭ major key."
  },
  "A$AP Ferg_Allure (feat. Future & Mike WiLL Made-It)": {
    "genre": "Hip Hop",
    "track bpm": "about 120",
    "lyrics summary": "The lyrics of 'Allure' delve into themes of wealth, drugs, and the difficulties that accompany success, portraying a balance between the allure of riches and the darker aspects of that lifestyle.",
    "lyrics sentiment": "Mixed because the lyrics celebrate wealth and success but also highlight the risks and darker facets associated with them.",
    "music energy": "High because the track features a hard, intense beat typical of Mike WiLL Made-It's production style.",
    "music danceability": "Medium because while the beat is strong, the focus on narrative and lyrical content makes it more suited to listening than dancing.",
    "valence": "Medium because the track balances between the glamorous allure of wealth and the somber realities behind it.",
    "mode": "Minor because the melody and beat convey a dark, ominous tone fitting the song's theme."
  }
}