{
  "The Oh Hellos_Soldier, Poet, King": {
    "genre": "Folk",
    "track bpm": "about 110",
    "lyrics summary": "The lyrics tell the story of three archetypal figures: a soldier, a poet, and a king, each with their symbolic roles and impact on the world.",
    "lyrics sentiment": "Neutral because they describe characters and their actions without overt emotional expressions or judgments.",
    "music energy": "Medium because the track features steady instrumentation and rhythm typical of folk music.",
    "music danceability": "Medium because the song has a steady beat and rhythmic consistency suitable for light dancing or swaying.",
    "valence": "Medium because while the lyrics do not explicitly convey positive emotions, the melody and instrumentation provide a balanced tone.",
    "mode": "Major because the melody creates a bright and folkloric atmosphere."
  },
  "Yaelokre_Hartebeest": {
    "genre": "Electronic",
    "track bpm": 115,
    "lyrics summary": "The song 'Hartebeest' by Yaelokre explores themes of nature, survival, and existential reflection, focusing on the idea of entropy, change, and death. It uses the imagery of hartebeests to convey the primal instincts driving both predator and prey, highlighting the raw and unforgiving beauty of the natural world.",
    "lyrics sentiment": "Mixed because the lyrics delve into existential themes, portraying both the fear and wonder of existence.",
    "music energy": "Medium because the track is at a steady 115 BPM with balanced dynamics.",
    "music danceability": "Medium because the tempo is suitable for moderate grooving, but the reflective themes may not encourage high energy dancing.",
    "valence": "Low because the themes of entropy and existential reflection introduce a darker tonality.",
    "mode": "Minor because the track is in C Minor, which often conveys introspection and somber tones."
  },
  "Pinegrove_Need 2": {
    "genre": "Indie Rock",
    "track bpm": 77,
    "lyrics summary": "The lyrics explore deep introspection about desire and expression, filled with emotional and contemplative themes, questioning the essence of what is needed.",
    "lyrics sentiment": "Mixed because the lyrics are introspective and contemplative, expressing a sense of longing and questioning.",
    "music energy": "High because despite the slower tempo, the song has intense emotional dynamics and strong guitar work.",
    "music danceability": "Medium because the song has a steady rhythm that supports moderate dance movements despite its introspective nature.",
    "valence": "Low because the lyrics and music convey a somber and contemplative mood.",
    "mode": "Minor because the song is in a C♯/D♭ minor key, which traditionally conveys a darker, more introspective tone."
  },
  "Syd Matters_Obstacles": {
    "genre": "Indie Folk",
    "track bpm": 127,
    "lyrics summary": "The song 'Obstacles' by Syd Matters features introspective lyrics that encapsulate a journey of nostalgia, change, and the inevitability of facing life’s challenges.",
    "lyrics sentiment": "Mixed because it evokes feelings of nostalgia and reflection alongside its melancholic themes.",
    "music energy": "Medium because the tempo is allegro, but the instrumentation remains balanced and not overly intense.",
    "music danceability": "Low because the main focus is on the melody and storytelling rather than a strong rhythm conducive to dancing.",
    "valence": "Low because the song is described as melancholic with an introspective and haunting melody.",
    "mode": "Major because the song is in the D♯/E♭ key, which is typically associated with a brighter sound despite the melancholic feel."
  },
  "Walter Mitty and His Makeshift Orchestra_Chamomile": {
    "genre": "Indie Folk",
    "track bpm": "about 80",
    "lyrics summary": "The lyrics of 'Chamomile' by Walter Mitty and His Makeshift Orchestra describe a reflective conversation while sipping chamomile tea on a rainy day, exploring feelings of disenchantment and growing older.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of nostalgia and reflection with hints of disenchantment, but also a cozy, intimate setting.",
    "music energy": "Low because the acoustic nature and reflective lyrics suggest a mellow and soft dynamic.",
    "music danceability": "Low because the focus appears to be on storytelling and reflection rather than rhythmic danceability.",
    "valence": "Medium because the mood is bittersweet with both soothing and somewhat melancholic elements in the lyrics.",
    "mode": "Minor because the themes of disenchantment and reflection suggest a moody and introspective tonal quality."
  }
}