{
  "Phantom Power_Overpowered": {
    "genre": "Electronic",
    "track bpm": 115,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track has no lyrics to convey any sentiment.",
    "music energy": "High because the tempo is fast at 115 BPM and the track is likely intense given its electronic genre.",
    "music danceability": "High because the consistent tempo and electronic instrumentation encourage movement and dance.",
    "valence": "Medium because while the mode is Major which suggests brightness, the electronic setting can offer subtle emotional complexity.",
    "mode": "Major because the track is in D♭ Major, which typically conveys a bright and resolved tonal quality."
  },
  "Antti Martikainen_Legendary": {
    "genre": "Epic Hybrid Action Metal",
    "track bpm": 145,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental with no lyrics.",
    "music energy": "High because the track likely features powerful instrumentation and a fast tempo consistent with epic and action metal genres.",
    "music danceability": "Medium because despite its strong beat, the rhythmic complexity typical of epic metal may not suit conventional dancing.",
    "valence": "Medium because the epic and triumphant sound is combined with the tension often found in action metal.",
    "mode": "Major because the track is noted to be in A Major, which typically has a bright and resolved tonal quality."
  },
  "Evan Dingman_A Promise to the Stars": {
    "genre": "Epic Orchestral Music",
    "track bpm": "about 70",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to express sentiment.",
    "music energy": "Medium because the orchestral arrangement provides a rising dynamic that is intense but not overwhelming.",
    "music danceability": "Low because epic orchestral music focuses more on dramatic emotion than a danceable beat.",
    "valence": "High because the epic orchestral style often evokes uplifting and triumphant emotions.",
    "mode": "Major because the epic feel typically aligns with a bright and triumphant sound."
  },
  "StudioKolomna_Dragon Fighter": {
    "genre": "Epic Music",
    "track bpm": "unknown",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics to convey any sentiment.",
    "music energy": "High because epic music typically features intense and dynamic orchestration.",
    "music danceability": "Low because epic music usually emphasizes dramatic and cinematic elements over danceable rhythms.",
    "valence": "Medium because epic music can evoke a range of emotions, from tension to upliftment, within its dynamic scope.",
    "mode": "Minor because the epic and dramatic nature of the genre often employs darker, unresolved tones."
  },
  "Two Steps from Hell_Shiver Me Timpanis": {
    "genre": "Epic Orchestral",
    "track bpm": 203,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and does not contain lyrics that express any particular emotion.",
    "music energy": "High because the arrangement of orchestral percussion and intense dynamics suggest a dramatic and forceful sound.",
    "music danceability": "Low because epic orchestral tracks typically have complex rhythms and structures not designed for dancing.",
    "valence": "Medium because while the track sounds grand and powerful, it remains emotionally balanced with no explicit positive or negative expressions due to the lack of lyrics.",
    "mode": "Minor because Two Steps from Hell often uses minor keys to create a dramatic and intense mood in their compositions."
  }
}