{
  "Sebastian Ingrosso_Calling (Lose My Mind) - Radio Edit": {
    "genre": "Dance",
    "track bpm": "about 128",
    "lyrics summary": "The lyrics describe a feeling of being overwhelmed or mentally 'frozen' while using metaphors of isolation and struggling to navigate through people's chatter.",
    "lyrics sentiment": "Negative because the lyrics describe feelings of mental overwhelm and isolation.",
    "music energy": "High because the track likely has a fast tempo typical of dance music and energetic instrumentation.",
    "music danceability": "High because the track is a dance genre remix, implying a consistent, strong beat meant for dancing.",
    "valence": "Low because the lyrics reflect feelings of isolation and struggle, contributing to a melancholic tone.",
    "mode": "Minor because the themes of mental freeze and isolation often lend themselves to a darker sound."
  },
  "The Chainsmokers_Roses (feat. ROZES) - Zaxx Remix": {
    "genre": "EDM",
    "track bpm": 128,
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Instrumental because the track features a remix with emphasis on electronic beats rather than lyrical content.",
    "music energy": "High because it features upbeat chords and high-energy elements that are typical of EDM tracks.",
    "music danceability": "High because the remix includes an evident upbeat feel and consistent rhythm ideal for dancing.",
    "valence": "High because the upbeat feel and energetic chords contribute to a positive and uplifting atmosphere.",
    "mode": "Major because the song is described as irresistibly charming and upbeat, typical qualities of a major mode."
  },
  "Armin van Buuren_Strong Ones": {
    "genre": "Progressive House",
    "track bpm": 126,
    "lyrics summary": "The lyrics describe a journey through various places and experiences, with an underlying theme of searching for meaning or fulfillment.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of longing and searching paired with a hopeful undertone.",
    "music energy": "High because the track is likely designed for energetic dance environments with a fast tempo and intense beats.",
    "music danceability": "High because the track has a strong and consistent beat typical of Progressive House, making it suitable for dancing.",
    "valence": "Medium because while the music is energetic, the lyrical theme introduces some emotional complexity and introspection.",
    "mode": "Major because Progressive House often uses uplifting melodies and harmonies that align with a Major mode."
  },
  "RL Grime_UCLA": {
    "genre": "Trap",
    "track bpm": "about 140",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because there are no lyrics in this track to analyze sentiment from.",
    "music energy": "High because RL Grime's tracks often feature intense beats and dynamic drops typical of high-energy electronic trap music.",
    "music danceability": "High because the track likely has a strong, rhythmic beat and bass typical of trap music, making it highly danceable.",
    "valence": "Medium because instrumental trap music often incorporates both intense and atmospheric elements, creating a balanced emotional expression.",
    "mode": "Minor because trap music frequently uses darker, moody synths and chord progressions that align with a minor mode."
  },
  "ARTY_Craving": {
    "genre": "EDM",
    "track bpm": "about 120",
    "lyrics summary": "Instrumental",
    "lyrics sentiment": "Neutral because the track is instrumental and does not contain lyrics.",
    "music energy": "High because the track is fast-paced and intense, typical of EDM songs.",
    "music danceability": "High because EDM tracks are designed to have a strong and consistent beat that makes people move.",
    "valence": "Medium because typical EDM tracks have both euphoric and emotionally complex elements.",
    "mode": "Major because EDM typically uses bright and resolved tonal qualities."
  }
}