{
  "Eminem_Lose Yourself": {
    "genre": "Hip-hop",
    "track bpm": 171,
    "lyrics summary": "The lyrics explore the struggles and triumphs of pursuing dreams, telling the story of the character B-Rabbit and capturing his journey through challenges on the path to success.",
    "lyrics sentiment": "Mixed because the lyrics convey both anxiety and determination to succeed, reflecting struggles and triumphs.",
    "music energy": "High because the tempo is fast and the instrumental is intense and dynamic.",
    "music danceability": "Medium because while it has a strong beat, the focus on lyrical delivery makes it less groove-focused.",
    "valence": "Low because the lyrical themes focus on pressure, challenges, and the darker aspects of striving for success.",
    "mode": "Minor because the melody conveys a sense of tension and urgency reflective of the protagonist's struggles."
  },
  "David Guetta_Titanium (feat. Sia)": {
    "genre": "EDM",
    "track bpm": 126,
    "lyrics summary": "The song's lyrics center around themes of resilience and strength despite facing adversity. It uses the metaphor of being 'titanium' to depict a sense of indestructibility and empowerment.",
    "lyrics sentiment": "Positive because the lyrics express themes of empowerment and resilience against challenges.",
    "music energy": "High because the production features a fast tempo and intense beat typical of an energetic EDM track.",
    "music danceability": "High because the song has a consistent beat and strong rhythm ideal for dancing.",
    "valence": "High because the tone of the song is uplifting and empowering, encouraging a sense of strength and confidence.",
    "mode": "Major because the song conveys a bright, triumphant feeling with its empowering lyrics and musical composition."
  },
  "The Roots_My Shot (feat. Busta Rhymes, Joell Ortiz & Nate Ruess) - Rise Up Remix": {
    "genre": "Hip Hop",
    "track bpm": "about 94",
    "lyrics summary": "The lyrics focus on themes of ambition and perseverance, equating personal drive with rising up against adversity, as well as highlighting societal challenges. Distinctive phrases emphasize not 'throwing away one's shot' and the importance of rising up, reflecting a spirit of resilience.",
    "lyrics sentiment": "Positive because the lyrics express motivation, determination, and resilience, urging listeners to rise above challenges.",
    "music energy": "High because the verses are delivered with intensity and the strong rhythmic foundation typical of hip hop increases dynamic energy.",
    "music danceability": "Medium because the song has a steady rhythm suitable for nodding along or casual dancing but not a strong dance beat.",
    "valence": "Medium because while the themes are motivational and resilient, they also address serious societal issues, creating a complex emotional tone.",
    "mode": "Minor because the core themes discuss overcoming adversity and challenges, which often align with a darker, more moody tonality."
  },
  "Mark Ronson_Nothing Breaks Like a Heart (feat. Miley Cyrus)": {
    "genre": "Pop",
    "track bpm": 116,
    "lyrics summary": "The lyrics describe emotional pain and heartbreak, expressing how the world can deeply hurt and scar the heart more profoundly than anything else.",
    "lyrics sentiment": "Negative because the lyrics focus on themes of emotional pain, heartbreak, and the inevitable fall apart of relationships.",
    "music energy": "Medium because the tempo is moderately upbeat and the instrumentation carries a steady intensity appropriate for the pop genre.",
    "music danceability": "Medium because the beat is consistent with pop music, allowing for easy movement but not overpowering enough to be suitable for only dance-oriented environments.",
    "valence": "Low because the lyrics are centered around heartbreak and sadness, imparting a melancholic and emotional tone.",
    "mode": "Minor because the song's chord progressions and melodic elements convey a sense of somberness and emotional depth."
  },
  "Imagine Dragons_Thunder": {
    "genre": "Rock",
    "track bpm": 168,
    "lyrics summary": "The lyrics of 'Thunder' by Imagine Dragons are about overcoming adversity and achieving dreams, reflecting the journey of the band's lead vocalist Dan Reynolds in becoming a global success.",
    "lyrics sentiment": "Positive because the lyrics express triumph over challenges and achieving one's dreams.",
    "music energy": "High because the tempo is fast and the song is described as a powerful anthem.",
    "music danceability": "Medium because although the beat is strong, the song has a rock style which is not primarily dance-focused.",
    "valence": "High because the theme is triumphant and inspirational, conveying a sense of success and fulfillment.",
    "mode": "Major because the song has a bright, uplifting tonal quality indicative of triumph and success."
  }
}