{
  "Danny DeVito_One Last Hope": {
    "genre": "Musical",
    "track bpm": 199,
    "lyrics summary": "The song 'One Last Hope' is about the character Phil placing his faith in an unexpected hero, expressing themes of hope and belief despite past disappointments.",
    "lyrics sentiment": "Mixed because the lyrics convey hope and belief in potential, despite acknowledging past failures and skepticism.",
    "music energy": "Medium because the tempo is fast, but the song's dynamics and instrumentation are balanced, typical of musical theater pieces.",
    "music danceability": "Medium because the song has a consistent rhythm and structure typical of musical numbers, but it's not highly dance-oriented.",
    "valence": "Medium because the song balances hopeful and reflective tones, typical of character development songs in musicals.",
    "mode": "Major because the song is in a G major key, contributing to its optimistic outlook despite the challenges discussed in the lyrics."
  },
  "Louis Armstrong_The Bare Necessities": {
    "genre": "Jazz",
    "track bpm": 84,
    "lyrics summary": "The lyrics encourage listeners to focus on the simple, essential aspects of life and to forget their worries and strife, embracing a carefree attitude.",
    "lyrics sentiment": "Positive because the lyrics focus on joy in simplicity and living without unnecessary worry.",
    "music energy": "Low because the track has a laid-back, relaxed tempo and gentle performance characteristic of Louis Armstrong's style.",
    "music danceability": "High because the track features a steady 4/4 beat and a lively feel that makes it easy to dance to.",
    "valence": "High because the tone is joyful and the lyrics express a carefree, positive outlook on life.",
    "mode": "Major because the key of F major gives the track a bright and uplifting sound."
  },
  "Cheryl Freeman_The Gospel Truth I / Main Titles - Hercules": {
    "genre": "Soundtrack",
    "track bpm": 158,
    "lyrics summary": "The song introduces the mythological backdrop of Disney's 'Hercules', with the vocals describing Zeus' triumph over the Titans and setting the epic narrative in motion, showcasing the journey of the hero Hercules.",
    "lyrics sentiment": "Positive because the lyrics celebrate triumph and heroism in the context of Greek mythology.",
    "music energy": "High because of the fast pace and the strong, dynamic vocal performances that drive the excitement of the track.",
    "music danceability": "Medium because while the tempo is lively, the focus is more on narrative delivery than on creating a dance beat.",
    "valence": "High because the song conveys triumph, celebration, and positive energy typical of an epic story start.",
    "mode": "Major because the key of B Major supports a bright and triumphant tonal quality suitable for an epic introduction."
  },
  "Richard White_Gaston - Soundtrack": {
    "genre": "Soundtrack",
    "track bpm": "about 120",
    "lyrics summary": "The song 'Gaston' from Disney's 'Beauty and the Beast' features Gaston's sidekick LeFou and tavern patrons singing about Gaston's unmatched qualities to cheer him up after being rejected by Belle.",
    "lyrics sentiment": "Mixed because the lyrics humorously praise Gaston in an exaggerated manner, while also hinting at themes of egotism and toxic masculinity.",
    "music energy": "High because the song features lively instrumentation and animated singing reflective of a show-stopping musical number.",
    "music danceability": "High because the song has a strong, consistent rhythm typical of musical numbers designed to entertain.",
    "valence": "Medium because while the song is fun and upbeat, the underlying themes are more complex and critical of Gaston's character traits.",
    "mode": "Major because the melody and progression convey a jubilant and celebratory tone, despite the underlying satirical content."
  },
  "Jason Weaver_I Just Can't Wait to Be King": {
    "genre": "Disney Soundtrack",
    "track bpm": 120,
    "lyrics summary": "A young lion prince excitedly expresses his eagerness and confidence to become king, imagining a future where he has power and control.",
    "lyrics sentiment": "Positive because the lyrics express excitement and ambition about becoming king.",
    "music energy": "High because the song is lively and has an upbeat tempo.",
    "music danceability": "High because the strong rhythmic elements and upbeat tune make it easy to move to.",
    "valence": "High because the song's tone is cheerful and exuberant.",
    "mode": "Major because the melody is bright and uplifting, typical of Disney songs."
  }
}