{
  "Jay Sean_Down": {
    "genre": "Pop",
    "track bpm": 132,
    "lyrics summary": "The song explores themes of love, support, and unwavering commitment, with lyrics emphasizing standing by a loved one despite challenges, as metaphorically expressed in the chorus 'Even if the sky is falling down.'",
    "lyrics sentiment": "Positive because the lyrics express love and devotion despite adversity.",
    "music energy": "High because the song is characterized by a fast tempo when considered in double-time, intense instrumentals, and vibrant rhythm.",
    "music danceability": "High because the track has a strong, consistent beat and rhythm that encourages dancing.",
    "valence": "High because the tone is uplifting and the theme revolves around love and emotional reassurance.",
    "mode": "Major because the song is in D major, giving it a bright and resolved tonal quality."
  },
  "Soulja Boy_Kiss Me Thru The Phone": {
    "genre": "Hip-Hop",
    "track bpm": 120,
    "lyrics summary": "The song explores themes of longing, distance, and the power of communication in maintaining a romantic connection, with a strong sense of missing someone and the desire to be physically close despite circumstances that prevent it.",
    "lyrics sentiment": "Positive because the lyrics express romantic devotion and the hope to maintain connection despite distance.",
    "music energy": "High because the tempo is upbeat and the track has a lively production typical of late 2000s hip-hop and pop.",
    "music danceability": "High because the track features a strong and consistent beat that encourages movement and dancing.",
    "valence": "High because the melody and lyrics convey a sense of youthful love and optimism.",
    "mode": "Major because the track has a bright and uplifting tonal quality typical of pop anthems."
  },
  "Akon_Right Now (Na Na Na)": {
    "genre": "R&B",
    "track bpm": 131,
    "lyrics summary": "The song explores themes of longing and desire to reunite with a past love. The narrator reflects on time apart and expresses a yearning to restore a lost relationship.",
    "lyrics sentiment": "Mixed because the lyrics express both the sadness of separation and the hope for reconciliation.",
    "music energy": "High because the song has an upbeat tempo and energetic production typical of club hits.",
    "music danceability": "High because the track features a strong and consistent beat suitable for dancing.",
    "valence": "Medium because the song has an emotionally complex theme of longing mixed with the upbeat sound.",
    "mode": "Minor because the track is in a G♯/A♭ minor key, lending a slightly darker tonal quality despite the energetic beat."
  },
  "Chris Brown_Forever": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The song is an upbeat and romantic celebration of dance, love, and living in the moment.",
    "lyrics sentiment": "Positive because the lyrics express a euphoric celebration of love and shared experiences.",
    "music energy": "High because the track is described as a banger and energetic, with an upbeat tempo of 120 BPM.",
    "music danceability": "High because the song is designed for dancing, featuring a steady and enticing beat typical of club music.",
    "valence": "High because the song evokes feelings of joy and romantic celebration, typical in upbeat pop music.",
    "mode": "Major because it is specified to be in the key of B Major, which typically sounds bright and happy."
  },
  "Flo Rida_Low (feat. T-Pain)": {
    "genre": "Hip Hop",
    "track bpm": 128,
    "lyrics summary": "The lyrics focus on themes of nightlife, dance, and celebration, highlighting interactions and energy on the dance floor.",
    "lyrics sentiment": "Positive because the lyrics express enjoyment and celebration of living in the moment and having fun.",
    "music energy": "High because the song features a driving beat and energetic vocal delivery suitable for a club environment.",
    "music danceability": "High because the song has a strong, consistent beat designed to encourage dancing.",
    "valence": "High because the track's upbeat tempo and lively hook create a feel-good, party atmosphere.",
    "mode": "Major because the song's melody and chords sound bright and uplifting."
  }
}