{
  "Imagine Dragons_Radioactive": {
    "genre": "Indie Rock",
    "track bpm": 136,
    "lyrics summary": "The lyrics of 'Radioactive' describe an environment filled with dangerous artificial elements, metaphorically exploring themes of resilience and transformation.",
    "lyrics sentiment": "Mixed because the song conveys both a sense of danger and a hopeful transformation.",
    "music energy": "High because the song features intense instrumentation and a driving rhythm.",
    "music danceability": "Medium because the beat is steady and rhythmic but not the primary focus of the song.",
    "valence": "Medium because the song has an urgent yet uplifting quality, balancing dark themes with hopeful undertones.",
    "mode": "Major because the song is written in A Major, giving it a bright and impactful sound."
  },
  "Tom Odell_Can't Pretend": {
    "genre": "Singer-Songwriter",
    "track bpm": 80,
    "lyrics summary": "The song explores the vulnerability of being in love and the experience of surrendering control to another person. It speaks of emotional wounds and healing, mutual understanding, and overwhelming emotions in the realm of love.",
    "lyrics sentiment": "Mixed because the lyrics express both the struggles and healing power of love, capturing vulnerability and strength.",
    "music energy": "Medium because the track has a steady pace and emotionally charged delivery.",
    "music danceability": "Low because the rhythm and arrangement focus on emotional expression rather than a danceable beat.",
    "valence": "Medium because the song's tone is introspective with a mix of vulnerability and hope.",
    "mode": "Minor because the melodies and chord progressions convey a melancholic and introspective feel."
  },
  "Jaymes Young_I'll Be Good": {
    "genre": "Alternative Pop",
    "track bpm": 75,
    "lyrics summary": "The lyrics of 'I'll Be Good' by Jaymes Young revolve around themes of redemption and atonement, expressing a commitment to be better and love the world like one should, while reflecting on past mistakes and their impact.",
    "lyrics sentiment": "Mixed because the lyrics reflect both regret for past actions and a hopeful aspiration to improve and make amends.",
    "music energy": "Medium because the song has a steady rhythm and emotive intensity, but is not aggressive or fast-paced.",
    "music danceability": "Low because the focus is on introspective and emotive content with a slower tempo, rather than a strong dance beat.",
    "valence": "Medium because while the song explores darker themes of regret, it also conveys a sense of hope and redemption.",
    "mode": "Minor because the melody and harmony create a reflective and somewhat somber tonal quality."
  },
  "Fall Out Boy_Centuries": {
    "genre": "Pop Rock",
    "track bpm": 176,
    "lyrics summary": "The song 'Centuries' explores themes of legacy, the desire for immortality, and the pursuit of lasting recognition. It uses historical imagery and speaks to the angst and aspirations of youth.",
    "lyrics sentiment": "Mixed because the lyrics combine anthemic, empowering elements with themes of fear and desire for legacy.",
    "music energy": "High because the song features a fast tempo and intense instrumentation typical of an anthemic rock track.",
    "music danceability": "Low because despite the high energy, the time signature and complexity make it less suitable for dancing.",
    "valence": "Medium because although the lyrics are empowering, they also have introspective and serious undertones.",
    "mode": "Minor because the song is in a minor key, contributing to its gritty and ambitious tone."
  },
  "Cody Simpson_La Da Dee": {
    "genre": "Pop",
    "track bpm": 116,
    "lyrics summary": "The lyrics convey being enamored with someone who becomes the center of the singer's universe, expressing feelings of longing and preoccupation with a loved one.",
    "lyrics sentiment": "Positive because the lyrics express joy and romantic devotion to a loved one, depicting a happy and carefree love.",
    "music energy": "Medium because the song is described as a buoyant and infectious tune, capturing the essence of carefree love while not being overly intense.",
    "music danceability": "High because the song features a catchy, earworm chorus and a steady rhythm that promotes dancing.",
    "valence": "High because the tone is joyful and focuses on the positive emotions of love and happiness.",
    "mode": "Minor because the song is described in G Minor, which often gives a slightly moody or introspective quality despite the upbeat theme."
  }
}