{
  "Sia_Unstoppable": {
    "genre": "Pop",
    "track bpm": 174,
    "lyrics summary": "The song 'Unstoppable' by Sia is centered around themes of personal resilience and empowerment, encouraging self-belief and inner strength.",
    "lyrics sentiment": "Positive because the lyrics express confidence and empowerment, inspiring listeners to feel unstoppable and capable of overcoming challenges.",
    "music energy": "High because the track has a fast tempo of 174 BPM and assertive instrumentation supporting its empowering theme.",
    "music danceability": "Medium because while the song has a driving beat, its primary focus is on powerful lyrical delivery rather than a dance-driven rhythm.",
    "valence": "High because the lyrics and major key convey a sense of triumph and positivity.",
    "mode": "Major because the song utilizes a bright and resolved tonal quality in line with its empowering lyrics."
  },
  "Rachel Platten_Fight Song": {
    "genre": "Pop",
    "track bpm": 88,
    "lyrics summary": "A powerful anthem about finding inner strength and resilience, where the lyrics use metaphors like a small boat creating waves to symbolize making significant impacts despite feeling insignificant.",
    "lyrics sentiment": "Positive because the lyrics focus on themes of self-empowerment and resilience.",
    "music energy": "High because the song's anthemic structure and emphatic delivery create a feeling of strength and determination.",
    "music danceability": "Medium because the beat is steady and uplifting, suitable for movement but not focused on dance.",
    "valence": "High because the song's message and melody convey a sense of empowerment and positivity.",
    "mode": "Major because the melody and harmony emphasize a bright and uplifting tone."
  },
  "CANI_Unstoppable": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics focus on empowerment, resilience, and self-belief, encouraging the listener to feel unstoppable and to persevere through challenges.",
    "lyrics sentiment": "Positive because the lyrics convey messages of empowerment, resilience, and encouragement.",
    "music energy": "High because the song is described as a powerful anthem with a build-up and an assertive melody.",
    "music danceability": "Medium because the beat builds throughout the track, providing a steady rhythm that supports movement.",
    "valence": "High because the lyrical and musical content is uplifting and inspiring.",
    "mode": "Major because the song has an uplifting and positive melodic quality."
  },
  "Fearless Soul_I Can": {
    "genre": "Inspirational Pop",
    "track bpm": "about 100",
    "lyrics summary": "The lyrics convey a theme of resilience and overcoming difficulties. The narrator talks about facing fears, overcoming challenges, and embracing courage to step into the unknown, symbolizing personal growth and hope.",
    "lyrics sentiment": "Positive because the lyrics convey a message of hope, courage, and perseverance against challenges.",
    "music energy": "Medium because the focus on personal empowerment suggests a steady, uplifting energy without being overly intense.",
    "music danceability": "Medium because the inspirational nature usually includes a steady rhythm suitable for casual movement.",
    "valence": "High because the lyrics and tone are uplifting and filled with positive affirmations.",
    "mode": "Major because the message of overcoming adversity and staying courageous is typically associated with a major tonal quality."
  },
  "Andy Grammer_Keep Your Head Up": {
    "genre": "Pop",
    "track bpm": 123,
    "lyrics summary": "The lyrics of 'Keep Your Head Up' by Andy Grammer encourage maintaining a positive outlook in the face of life's challenges, emphasizing perseverance and optimism.",
    "lyrics sentiment": "Positive because the lyrics express hope and encourage resilience despite hardships.",
    "music energy": "Medium because the song has a steady beat and moderate intensity suitable for a pop track.",
    "music danceability": "High because the song features a catchy, rhythmic beat that's easy to dance to.",
    "valence": "High because the song conveys an uplifting and hopeful message.",
    "mode": "Major because the melody and chord progressions sound bright and uplifting."
  }
}