{
  "Harry Styles_Treat People With Kindness": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'Treat People With Kindness' celebrate positivity and the power of kindness, fostering a sense of belonging and acceptance. The song conveys an optimistic, hopeful message about finding a place to feel good and urging listeners to treat others with kindness.",
    "lyrics sentiment": "Positive because the lyrics celebrate positivity and kindness, promoting feelings of acceptance and belonging.",
    "music energy": "Medium because the track has a steady and inviting sound, typical of upbeat pop songs.",
    "music danceability": "High because the track features a catchy and consistent pop beat that encourages movement and dancing.",
    "valence": "High because the song is uplifting and promotes positive emotions through its message and melody.",
    "mode": "Major because the song has a bright and positive tonal quality, aligning with its positive themes."
  },
  "Mac Miller_The Spins": {
    "genre": "Hip Hop",
    "track bpm": 127,
    "lyrics summary": "The lyrics of 'The Spins' by Mac Miller are reflective of youthful exuberance and carefree living, focusing on themes such as ambition, romance, partying, and the thrill of fame.",
    "lyrics sentiment": "Positive because the lyrics express joy and celebration of life's pleasures and ambitions.",
    "music energy": "High because the song is vibrant, upbeat, and lively, matching its dance-friendly tempo.",
    "music danceability": "High because it has a strong beat and rhythm suitable for dancing, with a tempo of 127 BPM.",
    "valence": "High because the track is joyful and upbeat, creating an uplifting atmosphere.",
    "mode": "Minor because the key is in A minor, which gives a slightly introspective tone despite the upbeat tempo."
  },
  "The Weeknd_Sacrifice": {
    "genre": "Pop",
    "track bpm": 122,
    "lyrics summary": "The song 'Sacrifice' by The Weeknd deals with themes of self-reflection, regret, and personal challenges, often expressing a willingness to make sacrifices in a romantic or personal context.",
    "lyrics sentiment": "Mixed because the lyrics reflect personal struggle and regret but also a sense of resolution or acceptance.",
    "music energy": "High because the collaboration with Swedish House Mafia suggests an intense and captivating production.",
    "music danceability": "High because the song has a tempo of 122 BPM with a consistent beat, making it suitable for dancing.",
    "valence": "Medium because while the theme has elements of struggle, the music presents an uplifting, danceable vibe.",
    "mode": "Minor because The Weeknd's style often uses dark, moody tones which align with the lyrical themes."
  },
  "Shania Twain_That Don't Impress Me Much": {
    "genre": "Country Pop",
    "track bpm": 122,
    "lyrics summary": "The lyrics humorously critique the superficial qualities that some men believe are impressive, such as intelligence, good looks, and wealth, while emphasizing the importance of deeper, more meaningful attributes.",
    "lyrics sentiment": "Positive because the song playfully and confidently dismisses superficiality, encouraging genuine qualities.",
    "music energy": "Medium because the song has a lively but steady tempo with spirited instrumentation typical of upbeat pop tracks.",
    "music danceability": "Medium because the song has a steady rhythm that supports light dancing but is not overly dance-focused.",
    "valence": "High because the tone is light-hearted, playful, and upbeat, reflecting confidence and humor.",
    "mode": "Major because the melody and overall tone of the song sound uplifting and resolved."
  },
  "Sam Fender_Hypersonic Missiles": {
    "genre": "Indie Rock",
    "track bpm": 150,
    "lyrics summary": "The lyrics of 'Hypersonic Missiles' by Sam Fender critique political manipulation and media influence, referencing global political conflicts and tensions, such as bombings in Gaza.",
    "lyrics sentiment": "Mixed because the lyrics express a critical view of political issues but also convey urgency and a call to awareness.",
    "music energy": "High because the song is described as an anthem with intense and urgent themes, supported by a fast tempo and dynamic instrumentation common in rock.",
    "music danceability": "Medium because while the track has a strong tempo and rhythm typical of rock, its focus appears more on the lyrical content and intensity than a dance-oriented beat.",
    "valence": "Medium because while the themes are critical and urgent, the anthem-like quality provides a sense of empowerment rather than outright negativity.",
    "mode": "Minor because the song's focus on geopolitical unrest and manipulation implies a darker, more introspective tonal quality."
  }
}