{
  "Galantis_Runaway (U & I)": {
    "genre": "EDM",
    "track bpm": 126,
    "lyrics summary": "The song 'Runaway (U & I)' by Galantis explores themes of longing and a desire to escape with a loved one. The lyrics suggest an emotional connection and a yearning to leave their current situation behind.",
    "lyrics sentiment": "Positive because the lyrics express a hopeful desire to escape and connect deeply with a partner.",
    "music energy": "High because the track has a fast tempo and intense instrumentation typical of EDM.",
    "music danceability": "High because the track has a strong, consistent beat and rhythm that encourages dancing.",
    "valence": "High because the song conveys a sense of euphoria and emotional positivity.",
    "mode": "Major because it is specified in the key and contributes to an uplifting, bright sound."
  },
  "Katie Lynne_Dreamer's Demise": {
    "genre": "Classical Crossover",
    "track bpm": "about 90",
    "lyrics summary": "The lyrics delve into themes of unfulfilled aspirations and the emotional toll of fading dreams.",
    "lyrics sentiment": "Negative because the lyrics express sadness and loss over unachieved dreams.",
    "music energy": "Medium because there is a dynamic range with traditional string instruments creating a rich sound.",
    "music danceability": "Low because traditional string compositions typically lack a strong rhythmic beat suitable for dancing.",
    "valence": "Low because the themes and tone are melancholic and introspective.",
    "mode": "Minor because the track likely features a somber and reflective musical tone."
  },
  "Flo Rida_My House": {
    "genre": "Pop",
    "track bpm": 94,
    "lyrics summary": "'My House' by Flo Rida is about inviting people into one's home, celebrating, and having a good time with friends and family.",
    "lyrics sentiment": "Positive because the lyrics express a sense of welcoming and celebration, encouraging enjoyment and companionship.",
    "music energy": "High because the track is upbeat with a fast tempo and vibrant instrumentation, creating an energetic atmosphere.",
    "music danceability": "High because of its consistent and strong beat, suitable for dancing and energetic activities.",
    "valence": "High because the song has a joyful and uplifting tone, characteristic of celebratory themes.",
    "mode": "Minor because the track is in a minor key, which provides a certain unique emotional tint despite its upbeat nature."
  },
  "Beyoncé_Formation": {
    "genre": "Trap",
    "track bpm": "about 123",
    "lyrics summary": "An anthem celebrating black culture and female empowerment, calling for unity among black women and embracing Southern heritage.",
    "lyrics sentiment": "Positive because the lyrics celebrate self-assertion, heritage, and empowerment.",
    "music energy": "High because the song is intense with strong beats and assertive delivery.",
    "music danceability": "High because of the strong, consistent beat typical in trap music that encourages movement.",
    "valence": "High because it conveys a message of empowerment and confidence.",
    "mode": "Minor because the track has a moody, assertive tone common in trap music."
  },
  "Beyoncé_Run the World (Girls)": {
    "genre": "Pop",
    "track bpm": 127,
    "lyrics summary": "The lyrics celebrate female empowerment and independence, urging women to recognize their power and influence.",
    "lyrics sentiment": "Positive because the lyrics express joy and empowerment about women's ability to lead and influence the world.",
    "music energy": "High because the tempo is fast and the song features aggressive beats that drive its anthem-like quality.",
    "music danceability": "High because the rhythm is strong and consistent, making it suitable for dancing.",
    "valence": "High because the song's tone is triumphant and celebratory.",
    "mode": "Major because the track is in the C major key, contributing to its bright and uplifting sound."
  }
}