{
  "Kesha_Raising Hell - Steve James Remix": {
    "genre": "Pop",
    "track bpm": 124,
    "lyrics summary": "The track 'Raising Hell' is about self-expression, embracing flaws, and celebrating life's wild moments. It encourages rebellion against societal norms and inspires empowerment and liberation through the pursuit of a joyful and unapologetic life.",
    "lyrics sentiment": "Positive because the lyrics promote empowerment, self-expression, and living life to the fullest with a celebratory tone.",
    "music energy": "High because the remix version tends to have an intense and dynamic sound typically seen in dance tracks.",
    "music danceability": "High because the remix likely features a strong and consistent beat designed to be danceable.",
    "valence": "High because the track has an uplifting and empowering message with an upbeat tempo.",
    "mode": "Major because the song conveys an energetic and triumphant feeling typical of this mode."
  },
  "JAY-Z_Empire State Of Mind": {
    "genre": "Hip Hop",
    "track bpm": 174,
    "lyrics summary": "The lyrics express a deep love and admiration for New York City, highlighting the city's vibrant life, its challenges, and its iconic status. The song captures the essence of living in New York City, conveying both the glitz and the hustle of urban life.",
    "lyrics sentiment": "Mixed because it combines admiration and inspiration for New York City with acknowledgments of its gritty realities.",
    "music energy": "High because the tempo is fast and the instrumentation is intense, capturing the bustling energy of New York City.",
    "music danceability": "Medium because the beat is steady and engaging but not overwhelmingly dominant, allowing for some movement while focusing on lyrical delivery.",
    "valence": "Medium because the song blends uplifting and celebratory elements with more serious themes of struggle and persistence.",
    "mode": "Minor because the song is in a G♯/A♭ key minor, giving it a somewhat introspective and serious tone."
  },
  "Kanye West_Stronger": {
    "genre": "Hip-hop/Electronic",
    "track bpm": 104,
    "lyrics summary": "The lyrics of 'Stronger' by Kanye West revolve around themes of resilience and empowerment, asserting that challenges and adversity serve to make one stronger, while striving for success and urgency in the journey.",
    "lyrics sentiment": "Positive because the lyrics focus on empowerment and personal strength despite challenges.",
    "music energy": "High because the track features an intense, driving beat and powerful vocal delivery.",
    "music danceability": "High because the rhythm and beat are strong and consistent, inviting movement and dance.",
    "valence": "High because the song's tone and message are uplifting and empowering.",
    "mode": "Major because the overall tonality feels bright and resolved, contributing to its empowering message."
  },
  "JAY-Z_Numb / Encore": {
    "genre": "Rap Rock",
    "track bpm": 107,
    "lyrics summary": "The song 'Numb / Encore' is a mash-up that connects the themes of Jay-Z’s desire for greatness and recognition in 'Encore' with Linkin Park’s introspective and emotionally charged 'Numb.' The song explores the pressure of meeting expectations and the juxtaposition of public success with private struggles.",
    "lyrics sentiment": "Mixed because the lyrics combine the confident bravado of Jay-Z's verses with the introspective and somber tone of Linkin Park's lyrics.",
    "music energy": "High because the track features intense and dynamic instrumentation from both hip-hop and rock influences.",
    "music danceability": "High because the rhythm is consistent and engaging, combining upbeat hip-hop beats with rock elements.",
    "valence": "Medium because the music is uplifting and energetic, but the lyrics contain both hopeful and somber themes.",
    "mode": "Major because the track resolves with a bright, triumphant sound often associated with major scale progressions."
  },
  "Kanye West_POWER": {
    "genre": "Hip Hop",
    "track bpm": 154,
    "lyrics summary": "The song explores themes of power dynamics, fame, and personal struggles. Kanye West presents himself as a boundary-pushing icon while reflecting on the allure and dangers of power and influence.",
    "lyrics sentiment": "Mixed because while the song highlights the triumph and allure of power, it also critiques its dangerous and intoxicating nature.",
    "music energy": "High because the assertive beat and strong instrumentation drive the track with intensity.",
    "music danceability": "Medium because while the beat is strong and consistent, it prioritizes lyrical delivery and thematic depth over a dance-focused rhythm.",
    "valence": "Medium because the track mixes triumphant tones with a darker reflection on the nature of power and its consequences.",
    "mode": "Minor because the music features darker, introspective harmonies that complement its themes."
  }
}