{
  "Newsboys_God's Not Dead (Like A Lion)": {
    "genre": "Pop",
    "track bpm": 90,
    "lyrics summary": "The song explores themes of struggle, self-worth, and perseverance, with the narrator reflecting on hard work, lack of confidence in others, and the desire for recognition and authenticity in relationships.",
    "lyrics sentiment": "Mixed because the lyrics discuss both struggles and perseverance in the face of challenges.",
    "music energy": "Medium because the track maintains an average energy level typical of upbeat pop songs.",
    "music danceability": "High because the song features a very danceable rhythm with a clear, steady beat.",
    "valence": "Medium because it captures both challenges and moments of triumph, creating an emotionally complex atmosphere.",
    "mode": "Major because the song is in the key of A major, which typically conveys a bright, resolved sound."
  },
  "for KING & COUNTRY_Fix My Eyes": {
    "genre": "Contemporary Christian",
    "track bpm": 120,
    "lyrics summary": "The song 'Fix My Eyes' emphasizes the themes of faith, focus, and determination. It encourages listeners to stay grounded and aligned with their spiritual beliefs despite life's challenges.",
    "lyrics sentiment": "Positive because the lyrics express optimism and encouragement to maintain focus on one's faith.",
    "music energy": "Medium because the instrumentation is lively but balanced, with a steady rhythm supporting the vocals.",
    "music danceability": "Medium because the song has a consistent beat and rhythm suitable for light movement.",
    "valence": "High because the tone is uplifting and positive, reflecting hope and determination.",
    "mode": "Major because the melody and harmonic structure convey a bright and cheerful sound."
  },
  "MercyMe_Greater": {
    "genre": "Christian Rock",
    "track bpm": 120,
    "lyrics summary": "The song 'Greater' by MercyMe celebrates faith and finding strength in belief, emphasizing that one's self-worth is defined by divine love rather than worldly judgment.",
    "lyrics sentiment": "Positive because the lyrics express joy and empowerment through faith.",
    "music energy": "Medium because the song balances between uplifting melodies and steady instrumentation typical of rock with spiritual themes.",
    "music danceability": "Medium because the rhythm is steady and grooves enough to encourage movement, typical of uplifting rock tracks.",
    "valence": "High because the song conveys an uplifting and joyful message.",
    "mode": "Major because the melody and chord progressions tend to sound bright and resolved, in line with the uplifting lyrical content."
  },
  "TobyMac_Love Broke Thru": {
    "genre": "Contemporary Christian Music",
    "track bpm": 83,
    "lyrics summary": "The song describes a personal transformation and redemption through love, highlighting moments of spiritual enlightenment and hope.",
    "lyrics sentiment": "Positive because the lyrics focus on themes of redemption, hope, and spiritual awakening.",
    "music energy": "Medium because the song balances vibrant verses with an uplifting chorus.",
    "music danceability": "Medium because the song has a steady beat and rhythmic groove suitable for casual dancing.",
    "valence": "High because the song conveys a joyful and uplifting message through its lyrics and melody.",
    "mode": "Major because the song uses bright and uplifting chord progressions typical of inspirational themes."
  },
  "TobyMac_Move (Keep Walkin’)": {
    "genre": "Contemporary Christian Music",
    "track bpm": "about 120",
    "lyrics summary": "The song encourages perseverance and faith, motivating listeners to keep moving forward despite challenges.",
    "lyrics sentiment": "Positive because the lyrics focus on encouragement and maintaining faith through adversity.",
    "music energy": "High because the song features an upbeat tempo and lively instrumentation.",
    "music danceability": "High because the rhythm is strong and conducive to dancing.",
    "valence": "High because the tone is uplifting and the message is motivational.",
    "mode": "Major because the song's mood is positive and triumphant."
  }
}