{
  "Will Smith_Miami": {
    "genre": "Hip Hop",
    "track bpm": 108,
    "lyrics summary": "The song 'Miami' by Will Smith is an anthem that celebrates the vibrant culture and nightlife of Miami, especially focusing on South Beach. The lyrics convey a sense of excitement and festive spirit that comes with exploring the city's diverse and tropical allure.",
    "lyrics sentiment": "Positive because the lyrics express joy and celebration of Miami's lively culture and nightlife.",
    "music energy": "Medium because the tempo is upbeat yet balanced, matching the celebratory style without being overpowering.",
    "music danceability": "High because the track has a steady, catchy beat ideal for dancing and celebrating.",
    "valence": "High because the song is upbeat and exudes a joyful, festive atmosphere.",
    "mode": "Major because the melody and harmony project a bright and cheerful tonal quality."
  },
  "Rihanna_SOS": {
    "genre": "Pop",
    "track bpm": 122,
    "lyrics summary": "The lyrics describe intense love and infatuation, using the metaphor of an emergency distress signal to express the urgency and consuming nature of her emotions.",
    "lyrics sentiment": "Mixed because the lyrics convey strong romantic emotions that are passionate yet also distressed.",
    "music energy": "High because the song features an energetic electro-infused beat and an intense delivery.",
    "music danceability": "High because it has a strong, consistent beat designed for dancing.",
    "valence": "Medium because while the music is upbeat and catchy, the lyrical theme of emotional turmoil gives it a complex emotional character.",
    "mode": "Minor because the song samples 'Tainted Love,' known for its darker tone and unresolved harmonic progressions."
  },
  "Hailee Steinfeld_You're Such A": {
    "genre": "Dance Pop",
    "track bpm": 124,
    "lyrics summary": "The song conveys a strong message of empowerment and moving on from a toxic relationship. It depicts the narrator's refusal to accept their ex's attempts to come back into their life and argues that they are better off without them.",
    "lyrics sentiment": "Negative because the lyrics express frustration and liberation from a toxic past relationship.",
    "music energy": "High because the track features upbeat, intense dynamics and instrumentation typical of dance-pop.",
    "music danceability": "High because the rhythm and beat are prominent and consistent, typical of dance-pop music.",
    "valence": "Medium because while the lyrics convey frustration, the music itself is upbeat and empowering.",
    "mode": "Major because the overall sound is bright and assertive, fitting the dance-pop genre."
  },
  "G.R.L._Ugly Heart": {
    "genre": "Pop",
    "track bpm": 125,
    "lyrics summary": "The song explores the contrast between physical beauty and emotional shallowness in a past relationship, conveying a message of self-respect and empowerment, urging listeners to prioritize inner qualities over appearances.",
    "lyrics sentiment": "Positive because the lyrics promote self-respect and highlight the importance of inner beauty.",
    "music energy": "High because the track has a fast tempo and features intense pop production.",
    "music danceability": "High because the song is very danceable with a strong and steady pop beat at 125 BPM.",
    "valence": "High because the song's bright production and uplifting message contribute to a joyful mood.",
    "mode": "Major because the track is in A major, which gives a bright and resolved tonal quality."
  },
  "JAY-Z_Empire State Of Mind": {
    "genre": "Hip Hop",
    "track bpm": "about 88",
    "lyrics summary": "The lyrics narrate the artists' love and ambition within New York City, detailing Jay-Z's rise from the streets of Brooklyn to fame and success, alongside a broader celebration of the city's iconic qualities.",
    "lyrics sentiment": "Mixed because the lyrics celebrate success and triumph but also acknowledge struggles and hardships.",
    "music energy": "High because the track features strong beats and dynamic vocal performances.",
    "music danceability": "Medium because the beat is steady and groovy, but not overly dominant.",
    "valence": "Medium because the lyrics and music express both gritty realism and inspiring triumph.",
    "mode": "Major because the song has a triumphant and uplifting tonal quality."
  }
}