{
  "Maroon 5_Moves Like Jagger - Studio Recording From \"The Voice\" Performance": {
    "genre": "Pop",
    "track bpm": 128,
    "lyrics summary": "The song is about a confident and skilled lover who knows how to control the situation and make their partner feel good, drawing a comparison to Mick Jagger's iconic charisma.",
    "lyrics sentiment": "Positive because the lyrics emphasize confidence and charisma, creating a sense of enjoyment and attraction.",
    "music energy": "High because the tempo is fast and the collaboration adds intensity to the performance.",
    "music danceability": "High because the beat is strong and consistent, making it very suitable for dancing.",
    "valence": "High because the tone is energetic and joyful, with lyrics expressing confidence and attraction.",
    "mode": "Major because the song has a bright and uplifting tonality typical of pop music."
  },
  "Rick Springfield_Jessie's Girl": {
    "genre": "Pop Rock",
    "track bpm": 132,
    "lyrics summary": "The song is about a young man's unrequited love for his best friend's girlfriend, expressing his frustration and longing.",
    "lyrics sentiment": "Negative because the lyrics express longing and romantic obsession for someone he cannot have.",
    "music energy": "High because the song has a fast tempo and exuberant instrumentation.",
    "music danceability": "High because the tempo is energetic and the beat is strong, making it suitable for dancing.",
    "valence": "Medium because, despite the negative lyrical theme, the music itself is upbeat and energetic.",
    "mode": "Major because the track is in a major key, giving it a brighter musical tone."
  },
  "P!nk_Raise Your Glass": {
    "genre": "Pop",
    "track bpm": 122,
    "lyrics summary": "Raise Your Glass is an anthem about embracing individuality and celebrating with others, acknowledging that everyone has flaws which are integral to their identity.",
    "lyrics sentiment": "Positive because the lyrics emphasize individuality, celebration, and embracing one's imperfections joyfully.",
    "music energy": "High because the tempo is fast and the song is described as having energy and being danceable.",
    "music danceability": "High because the track has a strong and consistent beat, designed to be danceable.",
    "valence": "High because the song is described as uplifting and celebratory, contributing to an emotionally positive atmosphere.",
    "mode": "Major because the song is in the key of G Major, which typically has a bright and triumphant tone."
  },
  "Kesha_TiK ToK": {
    "genre": "Pop",
    "track bpm": 120,
    "lyrics summary": "The lyrics of 'TiK ToK' by Kesha describe a carefree lifestyle focused on partying, having fun, and living in the moment. It opens with the singer waking up and getting ready to go out, emphasizing an energetic and fun-loving attitude.",
    "lyrics sentiment": "Positive because the lyrics express joy, carefree living, and an upbeat party atmosphere.",
    "music energy": "High because the track features a fast tempo and intense, driving beat, making it very lively.",
    "music danceability": "High because the song has a strong, consistent beat and rhythm that is designed to make people move.",
    "valence": "High because the tone is cheerful, upbeat, and embodies a feel-good party vibe.",
    "mode": "Minor because the melody and chord progression are set in a minor key, which gives a slightly edgy feel despite the upbeat theme."
  },
  "Katy Perry_California Gurls": {
    "genre": "Pop",
    "track bpm": 125,
    "lyrics summary": "The song celebrates the allure and charm of California girls, painting a vibrant picture of the sunny and glamorous lifestyle associated with California. The lyrics create a sense of summer fun and carefree excitement, epitomized by bright images and upbeat themes.",
    "lyrics sentiment": "Positive because the lyrics celebrate the fun and exciting aspects of California life, emphasizing joy and carefree summer experiences.",
    "music energy": "High because the song is fast-paced with strong beats that create an intense, lively atmosphere.",
    "music danceability": "High because the catchy beat and rhythm are designed to engage listeners and make them want to dance.",
    "valence": "High because the song's tone is uplifting and joyful, creating a feel-good summer anthem.",
    "mode": "Major because the melody and harmonies convey a bright, happy, and resolved sound."
  }
}