{
  "Michael Nau_While You Stand": {
    "genre": "Indie Folk",
    "track bpm": 124,
    "lyrics summary": "The song explores themes of self-awareness, individuality, and the complexity of relationships through introspective lyrics.",
    "lyrics sentiment": "Mixed because the lyrics express both a sense of grandeur and introspection, as well as vulnerability and uncertainty.",
    "music energy": "Medium because the moderate tempo and instrumentation support a reflective yet engaging mood.",
    "music danceability": "Medium because the steady beat and rhythm allow for moderate movement, though not prominently dance-focused.",
    "valence": "Medium because the introspective and complex mood provides subtle emotional nuances rather than overt positivity or negativity.",
    "mode": "Major because the key of D Major gives the song a more uplifting and open tonal quality."
  },
  "Oliver Riot_Alcatraz": {
    "genre": "R&B/Soul",
    "track bpm": "about 90",
    "lyrics summary": "The lyrics of 'Alcatraz' by Oliver Riot explore the emotional and psychological struggles of self-discovery and the quest for authenticity. The song describes a journey 'out west,' symbolizing a search for new beginnings, but it is fraught with loneliness and uncertainty.",
    "lyrics sentiment": "Mixed because the lyrics convey a sense of struggle and loneliness intertwined with a hopeful search for new beginnings and personal growth.",
    "music energy": "Medium because the track likely balances emotional depth with a steady rhythm typical of R&B/Soul.",
    "music danceability": "Medium because the song likely has a groove typical of soulful music but is not primarily dance-oriented.",
    "valence": "Medium because the track mixes themes of loneliness and struggle with hope and personal growth.",
    "mode": "Minor because the lyrical themes of loneliness and self-discovery suggest a more introspective and unresolved tone."
  },
  "Noah Kahan_Call Your Mom": {
    "genre": "Folk Pop",
    "track bpm": 172,
    "lyrics summary": "The lyrics of 'Call Your Mom' explore the dark moments everyone experiences in their lives, serving as a heartfelt ballad offering comfort and support during difficult times.",
    "lyrics sentiment": "Negative because the lyrics focus on supporting oneself through dark and tough moments.",
    "music energy": "Low because despite the fast tempo, the song is described as a melancholic ballad with low energy.",
    "music danceability": "Medium because the song has a steady 4/4 beat but isn't primarily dance-focused due to its emotional tone.",
    "valence": "Low because the song's tone and lyrics revolve around melancholic and supportive themes.",
    "mode": "Major because it is explicitly in the C major key, providing a resolved tonal quality despite the lyrical content."
  },
  "Aquilo_Who Are You": {
    "genre": "Indie Pop",
    "track bpm": 130,
    "lyrics summary": "The lyrics of 'Who Are You' involve a contemplation about recognizing someone who seems familiar. The singer reflects on a connection with someone through their voice, despite having trouble remembering faces.",
    "lyrics sentiment": "Mixed because the lyrics express both a sense of longing and curiosity about recognizing someone familiar, using both romantic and uncertain tones.",
    "music energy": "Medium because the track likely has a balanced dynamic range and moderate intensity derived from its indie pop style.",
    "music danceability": "Medium because the BPM is 130, providing a steady beat that supports a moderate degree of danceability, typical of indie pop.",
    "valence": "Medium because the song combines elements of wonder and introspection, reflecting a nuanced emotional landscape.",
    "mode": "Major because the song is in Db Major, typically associated with a bright and resolved tonal quality."
  },
  "Noah Kahan_Mess": {
    "genre": "Folk-Pop",
    "track bpm": 67,
    "lyrics summary": "The lyrics express a desire to return to a simpler and more innocent time, free from life's chaos. The singer reflects on personal identity and struggles with pressures while exploring themes of self-awareness and connection with the past.",
    "lyrics sentiment": "Mixed because the lyrics convey both a longing for simplicity and a struggle with current identity pressures.",
    "music energy": "Low because the song features subtle instrumentation and soft dynamics.",
    "music danceability": "Low because the track focuses on lyrical content and storytelling rather than a strong beat for dancing.",
    "valence": "Medium because the song explores complex emotional themes of nostalgia and personal reflection without being overtly joyful or sad.",
    "mode": "Minor because the song's introspective and reflective nature suggests a moody and unresolved tone."
  }
}