{"bxUB6WNcSEU": {"title": "10 MIN LOVE HANDLES AND LOWER BELLY FAT WORKOUT Standing Only | No Equipment!", "description": "Do you want to get rid of your love handles and belly fat? Then this standing workout is for you! The BEST approach to lose love handles and belly fat is with a workout that trains your obliques, lower belly, glutes, outer thighs and combine it with cardio! That's exactly what we are doing in this standing only workout!\n\nDid you do this workout? Comment below!\n\nI recommend you do to this short workout daily for 2 weeks to see amazing results! \n\nThis workout is also great during pregnancy and postpartum.\n\nFollow me on instagram!\nhttps://www.instagram.com/fit.with.sally\n\nJoin my fitness program BUILD & BURN:\nhttps://train.fit-with-sally.com/products/build-burn-fitness-program\n\nGet my Meal Plan & Recipe Guide:\nhttps://train.fit-with-sally.com/products/meal-plan-recipe-guide\n\n00:00 Intro\n00:31 Side Crunch\n01:54 Squat Side Bend\n02:34 Push-Away\n03:15 Side Leg Raise\n04:36 Skiers + Floor Touch\n05:17 Side Punch\n05:58 Curtsy Lunge To Crunch\n07:19 Squat To Toe Touch\n07:58 Reach Over\n09:17 Squat To Side Crunch\n\nThe songs in this video are from Epidemic Sound:\nSong 1: Sleeping in my Head from Siine feat. Frank Moody\nSong 2: Name Tag from Nivicious feat. AdamAlexander\nSong 3: If your're looking for trouble from Basixx feat. TASH\nSong 4: Let's Stay Up All Night from Basixx feat. Frigga\n\nDISCLAIMER:  The information in this video is not intended to take the place of medical advice from your healthcare provider.  Viewers are strongly advised to consult with their doctor or other healthcare provider before undertaking any exercise or exercise program demonstrated in this video. Any application of the recommendations provided in this video is at the viewer's discretion and sole risk."}, "7GFgFl1_eiw": {"title": "Do THIS to Burn MORE Belly Fat on an Elliptical", "description": "Elliptical belly fat reduction is a sought-after goal for many fitness enthusiasts. Ellipticals, often referred to as cross trainers, are versatile machines that offer a dynamic workout for individuals at various fitness levels. \n\nEngaging in a specialized elliptical workout can target those stubborn fat areas, especially around the abdomen. The beauty of using a cross trainer lies in its ability to provide a low-impact, full-body exercise that can be adjusted to meet individual needs. \n\nBut just how can one maximize calorie burn and target belly fat more efficiently on this equipment? This video provides insight without diving deep into the nitty-gritty of the science. \n\nWhether you're a seasoned gym-goer or someone just starting their fitness journey, our guide will offer valuable tips to help you make the most of your elliptical sessions. Dive in and discover the secrets to melting that belly fat away!\n---------------------------\nRecommended equipment - https://fitnessdy.com/equipment/\n---------------------------------------------------------------------------------------------------------------------------\n\nPro tip: Book a personalized consultation with the engine behind Fitnessdy, certified Cardio and Fitness Trainer, Ioana. We can do talk through email, build a personalized workout plan, and more. https://ioanacozma.setmore.com/\n\n---------------------------------------------------------------------------------------------------------------------------\n\nResources\n\n\nhttps://pubmed.ncbi.nlm.nih.gov/29127602/ - the meta-analysis on the effect of high-intensity interval training on total, abdominal, and visceral fat mass \n\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4504736/ - a 1% incline may increase your caloric burn by 12%\n\n\nhttps://www.mdapp.co/elliptical-calorie-calculator-488/ - to burn 500 calories on the elliptical at low intensity, you would need 85.5 minutes\n\n\n----------------------------------------\nTimestamps\nIntro 00:00\n1. Do HIIT 00:31\n2. Increase the incline 01:45\n3. Vary your workouts 02:39\n4. Add weights 03:22\n5. Engage your abs 04:17\n6. Ramp up the speed 05:00\n7. Spend more time on it 06:07\nWhat do you think? 06:52"}}